{
  "Apartment building with Home Assistant onboard": "مبنى سكني مع Home Assistant على متنه",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant.": "شقتك هي أكثر المكان حميمية. من غير المرجح أن تشعر بالراحة عندما تعلم أن جميع بياناتك تنتهي على خادم ما في مكان ما خارج منزلك. في هذا المشروع، يتم تجهيز كل شقة بخادم منزلي يحتوي على Home Assistant.",
  "Hello everyone!": "مرحباً بالجميع!",
  "My name is Vadim Manaenko. I am a co-founder of Pinout LTD and one of the key developers in the [Robonomics Network](https://robonomics.network/) project. Today I want to share with you big news: Pinout LTD has signed a contract with the developer [CCS](https://www.stylianidesgroup.com/) for the automation of 28 apartments and common area in the [Residence 28](https://www.stylianidesgroup.com/property/residence-28) building. Work will begin in 2024.": "اسمي فاديم ماناينكو. أنا مؤسس شركة Pinout LTD وأحد المطورين الرئيسيين في مشروع [شبكة Robonomics](https://robonomics.network/). اليوم أرغب في مشاركة أخبار كبيرة معكم: قامت شركة Pinout LTD بتوقيع عقد مع المطور [CCS](https://www.stylianidesgroup.com/) لتطوير 28 شقة ومنطقة مشتركة في مبنى [Residence 28](https://www.stylianidesgroup.com/property/residence-28). ستبدأ الأعمال في عام 2024.",
  "About the Project": "حول المشروع",
  "The developer CCS has been operating on the market since 1997 and has built more than 600 properties. The Residence 28 project is located in Limassol, Cyprus. The building will consist of two blocks with a total living area (covered part) of about 1800 m2. This will be the first apartment building in Cyprus with a smart home system built on Zigbee wireless devices controlled by the open source [Home Assistant](https://www.home-assistant.io/) software, remote access will be provided via the Robonomics Parachain Web3 cloud.": "تعمل شركة المطور CCS في السوق منذ عام 1997 وقد قامت ببناء أكثر من 600 عقار. يقع مشروع Residence 28 في ليماسول، قبرص. سيتكون المبنى من كتلتين بمساحة سكنية إجمالية (الجزء المغطى) تبلغ حوالي 1800 متر مربع. سيكون هذا أول مبنى سكني في قبرص يحتوي على نظام منزل ذكي مبني على أجهزة لاسلكية Zigbee يتم التحكم فيها بواسطة برنامج مفتوح المصدر [Home Assistant](https://www.home-assistant.io/)، وسيتم توفير الوصول عن بعد عبر سحابة Robonomics Parachain Web3.",
  "What Will Future Residents Receive?": "ماذا سيحصل السكان المستقبليون؟",
  "Below is a floor plan of one of the two blocks and a designation legend.": "فيما يلي خطة الطابق لإحدى الكتلتين وأسطورة التعيين.",
  "Don't be confused by the word \"Wired\". This means that the device requires constant power, while the devices in the “Wireless” column are battery operated.": "لا تتردد في الخلط بسبب كلمة \"موصل\". هذا يعني أن الجهاز يحتاج إلى طاقة مستمرة، بينما الأجهزة في عمود \"لاسلكي\" تعمل بالبطارية.",
  "What new will the installation of all these devices bring to apartments?": "ما الجديد الذي ستجلبه تركيب جميع هذه الأجهزة إلى الشقق؟",
  "Smart switches will allow residents to control lighting both in the usual way and through a smartphone application, set up schedules and scenarios. For example, while in the bedroom, you can turn off the lights in the entire apartment or create the atmosphere for the evening with a defined scene.": "سيتيح للسكان الأفراد التحكم في الإضاءة بطريقة عادية وعبر تطبيق الهاتف الذكي، وإعداد الجداول الزمنية والسيناريوهات. على سبيل المثال، يمكنك إيقاف تشغيل الأضواء في الشقة بأكملها أثناء وجودك في غرفة النوم أو إنشاء أجواء المساء بمشهد محدد.",
  "Programmable IR remote controls can handle multiple devices from one location. For example, turning on the air conditioner on a schedule or to maintain a set temperature in the room.": "يمكن للأجهزة البعيدة التحكم في الأجهزة المتعددة من موقع واحد. على سبيل المثال، تشغيل مكيف الهواء وفقًا لجدول زمني أو للحفاظ على درجة حرارة محددة في الغرفة.",
  "Curtains can be tied to your alarm clock to make waking up a more pleasant experience.": "يمكن ربط الستائر بساعة المنبه الخاصة بك لجعل تجربة الاستيقاظ أكثر متعة.",
  "A smart boiler button will allow you to set the schedule once and no longer think about hot water in the winter.": "زر الغلاية الذكية سيتيح لك ضبط الجدول مرة واحدة وعدم التفكير بعد الآن في الماء الساخن في فصل الشتاء.",
  "Various sensors will give you complete information about the place where you live. Are all your doors and windows closed, what is the temperature and humidity in the nursery, how much electricity do you consume and for what, is there a water leak somewhere.": "سوف توفر لك مجموعة متنوعة من الحساسات معلومات كاملة عن المكان الذي تعيش فيه. هل جميع الأبواب والنوافذ مغلقة، ما هي درجة الحرارة والرطوبة في حجرة الأطفال، كمية الكهرباء التي تستهلكها ولأي غرض، هل هناك تسرب للماء في مكان ما.",
  "For greater comfort for residents, Pinout engineers will create seamless Internet within the apartment so that you have no dead zones.": "لراحة أكبر للسكان، ستقوم مهندسو Pinout بإنشاء شبكة إنترنت سلسة داخل الشقة بحيث لا توجد مناطق ميتة.",
  "Common Area": "منطقة مشتركة",
  "The building would not be called smart if the matter was limited only to automation inside the apartment. In a common area, smart relays will monitor the time of sunrise and sunset in order to turn on street lighting when it is really needed, without wasting resources. Lights in the lobby and staircases will turn on only when movement is detected.": "لن يكون البناء ذكيًا إذا كان الأمر مقتصرًا فقط على التشغيل التلقائي داخل الشقة. في المناطق المشتركة، ستراقب الأجهزة الذكية وقت شروق وغروب الشمس لتشغيل إضاءة الشوارع عندما يكون ذلك ضروريًا، دون إهدار الموارد. ستشتعل الأضواء في اللوبي والسلالم فقط عندما يتم اكتشاف الحركة.",
  "Regarding security, residents will have access to the intercom system from a single home control panel. We will also install CCTV cameras for security.": "بالنسبة للأمان، سيتمكن السكان من الوصول إلى نظام الانتركم من لوحة التحكم المنزلية الواحدة. سنقوم أيضًا بتركيب كاميرات مراقبة للأمان.",
  "Conclusion": "الاستنتاج",
  "Do you have the feeling that all this has already happened somewhere? Smart houses and apartments have been built for decades. So what new are Pinout engineers doing?": "هل لديك الشعور بأن كل هذا قد حدث في مكان ما من قبل؟ تم بناء المنازل والشقق الذكية منذ عقود. فما الجديد الذي يقوم به مهندسو Pinout؟",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant. This software allows you to combine all devices into a single system, and all data will remain inside your apartment.": "شقتك هي أكثر الأماكن حميمية. من غير المرجح أن تشعر بالراحة عندما تعلم أن جميع بياناتك تنتهي على خادم ما خارج منزلك. في هذا المشروع، يتم تجهيز كل شقة بخادم منزلي يحتوي على Home Assistant. هذا البرنامج يسمح لك بدمج جميع الأجهزة في نظام واحد، وسيبقى جميع البيانات داخل شقتك.",
  "Moreover, Home Assistant itself will understand that a new smart device has appeared, for example, a TV or a robot vacuum cleaner, and will offer to add it. You yourself can expand the smart home system and customize automation to suit your habits.": "علاوة على ذلك، سيفهم Home Assistant نفسه أن جهازًا ذكيًا جديدًا قد ظهر، على سبيل المثال، تلفزيون أو مكنسة كهربائية ذكية، وسيقترح إضافته. يمكنك بنفسك توسيع نظام المنزل الذكي وتخصيص الأتمتة لتناسب عاداتك.",
  "Residence 28 is not just a new residential complex with automation. This is a smart home that easily adapts to your life.": "Residence 28 ليس مجرد مجمع سكني جديد مع أتمتة. إنه منزل ذكي يتكيف بسهولة مع حياتك."
}