{
  "Hacked Johnny's Lab": "Gehackte Johnny's Lab",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Hallo daar! PaTara aan de lijn. Er was onlangs een evenement 'Hack Johnny's Lab' door Robonomics en ik geloof dat ik het op een bepaalde manier heb gehackt! Afgezien van de allereerste poging die ik verloor vanwege een misverstand over de regels, heb ik elke ronde waar ik aan deelnam gewonnen en hier is een kort 'howto' verhaal.",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Er was onlangs een evenement 'Hack Johnny's Lab' door Robonomics en ik geloof dat ik het op een bepaalde manier heb gehackt! Afgezien van de allereerste poging die ik verloor vanwege een misverstand over de regels, heb ik elke ronde waar ik aan deelnam gewonnen en hier is een kort 'howto' verhaal.",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "Ik ben redelijk bekend met programmeren en ik heb een degelijke laptop en bijna geen vaardigheid in beeldherkenning. Meer dan dat,",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "besloot ik het eerlijk te spelen, wat betekent geen video-downloaden, geen misbruik van afspeelsnelheid, geen navigatiebalk.",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "Dus de gekozen strategie was een goede oude bruteforce. Klinkt meer als hacken dan wat dan ook.",
  "(479’001’600 to be precise). Quite an amount to process!": "(479'001'600 om precies te zijn). Een behoorlijke hoeveelheid om te verwerken!",
  "## Strategy 1: dumb and straightforward.": "## Strategie 1: dom en rechttoe rechtaan.",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "mijn 64 GB RAM! Ik kreeg een SIGTERM-fout in de IDE-console.",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "Gewoon een evaluatieve run. Maar het ding is: mijn laptop draaide zelfs zijn ventilatoren niet op maximaal! Een enkele kern was belast.",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "Ik zocht een Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) pakket om alle",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "logische kernen van mijn CPU (20 stuks) te laden om de berekeningen parallel uit te voeren. Anders zou het een eeuwige reis zijn geweest.",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "Maar daarmee moest ik mijn iterator in 12 delen splitsen. De itertools multiprocessing-pakketten werken samen,",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "maar wanneer een hele reeks opties in het RAM-geheugen staat. Dat was niet mijn geval, dus het volgende werd uitgevoerd:",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "Vanaf dat moment en altijd zou ik deze strategie gebruiken om mijn CPU-belastingsmonitor er zo uit te laten zien:",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "Ik geloof dat dit de uitvoeringstijd heeft verkort tot ongeveer 5 seconden. Ik vond de beste manier om door de combinaties te itereren,",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "maar er waren er gewoon te veel! De eerste stap omvatte het uitvoeren van ongeveer 480 miljoen",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "extrinsieken in het netwerk. De node zou me gewoon verbannen voor DDOS en zelfs zonder dat zou het eeuwig duren!",
  "Just for a debugging reason I started the script (for node communication I used a": "Alleen voor een debugreden startte ik het script (voor node-communicatie gebruikte ik een",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) pakket) en merkte op dat voorafgaand aan het oproepen",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "uitvoeren kreeg ik fouten zoals _ongeldige mnemonische zin_. Een hint! Als ik de combinatie op locatie kon valideren,",
  "I would save tons of time! GitHub parsing led me to": "zou ik tonnen tijd besparen! GitHub-parsing leidde me naar",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "[dit](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "regel code en ik voegde een combinatievalidatie toe aan mijn script. Hierdoor is het aantal potentiële extrinsieken verminderd tot ongeveer 39'000'000 12 keer sneller!",
  "to roughly 39’000’000 12 times faster!": "Maar nog steeds, 39 miljoen oproepen zouden me voor altijd verbannen, dus ik moest meer graven. Hoe kon ik het aantal berekeningen aanzienlijk verminderen? Nou, door een beetje mijn oorspronkelijke strategie te verraden. Zie je, ik was van plan video's te vermijden,",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "“een hacker, die zelfs geen video nodig heeft”, maar de wiskunde deed me van gedachten veranderen. Verander het in een 132 keer snellere strategie.",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "Hieronder volgt de uitleg:",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "Hiermee hoefde ik alleen maar twee juiste posities van woorden in een zin te weten (één zou te lang duren, experimenteel gevalideerd).",
  "Below is the explanation:": "Ik zou door een 10! combinaties itereren, twee woorden op de juiste posities invoegen en de zin valideren,",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "waardoor de opties worden teruggebracht tot ongeveer 300'000 een behoorlijke afname! Meer nog, 10! combinatieset paste in mijn RAM, uitstekend!",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "mijn eigen lokale Robonomics-node gesynchroniseerd met de keten en vroeg het om een resulterend accountadres saldo!",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "Query is veel 'makkelijker' dan een extrinsieke. Na een hele nacht synchroniseren (ik heb een cache-limiet ingesteld zodat mijn",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "laptop niet opblaast met ketengegevens in zijn ROM) probeerde ik het en.. dit was een ramp. Netwerktransacties",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "Kijk. De regels zeggen dat het gewenste account **precies** 42 XRT heeft. Waarom zou ik niet alle actieve adressen in het netwerk krijgen,",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "ze filteren op precies 42 XRT en elke gegenereerde adres vergelijken met een lijst van mogelijke doelen",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(ongeveer 20, afnemend tot 1 aan het einde). Makkelijk om te zeggen en te doen.",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "Nu, na mijn script nog een keer te hebben aangepast, ben ik eindelijk tot slechts één query en één transactie gekomen die zeker",
  "give me the desired prize.": "mij de gewenste prijs zou geven.",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "Nu, nadat ik 25 seconden van de video heb bekeken (ondertussen de woorden van een mnemonische in te vullen),",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "zou ik slechts 30 seconden nodig hebben om de beloning te stelen. Gehackt."
}