{
  "Apartment building with Home Assistant onboard": "Wohngebäude mit Home Assistant an Bord",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant.": "Ihre Wohnung ist der intimste Ort. Es ist unwahrscheinlich, dass Sie sich wohl fühlen, wenn Sie wissen, dass alle Ihre Daten auf einem Server irgendwo außerhalb Ihres Zuhauses landen. In diesem Projekt ist jede Wohnung mit einem Heimserver mit Home Assistant ausgestattet.",
  "Hello everyone!": "Hallo allerseits!",
  "My name is Vadim Manaenko. I am a co-founder of Pinout LTD and one of the key developers in the [Robonomics Network](https://robonomics.network/) project. Today I want to share with you big news: Pinout LTD has signed a contract with the developer [CCS](https://www.stylianidesgroup.com/) for the automation of 28 apartments and common area in the [Residence 28](https://www.stylianidesgroup.com/property/residence-28) building. Work will begin in 2024.": "Mein Name ist Vadim Manaenko. Ich bin Mitbegründer von Pinout LTD und einer der Hauptentwickler des [Robonomics Network](https://robonomics.network/) Projekts. Heute möchte ich Ihnen eine große Neuigkeit mitteilen: Pinout LTD hat einen Vertrag mit dem Entwickler [CCS](https://www.stylianidesgroup.com/) für die Automatisierung von 28 Wohnungen und Gemeinschaftsbereichen im Gebäude [Residence 28](https://www.stylianidesgroup.com/property/residence-28) unterzeichnet. Die Arbeiten beginnen 2024.",
  "About the Project": "Über das Projekt",
  "The developer CCS has been operating on the market since 1997 and has built more than 600 properties. The Residence 28 project is located in Limassol, Cyprus. The building will consist of two blocks with a total living area (covered part) of about 1800 m2. This will be the first apartment building in Cyprus with a smart home system built on Zigbee wireless devices controlled by the open source [Home Assistant](https://www.home-assistant.io/) software, remote access will be provided via the Robonomics Parachain Web3 cloud.": "Der Entwickler CCS ist seit 1997 auf dem Markt tätig und hat mehr als 600 Immobilien gebaut. Das Projekt Residence 28 befindet sich in Limassol, Zypern. Das Gebäude besteht aus zwei Blöcken mit einer Gesamtwohnfläche (überdachter Teil) von etwa 1800 m2. Dies wird das erste Apartmentgebäude in Zypern sein, das auf Zigbee-Funkgeräten mit der Open-Source-Software [Home Assistant](https://www.home-assistant.io/) als Smart-Home-System ausgestattet ist. Der Fernzugriff erfolgt über die Robonomics Parachain Web3 Cloud.",
  "What Will Future Residents Receive?": "Was erhalten zukünftige Bewohner?",
  "Below is a floor plan of one of the two blocks and a designation legend.": "Unten finden Sie einen Grundriss eines der beiden Blöcke und eine Legende zur Kennzeichnung.",
  "Don't be confused by the word \"Wired\". This means that the device requires constant power, while the devices in the “Wireless” column are battery operated.": "Lassen Sie sich nicht von dem Wort \"Verkabelt\" verwirren. Dies bedeutet, dass das Gerät ständigen Strom benötigt, während die Geräte in der Spalte \"Kabellos\" batteriebetrieben sind.",
  "What new will the installation of all these devices bring to apartments?": "Was bringt die Installation all dieser Geräte in die Wohnungen?",
  "Smart switches will allow residents to control lighting both in the usual way and through a smartphone application, set up schedules and scenarios. For example, while in the bedroom, you can turn off the lights in the entire apartment or create the atmosphere for the evening with a defined scene.": "Mit intelligenten Schaltern können Bewohner die Beleuchtung sowohl auf herkömmliche Weise als auch über eine Smartphone-App steuern, Zeitpläne und Szenarien einrichten. Zum Beispiel können Sie im Schlafzimmer das Licht in der gesamten Wohnung ausschalten oder eine Atmosphäre für den Abend mit einer definierten Szene schaffen.",
  "Programmable IR remote controls can handle multiple devices from one location. For example, turning on the air conditioner on a schedule or to maintain a set temperature in the room.": "Programmierbare IR-Fernbedienungen können mehrere Geräte an einem Ort steuern. Zum Beispiel das Einschalten der Klimaanlage nach einem Zeitplan oder das Aufrechterhalten einer bestimmten Raumtemperatur.",
  "Curtains can be tied to your alarm clock to make waking up a more pleasant experience.": "Die Vorhänge können mit Ihrem Wecker verbunden werden, um das Aufwachen angenehmer zu gestalten.",
  "A smart boiler button will allow you to set the schedule once and no longer think about hot water in the winter.": "Mit einer intelligenten Boiler-Taste können Sie den Zeitplan einmal festlegen und sich im Winter keine Gedanken mehr über heißes Wasser machen.",
  "Various sensors will give you complete information about the place where you live. Are all your doors and windows closed, what is the temperature and humidity in the nursery, how much electricity do you consume and for what, is there a water leak somewhere.": "Verschiedene Sensoren liefern Ihnen vollständige Informationen über den Ort, an dem Sie leben. Sind alle Türen und Fenster geschlossen, wie ist die Temperatur und Luftfeuchtigkeit im Kinderzimmer, wie viel Strom verbrauchen Sie und wofür, gibt es irgendwo einen Wasserleckage.",
  "For greater comfort for residents, Pinout engineers will create seamless Internet within the apartment so that you have no dead zones.": "Um den Komfort der Bewohner zu erhöhen, werden Pinout-Ingenieure eine nahtlose Internetverbindung innerhalb der Wohnung herstellen, damit Sie keine Funklöcher haben.",
  "Common Area": "Gemeinschaftsbereich",
  "The building would not be called smart if the matter was limited only to automation inside the apartment. In a common area, smart relays will monitor the time of sunrise and sunset in order to turn on street lighting when it is really needed, without wasting resources. Lights in the lobby and staircases will turn on only when movement is detected.": "Das Gebäude wäre nicht intelligent, wenn es sich nur auf die Automatisierung innerhalb der Wohnung beschränken würde. In einem Gemeinschaftsbereich überwachen intelligente Relais die Sonnenaufgangs- und Sonnenuntergangszeiten, um die Straßenbeleuchtung nur dann einzuschalten, wenn sie wirklich benötigt wird, ohne Ressourcen zu verschwenden. Die Beleuchtung in der Lobby und den Treppenhäusern wird nur eingeschaltet, wenn eine Bewegung erkannt wird.",
  "Regarding security, residents will have access to the intercom system from a single home control panel. We will also install CCTV cameras for security.": "Was die Sicherheit betrifft, haben Bewohner Zugang zum Gegensprechanlagensystem von einer einzigen Heimsteuerung. Wir werden auch Überwachungskameras für die Sicherheit installieren.",
  "Conclusion": "Fazit",
  "Do you have the feeling that all this has already happened somewhere? Smart houses and apartments have been built for decades. So what new are Pinout engineers doing?": "Haben Sie das Gefühl, dass all dies bereits irgendwo passiert ist? Smarte Häuser und Wohnungen werden seit Jahrzehnten gebaut. Was also machen die Pinout-Ingenieure Neues?",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant. This software allows you to combine all devices into a single system, and all data will remain inside your apartment.": "Ihre Wohnung ist der intimste Ort. Es ist unwahrscheinlich, dass Sie sich wohl fühlen, wenn Sie wissen, dass alle Ihre Daten auf einem Server irgendwo außerhalb Ihres Zuhauses landen. In diesem Projekt ist jede Wohnung mit einem Heimserver mit Home Assistant ausgestattet. Diese Software ermöglicht es Ihnen, alle Geräte zu einer einzigen System zu kombinieren, und alle Daten bleiben innerhalb Ihrer Wohnung.",
  "This way we get rid of delays in transmitting commands over the global Internet. If I’m at home and press “turn off the lights,” there’s no point in sending a signal somewhere and waiting for a response.": "Auf diese Weise werden Verzögerungen bei der Übertragung von Befehlen über das globale Internet vermieden. Wenn ich zu Hause bin und auf \"Licht ausschalten\" drücke, hat es keinen Sinn, ein Signal irgendwohin zu senden und auf eine Antwort zu warten.",
  "Moreover, Home Assistant itself will understand that a new smart device has appeared, for example, a TV or a robot vacuum cleaner, and will offer to add it. You yourself can expand the smart home system and customize automation to suit your habits.": "Darüber hinaus erkennt Home Assistant selbst, dass ein neues intelligentes Gerät aufgetaucht ist, zum Beispiel ein Fernseher oder ein Roboterstaubsauger, und schlägt vor, es hinzuzufügen. Sie können das Smart-Home-System selbst erweitern und die Automatisierung an Ihre Gewohnheiten anpassen.",
  "Residence 28 is not just a new residential complex with automation. This is a smart home that easily adapts to your life.": "Residence 28 ist nicht nur ein neues Wohnkomplex mit Automatisierung. Dies ist ein intelligentes Zuhause, das sich problemlos an Ihr Leben anpasst."
}