{
  "Hacked Johnny's Lab": "Χακαρισμένο το εργαστήριο του Johnny",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Γεια σας! Ο PaTara στη γραμμή. Υπήρξε πρόσφατο γεγονός “Χάκαρε το εργαστήριο του Johnny” από την Robonomics και πιστεύω ότι το χάκαρα με κάποιον τρόπο! Εκτός από την πρώτη προσπάθεια που έχασα λόγω παρεξήγησης των κανόνων, κέρδισα σε κάθε γύρο που συμμετείχα και εδώ είναι μια σύντομη ιστορία “πώς να”.",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Υπήρξε πρόσφατο γεγονός “Hack Johnny’s Lab” από την Robonomics και πιστεύω ότι το χάκαρα με έναν τρόπο! Εκτός από την πρώτη προσπάθεια που έχασα λόγω παρεξήγησης των κανόνων, κέρδισα σε κάθε γύρο που συμμετείχα και εδώ είναι μια σύντομη ιστορία “πώς να”.",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "Είμαι κάπως εξοικειωμένος με την προγραμματισμό και έχω έναν αξιοπρεπή φορητό υπολογιστή και σχεδόν καθόλου δεξιότητα στην αναγνώριση εικόνας. Περισσότερο από αυτό,",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "αποφάσισα να παίξω δίκαια, που σημαίει χωρίς λήψη βίντεο, χωρίς κατάχρηση ταχύτητας αναπαραγωγής, χωρίς πλοήγηση μπάρας αναπαραγωγής.",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "Έτσι η επιλεγμένη στρατηγική ήταν μια καλή παλιά βία. Φαίνεται περισσότερο χάκινγκ από οτιδήποτε.",
  "What do we have here: a set of 12 words in a mixed order. This gives us 12! (factorial) options of phrases": "Τι έχουμε εδώ: ένα σύνολο 12 λέξεων σε ανάμεικτη σειρά. Αυτό μας δίνει 12! (παραγοντικό) επιλογές φράσεων",
  "(479’001’600 to be precise). Quite an amount to process!": "(479.001.600 για να είμαστε ακριβείς). Αρκετό ποσό για επεξεργασία!",
  "## Strategy 1: dumb and straightforward.": "## Στρατηγική 1: ανόητη και απλοϊκή.",
  "Well, what else do I need, just go and sort through! But here is the first trick: 12! mnemonic phrases just didn’t fit in": "Καλά, τι λλο χρειάζομαι, απλά πήγαινε και ταξινόμησε! Αλλά εδώ είναι το πρώτο κόλπο: 12! μνημονικές φράσεις απλά δεν χωρούσαν",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "στα 64 GB RAM μου! Πήρα ένα σφάλμα SIGTERM στην κονσόλα του IDE.",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "Απλά μια αξιολογική εκτέλεση. Αλλά το θέμα είναι: το laptop μου ακόμα δεν είχε αναπτύξει τους ανεμιστήρες του στο μέγιστο! Φορτώθηκε μόνο ένας πυρήνας.",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "Έκανα αναζήτηση στο Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) πακέτο για να φορτώσω όλους",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "τους λογικούς πυρήνες της CPU μου (20 από αυτούς) για παράλληλους υπολογισμούς. Διαφορετικά, θα ήταν ένα αιώνιο ταξίδι.",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "Αλλά με αυτό έπρεπε να χωρίσω τον επαναληπτή μου σε 12 μέρη. Τα πακέτα multiprocessing του itertools λειτουργούν μαζί,",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "αλλά όταν ένα ολόκληρο σύνολο επιλογών βρίσκεται στη RAM. Αυτό δεν ήταν η περίπτωσή μου, οπότε πραγματοποιήηκε το ακόλουθο:",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "Από εκείνη τη στιγμή και μετά θα χρησιμοποιούσα αυτή τη στρατηγική για να κάνω τον φορτίο της CPU μου να μοιάζει με αυτόν τον τρόπο:",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "Πιστεύω ότι αυτό μείωσε τον χρόνο εκτέλεσης σε περίπου 5 δευτερόλεπτα. Βρήκα τον καλύτερο τρόπο για να επαναλαμβάνω",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "τις συνδυασμούς αλλά υπήρχαν απλά πάρα πολλοί! Το πρώτο βήμα περιλάμβανε την εκτέλεση περίπου 480 εκατομμυρίων",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "εξωτερικών στο δίκτυο. Ο κόμβος απλά θα με απαγορεύσει για DDOS και ακόμη και χωρίς αυτό θα πήρε αιώνες!",
  "Just for a debugging reason I started the script (for node communication I used a": "Απλά για λόγους εντοπισμού σφαλμάτων ξεκίνησα το σενάριο (για επικοινωνία με τον κόμβο χρησιμοποίησα ένα",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) πακέτο) και παρατήρησα ότι πριν από την κλήση",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "εκτέλεσης πήρα σφάλματα όπως _μη έγκυρη φράση μνημονικού_. Ένα ίχνος! Αν μπορούσα να επικυρώσω τον συνδυασμό στον υπολογιστή μου,",
  "I would save tons of time! GitHub parsing led me to": "θα έσωζα πολύ χρόνο! Η ανάλυση του GitHub με οδήγησε σε",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "[αυτό](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "κομμάτι κώδικα και πρόσθεσα μια επικύρωση συνδυασμού στο σενάριό μου. Αυτό μείωσε τον αριθμό των πιθανών εξωτερικών",
  "to roughly 39’000’000 12 times faster!": "σε περίπου 39.000.000 12 φορές ταχύτερα!",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "Αλλά ακόμη, 39 εκατομύρια κλήσεις θα με απαγορεύσουν για πάντα, οπότε χρειάστηκε να ψάξω περισσότερο. Πώς θα μπορούσα",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "να μειώσω σημαντικά τον αριθμό των υπολογισμών; Καλά, με λίγη προδοσία της αρχικής μου στρατηγικής. Δείτε, είχα σκοπό να αποφύγω την παρακολούθηση βίντεο,",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "“ένας χάκερ, που δεν θα χρειαστεί ούτε ένα βίντεο”, αλλά η μαθηματική με έκανε να αλλάξω γνώμη. Να την αλλάξω σε μια στρατηγική 132 φορές ταχύτερη.",
  "Below is the explanation:": "Παρακάτω είναι η εξήγηση:",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "Με αυτό χρειαζόμουν μόνο να γνωρίζω δύο σωστές θέσεις λέξεων σε μια φράση (μία θα πάρει πολύ χρόνο, επιβεβαιωμένο από πείρα).",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "Θα επαναλάμβανα μέσα από έναν συνδυασμό 10!, εισήγαγα δύο λέξεις στις σωστές θέσεις και επικύρωνα τη φράση,",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "μειώνοντας τις επιλογές σε περίπου 300.000, μια σημαντική μείωση! Επιπλέον, οι συνδυασμοί 10! χωρούσαν στη RAM μου, εξαιρετικό!",
  "Also, rather than trying to transfer all the tokens each 300k times and calling a public node for that I decided to set": "Επίσης, αντί να προσπαθήσω να μεταφέρω όλα τα tokens κάθε 300k φορές και να καλώ ένα δημόσιο κόμβο γι' αυτό, αποφάσισα να ρυθμίσω",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "τον δικό μου τοπικό κόμβο Robonomics συγχρονισμένο με την αλυσίδα και να του ζητήσω το υπόλοιπο λογαριασμού λογαριασμού!",
  "Query is way “easier” than an extrinsic. After a whole night of synchronizing (I’ve set a cache limit so that my)": "Η ερώτηση είναι πολύ πιο “εύκολη” από μια εξωτερική. Μετά από μια ολόκληρη νύχτα συγχρονισμού (έχω ορίσει ένα όριο μνήμης cache ώστε το",
  "(laptop won’t blow up with chain data in its ROM) I gave it a try and.. this was a disaster. Network transactions": "φορητό μου υπολογιστή να μην εκραγεί με δεδομένα αλυσίδας στη ROM του) το δοκίμασα και.. αυτό ήταν ένας καταστροφή. Οι δικτυακές συναλλαγές",
  "(even within a localhost) took too much time. I didn’t even wait till the end, it was obviously way slower than": "(ακόμη και μέσα σε ένα τοπικό υπολογιστή) πήραν πολύ χρόνο. Δεν περίμενα ούτε μέχρι το τέλος, ήταν προφανώς πολύ πιο αργό από",
  "watching a whole video. If only I could know the exact address of the account! But for that I need a mnemonic phrase… **Or do I really?**": "το να παρακολουθήσω ένα ολόκληρο βίντεο. Αν μόνο μπορούσα να γνωρίζω την ακριβή διεύθυνση του λογαριασμού! Αλλά γι' αυτό χρειάζομαι μια φράση μνημονικού… **Ή μήπως όχι πραγματικά;**",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "Δείτε. Οι κανόνες λένε ότι ο επιθυμητός λογαριασμός έχει **ακριβώς** 42 XRT. Γιατί δεν θ πάρω όλες τις ενεργές διευθύνσεις στο δίκτυο,",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "θα τις φιλτράρω έχοντας ακριβώς 42 XRT και θα συγκρίνω κάθε δημιουργημένη διεύθυνση με μια λίστα πιθανών στόχων",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(περίπου 20, μειώνοντας σε 1 στο τέλος). Εύκολο να πεις και να κάνεις.",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "Τώρα, μετά την τροποποίηση του σεναρίου μου ακόμη μια φορά, τελικά τα κατάφερα με μόνο μια ερώτηση και μια συναλλαγή που θα μου",
  "give me the desired prize.": "δώσει σίγουρα το επιθυμητό βραβείο.",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "Τώρα, μετά από την παρακολούθηση 25 δευτερολέπτων του βίντεο (ταυτόχρονα συμπληρώνοντας τις λέξεις ενός μνημονικού),",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "θα χρειαζόμουν μόνο 30 δευτερόλεπτα ως μέγιστο για να κλέψω το έπαθλο. Το κατάφερα."
}