{
  "Hacked Johnny's Lab": "Laboratorio di Johnny violato",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Ciao! PaTara in linea. C'è stato di recente un evento “Hack Johnny’s Lab” di Robonomics e credo di averlo hackerato in un certo modo! A parte il primo tentativo che ho perso a causa di un fraintendimento delle regole, ho vinto ogni round a cui ho partecipato e qui c'è una breve storia su come ho fatto.",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "C'è stato di recente un evento “Hack Johnny’s Lab” di Robonomics e credo di averlo hackerato in un certo modo! A parte il primo tentativo che ho perso a causa di un fraintendimento delle regole, ho vinto ogni round a cui ho partecipato e qui c'è una breve storia su come ho fatto.",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "Sono abbastanza familiare con la programmazione e ho un laptop decente e quasi nessuna competenza nel riconoscimento delle immagini. Oltre a ciò,",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "ho deciso di giocare in modo leale, il che significa nessun download di video, nessun abuso di velocità di riproduzione, nessuna navigazione nella barra di riproduzione.",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "Quindi la strategia scelta è stata una vecchia e buona forza bruta. Suona più come hacking che altro.",
  "(479’001’600 to be precise). Quite an amount to process!": "(479’001’600 per essere precisi). Una quantità piuttosto consistente da elaborare!",
  "## Strategy 1: dumb and straightforward.": "## Strategia 1: stupida e diretta.",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "i miei 64 GB di RAM! Ho ricevuto un errore SIGTERM nella console dell'IDE.",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "Solo una corsa valutativa. Ma la cosa è: il mio laptop non ha nemmeno fatto girare i suoi ventilatori al massimo! Un singolo core era caricato.",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "Ho cercato un pacchetto Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) per caricare tutti",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "i core logici della mia CPU (20 di essi) per parallelizzare i calcoli. Altrimenti, sarebbe stato un viaggio eterno.",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "Ma con questo ho dovuto dividere il mio iteratore in 12 parti. I pacchetti di multiprocessing di itertools funzionano insieme,",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "ma quando un intero set di opzioni è nella RAM. Questo non era il mio caso, quindi è stato eseguito quanto segue:",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "Da quel momento in poi avrei usato questa strategia per far apparire il monitor del carico della CPU in questo modo:",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "Credo che questo abbia ridotto il tempo di esecuzione a circa 5 secondi. Ho trovato il modo migliore per iterare attraverso",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "le combinazioni ma ce n'erano semplicemente troppe! Il primo passo consisteva nell'eseguire circa 480 milioni",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "esterni nella rete. Il nodo mi avrebbe semplicemente bandito per DDOS e anche senza quello ci vorrebbe per sempre!",
  "Just for a debugging reason I started the script (for node communication I used a": "Solo per motivi di debug ho avviato lo script (per la comunicazione con il nodo ho usato un",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) pacchetto) e ho notato che prima di chiamare",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "eseguire ho ottenuto errori come _frase mnemonica non valida_. Un indizio! Se potessi convalidare la combinazione in premessa,",
  "I would save tons of time! GitHub parsing led me to": "risparmierei un sacco di tempo! Il parsing di GitHub mi ha portato a",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "[questo](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "riga di codice e ho aggiunto una convalida della combinazione al mio script. Questo ha ridotto il numero di esterni potenziali a circa 39’000’000 12 volte più veloce!",
  "to roughly 39’000’000 12 times faster!": "Ma ancora, 39 milioni di chiamate mi bandirebbero per sempre, quindi ho dovuto scavare di più. Come potevo tagliare significativamente il",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "numero di calcoli? Beh, tradendo un po' la mia strategia iniziale. Vedi, stavo per evitare di guardare video,",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "“un hacker, che nemmeno avrà bisogno di un video”, ma la matematica mi ha fatto cambiare idea. Cambiarla in una strategia 132 volte più veloce.",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "Di seguito è spiegato:",
  "Below is the explanation:": "Con questo dovevo solo conoscere due posizioni corrette delle parole in una frase (una richiederebbe troppo tempo, sperimento convalidato).",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "Avrei iterato attraverso un 10! combinazioni, inserito due parole nelle posizioni corrette e convalidato la frase,",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "riducendo le opzioni a circa 300’000 una notevole diminuzione! Inoltre, il set di combinazioni 10! si adattava alla mia RAM, eccellente!",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "il mio nodo Robonomics locale sincronizzato con la catena e chiedergli il saldo di un account risultante!",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "La query è molto più “facile” di un estrinseco. Dopo una intera notte di sincronizzazione (ho impostato un limite di cache in modo che il mio",
  "(even within a localhost) took too much time. I didn’t even wait till the end, it was obviously way slower than": "guardare un intero video. Se solo potessi conoscere l'indirizzo esatto dell'account! Ma per questo ho bisogno di una frase mnemonica… **O davvero?**",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "Guarda. Le regole dicono che l'account desiderato ha **esattamente** 42 XRT. Perché non dovrei ottenere tutti gli indirizzi attivi nella rete,",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "filtrarli avendo esattamente 42 XRT e confrontare ciascun indirizzo generato con un elenco di possibili obiettivi",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(circa 20, diminuendo a 1 alla fine). Facile da dire e da fare.",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "Ora, dopo aver modificato di nuovo il mio script, sono finalmente riuscito a fare solo una query e una transazione che sicuramente",
  "give me the desired prize.": "mi darebbe il premio desiderato.",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "Ora, dopo aver guardato 25 secondi del video (nel frattempo compilando le parole di un mnemonico),",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "avrei bisogno solo di 30 secondi al massimo per rubare la ricompensa. Hacked it."
}