{
  "Apartment building with Home Assistant onboard": "Edificio di appartamenti con Home Assistant a bordo",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant.": "Il tuo appartamento è il luogo più intimo. È improbabile che tu ti senta a tuo agio sapendo che tutti i tuoi dati finiscono su un server da qualche parte al di fuori della tua casa. In questo progetto, ogni appartamento è dotato di un server domestico con Home Assistant.",
  "Hello everyone!": "Ciao a tutti!",
  "My name is Vadim Manaenko. I am a co-founder of Pinout LTD and one of the key developers in the [Robonomics Network](https://robonomics.network/) project. Today I want to share with you big news: Pinout LTD has signed a contract with the developer [CCS](https://www.stylianidesgroup.com/) for the automation of 28 apartments and common area in the [Residence 28](https://www.stylianidesgroup.com/property/residence-28) building. Work will begin in 2024.": "Mi chiamo Vadim Manaenko. Sono uno dei fondatori di Pinout LTD e uno dei principali sviluppatori del progetto [Robonomics Network](https://robonomics.network/). Oggi voglio condividere con voi una grande notizia: Pinout LTD ha firmato un contratto con lo sviluppatore [CCS](https://www.stylianidesgroup.com/) per l'automazione di 28 appartamenti e delle aree comuni nel palazzo [Residence 28](https://www.stylianidesgroup.com/property/residence-28). I lavori inizieranno nel 2024.",
  "About the Project": "Informazioni sul progetto",
  "The developer CCS has been operating on the market since 1997 and has built more than 600 properties. The Residence 28 project is located in Limassol, Cyprus. The building will consist of two blocks with a total living area (covered part) of about 1800 m2. This will be the first apartment building in Cyprus with a smart home system built on Zigbee wireless devices controlled by the open source [Home Assistant](https://www.home-assistant.io/) software, remote access will be provided via the Robonomics Parachain Web3 cloud.": "Lo sviluppatore CCS opera sul mercato dal 1997 e ha costruito più di 600 proprietà. Il progetto Residence 28 si trova a Limassol, Cipro. L'edificio sarà composto da due blocchi con una superficie abitabile totale (parte coperta) di circa 1800 m2. Questo sarà il primo edificio di appartamenti a Cipro con un sistema domotico intelligente basato su dispositivi wireless Zigbee controllati dal software open source [Home Assistant](https://www.home-assistant.io/), l'accesso remoto sarà fornito tramite il cloud Robonomics Parachain Web3.",
  "What Will Future Residents Receive?": "Cosa riceveranno i futuri residenti?",
  "Below is a floor plan of one of the two blocks and a designation legend.": "Di seguito è riportata una pianta di uno dei due blocchi e una legenda di designazione.",
  "Don't be confused by the word \"Wired\". This means that the device requires constant power, while the devices in the “Wireless” column are battery operated.": "Non lasciarti confondere dalla parola \"Cablati\". Questo significa che il dispositivo richiede alimentazione costante, mentre i dispositivi nella colonna \"Senza fili\" sono alimentati a batteria.",
  "What new will the installation of all these devices bring to apartments?": "Cosa porterà l'installazione di tutti questi dispositivi negli appartamenti?",
  "Smart switches will allow residents to control lighting both in the usual way and through a smartphone application, set up schedules and scenarios. For example, while in the bedroom, you can turn off the lights in the entire apartment or create the atmosphere for the evening with a defined scene.": "I pulsanti intelligenti consentiranno ai residenti di controllare l'illuminazione sia nel modo usuale che tramite un'applicazione per smartphone, impostare programmi e scenari. Ad esempio, mentre sei in camera da letto, puoi spegnere le luci in tutto l'appartamento o creare l'atmosfera per la serata con una scena definita.",
  "Programmable IR remote controls can handle multiple devices from one location. For example, turning on the air conditioner on a schedule or to maintain a set temperature in the room.": "I telecomandi IR programmabili possono gestire più dispositivi da una sola posizione. Ad esempio, accendere l'aria condizionata secondo un programma o mantenere una temperatura impostata nella stanza.",
  "Curtains can be tied to your alarm clock to make waking up a more pleasant experience.": "Le tende possono essere collegate alla tua sveglia per rendere il risveglio un'esperienza più piacevole.",
  "A smart boiler button will allow you to set the schedule once and no longer think about hot water in the winter.": "Un pulsante intelligente per la caldaia ti permetterà di impostare il programma una volta e non pensare più all'acqua calda in inverno.",
  "Various sensors will give you complete information about the place where you live. Are all your doors and windows closed, what is the temperature and humidity in the nursery, how much electricity do you consume and for what, is there a water leak somewhere.": "Diversi sensori ti forniranno informazioni complete sul luogo in cui vivi. Sono tutte le porte e finestre chiuse, qual è la temperatura e l'umidità nella stanza dei bambini, quanto elettricità consumi e per cosa, c'è una perdita d'acqua da qualche parte.",
  "For greater comfort for residents, Pinout engineers will create seamless Internet within the apartment so that you have no dead zones.": "Per un maggiore comfort per i residenti, gli ingegneri di Pinout creeranno una connessione Internet senza interruzioni all'interno dell'appartamento in modo che non ci siano zone morte.",
  "Common Area": "Area comune",
  "The building would not be called smart if the matter was limited only to automation inside the apartment. In a common area, smart relays will monitor the time of sunrise and sunset in order to turn on street lighting when it is really needed, without wasting resources. Lights in the lobby and staircases will turn on only when movement is detected.": "L'edificio non sarebbe chiamato intelligente se la questione si limitasse solo all'automazione all'interno dell'appartamento. In un'area comune, i relè intelligenti monitoreranno l'ora del sorgere e del tramonto del sole per accendere l'illuminazione stradale quando è realmente necessario, senza sprechi di risorse. Le luci nella hall e nelle scale si accenderanno solo quando viene rilevato un movimento.",
  "Regarding security, residents will have access to the intercom system from a single home control panel. We will also install CCTV cameras for security.": "Per quanto riguarda la sicurezza, i residenti avranno accesso al sistema di citofono da un unico pannello di controllo domestico. Installeremo anche telecamere CCTV per la sicurezza.",
  "Conclusion": "Conclusione",
  "Do you have the feeling that all this has already happened somewhere? Smart houses and apartments have been built for decades. So what new are Pinout engineers doing?": "Hai la sensazione che tutto questo sia già successo da qualche parte? Case e appartamenti intelligenti sono stati costruiti da decenni. Quindi cosa fanno di nuovo gli ingegneri di Pinout?",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant. This software allows you to combine all devices into a single system, and all data will remain inside your apartment.": "Il tuo appartamento è il luogo più intimo. È improbabile che tu ti senta a tuo agio sapendo che tutti i tuoi dati finiscono su un server da qualche parte al di fuori della tua casa. In questo progetto, ogni appartamento è dotato di un server domestico con Home Assistant. Questo software ti permette di combinare tutti i dispositivi in un unico sistema e tutti i dati rimarranno all'interno del tuo appartamento.",
  "This way we get rid of delays in transmitting commands over the global Internet. If I’m at home and press “turn off the lights,” there’s no point in sending a signal somewhere and waiting for a response.": "In questo modo ci liberiamo dei ritardi nella trasmissione dei comandi su Internet. Se sono a casa e premo \"spegni le luci\", non ha senso inviare un segnale da qualche parte e aspettare una risposta.",
  "Moreover, Home Assistant itself will understand that a new smart device has appeared, for example, a TV or a robot vacuum cleaner, and will offer to add it. You yourself can expand the smart home system and customize automation to suit your habits.": "Inoltre, Home Assistant stesso capirà che è apparato un nuovo dispositivo intelligente, ad esempio una TV o un aspirapolvere robot, e offrirà di aggiungerlo. Puoi espandere il sistema di casa intelligente e personalizzare l'automazione secondo le tue abitudini.",
  "Residence 28 is not just a new residential complex with automation. This is a smart home that easily adapts to your life.": "Residence 28 non è solo un nuovo complesso residenziale con automazione. Questa è una casa intelligente che si adatta facilmente alla tua vita."
}