{
  "Hacked Johnny's Lab": "ハッキンされたジョニーの研究室",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "こんにちは！PaTaraです。最近、Robonomicsによるイベント「Hack Johnny's Lab」があり、私はある意味でそれをハックしたと思います！最初の試みはルールの誤解により失敗しましたが、参加したすべてのラウンドで勝利し、ここに短い「ハウツー」ストーリーがあります。",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "最近、Robonomicsによるイベント「Hack Johnny's Lab」があり、私はある意味でそれをハックしたと思います！最初の試みはルールの誤解により失敗しましたが、参加したすべてのラウンドで勝利し、ここに短い「ハウツー」ストーリーがあります。",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "私はプログラミングにはある程度慣れており、まあまあのラップトップを持っていますが、画像認識のスキルはほとんどありません。それ以上に、",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "ビデオのダウンロードや再生速度の乱用、プレイバーのナビゲーションなどは一切行わないと決めました。",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "選択した戦略は古典的なブルートフォースでした。それは何よりもハッキングらしいです。",
  "(479’001’600 to be precise). Quite an amount to process!": "（正確に479'001'600）。処理するにはかなりの量です！",
  "## Strategy 1: dumb and straightforward.": "## 戦略1：愚かで率直なもの。",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "私の64GB RAM！IDEコンソールSIGTERMエラーが発生しました。",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "評価用の実行です。しかし問題は、私のラップトップはさえぎりファンを最大速度で回転させることさえありませんでした！1つのコアが負荷をかけられました。",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "私はすべての論理コア（20個）を並列計算するためにPythonの[multiprocessing](https://docs.python.org/3/library/multiprocessing.html)パッケージを調べました。そうしないと、永遠の旅になってしまいます。",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "しかし、そのためにはイテレータを12つに分割する必要がありました。itertools multiprocessingパッケージは一緒に動作しますが、",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "オプションのセット全体がRAMにある場合です。それは私の場合ではなかったので、次のように行いました。",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "その時点から、私は常にこの戦略を使って、CPUの負荷モニターをこのように見せるようにしました。",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "これにより、実行時間が約5秒に短縮されたと思います。組み合わせを繰り返す最良の方法を得ましたが、それらがあまりにも多すぎました！最初のステップは、おおよそ480百万の",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "ネットワーク内の外部入力を実行することでした。ノードは私をDDOSのために単純に禁止し、それさえなくても永遠にかかってしまいます！",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "デバッグのために、スクリプトを開始しました（ノードとの通信には",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/)パッケージを使用しました）",
  "Just for a debugging reason I started the script (for node communication I used a": "そして、呼び出しを行う前に、_無効なニーモニックフレーズ_のようなエラーが発生したことに気づきました。手がかり！プレミアムで組み合わせを検証できれば、",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "多くの時間を節約できると思いました！GitHubの解析により、私は",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "[これ](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "I would save tons of time! GitHub parsing led me to": "コード行にたどり着き、スクリプトに組み合わせの検証を追加しました。これにより、潜在的な外部入力の数がおおよそ39'000'000倍速く減少しました！",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "しかし、それでも、3900万回の呼び出しは永遠に私を禁止するでしょう。だから、もっと掘り下げる必要がありました。どうやって計算の数を大幅に削減できるでしょうか？",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "少し初期の戦略を裏切ることで、それを実現できます。ビデオの視聴を避けるつもりでしたが、",
  "to roughly 39’000’000 12 times faster!": "「ビデオを必要としないハッカー」という考えを変えさせたの学でした。132倍速い戦略に変更しました。",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "以下に説明します。",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "それにより、フレーズ内の単語の2つの正しい位置だけを知る必要がありました（1つだけだと時間がかかりすぎることが実験で確認されました）。",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "10！の組み合わせを繰り返し、2つの単語を正しい位置に挿入し、フレーズを検証し、",
  "Below is the explanation:": "オプションを約300'000に削減しました。さらに、10！の組み合わせセットは私のRAMに収まりました、素晴らしい！",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "自分のローカルRobonomicsノードをチェーンと同期させ、その結果のアカウントアドレス残高を尋ねました！",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "クエリは外部入力よりも「簡単」です。同期化を一晩中行った後（ROM内のチェーンデータでラップトップが爆発しないようにキャッシュ制限を設定しました）、試してみましたが...これは災難でした。ネットワークトランザクション",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "（localhost内でも）時間がかかりすぎました。最後まで待つこともなく、明らかにビデオ全体を見るよりも遅かったです。アカウントの正確なアドレスを知ることができればいいのですが！しかし、そのためにはニーモニックフレーズが必要です... **本当に必要なのでしょうか？**",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "見て。ルーによると、望ましいアカウントには**正確に**42 XRTが必要です。なぜなら、ネットワーク内のすべてのアクティブなアドレスを取得し、",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "正確に42 XRTを持つものをフィルタリングし、生成された各アドレスを可能なターゲットのリストと比較します",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(約20、最後に1に減少)。言うのは簡単ですが、やるのは簡単です。",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "さて、スクリプトをもう一度修正した後、確実に望ましい賞品を手に入れることができる",
  "give me the desired prize.": "1つのクエリと1つのトランザクションになりました。",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "さて、ビデオを25秒間見た後（その間にニーモニックの単語を入力している）、",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "報酬を盗むのに最大30秒しかかからないでしょう。ハッキングしました。",
  "What do we have here: a set of 12 words in a mixed order. This gives us 12! (factorial) options of phrases": "ここに何あるのか：順不同の12語のセット。これにより、12！（階乗）のフレーズのオプションが得られます",
  "Well, what else do I need, just go and sort through! But here is the first trick: 12! mnemonic phrases just didn’t fit in": "さて、他に何が必要か、ただ行って整理するだけです！しかし、最初のトリックがここにあります：12！ニーモニックフレーズはうまく収まりませんでした",
  "Also, rather than trying to transfer all the tokens each 300k times and calling a public node for that I decided to set": "また、すべてのトークンを300k回転送し、それに対して公開ノードを呼び出す代わりに、私は設定することに決めました",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "自分自身のローカルRobonomicsノードをチェーンと同期させ、その結果のアカウントアドレス残高を尋ねます！",
  "Query is way “easier” than an extrinsic. After a whole night of synchronizing (I’ve set a cache limit so that my)": "クエリは外部からの要求よりもはるかに「簡単」です。同期化の一晩中（ROM内のチェーンデータでラップトップが爆発しないようにキャッシュ制限を設定しました）",
  "(laptop won’t blow up with chain data in its ROM) I gave it a try and.. this was a disaster. Network transactions": "試してみましたが...これは災害でした。ネットワークトランザクション（localhost内でも）には時間がかかりすぎました。最後まで待つ必要もなく、明らかにビデオを見るよりも遅かったです。アカウントの正確なアドレスを知ることができればよかったのですが！しかし、そのためにはニーモニックフレーズが必要です... **本当に必要なのでしょうか？**",
  "(even within a localhost) took too much time. I didn’t even wait till the end, it was obviously way slower than": "（ローカルト内でも）時間がかかりすぎました。最後まで待つこともなく、明らかにビデオ全体を見るよりも遅かったです",
  "watching a whole video. If only I could know the exact address of the account! But for that I need a mnemonic phrase… **Or do I really?**": "アカウントの正確なアドレスを知ることができればいいのに！でもそのためにはニーモニックフレーズが必要です... **本当に必要なのか？**"
}