{
  "Hacked Johnny's Lab": "Laboratório do Johnny Hackeado",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Olá! PaTara na linha. Houve um evento recente “Hack Johnny’s Lab” pela Robonomics e eu acredito que consegui hackeá-lo de alguma forma! Além da primeira tentativa que perdi devido a um mal-entendido das regras, ganhei todas as rodadas das quais participei e aqui está uma breve história de “como fazer”.",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Houve um evento recente “Hack Johnny’s Lab” pela Robonomics e eu acredito que consegui hackeá-lo de alguma forma! Além da primeira tentativa que perdi devido a um mal-entendido das regras, ganhei todas as rodadas das quais participei e aqui está uma breve história de “como fazer”.",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "Eu sou meio familiarizado com programação e tenho um laptop decente e quase nenhuma habilidade em reconhecimento de imagem. Mais do que isso,",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "Decidi jogar de forma justa, o que significa sem baixar vídeos, sem abuso de velocidade de reprodução, sem navegação na barra de reprodução.",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "Então a estratégia escolhida foi um bom e velho bruteforce. Parece mais hacking do que qualquer outra coisa.",
  "(479’001’600 to be precise). Quite an amount to process!": "(479’001’600 para ser preciso). Uma quantidade considerável para processar!",
  "## Strategy 1: dumb and straightforward.": "## Estratégia 1: burra e direta.",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "meus 64 GB de RAM! Recebi um erro SIGTERM no console do IDE.",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "Apenas uma execução avaliativa. Mas o fato é: meu laptop nem chegou a girar seus ventiladores no máximo! Um único núcleo estava carregado.",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "Pesquisei um pacote Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) para carregar todos",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "os núcleos lógicos da minha CPU (20 deles) para paralelizar os cálculos. Caso contrário, teria sido uma jornada eterna.",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "Mas com isso tive que dividir meu iterador em 12 partes. Os pacotes de multiprocessing do itertools funcionam juntos,",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "mas quando um conjunto inteiro de opções está na RAM. Esse não era o meu caso, então o seguinte foi realizado:",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "A partir desse momento e sempre eu usaria essa estratégia para fazer meu monitor de carga da CPU parecer assim:",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "Acredito que isso reduziu o tempo de execução para cerca de 5 segundos. Descobri a melhor maneira de iterar através",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "das combinações, mas havia simplesmente muitas delas! O primeiro passo envolveu realizar aproximadamente 480 milhões",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "extrínsecos na rede. O nó simplesmente me baniria por DDOS e mesmo sem isso levaria uma eternidade!",
  "Just for a debugging reason I started the script (for node communication I used a": "Apenas por razões de depuração, iniciei o script (para comunicação com o nó usei um",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) pacote) e notei que antes de chamar",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "realizar eu recebia erros como _frase mnemônica inválida_. Uma pista! Se eu pudesse validar a combinação localmente,",
  "I would save tons of time! GitHub parsing led me to": "eu economizaria toneladas de tempo! A análise do GitHub me levou a",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "[este](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "linha de código e adicionei uma validação de combinação ao meu script. Isso reduziu o número de extrínsecos potenciais para aproximadamente 39’000’000 12 vezes mais rápido!",
  "to roughly 39’000’000 12 times faster!": "Mas ainda assim, 39 milhões de chamadas me baniriam para sempre, então eu precisava cavar mais fundo. Como eu poderia cortar significativamente o",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "número de cálculos? Bem, traindo um pouco minha estratégia inicial. Veja, eu ia evitar assistir vídeos,",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "“um hacker, que nem precisará de um vídeo”, mas a matemática me fez mudar de ideia. Mudar para uma estratégia 132 vezes mais rápida.",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "Abaixo está a explicação:",
  "Below is the explanation:": "Com isso, eu só precisava saber duas posições corretas de palavras em uma frase (uma levaria muito tempo, validada por experimento).",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "Eu iteraria através de 10! combinações, inseriria duas palavras nas posições corretas e validaria a frase,",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "reduzindo as opções para aproximadamente 300’000, uma grande diminuição! Além disso, o conjunto de 10! combinações cabia na minha RAM, excelente!",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "meu próprio nó Robonomics local sincronizado com a cadeia e perguntaria a ele pelo saldo de uma conta resultante!",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "A consulta é muito mais “fácil” do que um extrínseco. Depois de uma noite inteira de sincronização (defini um limite de cache para que meu",
  "(even within a localhost) took too much time. I didn’t even wait till the end, it was obviously way slower than": "assistir a um vídeo inteiro. Se ao menos eu pudesse saber o endereço exato da conta! Mas para isso eu precisaria de uma frase mnemônica… **Será que realmente?**",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "Olha. As regras dizem que a conta desejada tem **exatamente** 42 XRT. Por que eu não pegaria todos os endereços ativos na rede,",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "filtrá-los tendo exatamente 42 XRT e comparar cada endereço gerado com uma lista de possíveis alvos",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(cerca de 20, diminuindo para 1 no final). Fácil de dizer e fazer.",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "Agora, depois de modificar meu script mais uma vez, finalmente consegui chegar a apenas uma consulta e uma transação que com certeza",
  "give me the desired prize.": "me daria o prêmio desejado.",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "Agora, depois de assistir 25 segundos do vídeo (enquanto preenchia as palavras de um mnemônico),",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "eu só precisaria de 30 segundos no máximo para roubar a recompensa. Hackeado.",
  "What do we have here: a set of 12 words in a mixed order. This gives us 12! (factorial) options of phrases": "O que temos aqui: um conjunto de 12 palavras em uma ordem misturada. Isso nos dá 12! (fatorial) opções de frases",
  "Well, what else do I need, just go and sort through! But here is the first trick: 12! mnemonic phrases just didn’t fit in": "Bem, o que mais eu preciso, apenas vá e ordene! Mas aqui está o primeiro truque: 12! frases mnemônicas simplesmente não se encaixaram",
  "Also, rather than trying to transfer all the tokens each 300k times and calling a public node for that I decided to set": "Além disso, em vez de tentar transferir todos os tokens 300 mil vezes e chamar um nó público para isso, decidi definir",
  "Query is way “easier” than an extrinsic. After a whole night of synchronizing (I’ve set a cache limit so that my)": "A consulta é muito mais 'fácil' do que um extrínseco. Depois de uma noite inteira de sincronização (defini um limite de cache para que meu)",
  "(laptop won’t blow up with chain data in its ROM) I gave it a try and.. this was a disaster. Network transactions": "(laptop não exploda com dados da cadeia em sua ROM) eu dei uma chance e.. isso foi um desastre. Transações de rede",
  "watching a whole video. If only I could know the exact address of the account! But for that I need a mnemonic phrase… **Or do I really?**": "assistindo a um vídeo inteiro. Se ao menos eu pudesse saber o endereço exato da conta! Mas para isso eu preciso de uma frase mnemônica... **Ou será que realmente preciso?**"
}