{
  "Apartment building with Home Assistant onboard": "Edifício de apartamentos com Home Assistant a bordo",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant.": "O seu apartamento é o lugar mais íntimo. É improvável que você se sinta confortável sabendo que todos os seus dados acabam em um servidor em algum lugar fora de sua casa. Neste projeto, cada apartamento está equipado com um servidor doméstico com o Home Assistant.",
  "Hello everyone!": "Olá a todos!",
  "My name is Vadim Manaenko. I am a co-founder of Pinout LTD and one of the key developers in the [Robonomics Network](https://robonomics.network/) project. Today I want to share with you big news: Pinout LTD has signed a contract with the developer [CCS](https://www.stylianidesgroup.com/) for the automation of 28 apartments and common area in the [Residence 28](https://www.stylianidesgroup.com/property/residence-28) building. Work will begin in 2024.": "Meu nome é Vadim Manaenko. Sou co-fundador da Pinout LTD e um dos principais desenvolvedores do projeto [Robonomics Network](https://robonomics.network/). Hoje quero compartilhar com vocês uma grande notícia: a Pinout LTD assinou um contrato com o desenvolvedor [CCS](https://www.stylianidesgroup.com/) para a automação de 28 apartamentos e áreas comuns no edifício [Residence 28](https://www.stylianidesgroup.com/property/residence-28). O trabalho começará em 2024.",
  "About the Project": "Sobre o Projeto",
  "The developer CCS has been operating on the market since 1997 and has built more than 600 properties. The Residence 28 project is located in Limassol, Cyprus. The building will consist of two blocks with a total living area (covered part) of about 1800 m2. This will be the first apartment building in Cyprus with a smart home system built on Zigbee wireless devices controlled by the open source [Home Assistant](https://www.home-assistant.io/) software, remote access will be provided via the Robonomics Parachain Web3 cloud.": "A CCS está operando no mercado desde 1997 e construiu mais de 600 propriedades. O projeto Residence 28 está localizado em Limassol, Chipre. O edifício será composto por dois blocos com uma área habitável total (parte coberta) de cerca de 1800 m2. Este será o primeiro edifício de apartamentos em Chipre com um sistema residencial inteligente construído em dispositivos sem fio Zigbee controlados pelo software de código aberto [Home Assistant](https://www.home-assistant.io/), o acesso remoto será fornecido através da nuvem Robonomics Parachain Web3.",
  "What Will Future Residents Receive?": "O que os futuros moradores receberão?",
  "Below is a floor plan of one of the two blocks and a designation legend.": "Abaixo está o plano de um dos dois blocos e uma legenda de designação.",
  "Don't be confused by the word \"Wired\". This means that the device requires constant power, while the devices in the “Wireless” column are battery operated.": "Não se confunda com a palavra \"Com fio\". Isso significa que o dispositivo requer energia constante, enquanto os dispositivos na coluna \"Sem fio\" são alimentados por bateria.",
  "What new will the installation of all these devices bring to apartments?": "O que a instalação de todos esses dispositivos trará de novo para os apartamentos?",
  "Smart switches will allow residents to control lighting both in the usual way and through a smartphone application, set up schedules and scenarios. For example, while in the bedroom, you can turn off the lights in the entire apartment or create the atmosphere for the evening with a defined scene.": "Interruptores inteligentes permitirão que os moradores controlem a iluminação tanto da maneira usual quanto através de um aplicativo de smartphone, configurem horários e cenários. Por exemplo, enquanto estiver no quarto, você pode desligar as luzes em todo o apartamento ou criar a atmosfera para a noite com uma cena definida.",
  "Programmable IR remote controls can handle multiple devices from one location. For example, turning on the air conditioner on a schedule or to maintain a set temperature in the room.": "Controles remotos IR programáveis podem controlar vários dispositivos de um único local. Por exemplo, ligar o ar condicionado em um horário programado ou manter uma temperatura definida no ambiente.",
  "Curtains can be tied to your alarm clock to make waking up a more pleasant experience.": "As cortinas podem ser vinculadas ao seu despertador para tornar a experiência de acordar mais agradável.",
  "A smart boiler button will allow you to set the schedule once and no longer think about hot water in the winter.": "Um botão inteligente para o aquecedor permitirá que você defina o cronograma uma vez e não precise mais se preocupar com água quente no inverno.",
  "Various sensors will give you complete information about the place where you live. Are all your doors and windows closed, what is the temperature and humidity in the nursery, how much electricity do you consume and for what, is there a water leak somewhere.": "Vários sensores fornecerão informações completas sobre o local onde você mora. Todas as suas portas e janelas estão fechadas, qual é a temperatura e umidade no quarto das crianças, quanto de eletricidade você consome e para quê, há algum vazamento de água em algum lugar.",
  "For greater comfort for residents, Pinout engineers will create seamless Internet within the apartment so that you have no dead zones.": "Para maior conforto dos moradores, os engenheiros da Pinout criarão uma Internet perfeita dentro do apartamento para que você não tenha áreas sem sinal.",
  "Common Area": "Área Comum",
  "The building would not be called smart if the matter was limited only to automation inside the apartment. In a common area, smart relays will monitor the time of sunrise and sunset in order to turn on street lighting when it is really needed, without wasting resources. Lights in the lobby and staircases will turn on only when movement is detected.": "O edifício não seria chamado de inteligente se a questão se limitasse apenas à automação dentro do apartamento. Em uma área comum, relés inteligentes monitorarão o horário do nascer e do pôr do sol para ligar a iluminação externa apenas quando realmente necessário, sem desperdiçar recursos. As luzes no saguão e nas escadas só acenderão quando houver movimento.",
  "Regarding security, residents will have access to the intercom system from a single home control panel. We will also install CCTV cameras for security.": "Em relação à segurança, os moradores terão acesso ao sistema de intercomunicação a partir de um único painel de controle residencial. Também instalaremos câmeras de segurança.",
  "Conclusion": "Conclusão",
  "Do you have the feeling that all this has already happened somewhere? Smart houses and apartments have been built for decades. So what new are Pinout engineers doing?": "Você tem a sensação de que tudo isso já aconteceu em algum lugar? Casas e apartamentos inteligentes têm sido construídos há décadas. Então, o que os engenheiros da Pinout estão fazendo de novo?",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant. This software allows you to combine all devices into a single system, and all data will remain inside your apartment.": "O seu apartamento é o lugar mais íntimo. É improvável que você se sinta confortável sabendo que todos os seus dados acabam em um servidor em algum lugar fora de sua casa. Neste projeto, cada apartamento está equipado com um servidor doméstico com o Home Assistant. Este software permite combinar todos os dispositivos em um único sistema, e todos os dados permanecerão dentro do seu apartamento.",
  "This way we get rid of delays in transmitting commands over the global Internet. If I’m at home and press “turn off the lights,” there’s no point in sending a signal somewhere and waiting for a response.": "Dessa forma, nos livramos dos atrasos na transmissão de comandos pela Internet global. Se estou em casa e pressiono \"desligar as luzes\", não faz sentido enviar um sinal para algum lugar e esperar por uma resposta.",
  "Moreover, Home Assistant itself will understand that a new smart device has appeared, for example, a TV or a robot vacuum cleaner, and will offer to add it. You yourself can expand the smart home system and customize automation to suit your habits.": "Além disso, o Home Assistant em si entenderá que um novo dispositivo inteligente apareceu, por exemplo, uma TV ou um aspirador de pó robô, e oferecerá para adicioná-lo. Você mesmo pode expandir o sistema residencial inteligente e personalizar a automação de acordo com seus hábitos.",
  "Residence 28 is not just a new residential complex with automation. This is a smart home that easily adapts to your life.": "O Residence 28 não é apenas um novo complexo residencial com automação. Esta é uma casa inteligente que se adapta facilmente à sua vida."
}