{
  "Apartment building with Home Assistant onboard": "Квартирный дом с Home Assistant на борту",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant.": "Ваша квартира - самое интимное место. Маловероятно, что вам будет комфортно знать, что все ваши данные попадают на сервер где-то за пределами вашего дома. В этом проекте каждая квартира оснащена домашним сервером с Home Assistant.",
  "Hello everyone!": "Всем привет!",
  "My name is Vadim Manaenko. I am a co-founder of Pinout LTD and one of the key developers in the [Robonomics Network](https://robonomics.network/) project. Today I want to share with you big news: Pinout LTD has signed a contract with the developer [CCS](https://www.stylianidesgroup.com/) for the automation of 28 apartments and common area in the [Residence 28](https://www.stylianidesgroup.com/property/residence-28) building. Work will begin in 2024.": "Меня зовут Вадим Манаенко. Я сооснователь компании Pinout LTD и один из ключевых разработчиков проекта [Robonomics Network](https://robonomics.network/). Сегодня я хочу поделиться с вами большой новостью: Pinout LTD заключила контракт с разработчиком [CCS](https://www.stylianidesgroup.com/) на автоматизацию 28 квартир и общей зоны в здании [Residence 28](https://www.stylianidesgroup.com/property/residence-28). Работы начнутся в 2024 году.",
  "About the Project": "О проекте",
  "The developer CCS has been operating on the market since 1997 and has built more than 600 properties. The Residence 28 project is located in Limassol, Cyprus. The building will consist of two blocks with a total living area (covered part) of about 1800 m2. This will be the first apartment building in Cyprus with a smart home system built on Zigbee wireless devices controlled by the open source [Home Assistant](https://www.home-assistant.io/) software, remote access will be provided via the Robonomics Parachain Web3 cloud.": "Разработчик CCS работает на рынке с 1997 года и построил более 600 объектов. Проект Residence 28 расположен в Лимассоле, Кипр. Здание будет состоять из двух блоков с общей жилой площадью (крытая часть) около 1800 м2. Это будет первый квартирный дом на Кипре с умной системой дома, построенной на беспроводных устройствах Zigbee, управляемых программным обеспечением с открытым исходным кодом [Home Assistant](https://www.home-assistant.io/), удаленный доступ будет предоставлен через облачную платформу Robonomics Parachain Web3.",
  "What Will Future Residents Receive?": "Что получат будущие жители?",
  "Below is a floor plan of one of the two blocks and a designation legend.": "Ниже представлена план этажа одного из двух блоков и легенда обозначений.",
  "Don't be confused by the word \"Wired\". This means that the device requires constant power, while the devices in the “Wireless” column are battery operated.": "Не путайтесь словом \"Проводной\". Это означает, что устройство требует постоянного питания, в то время как устройства в столбце \"Беспроводной\" работают от батареи.",
  "What new will the installation of all these devices bring to apartments?": "Что нового принесет установка всех этих устройств в квартиры?",
  "Smart switches will allow residents to control lighting both in the usual way and through a smartphone application, set up schedules and scenarios. For example, while in the bedroom, you can turn off the lights in the entire apartment or create the atmosphere for the evening with a defined scene.": "Умные выключатели позволят жителям управлять освещением как обычным способом, так и через приложение на смартфоне, настраивать расписания и сценарии. Например, находясь в спальне, вы можете выключить свет во всей квартире или создать атмосферу для вечера с определенной сценой.",
  "Programmable IR remote controls can handle multiple devices from one location. For example, turning on the air conditioner on a schedule or to maintain a set temperature in the room.": "Программируемые ИК-пульты позволяют управлять несколькими устройствами из одного места. Например, включение кондиционера по расписанию или поддержание заданной температуры в комнате.",
  "Curtains can be tied to your alarm clock to make waking up a more pleasant experience.": "Шторы могут быть связаны с будильником, чтобы пробуждение было более приятным.",
  "A smart boiler button will allow you to set the schedule once and no longer think about hot water in the winter.": "Умная кнопка для бойлера позволит вам один раз настроить расписание и больше не думать о горячей воде зимой.",
  "Various sensors will give you complete information about the place where you live. Are all your doors and windows closed, what is the temperature and humidity in the nursery, how much electricity do you consume and for what, is there a water leak somewhere.": "Различные датчики предоставят вам полную информацию о месте, где вы живете. Все ли ваши двери и окна закрыты, какая температура и влажность в детской, сколько электричества вы потребляете и на что, есть ли где-то утечка воды.",
  "For greater comfort for residents, Pinout engineers will create seamless Internet within the apartment so that you have no dead zones.": "Для большего комфорта жителей инженеры Pinout создадут бесшовный интернет внутри квартиры, чтобы у вас не было мертвых зон.",
  "Common Area": "Общая зона",
  "The building would not be called smart if the matter was limited only to automation inside the apartment. In a common area, smart relays will monitor the time of sunrise and sunset in order to turn on street lighting when it is really needed, without wasting resources. Lights in the lobby and staircases will turn on only when movement is detected.": "Здание не могло бы называться умным, если бы дело ограничивалось только автоматизацией внутри квартиры. В общей зоне умные реле будут контролировать время восхода и заката солнца, чтобы включать уличное освещение только тогда, когда это действительно необходимо, без излишних затрат ресурсов. Освещение в холле и лестничных клетках будет включаться только при обнаружении движения.",
  "Regarding security, residents will have access to the intercom system from a single home control panel. We will also install CCTV cameras for security.": "Что касается безопасности, жители будут иметь доступ к домофонной системе с единой панели управления. Мы также установим систему видеонаблюдения для обеспечения безопасности.",
  "Conclusion": "Заключение",
  "Do you have the feeling that all this has already happened somewhere? Smart houses and apartments have been built for decades. So what new are Pinout engineers doing?": "У вас есть ощущение, что все это уже где-то происходило? Умные дома и квартиры строятся уже десятилетиями. Так что нового делают инженеры Pinout?",
  "Your apartment is the most intimate place. It’s unlikely that you would be comfortable knowing that all your data ends up on a server somewhere outside your home. In this project, each apartment is equipped with a home server with Home Assistant. This software allows you to combine all devices into a single system, and all data will remain inside your apartment.": "Ваша квартира - самое интимное место. Маловероятно, что вам будет комфортно знать, что все ваши данные попадают на сервер где-то за пределами вашего дома. В этом проекте каждая квартира оснащена домашним сервером с Home Assistant. Это программное обеспечение позволяет объединить все устройства в единую систему, и все данные останутся внутри вашей квартиры.",
  "This way we get rid of delays in transmitting commands over the global Internet. If I’m at home and press “turn off the lights,” there’s no point in sending a signal somewhere and waiting for a response.": "Таким образом, мы избавляемся от задержек при передаче команд через глобальный Интернет. Если я нахожусь дома и нажимаю \"выключить свет\", нет смысла отправлять сигнал куда-то и ждать ответа.",
  "Moreover, Home Assistant itself will understand that a new smart device has appeared, for example, a TV or a robot vacuum cleaner, and will offer to add it. You yourself can expand the smart home system and customize automation to suit your habits.": "Более того, сам Home Assistant поймет, что появилось новое умное устройство, например, телевизор или робот-пылесос, и предложит добавить его. Вы сами можете расширять систему умного дома и настраивать автоматизацию под свои привычки.",
  "Residence 28 is not just a new residential complex with automation. This is a smart home that easily adapts to your life.": "Residence 28 - это не просто новый жилой комплекс с автоматизацией. Это умный дом, который легко адаптируется к вашей жизни."
}