{
  "Hacked Johnny's Lab": "Взломаный Лаборатория Джонни",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Привет! На связи PaTara. Недавно прошло событие «Взлом Лаборатории Джонни» от Robonomics, и я действительно считаю, что смог взломать ее! За исключением очень первой попытки, которую я проиграл из-за недопонимания правил, я выиграл каждый раунд, в котором принимал участие, и вот небольшая история «как это было».",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Недавно прошло событие «Взлом Лаборатории Джонни» от Robonomics, и я действительно считаю, что смог взломать ее! За исключением очень первой попытки, которую я проиграл из-за недопонимания правил, я выиграл каждый раунд, в котором принимал участие, и вот небольшая история «как это было».",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "Я довольно хорошо разбираюсь в программировании, у меня есть хороший ноутбук и почти нет навыков распознавания изображений. Более тго,",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "Я решил играть честно, что означает отсутствие загрузки видео, злоупотребления скоростью воспроизведения, навигации по плейбару.",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "Так что выбранная стратегия была хорошо знакомым методом брутфорса. Звучит больше как взлом, чем что-то еще.",
  "(479’001’600 to be precise). Quite an amount to process!": "(479’001’600, чтобы быть точным). Довольно большое количество для обработки!",
  "## Strategy 1: dumb and straightforward.": "## Стратегия 1: глупая и прямолинейная.",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "мои 64 ГБ ОЗУ! Я получил ошибку SIGTERM в консоли IDE.",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "Просто оценочный запуск. Но дело в том, что мой ноутбук даже не включил максимальную скорость вентиляторов! Был загружен только один ядро.",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "Я нашел в Интернете пакет Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html), чтобы загрузить все",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "логические ядра моего процессора (20 из них) для параллельных вычислений. В противном случае это было б вечное путешествие.",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "Но для этого мне пришлось разделить свой итератор на 12 частей. Пакеты multiprocessing itertools действительно работают вместе,",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "но когда вся группа вариантов находится в ОЗУ. Это не было моим случаем, поэтому было выполнено следующее:",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "С того момента и далее я использовал бы эту стратегию, чтобы мой монитор загрузки ЦП выглядел так:",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "Я считаю, что это сократило время выполнения до примерно 5 секунд. Я нашел лучший способ перебора",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "комбинаций, но их было просто слишком много! Первым шагом было выполнение примерно 480 миллионов",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "экструзий в сети. Узел просто забанил бы меня за DDOS, и даже без этого это заняло бы вечность!",
  "Just for a debugging reason I started the script (for node communication I used a": "Просто из-за отладочной цели я запустил скрипт (для связи с узлом использовал",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "пакет [py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) и заметил, что перед вызовом",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "выполнения у меня возникали ошибки, такие как _недопустимая мнемоническая фраза_. Подсказка! Если бы я мог проверить комбинацию на предмет",
  "I would save tons of time! GitHub parsing led me to": "валидации на месте, я бы сэкономил кучу времени! Парсинг GitHub привел меня к",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "[этой](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "строке кода, и я добавил проверку комбинации в свой скрипт. Это сократило количество потенциальных экструзий до примерно 39’000’000 в 12 раз быстрее!",
  "to roughly 39’000’000 12 times faster!": "Но все равно, 39 миллионов вызовов забанили бы меня навсегда, поэтому мне нужно было еще больше копаться. Как я мог существенно сократить",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "количество вычислений? Ну, немного предав свою первоначальную стратегию. Понимаете, я собирался избегать просмотра видео,",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "«хакер, который даже не будет нуждаться в видео», но математика заставила меня передумать. Перейти к стратегии в 132 раза быстрее.",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "Ниже объяснение:",
  "Below is the explanation:": "Теперь мне нужно было знать только два правильных положения слов в фразе (одно заняло бы слишком много времени, проверено экспериментом).",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "Я перебирал 10! комбинаций, вставлял два слова в правильные позиции и проверял фразу,",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "сокращая количество вариантов до примерно 300’000, довольно значительное уменьшение! Более того, набор 10! комбинаций поместился в мою ОЗУ, отлично!",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "свой собственный локальный узел Robonomics, синхронизированный с цепочкой, и спросить его о балансе счета!",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "Запрос намного «проще», чем экструзия. После целой ночи синхронизации (я установил предел кэша, чтобы мой",
  "(even within a localhost) took too much time. I didn’t even wait till the end, it was obviously way slower than": "просмотр целого видео. Если бы я только мог знать точный адрес счета! Но для этого мне нужна мнемоническая фраза… **Или действительно нужна?**",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "Посмотрите. Правила гласят, что желаемый аккаунт имеет **ровно** 42 XRT. Почему бы мне не получить все активные адреса в сети,",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "отфильтровать их, имея ровно 42 XRT и сравнить каждый сгенерированный адрес с возможными целями",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(около 20, уменьшаясь до 1 в конце). Легко сказать и сделать.",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "Теперь, после еще одной модификации моего скрипта, я наконец-то сделал только один запрос и одну транзакцию, которые, безусловно,",
  "give me the desired prize.": "дали бы мне желаемый приз.",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "Теперь, после того, как я посмотрел 25 секунд видео (при этом заполняя слова мнемоники),",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "мне было бы нужно всего 30 секунд максимум, чтобы украсть награду. Взломал это.",
  "What do we have here: a set of 12 words in a mixed order. This gives us 12! (factorial) options of phrases": "Что у нас здесь: набор из 12 слов в перемешанном порядке. Это дает нам 12! (факториал) вариантов фраз",
  "Well, what else do I need, just go and sort through! But here is the first trick: 12! mnemonic phrases just didn’t fit in": "Ну что еще мне нужно, просто иди и разберись! Но вот первый трюк: 12! мнемонических фраз просто не помещаются",
  "Also, rather than trying to transfer all the tokens each 300k times and calling a public node for that I decided to set": "Также, вместо того, чтобы пытаться передавать все токены каждые 300к раз и вызывать общедоступный узел для этого, я решил установить",
  "Query is way “easier” than an extrinsic. After a whole night of synchronizing (I’ve set a cache limit so that my)": "Запрос намного «проще», чем экстрансик. После целой ночи синхронизации (я установил предел кэша, чтобы мой",
  "(laptop won’t blow up with chain data in its ROM) I gave it a try and.. this was a disaster. Network transactions": "ноутбук не взорвался от данных цепи в его ПЗУ) я попробовал и.. это была катастрофа. Сетевые транзакции",
  "watching a whole video. If only I could know the exact address of the account! But for that I need a mnemonic phrase… **Or do I really?**": "просмотр видео целиком. Если бы я только мог знать точный адрес счета! Но для этого мне нужна мнемоническая фраза… **Или мне действительно нужно?**"
}