{
  "Hacked Johnny's Lab": "Laboratorio de Johnny hackeado",
  "Hey there! PaTara on the line. There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "¡Hola! PaTara al teléfono. Hubo un evento reciente “Hack Johnny’s Lab” por Robonomics y creo que lo hackeé de alguna manera! Aparte del primer intento que perdí debido a un malentendido de las reglas, gané cada ronda en la que participé y aquí hay una breve historia de “cómo hacerlo”.",
  "There was a recent event “Hack Johnny’s Lab” by Robonomics and I believe I did hack it in a way! Apart from the very first try which I lost due to rules misunderstanding, I won every round I took part in and here is a short “howto” story.": "Hubo un evento reciente “Hack Johnny’s Lab” por Robonomics y creo que lo hackeé de alguna manera! Aparte del primer intento que perdí debido a un malentendido de las reglas, gané cada ronda en la que participé y aquí hay una breve historia de “cómo hacerlo”.",
  "I’m sort of familiar with programming and I have a decent laptop and almost no skill in image recognition. More than that,": "Soy algo familiarizado con la programación y tengo una computadora portátil decente y casi ninguna habilidad en reconocimiento de imágenes. Más que eso,",
  "I decided to play it fairly, which means no video downloading, no playback speed abuse, no playbar navigation.": "Decidí jugar limpio, lo que significa no descargar videos, no abusar de la velocidad de reproducción, no navegar por la barra de reproducción.",
  "So the picked strategy was a good old bruteforce. Sounds more hacking that anything.": "Así que la estrategia elegida fue un buen viejo ataque de fuerza bruta. Suena más a hackeo que a cualquier otra cosa.",
  "(479’001’600 to be precise). Quite an amount to process!": "(479’001’600 para ser precisos). ¡Una cantidad bastante grande para procesar!",
  "## Strategy 1: dumb and straightforward.": "## Estrategia 1: tonta y directa.",
  "my 64 GB RAM! I got a SIGTERM error in the IDE console.": "¡Mis 64 GB de RAM! Recibí un error SIGTERM en la consola del IDE.",
  "Just an evaluative run. But the thing is: my laptop didn’t even spin its fans at max! A single core was loaded.": "Solo una ejecución de evaluación. ¡Pero la cosa es que mi computadora portátil ni siquiera hizo girar sus ventiladores al máximo! Un solo núcleo estaba cargado.",
  "I googled a Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) package to load all": "Busqué un paquete de Python [multiprocessing](https://docs.python.org/3/library/multiprocessing.html) para cargar todos",
  "the logical cores of my CPU (20 of them) to parallel the computations. Otherwise, it would have been an eternal journey.": "los núcleos lógicos de mi CPU (20 de ellos) para paralelizar los cálculos. De lo contrario, habría sido un viaje eterno.",
  "But with that I had to split my iterator in 12 parts. The itertools multiprocessing packages do work together,": "Pero con eso tuve que dividir mi iterador en 12 partes. Los paquetes de multiprocessing de itertools funcionan juntos,",
  "but when a whole set of options is in the RAM. That was not my case, so the following was performed:": "pero cuando un conjunto completo de opciones está en la RAM. Ese no era mi caso, así que se realizó lo siguiente:",
  "From that moment and ever I would use this strategy to make my CPU load monitor look like this:": "A partir de ese momento y siempre usaría esta estrategia para que mi monitor de carga de la CPU se viera así:",
  "I believe this shortened the execution time down to around 5 seconds. I got the best way to iterate through": "Creo que esto acortó el tiempo de ejecución a alrededor de 5 segundos. Encontré la mejor manera de iterar a través",
  "the combinations but there were just too many of them! The first step involved performing roughly 480 millions": "de las combinaciones ¡pero había demasiadas! El primer paso implicaba realizar aproximadamente 480 millones",
  "extrinsics in the network. The node would simply ban me for DDOS and even without that It would take forever!": "extrínsecos en la red. ¡El nodo simplemente me prohibiría por DDOS e incluso sin eso tomaría una eternidad!",
  "Just for a debugging reason I started the script (for node communication I used a": "Solo por una razón de depuración, comencé el script (para la comunicación del nodo usé un",
  "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) package) and noticed that prior to call": "[py-substrate-interface](https://pypi.org/project/substrate-interface/1.0.3/) paquete) y noté que antes de llamar",
  "performing I got errors like _invalid mnemonic phrase_. A clue! If I could validate the combination on prem,": "realizando obtuve errores como _frase mnemotécnica inválida_. ¡Una pista! Si pudiera validar la combinación en prem,",
  "I would save tons of time! GitHub parsing led me to": "¡ahorraría toneladas de tiempo! El análisis de GitHub me llevó a",
  "[this](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)": "[esto](https://github.com/polkascan/py-substrate-interface/blob/master/substrateinterface/keypair.py#L170)",
  "line of code and I added a combination validation to my script. This has reduced the number of potential extrinsics down": "línea de código y agregué una validación de combinación a mi script. ¡Esto redujo el número de extrínsecos potenciales a aproximadamente 39’000’000 12 veces más rápido!",
  "to roughly 39’000’000 12 times faster!": "Pero aún así, 39 millones de llamadas me prohibirían para siempre, así que necesitaba investigar más. ¿Cómo podría reducir significativamente el",
  "But still, 39 million calls would ban me forever, so I needed more digging. How could I significantly cut the": "número de cálculos? Bueno, traicionando un poco mi estrategia inicial. Verás, iba a evitar ver videos,",
  "number of calculations? Well, by a little bit betraying my initial strategy. See, I was going to avoid video watching,": "“un hacker, que ni siquiera necesitará un video”, pero las matemáticas me hicieron cambiar de opinión. Cambiarlo a una estrategia 132 veces más rápida.",
  "“a hacker, who won’t even need a video”, but the math made me change my mind. Change it to a 132 times faster strategy.": "A continuación se explica:",
  "Below is the explanation:": "Con eso solo necesitaba saber dos posiciones correctas de palabras en una frase (una tomaría demasiado tiempo, validada experimentalmente).",
  "With that I only needed to know two correct positions of words in a phrase (one would take too long, experiment-validated).": "Iteraría a través de 10! combinaciones, insertaría dos palabras en posiciones correctas y validar la frase,",
  "I would iterate through a 10! combinations, insert two words in correct positions and validate the phrase,": "recortando las opciones a aproximadamente 300’000 ¡una disminución considerable! ¡Más que eso, el conjunto de combinaciones 10! encajaba en mi RAM, excelente!",
  "cutting down the options to approximately 300’000 quite a decrease! More that, 10! combinations set fitted in my RAM, excellent!": "mi propio nodo Robonomics local sincronizado con la cadena y preguntarle por el saldo de una cuenta resultante!",
  "up my own local Robonomics node synchronized with the chain and ask it for a resulting account address balance!": "La consulta es mucho “más fácil” que un extrínseco. Después de toda una noche de sincronización (establecí un límite de caché para que mi",
  "(even within a localhost) took too much time. I didn’t even wait till the end, it was obviously way slower than": "ver un video completo. ¡Si tan solo pudiera saber la dirección exacta de la cuenta! Pero para eso necesito una frase mnemotécnica… **¿O realmente la necesito?**",
  "Look. The rules say that the desired account has **exactly** 42 XRT. Why wouldn’t I get all the active addresses in the network,": "Mira. Las reglas dicen que la cuenta deseada tiene **exactamente** 42 XRT. ¿Por qué no obtendría todas las direcciones activas en la red,",
  "filter them by having exactly 42 XRT and compare each generated address with a list of possible targets": "filtrarlas teniendo exactamente 42 XRT y comparar cada dirección generada con una lista de posibles objetivos",
  "(around 20, decreasing to 1 in the end). Easy to say and to do.": "(alrededor de 20, disminuyendo a 1 al final). Fácil de decir y de hacer.",
  "Now, after modifying my script once more I finally made it to only one query and one transaction which would for sure": "Ahora, después de modificar mi script una vez más finalmente lo logré con solo una consulta y una transacción que seguramente",
  "give me the desired prize.": "me daría el premio deseado.",
  "Now, after I watched 25 seconds of the video (meanwhile filling in the words of a mnemonic),": "Ahora, después de ver 25 segundos del video (mientras llenaba las palabras de un mnemónico),",
  "I would only need 30 seconds at max to steal the reward. Hacked it.": "solo necesitaría 30 segundos como máximo para robar la recompensa. Hackeado."
}