{
  "What is Robonomics network?": "ما هي شبكة Robonomics؟",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics هي منصة مفتوحة المصدر لتطبيقات الإنترنت الأشياء التي تمكن تبادل المعلومات التقنية والاقتصادية في شكل معاملات ذرية بين تطبيقات المستخدم وخدمات الإنترنت الشياء والروبوتات المعقدة.",
  "Get started": "ابدأ",
  "Explore Robonomics": "استكشف Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics هي تكنولوجيا مفتوحة المصدر لسوق الإنترنت الأشياء المتاحة للجميع. اقرأ الملخص التنفيذي لمعرفة المزيد",
  "Get XRT": "احصل على XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT هو رمز الأداة التي تجعل من الممكن التحكم في أجهزة الإنترنت الأشياء على أعلى شبكة Ethereum و Robonomics parachain",
  "Use a Dapp": "استخدم Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "شاهد النسخة التجريبية من التطبيق المركزي لإدارة أجهزة الإنترنت الأشياء",
  "Start building": "ابدأ البناء",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "تعلم Robonomics من خلال البرامج التعليمية والتجارب العملية المفيدة في Robonomics WIKI",
  "Robonomics objectives": "أهداف Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "بناءً على إنجازات منصات السحابة ، تهدف Robonomics إلى تقديم حلول إنترنت أكثر أمانًا ومتقدمة لسوق الإنترنت الأشياء في كل مرحلة من مراحل التواصل بين الإنسان والآلة. هناك المهام الرئيسية التي يتم تطوير Robonomics من أجلها",
  "IoT device management with a decentralized cloud": "إدارة أجهزة الإنترنت الأشياء مع سحابة مركزية",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "تحتوي شبكات البلوكشين على جميع المعلمات لضمان أعلى مستوى من الأمان لإطلاق الجهاز واستلام البيانات القياسية. يمكن فعليًا وصف التفاعل مع الجهاز عن طريق تغيير حالة التوأم الرقمي المخزن في شبكة البلوكشين وتقديم معلومات حول هذه التغييرات إلى الجهاز الفعلي. في حالة استخدام بلوكشين غير المرخصة ، يمكننا التأكد من توفر مقدمي الخدمة على المستوى العالمي ، وكذلك مستوى عال من حماية البيانات للتوأم الرقمي من التغييرات غير المرغوب فيها.",
  "Techno-economic transactions between humans and machines": "المعاملات التكنو-اقتصادية بين البشر والآلات",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "يمكننا التحدث عن الإنجازات المؤسسية من حيث وصول الأنظمة الآلية مباشرة إلى الأسواق الرقمية من خلال العملات المشفرة والعقود الذكية. على سبيل المثال ، ينفذ Ethereum بالفعل معظم الأدوات الأساسية للنشاط الاقتصادي. ستكون التطبيقات التي تم إنشاؤها اليوم لربط المستخدم النهائي وأجهزة الإنترنت الأشيء أكثر كفاءة إذا كانت عملية الدفع وشروط الخدمة لا يمكن فصلها عن معلمات إطلاق الجهاز.",
  "Serverless IoT applications for users": "تطبيقات إنترنت الأشياء بدون خادم للمستخدمين",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "يجب ألا يتعثر سؤال خصوصية مستخدمي التطبيقات الحديثة في عجز الشركات عن استخدام التقدمات الحديثة في مجال الويب3. ليس هناك حاجة للمصادقة أو الاتصال بخوادم محددة للوصول إلى البيانات القياسية والتحكم في الجهاز.",
  "Learn with Robonomics": "تعلم مع Robonomics",
  "Introduction course": "دورة مقدمة",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "تعرف على المشاكل التي تنشأ حول بناء تطبيقات إنترنت الأشياء الحديثة والحلول الممكنة باستخدام تقنيات الويب3 وأدوات Robonomics لمطوري ومستخدمي إنترنت الأشياء.",
  "Boston dynamics spot software developing": "تطوير برامج برمجة Boston Dynamics Spot",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "نحن متحمسون لتقديم برنامج التعليم SDK Spot! هدفنا هو أن نجعلك على دراية بـ SDK Spot ونسمح لك باختبار مهاراتك عن بُعد باستخدام روبوت Boston Dynamics Spot في مختبرنا.",
  "Sovereign smart home with robonomics and home assistant": "المنزل الذكي السيادي مع Robonomics ومساعد النزل",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "في هذه الدورة ، ستقوم بمراجعة جميع الخطوات المطلوبة لبناء منزل ذكي سيادي خاص بك ، والميزة الرئيسية له هي سلامة / خصوصية بيانات المستخدم.",
  "Shop": "متجر",
  "Science papers": "أوراق علمية",
  "Books": "كتب",
  "Logo and assets": "شعار وأصول",
  "Wallpapers": "خلفيات",
  "Blog": "مدونة",
  "Cases": "حالات",
  "Ambassador program": "برنامج السفير",
  "Contacts": "جهات الاتصال",
  "Robonomics is 100% open-source.": "روبونوميكس هو مفتوح المصدر بنسبة 100٪.",
  "Anyone can contribute to": "أي شخص يمكنه المساهمة في",
  "the code base": "قاعدة الشفرة",
  "or": "أو",
  "build services with Robonomics": "بناء الخدمات باستخدام روبونوميكس",
  "White Paper 2022": "ورقة بيضاء 2022",
  "Timeline": "الجدول الزمني",
  "Tokenomics": "توكينوميكس",
  "Parachain": "باراشين",
  "User (D)App": "تطبيق المستخدم (D)",
  "Function request": "طلب وظيفة",
  "Report": "تقرير",
  "Control": "التحكم",
  "Log": "سجل",
  "IoT Device": "جهاز الإنترنت من الأشياء",
  "Decentralized application": "تطبيق لامركزي",
  "Digital twin": "توأم رقمي",
  "IoT / Smart device": "جهاز الإنترنت من الأشياء / الجهاز الذكي",
  "Robonomics tokenomics": "توكينوميكس روبونوميكس",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "هو توكن الخدمة الذي سيتيح التحكم في أجهزة الإنترنت المشتركة على شبكة إيثريوم وشبكة روبونوميكس الفرعية في بيئة بولكادوت.",
  "Token distribution": "توزيع التوكن",
  "The task": "المهمة",
  "Try our Dapp": "جرب تطبيقنا",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "يمكنك تشغيل XRT داخل سلاسل الكتل باستخدام الأدوات المقدمة من قبل فرق مستقلة مختلفة في مجتمعات بولكادوت (كوساما) وإيثريوم.",
  "Within the Kusama network, you have the capability use": "في شبكة كوساما، لديك القدرة على استخدام",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "الاتصال بين شبكة روبونوميكس الفرعية وشبكات فرعية أخرى باستخدام تطبيقات مركزية مختلفة (dApps):",
  "Attention please": "يرجى الانتباه",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "إذا كنت تستخدم خدمة المتعددة السلاسل لعمليات الجسر، يرجى عدم استخدامها في الوقت الحالي، حيث تم",
  "announced": "الإعلان",
  "on the official Twitter of The Multichain.": "عن ذلك على تويتر الرسمي للمتعددة السلاسل.",
  "Be aware of scammers": "كن حذراً من النصابين",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "يرجى استخدام الأسواق المعروفة فقط لتبادل XRT. لا ترسل رموزك إلى حسابات يتم تزويدك بها في رسائل خاصة بغض النظر عن العملية التي ترغب في تنفيذها (شراء أو بيع الرمز). إذا تلقيت أي 'يانات صاخبة' حول توكن روبونوميكس (يستخدم النصابون في كثير من الأحيان إعلانات مثل الإسقاط الجوي)، يرجى التحقق من هذا الموقع (https://robonomics.network/) أو من",
  "for official updates. Be careful, be safe.": "للحصول على التحديثات الرسمية. كن حذراً، كن آمناً.",
  "XRT in Ethereum": "XRT في إيثريوم",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "عند تنفيذ مشروع روبونوميكس في الفترة من 2015 إلى 2018، كان على فريق المشروع أن يجد اتصالًا بين توفير وظيفة مفيدة من قبل شبكة روبونوميكس، وهي إطلاق أجهزة الإنترنت المشتركة وفقًا لنموذج الروبوت كخدمة، وتعويض مقدمي روبونوميكس عن رسوم الغاز في إيثريوم. كان علينا أن نفكر في دورة حياة مسؤولية كل جهاز ذكي فردي لأداء خدمة. نتيجة للبحث والتطوير المبكر في روبونوميكس، وجد الفريق آلية لتعدين توكنات جديدة لمكافأة كل عقد ذكي لروبوت كخدمة تم إنشاؤه. هذا النموذج لا يزال قابلاً للتطبيق في مستقبل روبونوميكس على إيثريوم، ولكن فقط مع تحسينات كبيرة في إيثروم.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "اقرأ هذا لمعرفة الخلفية التاريخية والخطط الطويلة الأجل للفريق لـ XRT في بيئة إيثريوم.",
  "Etherscan profile": "ملف Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "عرض عقد توكن وعمليات التداول في شبكة إيثريوم هنا.",
  "Coingecko markets": "أسواق Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "هنا يمكنك العثور على أسواق CEX و DEX لتداول XRT.",
  "XRT In Polkadot": "XRT في بولكادوت",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "عند الانتقال من إيثريوم إلى بولكادوت، نحتاج إلى عملية 'توسيع' في توكينوميكس. الفرعيات في بيئة بولكادوت ليست مكافئة لعقد ذكي، بل هي سلسلة كتل قابلة للبرمجة بالكامل تستأجر جزءًا من الشبكة العامة.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "الدفع الفعلي من جانب فرعيات بولكادوت وكوساما هو ربط طويل الأجل لرموز سلسلة الإرسال الأصلية (DOT / KSM) بكمية كافية للفوز في إحدى المزادات. يدعم XRT في شبكة روبونوميكس تجديد الفتحة ومكافآت لأصحاب المصلحة. تم تصميم آلية حرق XRT الأساسية التي تدعم تنشيط اشتراكات الإنترنت المشتركة لتقليل التضخم إلى الحد الأدنى، وفي حالة زيادة الاهتما إلى الصفر.",
  "Learn more": "تعلم المزيد",
  "in Twitter thread from our network architect.": "في سلسلة تغريدات تويتر من مهندس الشبكة لدينا.",
  "Usage:": "الاستخدام:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "يمكن استخدام XRT لدفع الرسوم عند تنفيذ المعاملات على الفرعية أو لشراء اشتراك في الإنترنت المشتركة يضمن معالجة الأجهزة الذكية أو معاملات المستخدم على الإنترنت المشتركة بأولوية.",
  "Rewards:": "المكافآت:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "طوال العام، تصدر الفرعية كمية صغيرة من XRT لتحفيز مجمعي الفرعية.",
  "The parameter of the total reward": "يتم تحديد معلمة المكافأة الإجمالية",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "لمجمعي الفرعية للعام من خلال التصويت على السلسلة، ويمكن تغييرها من خلال إجراء استفتاء.",
  "Use XRT": "استخدم XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "اشترك في الإنترنت المشتركة في تطبيقنا المركزي. تحكم في أجهزتك الذكية عبر البلوكشين دون أي شركة مركزية تراقب.",
  "Subscan profile": "ملف Subscan",
  "View token statistics on top of Polkadot ecosystem.": "عرض إحصاءات التوكن على رأس بيئة بولكادوت.",
  "Other questions": "أسئلة أخرى",
  "What is RWS?": "ما هو RWS؟",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[تحت تطوير الوظائف الأساسية] سيحاول فريق المطورين الأساسيين تقديم نماذج استخدم مختلفة لروبونوميكس والخطوة الأولى في هذا الاتجاه هي إطلاق رمز اشتراك مدى الحياة - رمز RWS. سيمنحك كل رمز RWS معاملة واحدة في الثانية (tps) من / إلى جهاز الإنترنت المشترك الخاص بك عبر شبكة روبونوميكس الفرعية. قم بتنشيط رمز RWS الخاص بك وقم بإجراء معاملات 'الغاز المجاني' مع تنفيذ مسبق وتأخير قابل للتنبؤ. قم بإلغاء تنشيط رمز RWS الخاص بك وتداوله على DEX.",
  "What is AIRA/AIR ID?": "ما هو AIRA / AIR ID؟",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "تم توزيع رمز Pre-XRT في عام 2017 كجزء مستقل من بنية روبونوميكس المستقبلية على إيثريوم. بعد إطلاق ناجح لروبونوميكس على إيثريوم في عام 2019، تم ربط رموز AIRA بالبنية التحتية التي تم إنشاؤها للمشروع من خلال",
  "ambix smart contract": "عقد ذكي ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "الذي ضمن عملية تبادل Pre-XRT إلى ERC-20 XRT بشكل مستقل ومستقل.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "هدف رمز روبونوميكس هو ضمان تشغيل شبكة لامركزية لصيانة المدن الذكية وصناعة 4.0 في بنية البلوكشين. من أجل تحقيق هذا الهدف، يحتاج الاقتصاد الرمزي إلى أن يعكس الحوافز لتنفيذ الشبكة.",
  "In addition": "بالإافة إلى ذلك",
  "Within the Ethereum network you can use decentralized application powered by the": "يمكنك استخدام التطبيقات اللامركزية التي تعمل بواسطة شبكة إيثيريوم",
  "Translation was executed by AI so there may be some inaccuracies": "تم تنفيذ الترجمة بواسطة الذكاء الاصطناعي لذا قد تكون هناك بعض الاخطاء",
  "Inform us": "أبلغنا",
  "please": "من فضلك",
  "if you find any": "إذا وجدت أي",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "تعمل التطبيقات اللامركزية (dapp) ضمن تقنية البلوكشين. إنها مفتوحة المصدر وتقدم بياناتها على IPFS و Github. تتيح هذه التقنيات للتطبيق أن يكون آمنًا وشفافًا في نفس الوقت. يعمل مطورونا على تطوير تطبيق Robonomics والمكتبات التي يمكنك استخدامها عند بناء تطبيقك الخاص.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "التوأم الرقمي هو أحد الأدوات التي يوفرها خدمات Robonomics على الويب (RWS). يعمل كنسخة رقمية من المعدات الحقيقية وينسخ جميع الخصائص التقنية لها. يتيح ذلك جعل التطبيق اللامركزي أكثر استجابة لأوامر المستخدم.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "يمكنك استخدام Robonomics مع مجموعة واسعة من أجهزة Zigbee الذكية لتحسين ومراقبة جوانب مختلفة من منزلك / مكتبك أو استخدامها مع الروبوتات القائمة على ROS لمهام صناعية أكثر تعقيدًا.",
  "Do Androids Dream of Electric Sheep?": "هل الروبوتات تحلم بالخرافة الكهربائية؟",
  "Additional icons for the wallpaper:": "أيقونات إضافية للخلفية:",
  "Want emails from robonomics": "هل ترغب في تلقي رسائل بريد إلكتروني من روبونوميكس",
  "Adding you to our special list...": "إضافتك إلى قائمتنا الخاصة...",
  "Nice, you are in the list": "جيد، أنت في القائمة",
  "Something went  wrong. Try again later": "حدث خطأ ما. حاول مرة أخرى لاحقًا",
  "Our library": "مكتبتنا",
  "Free E-Books": "كتب إلكترونية مجانية",
  "Our recommendations": "توصياتنا",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "نوصي بهذه الكتب إذا كنت ترغب في المشاركة والإلهام والتعلم الذاتي في مجال الروبوتات، والتقدم في هذا المجال، وفهم الاقتصاديات الكامنة وراءه. يمكنك تنزيل هذه الكتب أو شرائها من مصادر أخرى.",
  "Community & Contacts": "المجتمع وجهات الاتصال",
  "Get latest updates": "احصل على آخر التحديثات",
  "Your email": "بريدك الإلكتروني",
  "Tell us something if you want": "أخبرنا بشيء إذا كنت ترغب",
  "Submit": "إرسال",
  "Something went  wrong :( Try again later": "حدث خطأ ما :( حاول مرة أخرى لاحقًا",
  "Robonomics nfts": "روبونوميكس NFTs",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "هنا، قمنا بتجميع مجموعة من NFTs التي تم إصدارها خلال رحلتنا الطويلة في عالم العملات المشفرة، سواء بشكل مستقل أو مع فرق رائعة. توفر هذه الرموز الفريدة ملكية قابلة للتحقق على سلسلة الكتل وتعد زينة رائعة لحسابك على سلسلة الكتل. يمكنك المزايدة على بعضها في المزاد أو حتى إصدار قطعة فريدة خاصة بك.",
  "Robonomics Pioneer": "روبونوميكس Pioneer",
  "1. Robonomics Pioneer": "1. روبونوميكس Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "خلال حملتنا الأولية لجمع التبرعات على منصة كوساما، قررنا مكافأة المساهمين الذين ساهموا في مشروعنا العملات المشفرة بأكثر من مجرد الرموز - قمنا أيضًا بإهدائهم NFT ملونة رائعة. تحمل هذه البطاقة معنى كبير بالنسبة لنا، وإذا كانت بحوزة شخص ما، فإننا نعلم أنه مؤيد رائع لقيم روبونوميكس: الحرية واللامركزية.",
  "Robonomics crypto girls": "روبونوميكس crypto girls",
  "2. Robonomics crypto girls": "2. روبونوميكس crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "يسعدنا أن نقدم لكم سلسلة خاصة من الأصول الرقمية - روبونوميكس Crypto Girls، التي تم إنشاؤها بواسطة فريق روبونوميكس للفنون والعلوم. كل NFT في هذه المجموعة هو تمثيل رسومي فريد للتكنولوجيا المستخدمة في روبونوميكس أو المبنية على أعلى استخدامات روبونوميكس. قام فنانونا الموهوبون برسم كل فتاة بأسلوب روبونوميكس المميز. يمكنك اختيار تلك التي تتناسب معك أو جمع المجموعة بأكملها! من خلال شراء هذه الرموز الرقمية، فإنك لا تضيف فقط إضافة أنيقة لمجموعتك، بل تدعمنا أيضًا في الاستمرار في الابتكار وتنفيذ الاتصال غير المركزي للروبوتات. ترقبوا الإضافات الجديدة للمجموعة!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. مجموعات NFT الموسمية",
  "On demand minting": "إصدار حسب الطلب",
  "SEASONAL SPOT NFT COLLECTIONS": "مجموعات NFT الموسمية",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "تمثل هذه المجموعات الموسمية من الرموز الرقمية أصولًا رقمية فريدة تلتقط التفاعل الفريد بين المستخدم والروبوت داخل سلسلة كتل روبونوميكس. يمكن للمستخدمين رسم أي شيء على المتصفح، وسيقوم الروبوت بتكرار حركاتهم لإنشاء صورة مرسومة باليد. بمجرد اكتمال التفاعل، يتم إصدار الرمز الرقمي على منصة سينغولار لحساب بولكادوت الخاص بالمستخدم. الآن، يمكن لأي شخص التفاعل مع روبوت حقيقي يقع في مختبر في كاليفورنيا لإنشاء أصول رقمية شخصية وفريدة يمكن امتلاكها وشراؤها وبيعها مثل أي أصل رقمي آخر.",
  "Create your NFT": "أنشئ رمزك الرقمي",
  "4. automated telescope collection": "4. مجموعة التلسكوب الآلي",
  "automated telescope collection": "مجموعة التلسكوب الآلي",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "يمكن الوصل إلى تلسكوب فعلي في صحراء أتاكاما في تشيلي من خلال تطبيق لامركزي لالتقاط صور فورية للكائنات الفلكية في الفضاء العميق. يمكن لأي مستخدم يمتلك اتصالًا بالإنترنت الوصول إليه باستخدام رموز $STRGZN، والتي يمكن شراؤها في التطبيق باستخدام بطاقة ائتمان. حدد كائنًا فلكيًا، وأرسل أمرًا إلى التلسكوب لالتقاط صورة، وانتظر إصدار الرمز الرقمي على منصة سينغولار. يرجى ملاحظة أن التطبيق متاح فقط للاستخدام من الساعة 11 مساءً حتى 6 صباحًا بتوقيت غرينتش-3 بسبب ساعات تشغيل التلسكوب.",
  "Try yourself": "جرب بنفسك",
  "5. Robonomics Polka pet": "5. روبونوميكس بولكا بيت",
  "In collaboration with Polkapets": "بالتعاون مع بولكابيتس",
  "and": "و",
  "Robonomics Polka pet": "روبونوميكس بولكا بيت",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "كعضو فخور في نظام بولكادوت البيئي، شاركت روبونوميكس في عالم بولكابيتس. بالتعاون مع فريق بولكابيتس، قمنا بإصدار 1200 رمز رقمي يتميز بمفهوم تصميم فريد يعكس فكرتنا الأساسية للاتصال. لتحقيق هذه الكرة، قمنا بإنشاء شخصية: أندرويد متخصص في مساعدة البشر على التواصل مع أي كيان روبوتي.",
  "6. Mecha Arm Jetpack": "6. حزمة الجت باك Mecha Arm",
  "Mecha Arm Jetpack": "حزمة الجت باك Mecha Arm",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "في عام 2021، بدأت روبونوميكس التزامًا بدعم إضافة لوحات RMRK إلى برنامج التشغيل الخاص بها، مما سيؤدي إلى التكامل الأصلي مع أكثر منطق NFT متقدم في العالم. للاحتفال بهذا الإنجاز الملحوظ، قمنا بإطلاق عنصر خاص متوافق مع كاناريا - NFT للأطفال يمكن تجهيزه على طائر كاناريا الخاص بك، وقد يوفر مزايا في عالم RMRK.",
  "RMRK Partnerships": "شراكات RMRK",
  "Robonomics wallpapers": "خلفيات روبونوميكس",
  "Regular wallpapers": "خلفيات عادية",
  "Wallpapers for phones": "خلفيات للهواتف",
  "Hidden wallpapers": "خلفيات مخفية",
  "Robonomics art shop": "متجر Robonomics للفنون",
  "Welcome to our brand new online shop on": "مرحبًا بكم في متجرنا الجديد على الإنترنت في ",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": " يتميز متجرنا بالملابس والإكسسوارات وديكور المنزل وغيرها من العناصر التي تعرض حبنا للروبوتات والتكنولوجيا والفن. يمكنك العثور على القمصان والأكمام الطويلة والقلنسوة وستائر الاستحمام والوسائد والبطانيات وغيرها من المنتجات المفيدة مع تصميماتنا الفريدة التي صنعها فنانو Robonomics والإنتاج والشحن المعالج من قبل الزملاء من Threadless. استمتع!",
  "Shop now on threadless": "تسوّق الآن علىTHREADLESS",
  "alternative shop": " متجر بديل",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "بدأ العام بإنجاز كبير - فازت Robonomics بالمزاد العشرين من Parachain ",
  "officially became": "وأصبحت رسميًا ",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "Parachain بهوية 2048 على شبكة Kusama Network. الإطلاق ، سجل البيانات ، DigitalTwin ، وظائف المسؤولية واشتراكات إنترنت الأشياء متاحة الآن لجميع مستخدمي النظام البيئي. لتقديم تفاصيل عن هذه المرحلة من المشروع ، نشر الفريق الأساسي الفصول الأولى من ",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "تم إصدار Robonomics 2.0 على ركيزة مع دعم رسائل XCM ، وبدأنا في فتح قنوات HRMP باستخدام مظلات أخرى (مثل Crust Shadow و Darwinia ) ، التي تعتبر وظائفها مفيدة جدًا لنا.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "في الوقت نفسه، قمنا بفتح استراتيجية لإدخال سوق الإنترنت من الأشياء إلى بروتوكولنا. أدت تجاربنا مع معدات الإنترنت من الأشياء إلى مفهوم المنزل الذكي السيادي، الذي يعتمد على مزودي خدمات السحابة المركزية. لقد قمنا بتطوير",
  "integration": "التكامل",
  "with the Home Assistant automation system, and also designed our own": "مع نظام الأتمتة المنزلية المساعد، وصممنا أيضًا",
  "IoT gateway": "بوابة الإنترنت من الأشياء",
  "for connecting smart devices.": "لربط الأجهزة الذكية.",
  "We have launched two big initiatives in order to increase community engagement —": "لقد أطلقنا مبادرتين كبيرتين من أجل زيادة مشاركة المجتمع - أكاديمية",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "وبرنامج سفير Robonomics",
  "Additionally,": "بالإضافة إلى ذلك، تم عقد ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "في الخريف حتى يتمكن مجتمع Robonomics من تجربة آليات الحوكمة لدينا لأول مرة. في الآونة الأخيرة، ساعد فريق Robonomics مشروع DAO IPCI في الحصول على فتحة Parachain لتقديم خدمة تعويض الكربون للمباني الذكية.",
  "In 2021, our": "إلى إعداد المشروع بحيث يمكن استخدام تطبيقات إنترنت الأشياء عبر باراشين الخاص بنا على شبكة ",
  "main focus": "تركيزنا الرئيسي",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "في عام 2021 ، تحول Kusama. تم إصدار Robonomics 1.0 على Substrate ، ونحن نختبر توصيل أجهزة الاستشعار بالباراشين لإرسال بيانات القياس عن بُعد ، بالإضافة إلى تطوير وظيفة التوأم الرقمي. في منتصف العام ، قررنا اختبار الدورة الكاملة لشبكتنا وأنشأنا سلسلة الترحيل الخاصة بنا والتي تسمى ، والتي تم دمج Robonomics parachain فيها (قبل ترحيلها إلى سلسلة Kusama للتتابع). كان هناك الكثير من ",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "لتركيز على الحصول على فتحة باراشين في كوساما ، والتي نظمنا من أجلها عدة حملات جماعية.",
  "There have been two big changes for the community. First, we launched the": "،والذي يسمح لمشاريع Web3 والروبوتات وإنترنت الأشياء بتلقي التمويل ",
  "Robonomics Grant Program": "برنامج منح علم الروبوتات",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "كان هناك تغييران كبيران للمجتمع. أولاً ، أطلقنا ، مما سمح لحاملي توكنات ",
  "Exodus process": "Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "لمهام البحث والتطوير. بحلول نهاية العام ، شاركت أربعة مشاريع نشطة في البرنامج. ثانيًا ، بدأ الفريق عملية Ethereum بنقل رموز XRT الخاصة بهم إلى parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "من بين التعاونات، يمكننا أن نتذكر ظهور بوسطن ديناميكس سبوت في ميركلبوت، حيث",
  "rental remote control system": "نظام تحكم عن بعد ",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "من بين أوجه التعاون ، يمكننا أن نتذكر المظهر الرائع لـ Boston Dynamics Spot في MerkleBot ، حيث تم تطوير للتأجير. نود أيضًا أن نعلمك بشأن شركة Multi-Agent Systems وهي مشروع شخصي تم تشكيله بواسطة فريق من مهندسي Robonomics. لقد طوروا خبازًا آليًا للوافل يسمى Eisenkoch يقوم بمهام الطبخ لأصحاب المقاهي.",
  "There came a time when the existing limitations of Ethereum": "(على وجه الخصوص ، ضعف قابلية التوسع والسرعة المنخفضة والتكلفة العالية جدًا",
  "began to stand out clearly": "تبرز بوضوح",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "لقد حان وقت بدأت فيه القيود الحالية لـ Ethereum للمعاملات). كان من المفترض أن تؤدي الترقية إلى ETH2.0 إلى إصلاح الموقف ، ولكن تم تأخير هذه الترقية بشكل متكرر. بينما لم نرغب في مغادرة شبكة Ethereum ، أدركنا أنه في الوضع الحالي كان من الصعب تنفيذ حالات الاستخدام الخاصة بنا ، وبدأنا في البحث عن شبكة بديلة. أصبح النظام الإيكولوجي للبلوكشين المُقسَّم Polkadot هذا البديل. لقد بدأنا بتجربة إطار عمل الركيزة لترحيل ميزات Robonomics الرئيسية ونشر شبكة الاختبار الخاصة بنا. بحلول نهاية هذه المرحلة ، كنا قد نشرنا الباراشين الخاص بنا على شبكة اختبار Rococo وبدأنا في الاستعداد للحصول على فتحة على شبكة Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "بالاستمرار في دراسة أنظمة إنترنت الأشياء ، حددنا الوظيفة الرئيسية لـ Robonomics ، والتي يمكن أن تضيف قيمة للمستخدمين - وظيفة السحابة أخذت البنية الأساسية لـ RWS على عاتقها ",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "اللامركزية لإنترنت الأشياء. شكلت هذه الفكرة أساس جميع وظائف السحابة المركزية النموذجية ، ولكن بدون المشكلات القياسية للتوافر العالمي والأمان والخصوصية. بالإضافة إلى ذلك ، توصلنا إلى فكرة اشتراكات Parachain IoT التي تسمح لأصحاب الاشتراك باستخدام شبكة blockchain دون الحاجة إلى دفع رسوم مقابل كل معاملة. كانت التجربة  الأولى لاشتراكات إنترنت الأشياء هي إصدار رمز RWS ، والذي يسمح لمالكه بإرسال معاملة واحدة لكل كتلة. بالإضافة إلى ذلك ، بدأنا في اتخاذ  الخطوات الأولى لتطوير مجموعة الأجهزة الخاصة بنا للتحكم في الأجهزة الذكية (مفهوم DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": ".. وقد بدأ  ",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "بالطبع ، لم يتوقف دعم Robonomics على Ethereum. تم الانتهاء من حزمة اتصالات Robonomics إلى الإصدار الرمز المميز XRT التداول في العديد من البورصات (على وجه الخصوص ، Uniswap DEX) ، وتم إطلاق برنامج تحفيز السيولة.",
  "The team actively developed ways to interact with the community. The first version of our": "طور الفريق بنشاط طرقًا للتفاعل مع المجتمع. تم إطلاق الإصدار الأول من موقع",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "الخاص بنا و Robonomics Wiki. من أجل إدارة مشروع أكثر شفافية وملاءمة ، بدأنا في استخدام",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "استضفنا",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "في عام 2019 للقادمين الجدد إلى المشروع.",
  "Robonomics became the foundation for the": "أصبحت Robonomics أساسًا لـ",
  "RoSeMAN": "RoSeMAN.",
  "MerkleBot": "MerkleBot ،",
  "project, which is developing a system for smart leasing of robotic equipment.": "الذي يعمل على تطوير نظام للتأجير الذكي للمعدات الروبوتية.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "لقد فهمنا أن الوكلاء المستقلين يحتاجون إلى بيئة تضمن عملياتهم التقنية والاقتصادية الموثوقة. لعدة سنوات، كنا نطور بروتوكولًا لإنشاء شبكة لامركزية من مقدمي الخدمات التي تساعد الوكلاء الروبوتيين على تقديم خدماتهم. تم تطوير أدوات لصيانة الشبكة ومجموعة الاتصالات بين Ethereum و  وتم إطلاق نسخة alpha من Robonomics Network على شبكة",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "ROS. في عام 2018، نشرنا Ethereum الرئيسية. استمرت الاستعدادات النشطة لحدث توليد الرموز XRT (والذي حدث في النهاية في ربيع عام 2019 بسبب شتاء التشفير الأول).",
  "Important news &amp; announcements": "أخبار مهمة وإعلانات",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "بدأت روبونوميكس في تطوير حالات الاستخدام المتعلقة بالصناعة 4.0 - المصانع الذكية والمدن الذكية والمنازل الذكية - وهذا جلب اهتمامنا الكبير بعالم الإنترنت من الأشياء. في البحث عن الابتكار، قدم الفريق عدة عروض تجريبية كبيرة وفريدة من نوعها:",
  "sensor network": "شبكة أجهزة الاستشعار",
  "a water drone": "طائرة مائية",
  "for environmental monitoring (supported by a sensor systems manufacturer": "لمراقبة البيئة (بدعم من شركة تصنيع أنظمة الاستشعار)",
  "a smart factory model": "نموذج مصنع ذكي",
  "a self-employed": "فنان روبوتي ذاتي العمل جاكا-تشو",
  "robot artist Gaka-chu": "و",
  "and a": "نظام إدارة حركة الطائرات بدون طيار",
  "drone traffic management system": "بدأت روبونوميكس التعاون مع مشروع داو إي بي سي آي على إدارة الأصول البيئية باستخام تقنيات الويب3 وأجهزة الإنترنت من الأشياء",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "بدأت Robonomics التعاون مع مشروع DAO IPCI في إدارة الأصول البيئية باستخدام تقنيات web3 وأجهزة إنترنت الأشياء.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "كانت هذه فترة بحث وتطوير نشط حددنا خلالها مجموعة من المهام، حيث تتمتع تقنيات p2p بقدرات لم تكن متاحة من قبل للروبوتات. بدمج كمبيوتر في المقابل، فتح",
  "autonomous intelligent robot agent": "يصبح وكيل روبوت ذكي مستقل",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Ethereum وتخزين ملفات IPFS ونظام تشغيل الروبوت (ROS)، أدركنا أن أي جهاز يمكن أن هذا الطريق أمامنا لمفاهيم الروبوت كخدمة واقتصاد الروبوت.",
  "Our publications in scientific journals of this period are available in the": "الاستخدام ",
  "Papers section": "كتاب سه",
  "We have collected all R&D projects over the years in the": "لقد جمعنا جميع مشاريع البحث والتطوير على مر السنين في كتاب سهل",
  "a handy book": "كتاب سهل الاستخدام",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "بدأ كل شيء بفكرة ظهرت على المؤسسين عندما أطلقت Ethereum للتو شبكتها الرئيسية. ماذا لو كان الروبوت يؤدي مهمة لعميل للعملة المشفرة، ويتم التحكم في منطقه من خلال عقد ذكي ؟",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "لاختبار الفكرة، قمنا بعمل عرض توضيحي تم فيه إطلاق طائرة بدون طيار يتحكم فيها جهاز كمبيوتر Ethereum لتحقيق إحداثيات GPS المحددة بعد أن أكمل المستخدم معاملة الدفع.",
  "The demo is available on": "العرض التوضيحي متاح على ",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "الجدول الزمني لتطوير البنية التحتية والتكنولوجيا",
  "Notable events": " الأحداث البارزة",
  "Robonomics logos and usage": "Robonomics الشعارات والاستخدام",
  "Download Robonomics logo": "قم بتنزيل شعار Robonomics",
  "Download RWS logo": "قم بتنزيل شعار RWS",
  "Download wiki logo": "قم بتنزيل شعار WIKI",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": " استخدم هذه الشعارات المسموح بها للارتباط بـ Robonomics أو RWS أو Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": " استخدم شعار Robonomics المسموح به لإعلام الآخرين بأنك مدمج مع Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": " استخدم الشعارات المسموح بها في منشورات المدونة والمقالات والشرائح حول تقنية Robonomics والمشاريع المتكاملة",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": " لا تقم بتعديل شعارات Robonomics المسموح بها ، بما في ذلك تغيير اللون أو الأبعاد أو دمجها مع كلمات أو عناصر تصميم أخرى.",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": " لا تستخدم شعار Robonomics واسمه بطريقة توحي بأنك Robonomics ، أو أن عرضك أو مشروعك من Robonomics ، أو أن Robonomics تدعمك أو تدعم عرضك أو مشروعك إذا لم تتم الموافقة عليه من قبل Robonomics DAO.",
  "Robonomics Color pallet": " لوح الألوان Robonomics",
  "This page is out of your space": " هذه الصفحة خارج مساحتك",
  "Wiki": "ويكي",
  "Academy": "أكاديمية",
  "Github": "جيت هاب",
  "Dapp": "داب",
  "All posts": "جميع المشاركات",
  "I agree to receive emails": "أوافق على استلام رسائل البريد الإلكتروني",
  "Send": "إرسال",
  "Thanks, your application has been sent!": "شكرًا، تم إرسال طلبك!",
  "R&D cases": "حالات البحث والتطوير",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "التعاون مع مطور عقاري في قبرص لتتبع التوزيع اليومي واستهلاك الكربون الناتج وتعويض أي زيادة في الأثر الكربوني.",
  "I agree to receive email communications from Robonomics": "أوافق على استلام الرسائل الإلكترونية من Robonomics",
  "Check url once more or create an": "تحقق من عنوان URL مرة أخرى أو أنشئ",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "وأخبرنا أنك واجهت خطأ 404 (لا تنسى أن تذكر عنوان URL الحالي)",
  "Latest update": "أحدث تحديث",
  "For all passionate about Robonomics and inspired by web3.": "لجميع المهتمين بـ Robonomics والمستوحاة من web3.",
  "We invite you to contribute to the development and promotion of Robonomics in the international arena for cooperation.": "ندعوك للمساهمة في تطوير وتعزيز Robonomics في الساحة الدولية للتعاون.",
  "Learn": "تعلم",
  "Theory & practice from Robonomics": "النظرية والممارسة من Robonomics",
  "Make content": "إنشاء المحتوى",
  "Documentation, instructions, tutorials, Localization, scientific papers": "الوثائق، التعليمات، البرامج التعليمية، الترجمة، الأوراق العلمية",
  "Communicate": "التواصل",
  "Online and offline (meetups, conferences, social networks, collaborations)": "عبر الإنترنت وخارجه (الاجتماعات، المؤتمرات، الشبكات الاجتماعية، التعاون)",
  "Get rewards": "احصل على مكافآت",
  "XRT reward every month, extra bonuses and gifts for top 5 ambassadors": "مكافأة XRT كل شهر، مكافآت إضافية وهدايا لأفضل 5 سفراء",
  "Get your role, ambassador": "احصل على دورك، سفير",
  "How to become an ambassador?": "كيف تصبح سفيرًا؟",
  "Tell us more about you": "أخبرنا المزيد عنك",
  "Fill out the questionnaire": "املأ الاستبيان",
  "Start": "ابدأ",
  "Wait for your invitation to the special Discord chat for ambassadors": "انتظر دعوتك للانضمام إلى دردشة Discord الخاصة بالسفراء",
  "The number of participants in the program is limited": "عدد المشاركين في البرنامج محدود",
  "For content makers": "بالنسبة لصانعي المحتوى",
  "What you may do:": "ما يمكنك القيام به:",
  "1) work with technical documentation, instructions and tutorials;": "1) العمل مع الوثائق الفنية والتعليمات والبرامج التعليمية؛",
  "2) translate content into your native language;": "2) ترجمة المحتوى إلى لغتك الأم؛",
  "3) make scientific papers based on Robonomics technologies;": "3) إنشاء أوراق علمية استنادًا إلى تقنيات Robonomics؛",
  "4) popularize ideas of Robonomics.": "4) نشر أفكار Robonomics.",
  "How:": "كيف:",
  "1) make pull requests on GitHub for": "1) قدم طلبات سحب على GitHub لـ",
  "website": "الموقع الإلكتروني",
  "wiki": "الويكي",
  "2) discuss what we need to translate in ambassador chat;": "2) ناقش ما نحتاج إلى ترجمته في دردشة السفراء؛",
  "3) create video and text content, try to make it unique for your followers;": "3) إنشاء محتوى فيديو ونصي، وحاول جعله فريدًا لمتابعيك؛",
  "4) share progress with other ambassadors and team.": "4) شارك التقدم مع السفراء الآخرين والفريق.",
  "For community helpers": "بالنسبة لمساعدي المجتمع",
  "1) organize local offline meetups and hackathons based on Robonomics technologies;": "1) تنظيم اجتماعات وورش عمل محلية في استنادٍ إلى تقنيات Robonomics؛",
  "2) participate in thematic conferences on behalf of Robonomics;": "2) المشاركة في المؤتمرات الموضوعية نيابةً عن Robonomics؛",
  "3) work online with community: online meetups and hackathons, chat administration, forum moderation, various social networks;": "3) العمل عبر الإنترنت مع المجتمع: الاجتماعات وورش العمل عبر الإنترنت، إدارة الدردشة، مراقبة المنتدى، مختلف الشبكات الاجتماعية؛",
  "4) communicate with other projects for collaboration.": "4) التواصل مع مشاريع أخرى للتعاون.",
  "1) make your suggestion in ambassador’s chat;": "1) قدم اقتراحك في دردشة السفراء؛",
  "2) get merchandise if needed for offline events;": "2) احصل على سلع ترويجية إذا لزم الأمر للفعاليات الخارجية؛",
  "3) share progress with other ambassadors and team.": "3) شارك التقدم مع السفراء الآخرين والفريق.",
  "Get all our support and visual materials in ambassador’s chat": "احصل على كل الدعم والمواد المرئية في دردشة السفراء",
  "Robonomics architecture": "هندسة Robonomics",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "بعد ذلك، نود أن نعرض لك المجالات العملية للتفاعل بين الإنسان والآلة باستخدام تكنولوجيا الإنترنت الحديثة. سننتقل من معمارية جهاز IoT المألوفة لتبادل المعلومات التقنية من خلال خدمات السحابة إلى تنظيم التفاعل التقني-الاقتصادي من خلال شبكة لامركزية ومتاحة عالميًا من المزودين.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "للبدء، نحتاج إلى جولة في المجال الذي يرتبط بشكل واضح باتصال الشبكة بالأنظمة المؤتمتة. بعد ذلك، سنلقي نظرة على أساسيات إنترنت الأشياء لتسليط الضوء على المشاكل والتحديات الرئيسية التي يواجهها مبتكرو أنظمة IoT والتي يهدف Robonomics إلى حلها.",
  "Overview of the state of the internet of things (IoT)": "نظرة عامة على حالة إنترنت الأشياء (IoT)",
  "Robot and electrics sheep artboard": "لوحة فن الروبوت والخروف الكهربائي",
  "Robot and apple artboard": "لوحة فن الروبوت والتفاحة",
  "Robot and cosmonaut artboard": "لوحة فن الروبوت والرائد الفضائي",
  "Robot and cat artboard": "لوحة فن الروبوت والقطة",
  "Space travelers artboard": "رحالة الفضاء لوحة فنية",
  "Coloured astronaut artboard": "رائد الفضاء الملون لوحة فنية",
  "Black and white astronaut artboard": "رائد الفضاء الأبيض والأسود لوحة فنية",
  "icons for macos": "أيقونات لنظام التشغيل macOS",
  "icons for windows": "أيقونات لنظام التشغيل Windows",
  "Sleeping Mew Space": "نوم ميو الفضائي",
  "Are you ready for Mars?": "هل أنت مستعد للذهاب إلى المريخ؟",
  "Shiva Robot": "روبوت شيفا",
  "Space Travelers": "رحالة الفضاء",
  "Retro Astronaut": "رائد الفضاء الرجعي",
  "New Newton": "نيوتن الجديد",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "ألكسندر كابيتونوف ، سيرجي لونشاكوف ، فيتالي بولاتوف ، باباك كيا مونتازام ، جيمس وايت",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "إيفان بيرمان ، إنريكا زيريك ، ألكسندر كابيتونوف ، فابيو بونسينيوريو ، عليشير خسانوف ، عزيزة أوريبوفا ، سيرجي لونشاكوف ، فيتالي بولاتوف",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "فاديم ماناينكو ، ألكسندر كابيتونوف ، إيفان بيرمان",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "ألكسندر كابيتونوف ؛ إيفان بيرمان ؛ فاديم ماناينكو ؛ فياتشيسلاف رزهفسكي ؛ فيتالي بولاتوف ؛ أرتيمي زينكين",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "إيليا أفاناسيف ، ألكساندر كولوتوف ، روسلان ريزين ، كونستانتين دانيلوف ، مانويل مازارا ، سوبهام تشاكرابورتي ، أليكسي كاشيفنيك ، أندريه تشيتشولين ، ألكسندر كابيتونوف ، فلاديمير جوتسوف ، أندون توبالوف ، نيكولا شاكيف ، سيفيل أحمد",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "ألكسندر كابيتونوف ، سيرجي لونشاكوف ، إيفان بيرمان ، إدواردو كاستيلو فيرير ، فابيو ب بونسينيوريو ، فيتالي بولاتوف ، ألكسندر سفيستوف",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "ألكسندر كابيتونوف ، إيفان بيرمان ، سيرجي لونشاكوف ، ألكسندر كروبينكين ، فيتالي بولاتوف",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "كونستانتين دانيلوف ؛ روسلان ريزين ؛ إيليا أفاناسيف ؛ ألكساندر كولوتوف",
  "Alastair Marke": "ألاستير مارك",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "سيرجي لونشاكوف ، ألكسندر كروبينكين ، ألكسندر كابيتونوف ، يفجيني رادتشينكو ، عليشير خسانوف ، ألكسندر ستاروستين",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "ألكسندر كابيتونوف ، إيفان بيرمان ، سيرجي لونشاكوف ، ألكسندر كروبينكين",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "ألكسندر كابيتونوف ، إيفان بيرمان ، فيتالي بولاتوف ، سيرجي لونشاكوف ، ألكسندر كروبينكين",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "أنتون غالينوفيتش ، سيرجي لونشاكوف ، أليكسي شادرين",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "ألكسندر كابيتونوف ، سيرجي لونشاكوف ، ألكسندر كروبينكين ، إيفان بيرمان",
  "The latest Robonomics news here.": "أحدث أخبار Robonomics هنا.",
  "Follow us": "تابعنا",
  "Video tutorials, screencasts, interviews, events.": "الفيديوهات التعليمية والتسجيلات الشاشة والمقابلات والفعاليات.",
  "Watch videos": "شاهد الفيديوهات",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "تحدث معنا ومع مجتمعنا. لا تتردد في طرح أي أسئلة ومناقشة اقتراحاتك.",
  "Join chat": "انضم للدردشة",
  "Medium Blog": "مدونة Medium",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "رؤيتنا للماضي والحاضر والمستقبل حول Robonomics وشبكات Ethereum و Polkadot والأسواق الخضراء والروبوتات وكل ما يتعلق بـ Robonomics.",
  "Read": "اقرأ",
  "Telegram chat": "دردشة Telegram",
  "Local communities & news. You are welcome!": "المجتمعات المحلية والأخبار. أهلا بك!",
  "Updated use cases for connected robots within web3 technologies.": "حالات الاستخدام المحدثة للروبوتات المتصلة بتقنيات web3.",
  "17 use cases for connected robots within Polkadot and Ethereum.": "17 حالة استخدام للروبوتات المتصلة ضمن Polkadot و Ethereum.",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "هنا ، نشرح فكرة النظام الفيزيائي السيبراني ، وكيف يمكن أن يساعد في توسيع التصنيع ، وما يجب فعله بشأن التزامات الروبوتات.",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "هنا، يمكنك العثور على أول ورقة بيضاء حول علم الروبوتات وتنزيلها (مجانًا تمامًا بالطبع)، والتي تم تقديمها في مايو 2018. وعلى الرغم من تطور الكثير منذ ذلك الحين، إلا أن أساسيات علم الروبوتات لا تزال موضحة في هذه الورقة.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "جاكا تشو: فنان روبوت مستقل يعمل لحسابه الخاص",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "التوطين التعاوني الخالي من التدرج وتتبع الحدود البيئية المتحركة بواسطة فرق من الروبوتات غير الشاملة",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "الروبوت كخدمة: من السحابة إلى تقنيات التناظر",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "مراقبة بيئية موثوقة عن طريق شبكات الاستشعار على متن السفن البحرية المستقلة وتكنولوجيا السجلات الموزعة",
  "Digital Passport for Unmanned Vehicles": "جواز السفر الرقمي للمركبات غير المأهولة",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics كمنصة قائمة على Blockchain لإدارة حركة المرور غير المأهولة للمركبات المتنقلة",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "نحو أنظمة روبوتية متعددة الوكلاء تعتمد على تقنية blockchain: التحليل والتصنيف والتطبيقات",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "الخدمات الروبوتية للمدن الذكية النموذجية الجديدة القائمة على التقنيات اللامركزية",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "بروتوكول تنظيم شبكة الوكلاء المستقلين اللامركزية في المصانع باستخدام آليات السوق",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "نحو علم الروبوتات القائم على blockchain: التحقق من سلوك الوكلاء المستقلين",
  "Transforming Climate Finance and Green Investment with Blockchains": "تحويل تمويل المناخ والاستثمار الأخضر باستخدام Blockchainκ",
  "Robonomics: platform for integration of cyber physical systems into human economy": "الروبوتات: منصة لدمج الأنظمة المادية السيبرانية في الاقتصاد البشري",
  "Blockchain based protocol for economical communication in industry 4.0": "بروتوكول قائم على Blockchain للاتصالات الاقتصادية في الصناعة 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "الروبوتات التي تعتمد على blockchain كمبدأ لإنشاء المصانع الذكية",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "النظام البيئي Blockchain لأسواق الكربون والأصول البيئية والحقوق والالتزامات: تصميم المفهوم وتنفيذه",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "بروتوكول قائم على Blockchain للنشاط التجاري المستقل للأنظمة متعددة الوكلاء التي تتكون من الطائرات بدون طيار",
  "English": "إنجليزي",
  "Russian": "الروسية",
  "Chinese": "صينى",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics عبارة عن منصة مفتوحة المصدر تسهل كلاً من خدمات إنترنت الأشياء البسيطة والروبوتات المعقدة، مما يتيح التواصل الفعال بين الوكلاء، سواء كانوا بشرًا أو آليين. لدمج الروبوتات في هذا النظام، نستخدم ROS. في هذه المقالة، نهدف إلى تقديم نظرة عامة على عمليتنا لدمج Robonomics في ROS 2.",
  "Research papers": "أوراق بحثية",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "وبدون البحث الأكاديمي، فإن تطوير الأنظمة المعقدة التي يمكن دمجها في حياتنا اليومية قد يفقد غرضه أو حتى يشكل مخاطر. يجب علينا أن نفكر بعناية في اتجاهنا وأهدافنا والعواقب المحتملة. إن المجالات التي تعمل فيها الروبوتات، وتحديدًا الروبوتات والعلاقات الاقتصادية وتقنيات Web3، تستحق الدراسة بشكل فردي، واستكشاف كيفية دمجها مع بعضها البعض، وتقييم تأثيرها المحتمل على حياتنا.",
  "Why ROS 2 in Robonomics?": "لماذا ROS 2 في علم الروبوتات؟",
  "Robonomics whitepaper 2022 welcome guide": "دليل الترحيب بورقة عمل روبونوميكس 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "لقد قمنا بتطوير بروتوكول اتصال تكنو-اقتصادي للآلات يعمل فوق منصة إيثريوم و IPFS، ونكمله بعناصر من منصة IoT مستندة إلى بولكادوت باراشين. اليوم، لدينا بالفعل منصة هجينة لإنشاء تطبيقات IoT المستقبلية. إنه يوفر التفاعل مع الأجهزة تحت سيطرة كمبيوتر لامركزي عالمي. قبل أن نبدأ في إنشاء تطبيقات IoT آمنة وخالية من الخوادم ومستقبلية باستخدام منصة روبونوميكس، دعنا نغوص قليلاً في النظرية...",
  "The first two chapters of the Robonomics white paper are already available to users.": "الفصلين الأولين من ورقة عمل روبونوميكس متاحين بالفعل للمستخدمين.",
  "Chapter 1.": "الفصل 1.",
  "At the intersection of cybernetics and economics": "عند تقاطع السيبرنياتيك والاقتصاد",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "قدمنا نظامًا اقتصاديًا يعمل فيه الأجهزة الروبوتية كوكلاء مستقلين قادرين على أداء الأنشطة الاقتصادية الرئيسية التي كانت محجوزة سابقًا للبشر. في هذا الفصل، سنتحدث عن أهمية اقتصاد الروبوت، الذي يمكن أن يصبح جزءًا مهمًا من حياة الناس ويغير المستوى الحالي للاقتصاد إلى خدمات مؤتمتة بالكامل في المستقبل.",
  "In this chapter you will learn": "في هذا الفصل ستتعلم",
  "Ronald Coase and The Nature of the Firm": "رونالد كوز وطبيعة الشركة",
  "CPS - cyber-physical system": "نظام السيبر-فيزيائي (CPS)",
  "Norbert Wiener and the search for patterns in living and machine": "نوربرت وينر والبحث عن الأنماط في الكائنات الحية والآلات",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "الثورة الصناعية الرابعة، المال للروبوتات والبيتكوين",
  "Ethereum Smart Contracts": "عقود إيثريوم الذكية",
  "Polkadot Parachains": "بولكادوت باراشين",
  "Polkadot VS Ethereum 2.0": "بولكادوت مقابل إيثريوم 2.0",
  "Open questions of teleology and Mises' work": "الأسئلة المفتوحة للتليولوجيا وعمل ميسيس",
  "Read chapter 1": "اقرأ الفصل 1",
  "Chapter 2.": "الفصل 2.",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "في الفصل الثاني، ستقرأ عن التفاعل بين الإنسان والآلة باستخدام تكنولوجيا الإنترنت الحديثة - من أجهزة IoT إلى شبكة موفرين متاحة بشكل لامركزي وعالمي. سننظر في أساسيات إنترنت الأشياء من أجل إبراز المشاكل والتحديات الرئيسية التي يواجهها مبتكرو أنظمة IoT والحل الذي يهدف إليه روبونوميكس.",
  "Overview of the state of the Internet of Things (IoT)": "نظرة عامة على حالة إنترنت الأشياء (IoT)",
  "Classification of IoT devices": "تصنيف أجهزة IoT",
  "Embedded IoT systems": "أنظمة IoT المضمنة",
  "Edge-systems: IoT gateways and controllers": "أنظمة الحواف: بوابات ومتحكمات IoT",
  "Autonomous Systems": "أنظمة مستقلة",
  "Internet of Things providers": "موفرون لإنترنت الأشياء",
  "Digital twins are the heart of the Internet of Things": "التوائم الرقمية هي قلب إنترنت الأشياء",
  "IoT data flows in cloud service": "تدفقات بيانات IoT في خدمة السحابة",
  "Popular examples of IoT solutions": "أمثلة شائعة لحلول IoT",
  "Current problems of building IoT solutions": "مشاكل الحالية في بناء حلول IoT",
  "Main tasks of Robonomics architecture": "المهام الرئيسية لهندسة روبونوميكس",
  "Basic components of Robonomics architecture": "المكونات الأساسية لهندسة روبونوميكس",
  "A simple representation of Robonomics architecture": "تمثيل بسيط لهندسة روبونوميكس",
  "Read chapter 2": "اقرأ الفصل 2",
  "We continue to update the white paper of Robonomics": "نحن ما زلنا نحدث ورقة عمل روبونوميكس",
  "stay tuned for new parts on our website and in Discord": "تابعنا للحصول على أجزاء جديدة على موقعنا وفي ديسكورد",
  "Join our discord": "انضم إلى ديسكورد لدينا",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics هي منصة IoT مستقبلية مفتوحة المصدر بنسبة 100٪ ، آمنة ، فعالة من حيث التكلفة ، ومستقبلية لربط الروبوتات تحت التحكم في Polkadot و Ethereum. يمكن لأي شخص بناء خدمات باسخدام Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "فيما يلي قائمة بتطبيقاتنا المثبتة لتقنيات الروبوتات الحديثة.",
  "By interest:": "حسب الاهتمام:",
  "Sort by progress:": "ترتيب حسب التقدم:",
  "Any progress": "أي تقدم",
  "Complete": "كامل",
  "Proceeding": "جارٍ",
  "Sort by time:": "ترتيب حسب الوقت:",
  "Recent": "الأحدث",
  "Earliest": "الأقدم",
  "Show more": "عرض المزيد",
  "Establishing democracy with smart contracts": "إنشاء الديمقراطية باستخدام العقود الذكية",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "لنتخيل مكتبًا صغيرًا يضم فريقًا مكونًا من 10-15 شخصًا. بينما يركز الجميع على المواعيد النهائية الخاصة بهم لمهامهم المهنية الرئيسية ، لا يبدو أن أحدًا يهتم بصيانة مساحة المكتب. الحل الأكثر شيوعًا لتجنب الانغماس في الفوضى هو توظيف أفراد آخرين للدعم. نهج آخر هو اتخاذ المبادرة وفرض عقوبات على أولئك الذين يخلقون فوضى أو يستنفدون الإمدادات دون تجديدها. ومع ذلك ، هل من الأخلاقي أن نعيش تحت الاستبداد في عامنا المستقبلي العملة المشفرة الذي يُتوقع من الجميع أن يكونوا مسؤولين ويتمتعوا بالحرية؟ لنسعى لإنشاء مجتمع ديمقراطي أكثر باستخدام العقود الذكية وجيل جديد من تكنولوجيا الإنترنت (المشار إليها في كثير من الأحيان بـ Web3). نحتاج إلى أدوات يمكن أن تساعدنا في اتخاذ القرارات معًا ، ثم التأكد من أنها تعمل بشكل صحيح دون أن يشارك البشر مباشرة.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'من شرب كل القهوة؟!' أو مأساة المشتركات",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "هناك مفهوم يتم مناقشته على نطاق واسع في الاقتصاد والبيئة والعلوم الأخرى يعرف بـ 'مأساة المشتركات'. يتعلق هذا بسيناريو يقوم فيه الأفراد الذين لديهم وصول إلى مورد مشترك بإعطاء الأولوية لمصالحهم الخاصة ، مما يؤدي في النهاية إلى استنفاد المورد. تشبه القهوة إلى حد كبير مثل هذا المورد ، حيث يتدهور بسبب الاستهلاك غير المضبوط في المكتب. ومع ذلك ، في الوقت نفسه ، عادةً ما لا يميل أي من أعضاء الفريق إلى استثمار وقتهم وأموالهم في الحصول على حزمة إضافية من حبوب القهوة. لذا ، يستمرون في شرب القهوة دون الحصول على إمدادات جديدة.",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "استراتيجية لتحويل آلة القهوة إلى جهاز روبوتي مستقل",
  "How to formulate the task in numbers.": "كيفية صياغة المهمة بالأرقام.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "بفرض ميزانية شهرية للقهوة قدرها 100 دولار ، وهو ما يعادل تقريبًا 150 كوبًا لفريقنا المكون من 10 أشخاص ، فإن هذا يترك لكل شخص كوبًا واحدًا كل يومين. الآن ، دعونا ننغمس في التفاصيل التقنية. السؤال هو: كيف يمكننا إحضار آلة قهوة مستقلة إلى الحياة في المكتب؟",
  "Step 1: automated coffee bean ordering": "الخطوة 1: طلب القهوة الحبوب تلقائيًا",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "لقد قمنا بالاتفاق مع الباريستا ، نيكيتا ، الذي يقع بالقرب من المكتب. سيزودنا بحبوب القهوة عند تلقي تنبيه من الروبوت. يرسل الروبوت رسالة عندما تنخفض كمية القهوة ، محددًا كمية القهوة (بالكيلوجرام) المطلوبة للطلب ومبلغ الدفع المقابل المحدد م قبل الفريق. باستخدام هذه التفاصيل ، يمكن لنيكيتا اختيار القهوة وفقًا لتفضيلاته.",
  "Step 2: automatic access to smart office.": "الخطوة 2: الوصول التلقائي إلى المكتب الذكي.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "بالتزامن مع الطلب ، تقوم آلة القهوة بإنشاء رمز QR. يقدم نيكيتا بعد ذلك رمز الاستجابة السريعة هذا إلى الكاميرا للدخول إلى المكتب.",
  "Step 3: distribution of coffee tokens to the team.": "الخطوة 3: توزيع رموز القهوة على الفريق.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "بمجرد أن تمسح الكاميرا المحلية رمز الاستجابة السريعة ، يقوم نظام إدارة المنزل الذكي ببدء الدفع لنيكيتا وتوزيع رموز القهوة الجديدة بين أعضاء الفريق.",
  "Step 4: drink coffee!": "الخطوة 4: شرب القهوة!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "لكي يتمكن عضو الفريق من الحصول على كوب جديد من القهوة ، يحتاج إلى إرسال رمز القهوة إلى عنوان آلة القهوة.",
  "Coffee beans delivery process:": "عملية تسليم حبوب القهوة:",
  "Unlock new possibilities with this concept": "فتح إمكانيات جديدة بهذا المفهوم",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "علاوة على ذلك ، تقدم مثل هذه الآلة القهوة المؤتمتة أبعادًا اقتصادية واجتماعية مختلفة. دعونا نلقي نظرة عليها:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "يمكن للمطورين إيداع رموز القهوة الإضافية عندما ينخفض الاستهلاك دون الحد المسموح به. يتم بذلك إنشاء نظام شفاف لاستخدام القهوة المتنوع ضمن الحد المسموح به.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "يمكن لآلة القهوة الحفاظ على حساب مشترك ، مما يتيح لأعضاء المكتب المساهمة في الأموال من حساباتهم الشخصية لتجربة قهوة عالية الجودة في المرة القادمة.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "يقرر الفريق بشكل جماعي كمية القهوة التي ستطلبها الآلة في كل مرة من خلال تصويت DAO. يوفر هذا الحرية للتعامل مع التحدي بموارد محدودة.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "العمليات القابلة للبرمجة تقلل من تأثير العوامل البشرية وتوفر مرونة أكبر في تخصيص الإعدادات لفرق محددة.",
  "How we smarten up our coffee machine in real life": "كيف نجعل آلة القهوة ذكية في الحياة الحقيقية",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "للحصول على التحكم الفعلي في آلة القهوة ، قمنا بدمج حاسوب لوحة واحدة ، وتحديداً Raspberry Pi 4 ، مع آلة قهوة متاحة في السوق العامة تدعم اتصال GPIO. كان تفضيلنا هو",
  "selected for its affordability and the convenience of its easily removable front panel.": "محدد بسبب تلفته المعقولة وسهولة إزالة اللوحة الأمامية.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "بعد ذلك ، عملنا على تفاصيل التشغيل ، وتحديدًا بالنسبة للرموز التي يمكن للمستخدمين إرسالها والخوارزمية الأساسية. هنا هو النتيجة:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "للاستمتاع بكوب من القهوة اللذيذة ، يحتاج المستخدمون إلى إرسال مبلغ معين من الأموال (في حالتنا ، رمز ACT لـ Statemine ، id = 3077) إلى عنوان آلة القهوة من شبكة فرعية (Statemine). ب، ويتم نشر سجل ",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS ، نظام التشغيل للروبوتات ، هو أحد أقدم الأطر المفتوحة المصدر للروبوتات. إنه مجموعة من مكتبات البرامج والأدوات لجعل الروبوتات تعمل. يحتوي على كل شيء من الأساسيات إلى الميزات المتقدمة ويأتي مع أدوات مفيدة للمبرمجين. يتم استخدامه على نطاق واسع من قبل الجامعات في جميع أنحاء العالم للتدريس والبحث في مجال الروبوتات ، لذلك فهو متأسس جيدًا ، ويعمل مع العديد من أنواع الروبوتات ، ولديه مجتمع كبير من المطورين.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "منذ بدء ROS في عام 2007 ، تمت تغييرات كبيرة في مجال الروبوتات وداخل مجتمع ROS. كاستجابة لهذه التطورات ، تم تقديم ROS 2 بهدف التكيف مع هذه التغييرات. يستفيد من نقاط قوة ROS 1 مع معالجة القيود الخاصة به. لقد استخدمنا ROS في Robonomics من البداية ، والآن حان الوقت لنقله إلى ROS 2.",
  "You might find this interesting": "قد تجد هذا مثيرًا للاهتمام",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "هناك العديد من الروبوتات مفتوحة المصدر ومنصات الروبوتات المعقدة التي تدعم ROS. هذا يعني أنه يمكنك إنشاء نظام متعدد الروبوتات مثير للإعجاب لتحقيق أهدافك المحددة. للحصول على",
  "the most current list of supported robots": "أحدث قائمة بالروبوتات المدعومة",
  "please visit the ROS website.": "يرجى زيارة موقع ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "دعنا نرى كيف يتم استخدام ROS داخل إطار Robonomics من خلال تصوير النظام بأكمله مع Robonomics يعمل كطبقات مختلفة:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "في طبقة 'واجهة الجهاز' ، نحتاج إلى أدوات لربط الروبوتات بالبرامج بسلاسة. يوفر ROS 2 مجموعة قوية من أدوات المطورين المناسبة تمامًا لهذه المهمة.",
  "Robonomics packages for ROS and ROS 2": "حزم Robonomics لـ ROS و ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "بناء نظام متعدد الروبوتات ينطوي في كثير من الأحيان على تحدي ربط الأجهزة من موردين مختلفين ، أو حتى الأجهزة داخل مورد واحد ، كل منها يستخدم بروتوكولات مختلفة. سواء كان ذلك لإعداد منزل ذكي أو التصنيع الآلي ، فإن التواصل الفعال بين الآلات الخاصة بك أمر حاسم. يقدم ROS (وبالطبع ROS 2) وسائط مختلفة للتعامل مع هذا. ماذا لو يمكنك تخصيص المهام أثناء إدارة ROS للتواصل بين العقد؟",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "قام فريق Robonomics بإنشاء حزم مختلفة لـ ROS لجعل الروبوتات أكثر ذكاءً والتعامل مع المهام المحددة حسب الحاجة. للاطلاع على المهام التي قمنا بها باستخدام ROS ، تحقق من صفحة حالات البحث والتطوير الخاصة بنا. يعتمد كل تفاعل مع الروبوت تقريبًا على ROS. يمكنك العثور على حزم Robonomics مفتوحة المصدر لـ ROS على GitHub ، وإليك بعضها:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "تحتوي مجموعة اتصالات Robonomics على مجموعة من حزم ROS لأغراض الاتصال الاقتصادي.",
  "Robonomics' contribution in the ROS 2 community": "مساهمة Robonomics في مجتمع ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "يجمع Robonomics بين الروبوتات وتقنيات Web3 ، ونهدف إلى النمو في هذه المجالات. منذ تقديم ROS 2 ، قمنا بتحديد ثلاثة تحديات رئيسية تتضمن دعم مجتمع ROS 2 وتحسين قدرات Robonomics:",
  "Creating ROS 2 tools for Rust:": "إنشاء أدوات ROS 2 لـ Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "تمكن هذه الأدوات المطورين من كتابة تطبيقات ROS 2 باستخدام Rust. لمعرفة المزيد حول سبب اختيارنا لـ Rust وأهمية هذا المشروع بالنسبة لنا ، يمكنك العثور على",
  "additional details": "تفاصيل إضافية",
  "Developing Robonomics Middleware for ROS 2:": "تطوير Robonomics Middleware لـ ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "تلعب هذه دورًا هامًا في ضمان التكامل السلس لـ Robonomics في أنظمة الروبوتات متعددة الوكلاء المختلفة باستخدام ROS 2. يمكن أن يسهل التكامل بين الروبوتات وتقنيات سلسلة الكتل Web 3 وكذلك تقليل الأخطاء أثناء عملية التكامل ، مما يوفر الوقت والتكاليف.",
  "Creating a robotics lab with ROS 2:": "إنشاء مختبر روبوتي مع ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "مع زيادة شعبية ROS 2 في مجتمع الروبوتات ، نحن حريصون على رؤية المزيد من الروبوتات والأجهزة تعمل مع ROS 2. هدفنا هو ربطها بنظام Web3 باستخدام Robonomics.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "كما استمر التعاون مع المشاريع الملائمة. Robonomics وDAO IPCI خدمة جمع وتحليل البيانات الحسية —",
  "On the Way to Sovereign Home Automation": "على الطريق إلى أتمتة المنزل السيادي",
  "Becoming a Parachain for IoT Applications": "أن نصبح باراشين لتطبيقات إنترنت الأشياء",
  "Transition to Multinetwork — Along Came Polkadot": "الانتقال إلى الشبكات المتعددة – جاء Polkadot على طول الطريق",
  "The Rise of Robonomics Network": "صعود شبكة الروبوتات",
  "Bringing Together Web3 Techs and Robotic Frameworks": "الجمع بين تقنيات Web3 والأطر الروبوتية",
  "Playing with Human-Machine Interaction through Ethereum": "اللعب بالتفاعل بين الإنسان والآلة من خلال الإيثيريوم",
  "In a nutshell": "شيء صغير",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "في أيامنا هذه، أصبح من الواضح أكثر فأكثر أن استهلاك الطاقة هو مساهم رئيسي في آثار الكربون، مما يزيد من أهمية إيجاد طرق للحد من تأثيرنا البيئي. تلعب المكاتب والمباني التجارية دورًا مهمًا في استهلاك الطاقة. قام المهندسون في شركة Robonomics بتثبيت نظام في مكتب BBF، وهي شركة تطوير عقاري مقرها قبرص، لتتبع وجمع قياسات الكهرباء. ويوفر هذا النظام أيضًا طريقة عملية لتعويض البصمة الكربونية.",
  "1. Monitoring surplus energy generation": "1. مراقبة توليد الطاقة الفائضة",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "وفي مبنى مكاتب شركة BBF، تم تركيب العديد من الألواح الشمسية ودمجها في نظام Solarweb، مما يتيح جمع التحليلات بسهولة. يوفر النظام بيانات عن استهلاك الكهرباء الإجمالي للمبنى والكهرباء المولدة بواسطة الألواح الشمسية. ومع ذلك، فإن الميزة الأساسية المفقودة هي القدرة على تعويض البصمة الكربونية الناتجة عن استهلاك الكهرباء بشكل يتجاوز ما تولده الألواح الشمسية.",
  "2. Converting excess energy power to CO2 offset": "2. تحويل الطاقة الزائدة إلى تعويض ثاني أكسيد الكربون",
  "When the concept extends beyond the office": "عندما يمتد المفهوم إلى ما هو أبعد من المكتب",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "يوفر هذا المفهوم طرقًا عديدة لتوسيع الفكرة. وتم تنفيذه بنجاح في Polkadot Web3 Hub خلال المنتدى الاقتصادي العالمي لعام 2022 في دافوس. تمكن المشاركون من تقديم طلبات القهوة وتحديد نوع القهوة المرغوبة (على سبيل المثال، اسبريسو، أمريكانو، كابتشينو) عن طريق إرسال كمية معينة من الرموز. دعونا نشارك الصور ومقاطع الفيديو من هذا الحدث:",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "إن الحصول على بيانات حول إجمالي استهلاك الكهرباء وإنتاج الكهرباء من الألواح الشمسية يسمح بإجراء حساب مباشر للبصمة الكربونية. من المفترض أن الكهرباء الناتجة عن الألواح الشمسية لها بصمة كربونية تبلغ 0، مما يعني أن التعويض ضروري فقط للكهرباء الزائدة المستهلكة بما يتجاوز ما تولده الألواح الشمسية",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "من الجدير بالذكر أن انبعاثات ثاني أكسيد الكربون تختلف بين البلدان. ففي قبرص، يبلغ متوسط التلوث 587 جم/كيلوواط ساعة، وفقًا لهانا ريتشي وماكس روزر وبابلو روسادو (2022) - \"الطاقة\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "لتعويض البصمة الكربونية، يتم استخدام أرصدة الكربون، حيث يمثل كل رصيد 1 طن من ثاني أكسيد الكربون. وتلعب هذه الاعتمادات دوراً حيوياً في تعويض الأثر البيئي الناجم عن استهلاك الكهرباء بما يتجاوز مساهمة الألواح الشمسية.",
  "3. Managing blockchain-verified carbon footprint offset": "3. إدارة تعويض البصمة الكربونية التي تم التحقق منها بواسطة blockchain",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "وبالتالي، مع التسلح ببيانات حول استهلاك الطاقة، وإنتاج الألواح الشمسية، ومعامل قبرص، يصبح من السهل تحديد عدد الرموز المطلوبة لتعويض البصمة الكربونية.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "ولتحقيق ذلك، قمنا بدمج Raspberry Pi، وقمنا بتكوين Home Assistant لجمع البيانات التحليلية، وقمنا بتطوير تكامل لتعويض البصمة. تعرض لوحة معلومات الطاقة الخاصة بـ Home Assistant التفاصيل التالية:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "علاوة على ذلك، يعمل التكامل لدينا على تحسين النظام من خلال تقديم لوحة تحكم ملائمة لعرض الإحصائيات وتحفيز التعويض:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "وفيما يلي مثال توضيحي لكيفية حدوث تعويض البصمة الكربونية من خلال التكامل لدينا. عند الانتهاء بنجاح،",
  "transaction": "عملية",
  "unfolds as follows:": "تتكشف على النحو التالي:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "إن تقليل استخدام الطاقة في المكتب لا يقل أهمية عن التعويض عن انبعاثات الكربون. يمكننا تحقيق ذلك من خلال إجراء تغييرات صغيرة مثل استخدام الإضاءة والأجهزة الموفرة للطاقة والحفاظ على صيانة المعدات المكتبية بشكل جيد.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "يعد استهلاك الطاقة جزءًا كبيرًا من بصمتنا الكربونية، ويجب على الشركات القيام بدورها لتكون أكثر صداقة للبيئة. إن وجود نظام يتتبع استخدام الطاقة ويساعد على تعويض انبعاثات الكربون يمكن أن يقلل بشكل كبير من تأثير مبنى المكاتب على البيئة. ومن خلال اعتماد النهج الصحيح، يمكن للشركات المساهمة في مستقبل أكثر اخضرارًا.",
  "The way forward": "الطريق الى الامام",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "\"Robonomics Coffee\" هي ماكينة قهوة ذكية مدمجة في شبكة Robonomics. يهدف هذا المشروع إلى توضيح إمكانات Robonomics في مجال إنترنت الأشياء من خلال مثال واقعي.",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "الأساس هنا هو أن المبادئ الاقتصادية الحرة كافية للعيش في عالم آلي. يمكن للروبوتات أن تكون أصدقائنا، ولا نحتاج إلى المركزية لجعلها مريحة وموثوقة.",
  "We have put together Robonomics logos and guidelines to show how you may use it.": "لقد قمنا بتجميع شعارات وإرشادات Robonomics لإظهار كيفية استخدامها.",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics.": "نستخدم هذه الألوان في واجهاتنا ومطبوعاتنا ومرئياتنا الأخرى. </br> استخدمه لشرائحك ولافتات المنشورات وما إلى ذلك التي تتحدث عن Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "تكامل Fronius Solar.web مع Home Assistant",
  "RUST for ROS2": "الصدأ لـ ROS2",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "أحد أهدافنا في تطوير هذه الحالة هو تحويل Robonomics إلى ROS 2 Middleware. وهذا سيسمح لنا باستخدام Robonomics on Substrate لإنشاء تطبيق dapp يمكنه تشغيل ROS 2 مباشرة من المتصفح!",
  "Blockchain-powered smart coffee machine": "ماكينة صنع القهوة الذكية التي تعمل بتقنية Blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "قهوة Robonomics - هي ماكينة قهوة ذكية مدمجة في شبكة Robonomics. يهدف هذا المشروع إلى إظهار إمكانات Robonomics في مجال إنترنت الأشياء من خلال مثال واقعي",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "هذه القضية قيد التنفيذ حاليًا؛ لا تفوت الأخبار - اشترك للحصول على التحديثات في المربع أدناه"
}