{
  "What is Robonomics network?": "ما هي شبكة Robonomics؟",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics هي منصة مفتوحة المصدر لتطبيقات الإنترنت الأشياء التي تمكن تبادل المعلومات التقنية والاقتصادية في شكل معاملات ذرية بين تطبيقات المستخدم وخدمات الإنترنت الشياء والروبوتات المعقدة.",
  "Serverless IoT applications for users": "تطبيقات إنترنت الأشياء بدون خادم للمستخدمين",
  "or": "أو",
  "Timeline": "الجدول الزمني",
  "User (D)App": "تطبيق المستخدم (D)",
  "Function request": "طلب وظيفة",
  "Report": "تقرير",
  "Control": "التحكم",
  "Log": "سجل",
  "IoT Device": "جهاز الإنترنت من الأشياء",
  "Decentralized application": "تطبيق لامركزي",
  "Digital twin": "توأم رقمي",
  "IoT / Smart device": "جهاز الإنترنت من الأشياء / الجهاز الذكي",
  "Robonomics tokenomics": "توكينوميكس روبونوميكس",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "هو توكن الخدمة الذي سيتيح التحكم في أجهزة الإنترنت المشتركة على شبكة إيثريوم وشبكة روبونوميكس الفرعية في بيئة بولكادوت.",
  "Token distribution": "توزيع التوكن",
  "The task": "المهمة",
  "Try our Dapp": "جرب تطبيقنا",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "يمكنك تشغيل XRT داخل سلاسل الكتل باستخدام الأدوات المقدمة من قبل فرق مستقلة مختلفة في مجتمعات بولكادوت (كوساما) وإيثريوم.",
  "Within the Kusama network, you have the capability use": "في شبكة كوساما، لديك القدرة على استخدام",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "الاتصال بين شبكة روبونوميكس الفرعية وشبكات فرعية أخرى باستخدام تطبيقات مركزية مختلفة (dApps):",
  "Be aware of scammers": "كن حذراً من النصابين",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "يرجى استخدام الأسواق المعروفة فقط لتبادل XRT. لا ترسل رموزك إلى حسابات يتم تزويدك بها في رسائل خاصة بغض النظر عن العملية التي ترغب في تنفيذها (شراء أو بيع الرمز). إذا تلقيت أي 'يانات صاخبة' حول توكن روبونوميكس (يستخدم النصابون في كثير من الأحيان إعلانات مثل الإسقاط الجوي)، يرجى التحقق من هذا الموقع (https://robonomics.network/) أو من",
  "for official updates. Be careful, be safe.": "للحصول على التحديثات الرسمية. كن حذراً، كن آمناً.",
  "XRT in Ethereum": "XRT في إيثريوم",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "عند تنفيذ مشروع روبونوميكس في الفترة من 2015 إلى 2018، كان على فريق المشروع أن يجد اتصالًا بين توفير وظيفة مفيدة من قبل شبكة روبونوميكس، وهي إطلاق أجهزة الإنترنت المشتركة وفقًا لنموذج الروبوت كخدمة، وتعويض مقدمي روبونوميكس عن رسوم الغاز في إيثريوم. كان علينا أن نفكر في دورة حياة مسؤولية كل جهاز ذكي فردي لأداء خدمة. نتيجة للبحث والتطوير المبكر في روبونوميكس، وجد الفريق آلية لتعدين توكنات جديدة لمكافأة كل عقد ذكي لروبوت كخدمة تم إنشاؤه. هذا النموذج لا يزال قابلاً للتطبيق في مستقبل روبونوميكس على إيثريوم، ولكن فقط مع تحسينات كبيرة في إيثروم.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "اقرأ هذا لمعرفة الخلفية التاريخية والخطط الطويلة الأجل للفريق لـ XRT في بيئة إيثريوم.",
  "Etherscan profile": "ملف Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "عرض عقد توكن وعمليات التداول في شبكة إيثريوم هنا.",
  "Coingecko markets": "أسواق Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "هنا يمكنك العثور على أسواق CEX و DEX لتداول XRT.",
  "XRT In Polkadot": "XRT في بولكادوت",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "عند الانتقال من إيثريوم إلى بولكادوت، نحتاج إلى عملية 'توسيع' في توكينوميكس. الفرعيات في بيئة بولكادوت ليست مكافئة لعقد ذكي، بل هي سلسلة كتل قابلة للبرمجة بالكامل تستأجر جزءًا من الشبكة العامة.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "الدفع الفعلي من جانب فرعيات بولكادوت وكوساما هو ربط طويل الأجل لرموز سلسلة الإرسال الأصلية (DOT / KSM) بكمية كافية للفوز في إحدى المزادات. يدعم XRT في شبكة روبونوميكس تجديد الفتحة ومكافآت لأصحاب المصلحة. تم تصميم آلية حرق XRT الأساسية التي تدعم تنشيط اشتراكات الإنترنت المشتركة لتقليل التضخم إلى الحد الأدنى، وفي حالة زيادة الاهتما إلى الصفر.",
  "Learn more": "تعلم المزيد",
  "in Twitter thread from our network architect.": "في سلسلة تغريدات تويتر من مهندس الشبكة لدينا.",
  "Usage:": "الاستخدام:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "يمكن استخدام XRT لدفع الرسوم عند تنفيذ المعاملات على الفرعية أو لشراء اشتراك في الإنترنت المشتركة يضمن معالجة الأجهزة الذكية أو معاملات المستخدم على الإنترنت المشتركة بأولوية.",
  "Rewards:": "المكافآت:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "طوال العام، تصدر الفرعية كمية صغيرة من XRT لتحفيز مجمعي الفرعية.",
  "The parameter of the total reward": "يتم تحديد معلمة المكافأة الإجمالية",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "لمجمعي الفرعية للعام من خلال التصويت على السلسلة، ويمكن تغييرها من خلال إجراء استفتاء.",
  "Use XRT": "استخدم XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "اشترك في الإنترنت المشتركة في تطبيقنا المركزي. تحكم في أجهزتك الذكية عبر البلوكشين دون أي شركة مركزية تراقب.",
  "Subscan profile": "ملف Subscan",
  "View token statistics on top of Polkadot ecosystem.": "عرض إحصاءات التوكن على رأس بيئة بولكادوت.",
  "Other questions": "أسئلة أخرى",
  "What is RWS?": "ما هو RWS؟",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[تحت تطوير الوظائف الأساسية] سيحاول فريق المطورين الأساسيين تقديم نماذج استخدم مختلفة لروبونوميكس والخطوة الأولى في هذا الاتجاه هي إطلاق رمز اشتراك مدى الحياة - رمز RWS. سيمنحك كل رمز RWS معاملة واحدة في الثانية (tps) من / إلى جهاز الإنترنت المشترك الخاص بك عبر شبكة روبونوميكس الفرعية. قم بتنشيط رمز RWS الخاص بك وقم بإجراء معاملات 'الغاز المجاني' مع تنفيذ مسبق وتأخير قابل للتنبؤ. قم بإلغاء تنشيط رمز RWS الخاص بك وتداوله على DEX.",
  "What is AIRA/AIR ID?": "ما هو AIRA / AIR ID؟",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "تم توزيع رمز Pre-XRT في عام 2017 كجزء مستقل من بنية روبونوميكس المستقبلية على إيثريوم. بعد إطلاق ناجح لروبونوميكس على إيثريوم في عام 2019، تم ربط رموز AIRA بالبنية التحتية التي تم إنشاؤها للمشروع من خلال",
  "ambix smart contract": "عقد ذكي ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "الذي ضمن عملية تبادل Pre-XRT إلى ERC-20 XRT بشكل مستقل ومستقل.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "هدف رمز روبونوميكس هو ضمان تشغيل شبكة لامركزية لصيانة المدن الذكية وصناعة 4.0 في بنية البلوكشين. من أجل تحقيق هذا الهدف، يحتاج الاقتصاد الرمزي إلى أن يعكس الحوافز لتنفيذ الشبكة.",
  "In addition": "بالإافة إلى ذلك",
  "Within the Ethereum network you can use decentralized application powered by the": "يمكنك استخدام التطبيقات اللامركزية التي تعمل بواسطة شبكة إيثيريوم",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "تعمل التطبيقات اللامركزية (dapp) ضمن تقنية البلوكشين. إنها مفتوحة المصدر وتقدم بياناتها على IPFS و Github. تتيح هذه التقنيات للتطبيق أن يكون آمنًا وشفافًا في نفس الوقت. يعمل مطورونا على تطوير تطبيق Robonomics والمكتبات التي يمكنك استخدامها عند بناء تطبيقك الخاص.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "التوأم الرقمي هو أحد الأدوات التي يوفرها خدمات Robonomics على الويب (RWS). يعمل كنسخة رقمية من المعدات الحقيقية وينسخ جميع الخصائص التقنية لها. يتيح ذلك جعل التطبيق اللامركزي أكثر استجابة لأوامر المستخدم.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "يمكنك استخدام Robonomics مع مجموعة واسعة من أجهزة Zigbee الذكية لتحسين ومراقبة جوانب مختلفة من منزلك / مكتبك أو استخدامها مع الروبوتات القائمة على ROS لمهام صناعية أكثر تعقيدًا.",
  "Do Androids Dream of Electric Sheep?": "هل الروبوتات تحلم بالخرافة الكهربائية؟",
  "Additional icons for the wallpaper:": "أيقونات إضافية للخلفية:",
  "Adding you to our special list...": "إضافتك إلى قائمتنا الخاصة...",
  "Nice, you are in the list": "جيد، أنت في القائمة",
  "Something went  wrong. Try again later": "حدث خطأ ما. حاول مرة أخرى لاحقًا",
  "Your email": "بريدك الإلكتروني",
  "Robonomics nfts": "روبونوميكس NFTs",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "هنا، قمنا بتجميع مجموعة من NFTs التي تم إصدارها خلال رحلتنا الطويلة في عالم العملات المشفرة، سواء بشكل مستقل أو مع فرق رائعة. توفر هذه الرموز الفريدة ملكية قابلة للتحقق على سلسلة الكتل وتعد زينة رائعة لحسابك على سلسلة الكتل. يمكنك المزايدة على بعضها في المزاد أو حتى إصدار قطعة فريدة خاصة بك.",
  "Robonomics Pioneer": "روبونوميكس Pioneer",
  "1. Robonomics Pioneer": "1. روبونوميكس Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "خلال حملتنا الأولية لجمع التبرعات على منصة كوساما، قررنا مكافأة المساهمين الذين ساهموا في مشروعنا العملات المشفرة بأكثر من مجرد الرموز - قمنا أيضًا بإهدائهم NFT ملونة رائعة. تحمل هذه البطاقة معنى كبير بالنسبة لنا، وإذا كانت بحوزة شخص ما، فإننا نعلم أنه مؤيد رائع لقيم روبونوميكس: الحرية واللامركزية.",
  "Robonomics crypto girls": "روبونوميكس crypto girls",
  "2. Robonomics crypto girls": "2. روبونوميكس crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "يسعدنا أن نقدم لكم سلسلة خاصة من الأصول الرقمية - روبونوميكس Crypto Girls، التي تم إنشاؤها بواسطة فريق روبونوميكس للفنون والعلوم. كل NFT في هذه المجموعة هو تمثيل رسومي فريد للتكنولوجيا المستخدمة في روبونوميكس أو المبنية على أعلى استخدامات روبونوميكس. قام فنانونا الموهوبون برسم كل فتاة بأسلوب روبونوميكس المميز. يمكنك اختيار تلك التي تتناسب معك أو جمع المجموعة بأكملها! من خلال شراء هذه الرموز الرقمية، فإنك لا تضيف فقط إضافة أنيقة لمجموعتك، بل تدعمنا أيضًا في الاستمرار في الابتكار وتنفيذ الاتصال غير المركزي للروبوتات. ترقبوا الإضافات الجديدة للمجموعة!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. مجموعات NFT الموسمية",
  "On demand minting": "إصدار حسب الطلب",
  "SEASONAL SPOT NFT COLLECTIONS": "مجموعات NFT الموسمية",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "تمثل هذه المجموعات الموسمية من الرموز الرقمية أصولًا رقمية فريدة تلتقط التفاعل الفريد بين المستخدم والروبوت داخل سلسلة كتل روبونوميكس. يمكن للمستخدمين رسم أي شيء على المتصفح، وسيقوم الروبوت بتكرار حركاتهم لإنشاء صورة مرسومة باليد. بمجرد اكتمال التفاعل، يتم إصدار الرمز الرقمي على منصة سينغولار لحساب بولكادوت الخاص بالمستخدم. الآن، يمكن لأي شخص التفاعل مع روبوت حقيقي يقع في مختبر في كاليفورنيا لإنشاء أصول رقمية شخصية وفريدة يمكن امتلاكها وشراؤها وبيعها مثل أي أصل رقمي آخر.",
  "Create your NFT": "أنشئ رمزك الرقمي",
  "4. automated telescope collection": "4. مجموعة التلسكوب الآلي",
  "automated telescope collection": "مجموعة التلسكوب الآلي",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "يمكن الوصل إلى تلسكوب فعلي في صحراء أتاكاما في تشيلي من خلال تطبيق لامركزي لالتقاط صور فورية للكائنات الفلكية في الفضاء العميق. يمكن لأي مستخدم يمتلك اتصالًا بالإنترنت الوصول إليه باستخدام رموز $STRGZN، والتي يمكن شراؤها في التطبيق باستخدام بطاقة ائتمان. حدد كائنًا فلكيًا، وأرسل أمرًا إلى التلسكوب لالتقاط صورة، وانتظر إصدار الرمز الرقمي على منصة سينغولار. يرجى ملاحظة أن التطبيق متاح فقط للاستخدام من الساعة 11 مساءً حتى 6 صباحًا بتوقيت غرينتش-3 بسبب ساعات تشغيل التلسكوب.",
  "Try yourself": "جرب بنفسك",
  "5. Robonomics Polka pet": "5. روبونوميكس بولكا بيت",
  "In collaboration with Polkapets": "بالتعاون مع بولكابيتس",
  "and": "و",
  "Robonomics Polka pet": "روبونوميكس بولكا بيت",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "كعضو فخور في نظام بولكادوت البيئي، شاركت روبونوميكس في عالم بولكابيتس. بالتعاون مع فريق بولكابيتس، قمنا بإصدار 1200 رمز رقمي يتميز بمفهوم تصميم فريد يعكس فكرتنا الأساسية للاتصال. لتحقيق هذه الكرة، قمنا بإنشاء شخصية: أندرويد متخصص في مساعدة البشر على التواصل مع أي كيان روبوتي.",
  "6. Mecha Arm Jetpack": "6. حزمة الجت باك Mecha Arm",
  "Mecha Arm Jetpack": "حزمة الجت باك Mecha Arm",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "في عام 2021، بدأت روبونوميكس التزامًا بدعم إضافة لوحات RMRK إلى برنامج التشغيل الخاص بها، مما سيؤدي إلى التكامل الأصلي مع أكثر منطق NFT متقدم في العالم. للاحتفال بهذا الإنجاز الملحوظ، قمنا بإطلاق عنصر خاص متوافق مع كاناريا - NFT للأطفال يمكن تجهيزه على طائر كاناريا الخاص بك، وقد يوفر مزايا في عالم RMRK.",
  "RMRK Partnerships": "شراكات RMRK",
  "Robonomics wallpapers": "خلفيات روبونوميكس",
  "Regular wallpapers": "خلفيات عادية",
  "Wallpapers for phones": "خلفيات للهواتف",
  "Hidden wallpapers": "خلفيات مخفية",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "بدأ العام بإنجاز كبير - فازت Robonomics بالمزاد العشرين من Parachain ",
  "officially became": "وأصبحت رسميًا ",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "Parachain بهوية 2048 على شبكة Kusama Network. الإطلاق ، سجل البيانات ، DigitalTwin ، وظائف المسؤولية واشتراكات إنترنت الأشياء متاحة الآن لجميع مستخدمي النظام البيئي. لتقديم تفاصيل عن هذه المرحلة من المشروع ، نشر الفريق الأساسي الفصول الأولى من ",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "تم إصدار Robonomics 2.0 على ركيزة مع دعم رسائل XCM ، وبدأنا في فتح قنوات HRMP باستخدام مظلات أخرى (مثل Crust Shadow و Darwinia ) ، التي تعتبر وظائفها مفيدة جدًا لنا.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "في الوقت نفسه، قمنا بفتح استراتيجية لإدخال سوق الإنترنت من الأشياء إلى بروتوكولنا. أدت تجاربنا مع معدات الإنترنت من الأشياء إلى مفهوم المنزل الذكي السيادي، الذي يعتمد على مزودي خدمات السحابة المركزية. لقد قمنا بتطوير",
  "integration": "التكامل",
  "with the Home Assistant automation system, and also designed our own": "مع نظام الأتمتة المنزلية المساعد، وصممنا أيضًا",
  "IoT gateway": "بوابة الإنترنت من الأشياء",
  "for connecting smart devices.": "لربط الأجهزة الذكية.",
  "We have launched two big initiatives in order to increase community engagement —": "لقد أطلقنا مبادرتين كبيرتين من أجل زيادة مشاركة المجتمع - أكاديمية",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "وبرنامج سفير Robonomics",
  "Additionally,": "بالإضافة إلى ذلك، تم عقد ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "في الخريف حتى يتمكن مجتمع Robonomics من تجربة آليات الحوكمة لدينا لأول مرة. في الآونة الأخيرة، ساعد فريق Robonomics مشروع DAO IPCI في الحصول على فتحة Parachain لتقديم خدمة تعويض الكربون للمباني الذكية.",
  "In 2021, our": "إلى إعداد المشروع بحيث يمكن استخدام تطبيقات إنترنت الأشياء عبر باراشين الخاص بنا على شبكة ",
  "main focus": "تركيزنا الرئيسي",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "في عام 2021 ، تحول Kusama. تم إصدار Robonomics 1.0 على Substrate ، ونحن نختبر توصيل أجهزة الاستشعار بالباراشين لإرسال بيانات القياس عن بُعد ، بالإضافة إلى تطوير وظيفة التوأم الرقمي. في منتصف العام ، قررنا اختبار الدورة الكاملة لشبكتنا وأنشأنا سلسلة الترحيل الخاصة بنا والتي تسمى ، والتي تم دمج Robonomics parachain فيها (قبل ترحيلها إلى سلسلة Kusama للتتابع). كان هناك الكثير من ",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "لتركيز على الحصول على فتحة باراشين في كوساما ، والتي نظمنا من أجلها عدة حملات جماعية.",
  "There have been two big changes for the community. First, we launched the": "،والذي يسمح لمشاريع Web3 والروبوتات وإنترنت الأشياء بتلقي التمويل ",
  "Robonomics Grant Program": "برنامج منح علم الروبوتات",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "كان هناك تغييران كبيران للمجتمع. أولاً ، أطلقنا ، مما سمح لحاملي توكنات ",
  "Exodus process": "Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "لمهام البحث والتطوير. بحلول نهاية العام ، شاركت أربعة مشاريع نشطة في البرنامج. ثانيًا ، بدأ الفريق عملية Ethereum بنقل رموز XRT الخاصة بهم إلى parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "من بين التعاونات، يمكننا أن نتذكر ظهور بوسطن ديناميكس سبوت في ميركلبوت، حيث",
  "rental remote control system": "نظام تحكم عن بعد ",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "من بين أوجه التعاون ، يمكننا أن نتذكر المظهر الرائع لـ Boston Dynamics Spot في MerkleBot ، حيث تم تطوير للتأجير. نود أيضًا أن نعلمك بشأن شركة Multi-Agent Systems وهي مشروع شخصي تم تشكيله بواسطة فريق من مهندسي Robonomics. لقد طوروا خبازًا آليًا للوافل يسمى Eisenkoch يقوم بمهام الطبخ لأصحاب المقاهي.",
  "There came a time when the existing limitations of Ethereum": "(على وجه الخصوص ، ضعف قابلية التوسع والسرعة المنخفضة والتكلفة العالية جدًا",
  "began to stand out clearly": "تبرز بوضوح",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "لقد حان وقت بدأت فيه القيود الحالية لـ Ethereum للمعاملات). كان من المفترض أن تؤدي الترقية إلى ETH2.0 إلى إصلاح الموقف ، ولكن تم تأخير هذه الترقية بشكل متكرر. بينما لم نرغب في مغادرة شبكة Ethereum ، أدركنا أنه في الوضع الحالي كان من الصعب تنفيذ حالات الاستخدام الخاصة بنا ، وبدأنا في البحث عن شبكة بديلة. أصبح النظام الإيكولوجي للبلوكشين المُقسَّم Polkadot هذا البديل. لقد بدأنا بتجربة إطار عمل الركيزة لترحيل ميزات Robonomics الرئيسية ونشر شبكة الاختبار الخاصة بنا. بحلول نهاية هذه المرحلة ، كنا قد نشرنا الباراشين الخاص بنا على شبكة اختبار Rococo وبدأنا في الاستعداد للحصول على فتحة على شبكة Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "بالاستمرار في دراسة أنظمة إنترنت الأشياء ، حددنا الوظيفة الرئيسية لـ Robonomics ، والتي يمكن أن تضيف قيمة للمستخدمين - وظيفة السحابة أخذت البنية الأساسية لـ RWS على عاتقها ",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "اللامركزية لإنترنت الأشياء. شكلت هذه الفكرة أساس جميع وظائف السحابة المركزية النموذجية ، ولكن بدون المشكلات القياسية للتوافر العالمي والأمان والخصوصية. بالإضافة إلى ذلك ، توصلنا إلى فكرة اشتراكات Parachain IoT التي تسمح لأصحاب الاشتراك باستخدام شبكة blockchain دون الحاجة إلى دفع رسوم مقابل كل معاملة. كانت التجربة  الأولى لاشتراكات إنترنت الأشياء هي إصدار رمز RWS ، والذي يسمح لمالكه بإرسال معاملة واحدة لكل كتلة. بالإضافة إلى ذلك ، بدأنا في اتخاذ  الخطوات الأولى لتطوير مجموعة الأجهزة الخاصة بنا للتحكم في الأجهزة الذكية (مفهوم DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": ".. وقد بدأ  ",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "بالطبع ، لم يتوقف دعم Robonomics على Ethereum. تم الانتهاء من حزمة اتصالات Robonomics إلى الإصدار الرمز المميز XRT التداول في العديد من البورصات (على وجه الخصوص ، Uniswap DEX) ، وتم إطلاق برنامج تحفيز السيولة.",
  "The team actively developed ways to interact with the community. The first version of our": "طور الفريق بنشاط طرقًا للتفاعل مع المجتمع. تم إطلاق الإصدار الأول من موقع",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "الخاص بنا و Robonomics Wiki. من أجل إدارة مشروع أكثر شفافية وملاءمة ، بدأنا في استخدام",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "استضفنا",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "في عام 2019 للقادمين الجدد إلى المشروع.",
  "Robonomics became the foundation for the": "أصبحت Robonomics أساسًا لـ",
  "RoSeMAN": "RoSeMAN.",
  "MerkleBot": "MerkleBot ،",
  "project, which is developing a system for smart leasing of robotic equipment.": "الذي يعمل على تطوير نظام للتأجير الذكي للمعدات الروبوتية.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "لقد فهمنا أن الوكلاء المستقلين يحتاجون إلى بيئة تضمن عملياتهم التقنية والاقتصادية الموثوقة. لعدة سنوات، كنا نطور بروتوكولًا لإنشاء شبكة لامركزية من مقدمي الخدمات التي تساعد الوكلاء الروبوتيين على تقديم خدماتهم. تم تطوير أدوات لصيانة الشبكة ومجموعة الاتصالات بين Ethereum و  وتم إطلاق نسخة alpha من Robonomics Network على شبكة",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "ROS. في عام 2018، نشرنا Ethereum الرئيسية. استمرت الاستعدادات النشطة لحدث توليد الرموز XRT (والذي حدث في النهاية في ربيع عام 2019 بسبب شتاء التشفير الأول).",
  "Important news &amp; announcements": "أخبار مهمة وإعلانات",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "بدأت روبونوميكس في تطوير حالات الاستخدام المتعلقة بالصناعة 4.0 - المصانع الذكية والمدن الذكية والمنازل الذكية - وهذا جلب اهتمامنا الكبير بعالم الإنترنت من الأشياء. في البحث عن الابتكار، قدم الفريق عدة عروض تجريبية كبيرة وفريدة من نوعها:",
  "sensor network": "شبكة أجهزة الاستشعار",
  "a water drone": "طائرة مائية",
  "for environmental monitoring (supported by a sensor systems manufacturer": "لمراقبة البيئة (بدعم من شركة تصنيع أنظمة الاستشعار)",
  "a smart factory model": "نموذج مصنع ذكي",
  "a self-employed": "فنان روبوتي ذاتي العمل جاكا-تشو",
  "robot artist Gaka-chu": "و",
  "and a": "نظام إدارة حركة الطائرات بدون طيار",
  "drone traffic management system": "بدأت روبونوميكس التعاون مع مشروع داو إي بي سي آي على إدارة الأصول البيئية باستخام تقنيات الويب3 وأجهزة الإنترنت من الأشياء",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "بدأت Robonomics التعاون مع مشروع DAO IPCI في إدارة الأصول البيئية باستخدام تقنيات web3 وأجهزة إنترنت الأشياء.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "كانت هذه فترة بحث وتطوير نشط حددنا خلالها مجموعة من المهام، حيث تتمتع تقنيات p2p بقدرات لم تكن متاحة من قبل للروبوتات. بدمج كمبيوتر في المقابل، فتح",
  "autonomous intelligent robot agent": "يصبح وكيل روبوت ذكي مستقل",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Ethereum وتخزين ملفات IPFS ونظام تشغيل الروبوت (ROS)، أدركنا أن أي جهاز يمكن أن هذا الطريق أمامنا لمفاهيم الروبوت كخدمة واقتصاد الروبوت.",
  "Our publications in scientific journals of this period are available in the": "الاستخدام ",
  "Papers section": "كتاب سه",
  "We have collected all R&D projects over the years in the": "لقد جمعنا جميع مشاريع البحث والتطوير على مر السنين في كتاب سهل",
  "a handy book": "كتاب سهل الاستخدام",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "بدأ كل شيء بفكرة ظهرت على المؤسسين عندما أطلقت Ethereum للتو شبكتها الرئيسية. ماذا لو كان الروبوت يؤدي مهمة لعميل للعملة المشفرة، ويتم التحكم في منطقه من خلال عقد ذكي ؟",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "لاختبار الفكرة، قمنا بعمل عرض توضيحي تم فيه إطلاق طائرة بدون طيار يتحكم فيها جهاز كمبيوتر Ethereum لتحقيق إحداثيات GPS المحددة بعد أن أكمل المستخدم معاملة الدفع.",
  "The demo is available on": "العرض التوضيحي متاح على ",
  "YouTube": "YouTube",
  "Notable events": " الأحداث البارزة",
  "This page is out of your space": " هذه الصفحة خارج مساحتك",
  "Github": "جيت هاب",
  "All posts": "جميع المشاركات",
  "I agree to receive emails": "أوافق على استلام رسائل البريد الإلكتروني",
  "Send": "إرسال",
  "Thanks, your application has been sent!": "شكرًا، تم إرسال طلبك!",
  "R&D cases": "حالات البحث والتطوير",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "التعاون مع مطور عقاري في قبرص لتتبع التوزيع اليومي واستهلاك الكربون الناتج وتعويض أي زيادة في الأثر الكربوني.",
  "Check url once more or create an": "تحقق من عنوان URL مرة أخرى أو أنشئ",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "وأخبرنا أنك واجهت خطأ 404 (لا تنسى أن تذكر عنوان URL الحالي)",
  "Robonomics architecture": "هندسة Robonomics",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "بعد ذلك، نود أن نعرض لك المجالات العملية للتفاعل بين الإنسان والآلة باستخدام تكنولوجيا الإنترنت الحديثة. سننتقل من معمارية جهاز IoT المألوفة لتبادل المعلومات التقنية من خلال خدمات السحابة إلى تنظيم التفاعل التقني-الاقتصادي من خلال شبكة لامركزية ومتاحة عالميًا من المزودين.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "للبدء، نحتاج إلى جولة في المجال الذي يرتبط بشكل واضح باتصال الشبكة بالأنظمة المؤتمتة. بعد ذلك، سنلقي نظرة على أساسيات إنترنت الأشياء لتسليط الضوء على المشاكل والتحديات الرئيسية التي يواجهها مبتكرو أنظمة IoT والتي يهدف Robonomics إلى حلها.",
  "Overview of the state of the internet of things (IoT)": "نظرة عامة على حالة إنترنت الأشياء (IoT)",
  "Robot and electrics sheep artboard": "لوحة فن الروبوت والخروف الكهربائي",
  "Robot and apple artboard": "لوحة فن الروبوت والتفاحة",
  "Robot and cosmonaut artboard": "لوحة فن الروبوت والرائد الفضائي",
  "Robot and cat artboard": "لوحة فن الروبوت والقطة",
  "Space travelers artboard": "رحالة الفضاء لوحة فنية",
  "Coloured astronaut artboard": "رائد الفضاء الملون لوحة فنية",
  "Black and white astronaut artboard": "رائد الفضاء الأبيض والأسود لوحة فنية",
  "icons for macos": "أيقونات لنظام التشغيل macOS",
  "icons for windows": "أيقونات لنظام التشغيل Windows",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "ألكسندر كابيتونوف ، سيرجي لونشاكوف ، فيتالي بولاتوف ، باباك كيا مونتازام ، جيمس وايت",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "إيفان بيرمان ، إنريكا زيريك ، ألكسندر كابيتونوف ، فابيو بونسينيوريو ، عليشير خسانوف ، عزيزة أوريبوفا ، سيرجي لونشاكوف ، فيتالي بولاتوف",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "فاديم ماناينكو ، ألكسندر كابيتونوف ، إيفان بيرمان",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "ألكسندر كابيتونوف ؛ إيفان بيرمان ؛ فاديم ماناينكو ؛ فياتشيسلاف رزهفسكي ؛ فيتالي بولاتوف ؛ أرتيمي زينكين",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "إيليا أفاناسيف ، ألكساندر كولوتوف ، روسلان ريزين ، كونستانتين دانيلوف ، مانويل مازارا ، سوبهام تشاكرابورتي ، أليكسي كاشيفنيك ، أندريه تشيتشولين ، ألكسندر كابيتونوف ، فلاديمير جوتسوف ، أندون توبالوف ، نيكولا شاكيف ، سيفيل أحمد",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "ألكسندر كابيتونوف ، سيرجي لونشاكوف ، إيفان بيرمان ، إدواردو كاستيلو فيرير ، فابيو ب بونسينيوريو ، فيتالي بولاتوف ، ألكسندر سفيستوف",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "ألكسندر كابيتونوف ، إيفان بيرمان ، سيرجي لونشاكوف ، ألكسندر كروبينكين ، فيتالي بولاتوف",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "كونستانتين دانيلوف ؛ روسلان ريزين ؛ إيليا أفاناسيف ؛ ألكساندر كولوتوف",
  "Alastair Marke": "ألاستير مارك",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "سيرجي لونشاكوف ، ألكسندر كروبينكين ، ألكسندر كابيتونوف ، يفجيني رادتشينكو ، عليشير خسانوف ، ألكسندر ستاروستين",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "ألكسندر كابيتونوف ، إيفان بيرمان ، سيرجي لونشاكوف ، ألكسندر كروبينكين",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "ألكسندر كابيتونوف ، إيفان بيرمان ، فيتالي بولاتوف ، سيرجي لونشاكوف ، ألكسندر كروبينكين",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "أنتون غالينوفيتش ، سيرجي لونشاكوف ، أليكسي شادرين",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "ألكسندر كابيتونوف ، سيرجي لونشاكوف ، ألكسندر كروبينكين ، إيفان بيرمان",
  "The latest Robonomics news here.": "أحدث أخبار Robonomics هنا.",
  "Follow us": "تابعنا",
  "Video tutorials, screencasts, interviews, events.": "الفيديوهات التعليمية والتسجيلات الشاشة والمقابلات والفعاليات.",
  "Watch videos": "شاهد الفيديوهات",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "تحدث معنا ومع مجتمعنا. لا تتردد في طرح أي أسئلة ومناقشة اقتراحاتك.",
  "Join chat": "انضم للدردشة",
  "Medium Blog": "مدونة Medium",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "رؤيتنا للماضي والحاضر والمستقبل حول Robonomics وشبكات Ethereum و Polkadot والأسواق الخضراء والروبوتات وكل ما يتعلق بـ Robonomics.",
  "Read": "اقرأ",
  "Telegram chat": "دردشة Telegram",
  "Local communities & news. You are welcome!": "المجتمعات المحلية والأخبار. أهلا بك!",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "هنا، يمكنك العثور على أول ورقة بيضاء حول علم الروبوتات وتنزيلها (مجانًا تمامًا بالطبع)، والتي تم تقديمها في مايو 2018. وعلى الرغم من تطور الكثير منذ ذلك الحين، إلا أن أساسيات علم الروبوتات لا تزال موضحة في هذه الورقة.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "جاكا تشو: فنان روبوت مستقل يعمل لحسابه الخاص",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "التوطين التعاوني الخالي من التدرج وتتبع الحدود البيئية المتحركة بواسطة فرق من الروبوتات غير الشاملة",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "الروبوت كخدمة: من السحابة إلى تقنيات التناظر",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "مراقبة بيئية موثوقة عن طريق شبكات الاستشعار على متن السفن البحرية المستقلة وتكنولوجيا السجلات الموزعة",
  "Digital Passport for Unmanned Vehicles": "جواز السفر الرقمي للمركبات غير المأهولة",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics كمنصة قائمة على Blockchain لإدارة حركة المرور غير المأهولة للمركبات المتنقلة",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "نحو أنظمة روبوتية متعددة الوكلاء تعتمد على تقنية blockchain: التحليل والتصنيف والتطبيقات",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "الخدمات الروبوتية للمدن الذكية النموذجية الجديدة القائمة على التقنيات اللامركزية",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "بروتوكول تنظيم شبكة الوكلاء المستقلين اللامركزية في المصانع باستخدام آليات السوق",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "نحو علم الروبوتات القائم على blockchain: التحقق من سلوك الوكلاء المستقلين",
  "Transforming Climate Finance and Green Investment with Blockchains": "تحويل تمويل المناخ والاستثمار الأخضر باستخدام Blockchainκ",
  "Robonomics: platform for integration of cyber physical systems into human economy": "الروبوتات: منصة لدمج الأنظمة المادية السيبرانية في الاقتصاد البشري",
  "Blockchain based protocol for economical communication in industry 4.0": "بروتوكول قائم على Blockchain للاتصالات الاقتصادية في الصناعة 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "الروبوتات التي تعتمد على blockchain كمبدأ لإنشاء المصانع الذكية",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "النظام البيئي Blockchain لأسواق الكربون والأصول البيئية والحقوق والالتزامات: تصميم المفهوم وتنفيذه",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "بروتوكول قائم على Blockchain للنشاط التجاري المستقل للأنظمة متعددة الوكلاء التي تتكون من الطائرات بدون طيار",
  "English": "إنجليزي",
  "Russian": "الروسية",
  "Chinese": "صينى",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics عبارة عن منصة مفتوحة المصدر تسهل كلاً من خدمات إنترنت الأشياء البسيطة والروبوتات المعقدة، مما يتيح التواصل الفعال بين الوكلاء، سواء كانوا بشرًا أو آليين. لدمج الروبوتات في هذا النظام، نستخدم ROS. في هذه المقالة، نهدف إلى تقديم نظرة عامة على عمليتنا لدمج Robonomics في ROS 2.",
  "Research papers": "أوراق بحثية",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "وبدون البحث الأكاديمي، فإن تطوير الأنظمة المعقدة التي يمكن دمجها في حياتنا اليومية قد يفقد غرضه أو حتى يشكل مخاطر. يجب علينا أن نفكر بعناية في اتجاهنا وأهدافنا والعواقب المحتملة. إن المجالات التي تعمل فيها الروبوتات، وتحديدًا الروبوتات والعلاقات الاقتصادية وتقنيات Web3، تستحق الدراسة بشكل فردي، واستكشاف كيفية دمجها مع بعضها البعض، وتقييم تأثيرها المحتمل على حياتنا.",
  "Why ROS 2 in Robonomics?": "لماذا ROS 2 في علم الروبوتات؟",
  "Robonomics whitepaper 2022 welcome guide": "دليل الترحيب بورقة عمل روبونوميكس 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "لقد قمنا بتطوير بروتوكول اتصال تكنو-اقتصادي للآلات يعمل فوق منصة إيثريوم و IPFS، ونكمله بعناصر من منصة IoT مستندة إلى بولكادوت باراشين. اليوم، لدينا بالفعل منصة هجينة لإنشاء تطبيقات IoT المستقبلية. إنه يوفر التفاعل مع الأجهزة تحت سيطرة كمبيوتر لامركزي عالمي. قبل أن نبدأ في إنشاء تطبيقات IoT آمنة وخالية من الخوادم ومستقبلية باستخدام منصة روبونوميكس، دعنا نغوص قليلاً في النظرية...",
  "Chapter 1.": "الفصل 1.",
  "At the intersection of cybernetics and economics": "عند تقاطع السيبرنياتيك والاقتصاد",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "قدمنا نظامًا اقتصاديًا يعمل فيه الأجهزة الروبوتية كوكلاء مستقلين قادرين على أداء الأنشطة الاقتصادية الرئيسية التي كانت محجوزة سابقًا للبشر. في هذا الفصل، سنتحدث عن أهمية اقتصاد الروبوت، الذي يمكن أن يصبح جزءًا مهمًا من حياة الناس ويغير المستوى الحالي للاقتصاد إلى خدمات مؤتمتة بالكامل في المستقبل.",
  "In this chapter you will learn": "في هذا الفصل ستتعلم",
  "Ronald Coase and The Nature of the Firm": "رونالد كوز وطبيعة الشركة",
  "CPS - cyber-physical system": "نظام السيبر-فيزيائي (CPS)",
  "Norbert Wiener and the search for patterns in living and machine": "نوربرت وينر والبحث عن الأنماط في الكائنات الحية والآلات",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "الثورة الصناعية الرابعة، المال للروبوتات والبيتكوين",
  "Ethereum Smart Contracts": "عقود إيثريوم الذكية",
  "Polkadot Parachains": "بولكادوت باراشين",
  "Polkadot VS Ethereum 2.0": "بولكادوت مقابل إيثريوم 2.0",
  "Open questions of teleology and Mises' work": "الأسئلة المفتوحة للتليولوجيا وعمل ميسيس",
  "Read chapter 1": "اقرأ الفصل 1",
  "Chapter 2.": "الفصل 2.",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "في الفصل الثاني، ستقرأ عن التفاعل بين الإنسان والآلة باستخدام تكنولوجيا الإنترنت الحديثة - من أجهزة IoT إلى شبكة موفرين متاحة بشكل لامركزي وعالمي. سننظر في أساسيات إنترنت الأشياء من أجل إبراز المشاكل والتحديات الرئيسية التي يواجهها مبتكرو أنظمة IoT والحل الذي يهدف إليه روبونوميكس.",
  "Overview of the state of the Internet of Things (IoT)": "نظرة عامة على حالة إنترنت الأشياء (IoT)",
  "Classification of IoT devices": "تصنيف أجهزة IoT",
  "Embedded IoT systems": "أنظمة IoT المضمنة",
  "Edge-systems: IoT gateways and controllers": "أنظمة الحواف: بوابات ومتحكمات IoT",
  "Autonomous Systems": "أنظمة مستقلة",
  "Internet of Things providers": "موفرون لإنترنت الأشياء",
  "Digital twins are the heart of the Internet of Things": "التوائم الرقمية هي قلب إنترنت الأشياء",
  "IoT data flows in cloud service": "تدفقات بيانات IoT في خدمة السحابة",
  "Popular examples of IoT solutions": "أمثلة شائعة لحلول IoT",
  "Current problems of building IoT solutions": "مشاكل الحالية في بناء حلول IoT",
  "Main tasks of Robonomics architecture": "المهام الرئيسية لهندسة روبونوميكس",
  "Basic components of Robonomics architecture": "المكونات الأساسية لهندسة روبونوميكس",
  "A simple representation of Robonomics architecture": "تمثيل بسيط لهندسة روبونوميكس",
  "Read chapter 2": "اقرأ الفصل 2",
  "We continue to update the white paper of Robonomics": "نحن ما زلنا نحدث ورقة عمل روبونوميكس",
  "stay tuned for new parts on our website and in Discord": "تابعنا للحصول على أجزاء جديدة على موقعنا وفي ديسكورد",
  "Join our discord": "انضم إلى ديسكورد لدينا",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics هي منصة IoT مستقبلية مفتوحة المصدر بنسبة 100٪ ، آمنة ، فعالة من حيث التكلفة ، ومستقبلية لربط الروبوتات تحت التحكم في Polkadot و Ethereum. يمكن لأي شخص بناء خدمات باسخدام Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "فيما يلي قائمة بتطبيقاتنا المثبتة لتقنيات الروبوتات الحديثة.",
  "By interest:": "حسب الاهتمام:",
  "Sort by progress:": "ترتيب حسب التقدم:",
  "Any progress": "أي تقدم",
  "Complete": "كامل",
  "Proceeding": "جارٍ",
  "Sort by time:": "ترتيب حسب الوقت:",
  "Recent": "الأحدث",
  "Earliest": "الأقدم",
  "Show more": "عرض المزيد",
  "Establishing democracy with smart contracts": "إنشاء الديمقراطية باستخدام العقود الذكية",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "لنتخيل مكتبًا صغيرًا يضم فريقًا مكونًا من 10-15 شخصًا. بينما يركز الجميع على المواعيد النهائية الخاصة بهم لمهامهم المهنية الرئيسية ، لا يبدو أن أحدًا يهتم بصيانة مساحة المكتب. الحل الأكثر شيوعًا لتجنب الانغماس في الفوضى هو توظيف أفراد آخرين للدعم. نهج آخر هو اتخاذ المبادرة وفرض عقوبات على أولئك الذين يخلقون فوضى أو يستنفدون الإمدادات دون تجديدها. ومع ذلك ، هل من الأخلاقي أن نعيش تحت الاستبداد في عامنا المستقبلي العملة المشفرة الذي يُتوقع من الجميع أن يكونوا مسؤولين ويتمتعوا بالحرية؟ لنسعى لإنشاء مجتمع ديمقراطي أكثر باستخدام العقود الذكية وجيل جديد من تكنولوجيا الإنترنت (المشار إليها في كثير من الأحيان بـ Web3). نحتاج إلى أدوات يمكن أن تساعدنا في اتخاذ القرارات معًا ، ثم التأكد من أنها تعمل بشكل صحيح دون أن يشارك البشر مباشرة.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'من شرب كل القهوة؟!' أو مأساة المشتركات",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "هناك مفهوم يتم مناقشته على نطاق واسع في الاقتصاد والبيئة والعلوم الأخرى يعرف بـ 'مأساة المشتركات'. يتعلق هذا بسيناريو يقوم فيه الأفراد الذين لديهم وصول إلى مورد مشترك بإعطاء الأولوية لمصالحهم الخاصة ، مما يؤدي في النهاية إلى استنفاد المورد. تشبه القهوة إلى حد كبير مثل هذا المورد ، حيث يتدهور بسبب الاستهلاك غير المضبوط في المكتب. ومع ذلك ، في الوقت نفسه ، عادةً ما لا يميل أي من أعضاء الفريق إلى استثمار وقتهم وأموالهم في الحصول على حزمة إضافية من حبوب القهوة. لذا ، يستمرون في شرب القهوة دون الحصول على إمدادات جديدة.",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "استراتيجية لتحويل آلة القهوة إلى جهاز روبوتي مستقل",
  "How to formulate the task in numbers.": "كيفية صياغة المهمة بالأرقام.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "بفرض ميزانية شهرية للقهوة قدرها 100 دولار ، وهو ما يعادل تقريبًا 150 كوبًا لفريقنا المكون من 10 أشخاص ، فإن هذا يترك لكل شخص كوبًا واحدًا كل يومين. الآن ، دعونا ننغمس في التفاصيل التقنية. السؤال هو: كيف يمكننا إحضار آلة قهوة مستقلة إلى الحياة في المكتب؟",
  "Step 1: automated coffee bean ordering": "الخطوة 1: طلب القهوة الحبوب تلقائيًا",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "لقد قمنا بالاتفاق مع الباريستا ، نيكيتا ، الذي يقع بالقرب من المكتب. سيزودنا بحبوب القهوة عند تلقي تنبيه من الروبوت. يرسل الروبوت رسالة عندما تنخفض كمية القهوة ، محددًا كمية القهوة (بالكيلوجرام) المطلوبة للطلب ومبلغ الدفع المقابل المحدد م قبل الفريق. باستخدام هذه التفاصيل ، يمكن لنيكيتا اختيار القهوة وفقًا لتفضيلاته.",
  "Step 2: automatic access to smart office.": "الخطوة 2: الوصول التلقائي إلى المكتب الذكي.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "بالتزامن مع الطلب ، تقوم آلة القهوة بإنشاء رمز QR. يقدم نيكيتا بعد ذلك رمز الاستجابة السريعة هذا إلى الكاميرا للدخول إلى المكتب.",
  "Step 3: distribution of coffee tokens to the team.": "الخطوة 3: توزيع رموز القهوة على الفريق.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "بمجرد أن تمسح الكاميرا المحلية رمز الاستجابة السريعة ، يقوم نظام إدارة المنزل الذكي ببدء الدفع لنيكيتا وتوزيع رموز القهوة الجديدة بين أعضاء الفريق.",
  "Step 4: drink coffee!": "الخطوة 4: شرب القهوة!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "لكي يتمكن عضو الفريق من الحصول على كوب جديد من القهوة ، يحتاج إلى إرسال رمز القهوة إلى عنوان آلة القهوة.",
  "Coffee beans delivery process:": "عملية تسليم حبوب القهوة:",
  "Unlock new possibilities with this concept": "فتح إمكانيات جديدة بهذا المفهوم",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "علاوة على ذلك ، تقدم مثل هذه الآلة القهوة المؤتمتة أبعادًا اقتصادية واجتماعية مختلفة. دعونا نلقي نظرة عليها:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "يمكن للمطورين إيداع رموز القهوة الإضافية عندما ينخفض الاستهلاك دون الحد المسموح به. يتم بذلك إنشاء نظام شفاف لاستخدام القهوة المتنوع ضمن الحد المسموح به.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "يمكن لآلة القهوة الحفاظ على حساب مشترك ، مما يتيح لأعضاء المكتب المساهمة في الأموال من حساباتهم الشخصية لتجربة قهوة عالية الجودة في المرة القادمة.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "يقرر الفريق بشكل جماعي كمية القهوة التي ستطلبها الآلة في كل مرة من خلال تصويت DAO. يوفر هذا الحرية للتعامل مع التحدي بموارد محدودة.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "العمليات القابلة للبرمجة تقلل من تأثير العوامل البشرية وتوفر مرونة أكبر في تخصيص الإعدادات لفرق محددة.",
  "How we smarten up our coffee machine in real life": "كيف نجعل آلة القهوة ذكية في الحياة الحقيقية",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "للحصول على التحكم الفعلي في آلة القهوة ، قمنا بدمج حاسوب لوحة واحدة ، وتحديداً Raspberry Pi 4 ، مع آلة قهوة متاحة في السوق العامة تدعم اتصال GPIO. كان تفضيلنا هو",
  "selected for its affordability and the convenience of its easily removable front panel.": "محدد بسبب تلفته المعقولة وسهولة إزالة اللوحة الأمامية.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "بعد ذلك ، عملنا على تفاصيل التشغيل ، وتحديدًا بالنسبة للرموز التي يمكن للمستخدمين إرسالها والخوارزمية الأساسية. هنا هو النتيجة:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "للاستمتاع بكوب من القهوة اللذيذة ، يحتاج المستخدمون إلى إرسال مبلغ معين من الأموال (في حالتنا ، رمز ACT لـ Statemine ، id = 3077) إلى عنوان آلة القهوة من شبكة فرعية (Statemine). ب، ويتم نشر سجل ",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS ، نظام التشغيل للروبوتات ، هو أحد أقدم الأطر المفتوحة المصدر للروبوتات. إنه مجموعة من مكتبات البرامج والأدوات لجعل الروبوتات تعمل. يحتوي على كل شيء من الأساسيات إلى الميزات المتقدمة ويأتي مع أدوات مفيدة للمبرمجين. يتم استخدامه على نطاق واسع من قبل الجامعات في جميع أنحاء العالم للتدريس والبحث في مجال الروبوتات ، لذلك فهو متأسس جيدًا ، ويعمل مع العديد من أنواع الروبوتات ، ولديه مجتمع كبير من المطورين.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "منذ بدء ROS في عام 2007 ، تمت تغييرات كبيرة في مجال الروبوتات وداخل مجتمع ROS. كاستجابة لهذه التطورات ، تم تقديم ROS 2 بهدف التكيف مع هذه التغييرات. يستفيد من نقاط قوة ROS 1 مع معالجة القيود الخاصة به. لقد استخدمنا ROS في Robonomics من البداية ، والآن حان الوقت لنقله إلى ROS 2.",
  "You might find this interesting": "قد تجد هذا مثيرًا للاهتمام",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "هناك العديد من الروبوتات مفتوحة المصدر ومنصات الروبوتات المعقدة التي تدعم ROS. هذا يعني أنه يمكنك إنشاء نظام متعدد الروبوتات مثير للإعجاب لتحقيق أهدافك المحددة. للحصول على",
  "the most current list of supported robots": "أحدث قائمة بالروبوتات المدعومة",
  "please visit the ROS website.": "يرجى زيارة موقع ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "دعنا نرى كيف يتم استخدام ROS داخل إطار Robonomics من خلال تصوير النظام بأكمله مع Robonomics يعمل كطبقات مختلفة:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "في طبقة 'واجهة الجهاز' ، نحتاج إلى أدوات لربط الروبوتات بالبرامج بسلاسة. يوفر ROS 2 مجموعة قوية من أدوات المطورين المناسبة تمامًا لهذه المهمة.",
  "Robonomics packages for ROS and ROS 2": "حزم Robonomics لـ ROS و ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "بناء نظام متعدد الروبوتات ينطوي في كثير من الأحيان على تحدي ربط الأجهزة من موردين مختلفين ، أو حتى الأجهزة داخل مورد واحد ، كل منها يستخدم بروتوكولات مختلفة. سواء كان ذلك لإعداد منزل ذكي أو التصنيع الآلي ، فإن التواصل الفعال بين الآلات الخاصة بك أمر حاسم. يقدم ROS (وبالطبع ROS 2) وسائط مختلفة للتعامل مع هذا. ماذا لو يمكنك تخصيص المهام أثناء إدارة ROS للتواصل بين العقد؟",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "قام فريق Robonomics بإنشاء حزم مختلفة لـ ROS لجعل الروبوتات أكثر ذكاءً والتعامل مع المهام المحددة حسب الحاجة. للاطلاع على المهام التي قمنا بها باستخدام ROS ، تحقق من صفحة حالات البحث والتطوير الخاصة بنا. يعتمد كل تفاعل مع الروبوت تقريبًا على ROS. يمكنك العثور على حزم Robonomics مفتوحة المصدر لـ ROS على GitHub ، وإليك بعضها:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "تحتوي مجموعة اتصالات Robonomics على مجموعة من حزم ROS لأغراض الاتصال الاقتصادي.",
  "Robonomics' contribution in the ROS 2 community": "مساهمة Robonomics في مجتمع ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "يجمع Robonomics بين الروبوتات وتقنيات Web3 ، ونهدف إلى النمو في هذه المجالات. منذ تقديم ROS 2 ، قمنا بتحديد ثلاثة تحديات رئيسية تتضمن دعم مجتمع ROS 2 وتحسين قدرات Robonomics:",
  "Creating ROS 2 tools for Rust:": "إنشاء أدوات ROS 2 لـ Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "تمكن هذه الأدوات المطورين من كتابة تطبيقات ROS 2 باستخدام Rust. لمعرفة المزيد حول سبب اختيارنا لـ Rust وأهمية هذا المشروع بالنسبة لنا ، يمكنك العثور على",
  "additional details": "تفاصيل إضافية",
  "Developing Robonomics Middleware for ROS 2:": "تطوير Robonomics Middleware لـ ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "تلعب هذه دورًا هامًا في ضمان التكامل السلس لـ Robonomics في أنظمة الروبوتات متعددة الوكلاء المختلفة باستخدام ROS 2. يمكن أن يسهل التكامل بين الروبوتات وتقنيات سلسلة الكتل Web 3 وكذلك تقليل الأخطاء أثناء عملية التكامل ، مما يوفر الوقت والتكاليف.",
  "Creating a robotics lab with ROS 2:": "إنشاء مختبر روبوتي مع ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "مع زيادة شعبية ROS 2 في مجتمع الروبوتات ، نحن حريصون على رؤية المزيد من الروبوتات والأجهزة تعمل مع ROS 2. هدفنا هو ربطها بنظام Web3 باستخدام Robonomics.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "كما استمر التعاون مع المشاريع الملائمة. Robonomics وDAO IPCI خدمة جمع وتحليل البيانات الحسية —",
  "On the Way to Sovereign Home Automation": "على الطريق إلى أتمتة المنزل السيادي",
  "Becoming a Parachain for IoT Applications": "أن نصبح باراشين لتطبيقات إنترنت الأشياء",
  "Transition to Multinetwork — Along Came Polkadot": "الانتقال إلى الشبكات المتعددة – جاء Polkadot على طول الطريق",
  "The Rise of Robonomics Network": "صعود شبكة الروبوتات",
  "In a nutshell": "شيء صغير",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "في أيامنا هذه، أصبح من الواضح أكثر فأكثر أن استهلاك الطاقة هو مساهم رئيسي في آثار الكربون، مما يزيد من أهمية إيجاد طرق للحد من تأثيرنا البيئي. تلعب المكاتب والمباني التجارية دورًا مهمًا في استهلاك الطاقة. قام المهندسون في شركة Robonomics بتثبيت نظام في مكتب BBF، وهي شركة تطوير عقاري مقرها قبرص، لتتبع وجمع قياسات الكهرباء. ويوفر هذا النظام أيضًا طريقة عملية لتعويض البصمة الكربونية.",
  "1. Monitoring surplus energy generation": "1. مراقبة توليد الطاقة الفائضة",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "وفي مبنى مكاتب شركة BBF، تم تركيب العديد من الألواح الشمسية ودمجها في نظام Solarweb، مما يتيح جمع التحليلات بسهولة. يوفر النظام بيانات عن استهلاك الكهرباء الإجمالي للمبنى والكهرباء المولدة بواسطة الألواح الشمسية. ومع ذلك، فإن الميزة الأساسية المفقودة هي القدرة على تعويض البصمة الكربونية الناتجة عن استهلاك الكهرباء بشكل يتجاوز ما تولده الألواح الشمسية.",
  "2. Converting excess energy power to CO2 offset": "2. تحويل الطاقة الزائدة إلى تعويض ثاني أكسيد الكربون",
  "When the concept extends beyond the office": "عندما يمتد المفهوم إلى ما هو أبعد من المكتب",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "يوفر هذا المفهوم طرقًا عديدة لتوسيع الفكرة. وتم تنفيذه بنجاح في Polkadot Web3 Hub خلال المنتدى الاقتصادي العالمي لعام 2022 في دافوس. تمكن المشاركون من تقديم طلبات القهوة وتحديد نوع القهوة المرغوبة (على سبيل المثال، اسبريسو، أمريكانو، كابتشينو) عن طريق إرسال كمية معينة من الرموز. دعونا نشارك الصور ومقاطع الفيديو من هذا الحدث:",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "إن الحصول على بيانات حول إجمالي استهلاك الكهرباء وإنتاج الكهرباء من الألواح الشمسية يسمح بإجراء حساب مباشر للبصمة الكربونية. من المفترض أن الكهرباء الناتجة عن الألواح الشمسية لها بصمة كربونية تبلغ 0، مما يعني أن التعويض ضروري فقط للكهرباء الزائدة المستهلكة بما يتجاوز ما تولده الألواح الشمسية",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "من الجدير بالذكر أن انبعاثات ثاني أكسيد الكربون تختلف بين البلدان. ففي قبرص، يبلغ متوسط التلوث 587 جم/كيلوواط ساعة، وفقًا لهانا ريتشي وماكس روزر وبابلو روسادو (2022) - \"الطاقة\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "لتعويض البصمة الكربونية، يتم استخدام أرصدة الكربون، حيث يمثل كل رصيد 1 طن من ثاني أكسيد الكربون. وتلعب هذه الاعتمادات دوراً حيوياً في تعويض الأثر البيئي الناجم عن استهلاك الكهرباء بما يتجاوز مساهمة الألواح الشمسية.",
  "3. Managing blockchain-verified carbon footprint offset": "3. إدارة تعويض البصمة الكربونية التي تم التحقق منها بواسطة blockchain",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "وبالتالي، مع التسلح ببيانات حول استهلاك الطاقة، وإنتاج الألواح الشمسية، ومعامل قبرص، يصبح من السهل تحديد عدد الرموز المطلوبة لتعويض البصمة الكربونية.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "ولتحقيق ذلك، قمنا بدمج Raspberry Pi، وقمنا بتكوين Home Assistant لجمع البيانات التحليلية، وقمنا بتطوير تكامل لتعويض البصمة. تعرض لوحة معلومات الطاقة الخاصة بـ Home Assistant التفاصيل التالية:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "علاوة على ذلك، يعمل التكامل لدينا على تحسين النظام من خلال تقديم لوحة تحكم ملائمة لعرض الإحصائيات وتحفيز التعويض:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "وفيما يلي مثال توضيحي لكيفية حدوث تعويض البصمة الكربونية من خلال التكامل لدينا. عند الانتهاء بنجاح،",
  "transaction": "عملية",
  "unfolds as follows:": "تتكشف على النحو التالي:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "إن تقليل استخدام الطاقة في المكتب لا يقل أهمية عن التعويض عن انبعاثات الكربون. يمكننا تحقيق ذلك من خلال إجراء تغييرات صغيرة مثل استخدام الإضاءة والأجهزة الموفرة للطاقة والحفاظ على صيانة المعدات المكتبية بشكل جيد.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "يعد استهلاك الطاقة جزءًا كبيرًا من بصمتنا الكربونية، ويجب على الشركات القيام بدورها لتكون أكثر صداقة للبيئة. إن وجود نظام يتتبع استخدام الطاقة ويساعد على تعويض انبعاثات الكربون يمكن أن يقلل بشكل كبير من تأثير مبنى المكاتب على البيئة. ومن خلال اعتماد النهج الصحيح، يمكن للشركات المساهمة في مستقبل أكثر اخضرارًا.",
  "The way forward": "الطريق الى الامام",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "\"Robonomics Coffee\" هي ماكينة قهوة ذكية مدمجة في شبكة Robonomics. يهدف هذا المشروع إلى توضيح إمكانات Robonomics في مجال إنترنت الأشياء من خلال مثال واقعي.",
  "Fronius Solar.web integration with Home Assistant": "تكامل Fronius Solar.web مع Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "أحد أهدافنا في تطوير هذه الحالة هو تحويل Robonomics إلى ROS 2 Middleware. وهذا سيسمح لنا باستخدام Robonomics on Substrate لإنشاء تطبيق dapp يمكنه تشغيل ROS 2 مباشرة من المتصفح!",
  "Blockchain-powered smart coffee machine": "ماكينة صنع القهوة الذكية التي تعمل بتقنية Blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "قهوة Robonomics - هي ماكينة قهوة ذكية مدمجة في شبكة Robonomics. يهدف هذا المشروع إلى إظهار إمكانات Robonomics في مجال إنترنت الأشياء من خلال مثال واقعي",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "هذه القضية قيد التنفيذ حاليًا؛ لا تفوت الأخبار - اشترك للحصول على التحديثات في المربع أدناه",
  "logos and assets": "الشعارات والأصول",
  "Download the Robonomics logos here. We've got two options for your": "قم بتنزيل شعارات Robonomics هنا. لدينا خياران لك",
  "basic needs": "الاحتياجات الاساسية",
  "and one designed for": "وواحدة مصممة ل",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "رمز مميز. بالإضافة إلى ذلك، اكتشف الأمثل",
  "color palette": "لوحة الألوان",
  "for the distinguished Robonomics brand": "للعلامة التجارية Robonomics المتميزة",
  "Robonomics logos": "شعارات الروبوتات",
  "Download all": "تحميل الكل",
  "XRT logos": "شعارات XRT",
  "Recommended color palette": "لوحة الألوان الموصى بها",
  "Sergei Lonshakov, software architect": "سيرجي لونشاكوف، مهندس برمجيات",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "دعونا نتذكر أن الآلة الآلية هي المكافئ الاقتصادي الدقيق لعمل العبيد. أي عمل يتنافس مع عمل العبيد يجب أن يقبل العواقب الاقتصادية لعمل العبيد.",
  "Norbert Wiener": "نوربرت فينر",
  "cybernetics": "السيبرنياتيكا",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "الروبوتات مثل الأطفال الكبار اليوم - يمكنها بالفعل إدارة المال والدخول في علاقات قانونية وأن تكون مستقلة.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "مستقبل البشرية نفسه يعتمد على كيفية تعليم الروبوتات للتعامل مع قدراتها.",
  "Robonomics tools": "أدوات روبونوميكس",
  "Operate with digital twins of IoT devices": "تشغيل التوائم الرقمية لأجهزة الإنترنت من الأشياء",
  "The first tools of the robot economy: money for robots, contracts for robots": "أول أدوات للاقتصاد الروبوت: النقود للروبوتات، العقود للروبوتات",
  "Software for connecting devices to a decentralized cloud": "برنامج لربط الأجهزة بسحابة مركزية",
  "API library for custom IoT applications": "مكتبة واجهة برمجة تطبيقات للأجهزة الإنترنت من الأشياء المخصصة",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "روبونوميكس يحتوي على مجموعة كاملة من الأدوات لتطوير تطبيقات الإنترنت من الأشياء، سواء على جانب الروبوتات أو واجهة المستخدم. يتم التواصل بين المستخدم والجهاز باستخدام التقنيات الأكثر نجاحًا من عالم الويب 3 - IPFS و Ethereum و Polkadot. بالتالي، يمكن للمطورين إنشاء تطبيقات حديثة وآمنة للمدن الذكية وصناعة 4.0.",
  "Robonomics Connectivity": "توصيل روبونوميكس",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "لراحة المطورين، يحتوي روبونوميكس على مجموعة من البرامج للاتصال: أجهزة الإنترنت الأشياء باستخدام بروتوكول HTTP/MQTT، أنظمة الروبوتات المعقدة باستخدام نظام التشغيل الروبوتي (ROS).",
  "Connect a sensor": "توصيل مستشعر",
  "to the Robonomics network": "بشبكة روبونوميكس",
  "Try": "جرب",
  "Robonomics IO": "روبونوميكس IO",
  "a simple prototyping tool": "أداة بسيطة للنمذجة الأولية",
  "Start building your own cyber physical system with": "ابدأ في بناء نظامك الفيزيائي السيبراني الخاص بك باستخدام",
  "Aira OS": "نظام Aira",
  "Robonomics Supports Hundreds of Robots Out of the Box": "يدعم روبونوميكس مئات الروبوتات مباشرةً",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "يمكن لمستخدمي المنصة ربط الروبوتات المتوافقة مع ROS بالاقتصاد الرقمي في غضون دقائق. للحصول على قائمة كاملة بالروبوتات المدعومة، يرجى اتباع الرابط",
  "Decentralized Cloud infrastructure for IoT": "بنية تحتية سحابية للأجهزة الذكية المتصلة بالإنترنت",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "خدمات الويب لروبونوميكس (RWS) هي الخدمة الأساسية للبنية التحتية للروبوتات والأجهزة الذكية على روبونوميكس باراشين وIPFS",
  "Robonomics web services (RWS)": "خدمات الويب لروبونوميكس (RWS)",
  "Robonomics dapp": "تطبيق روبونوميكس",
  "economy of robots": "اقتصاد الروبوتات",
  "Core RWS features available for IoT today": "الميزات الأساسية لـ RWS المتاحة للأجهزة الذكية اليوم",
  "RWS PubSub Message Broker": "وسيط رسائل RWS PubSub",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "استخدم الرسائل غير المحدودة عبر شبكة p2p تعتمد على بروتوكول IPFS",
  "RWS Data Blockchainization Service": "خدمة تحويل البيانات إلى سلسلة كتل IPFS وتخزين الهاشات في سلسلة كتل عامة",
  "Put data into IPFS and store hashes in a public Blockchain": "إجراءات الروبوت RWS",
  "RWS Robot Actions": "تشغيل / إيقاف ؛ إطلاق أو إيقاف أجهزة الإنترنت الأشياء تحت سيطرة حاسوب مركزي",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "قلب تطبيق IoT الخاص بك - توأم رقمي على سلسلة كتل",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "في الهندسة المعمارية التقنية ، يوفر توأم الأشياء الرقمية للإنترنت الأشياء الرؤية والمراقبة للأشياء والأحداث ذات الصلة (على سبيل المثال ، باستخدام أجهزة الإنترنت الأشياء لالتقاط أصل المنتج تلقائيًا) ، وتمكن سلسلة الكتل من الحصول على نسخة واحدة مشتركة من الحقيقة بخصوص حالة هذه الأشياء عبر دورات حياتها والأحداث التجارية المرتبطة بها",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "من بحث Gartner",
  "from Gartner research": "توفر Robonomics Parachain فرصة لإنشاء نموذج لتوأم رقمي وتحديث حالته كل 6 ثوانٍ.",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "يوفر Robonomics Parachain فرصة لإنشاء نموذج لتوأم رقمي وتحديث حالته كل 6 ثوانٍ.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "بناء التطبيقات اللامركزية وخدمات الويب لإنترنت الأشياء على تقنية Robonomics Parachain",
  "Secure": "آمنة",
  "Serverless": "خالية من الخوادم",
  "Futuristic": "مستقبلية",
  "IoT applications": "تطبيقات الإنترنت للأشياء",
  "Robonomics network vision": "رؤية شبكة روبونوميكس",
  "At the frontier of cybernetics and economics": "في مقدمة السيبرنيات والاقتصاد",
  "Build your IoT services on Robonomics platform": "قم ببناء خدمات الإنترنت للأشياء الخاصة بك على منصة روبونوميكس",
  "taking full advantage of decentralized architecture": "استفد بالكامل من الهندسة المعمارية المركزية",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "تسمح روبونوميكس للمستخدمين بالاتصال بالأجهزة الذكية باستخدام تطبيقات مركزية غير متطلبة لنقل بيانات المستخدم للمصادقة. يتم التواصل عبر شبكة مركزية من مقدمي الخدمات دون نقطة فشل واحدة، وتحصل الجهاز بشكل مستقل على المعلومات من شبكة البلوكشين للتشغيل أو إرسال البيانات عن بُعد. وبالتالي، توفر روبونوميكس مستوى عالٍ من أمان الجهاز وخصوصية بيانات المستخدم في جميع مراحل التواصل من تطبيق المستخدم لى تشغيل الجهاز الذكي.",
  "From smart contracts to cross chain IoT platform": "من العقود الذكية إلى منصة IoT عبر السلاسل الجانبية",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "مشروع Robonomics يبلغ من العمر أكثر من 6 سنوات. بدأنا في التحضير لأول تجربة توضح التواصل بين الإنسان والآلة باستخدام شبكة مزودين مستقلة متمركزة في عام 2015، منذ الأيام الأولى لشبكة Ethereum. بحلول بداية عام 2021، تمكن فريق المشروع من إنشاء بروتوكول للتواصل التكنولوجي الاقتصادي يعمل فوق Ethereum و IPFS، وتكمله بعناصر من منصة IoT مستندة إلى سحابة مبنية على Polkadot parachain.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "نتيجة لذلك، اليوم، لدينا بالفعل منصة هجينة لإنشاء تطبيقات IoT المستقبلية التي تمكن التفاعل مع الأجهزة تحت سيطرة حاسوب متمركز عالمي.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "مبتكرو روبونوميكس هم مجربون ومهندسون وعلماء يهتمون بفهم الصحة العلمية للنهج وتحقيق وضوح في تقديم المبادئ التي يجب أن تشكل أساس الهندسة المعمارية لحل البرمجيات بأكملها.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "في مقالاتنا بين عامي 2017 و 2020، قدمنا ​​للمجتمع العلمي العديد من المفاهيم والحلول الموحدة حول فكرة الاقتصاد الروبوتي، وهو نظام اقتصادي يعمل فيه الأجهزة الروبوتية كوكلاء مستقلين قادرين على أداء الأنشطة الاقتصادية الرئيسية التي كانت محجوزة سابقًا للبشر. يمكنك قراءة المقالات العلمية على",
  "this link": "هذا الرابط",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "نود تبرير ظهور الاقتصاد الروبوتي وشرحه بشكل عام لماذا نعتقد أن هذا المفهوم هو الإجابة الحتمية والواضحة على وظيفة أنظمة الروبوتات على نطاق واسع في الثورة الصناعية الجديدة.",
  "Move towards the factory of the future": "الانتقال نحو مصنع المستقبل",
  "Inspired by Ronald Coase": "مستوحى من رونالد كوس",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "أظهر رونالد كوس الحائز على جائزة نوبل في الاقتصاد في كتابه \"طبيعة الشركة\" الصادر عام 1937، أفضل طريقة للتسلسل الهرمي الثنائي مقابل السوق الحرة وقدم شرحًا لأسباب وجود المنظمات، ولا سيما الشركات. يناقش Coase تأثير تكاليف المعاملات (تكلفة جمع المعلومات ومعالجتها) لاتخاذ قرارات بشأن إبرام العقد ومراقبة تنفيذه. تم تشكيل الشركة، بكل هيكلها الهرمي خارج السوق، باعتبارها الطريقة الأكثر فعالية لتزويد المستهلك بالمنتج المستهدف بأقل تكاليف المعاملات في الوقت الحالي، عندما تبذل جهود المعاملات لإنشاء نفس المنتج من خلال عمليات تبادل متعددة على السوق بين الأفراد يصبح أعلى من ذلك بكثير. لتصور هذه العملية بشكل أفضل، انظر إلى المثال التوضيحي لشراء سيارة. حاول شراء سيارة حسب الأجزاء واحسب مقدار المال والوقت الذي ستنفقه فقط لتجميع جميع المكونات في المرآب الخاص بك. إن المخاطر وتكاليف التفاوض لشراء قطع الغيار مرتفعة للغاية مقارنة بسيارة تسلا موديل X الجاهزة للاستخدام.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "ومع ذلك، فإن هذا لا يؤدي إلى ظهور الشركة الوحيدة في العالم لإنتاج كل شيء. والنقطة المهمة هنا هي أن نفس تكاليف المعاملات تفرض أيضًا قيودًا على حجم الشركات. يكتب كوس:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "\"... ستميل الشركة إلى التوسع حتى تصبح تكاليف تنظيم معاملة إضافية داخل الشركة مساوية لتكاليف تنفيذ نفس المعاملة عن طريق التبادل في السوق المفتوحة ...\"",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "بعبارة أخرى، كلما كان التسلسل الهرمي داخل الشركة أكثر تعقيدًا، زادت التكاليف الداخلية، وفي نقطة ما، تتبين أنها مفرطة مقارنة بتكاليف العودة إلى السوق. لذلك، لضمان نموهم كأحد الدوافع، يبحث رواد الأعمال عن طرق لتقليل هذه التكاليف.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "فكرة تقليل تكاليف المعاملات من خلال قدرة جميع المشاركين في عملية الأعمال (الإنتاج واللوجستيات والاستهلاك) على الاتحاد على مستوى أقرب",
  "clearly correlates": "ترتبط بوضوح",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "مع المشاكل والتحديات التي تواجهها شركات تصنيع حلول الأتمتة. على مدى الـ 50 عامًا الماضية، تم تقريبًا أتمتة العمليات القياسية / العادية لمعظم عمليات الأعمال في الشركات الكبيرة. يتبقى للشركات المصنعة بشكل أساسي مهمة بناء اتصال آمن بين أجزاء سلسلة التوريد المؤتمتة بالكامل، وهذه المهمة هي عامل يعيق تقليل تكاليف المعاملات بشكل أكبر من خلال الأتمتة. الرغبة في تسويق منتجات أو خدمات أكثر تنافسية مقارنة بالشركات المؤتمتة جزئيًا",
  "firms spurs the search for solutions to": "تحفز البحث عن حلول ل",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "هذه التحديات. يبدو أن كل شيء يتجه نحو ظهور الشركات الروبوتية - المنظمات التي يتم فيها تأتمتة دورة العمل الكاملة ولا تحتاج إلى مشاركة بشرية، إلا كمستفيدين ومستهلكين.",
  "Get rid of transaction costs": "التخلص من تكاليف المعاملات",
  "Our future in smart cities": "مستقبلنا في المدن الذكية",
  "Self-regulating systems": "أنظمة تنظيمية ذاتية",
  "Inspired by Norbert Wiener": "مستوحاة من نوربرت فينر",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "المهمة التي تواجهها شركات تصنيع الأتمتة اليوم لها اسم محدد - بناء الأنظمة السيبر-فيزيائية (المختصرة ب CPS). بحسب التعريف، CPS هو توحيد قوي وتكامل متبادل لعمليات حوسبة وشبكات وعمليات فيزيائية متعددة. مهام بناء CPS هي جوهر أي فكرة موجودة في الثورة الصناعية الجديدة (الرابعة). لذلك، CPS هو الركيزة الأساسية لحياتنا المستقبلية في المدن الذكية، حيث يتجسد في كل مكان. أمثلة على أنظمة السيبر-فيزيائية في المستقبل هي: توجيه ذاتي لأوبر، صور الدرون، شبكة من طابعات ثلاثية الأبعاد في محطات المترو. CPS هو هيكل معقد مكون من العديد من العناصر المتصلة: من التطبيق على الهاتف، يمتد إلى التحكم في الدرون أثناء الطيران فوق المدينة، ثم ينتقل إلى نشر الصور الناتجة على إنستغرام، ولكن بعد معالجتها بواسطة الذكاء الاصطناعي في السحابة. أهم شيء في عملية تصميم CPS هو إيجاد الخط الرفيع بين عدد العناصر المؤتمتة الكافية والزائدة في سلسلة توريد خدمة المستخدم. بعبارة أخرى، أين هو الحد الأقصى لحجم CPS؟ للإجابة على هذا السؤال، يجب أن نلجأ إلى الرياضي الشهير نوربرت فينر.",
  "definition,": "تعريف،",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "إن CPS هو توحيد قوي وتكامل متبادل لعمليات حوسبة وشبكات وعمليات فيزيائية متعددة.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "مهام بناء CPS مركزية لأي فكرة موصوفة في الثورة الصناعية الجديدة (الرابعة). لذلك، CPS هو ركيزة حياتنا المستقبلية في المدن الذكية، حيث يتجسد في كل مكان. أمثلة على أنظمة الكمبيوتر الفعلية في المستقبل هي: طيارة أوبر التلقائية، صور الدرون، شبكة من طابعات ثلاثية الأبعاد في محطات المترو.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "CPS هي هيكل معقد يتكون من العديد من العناصر المتصلة: من التطبيق على الهاتف، يمتد إلى التحكم في الدرون أثناء الطيران فوق المدينة، ثم يتم نشر الصور الناتجة على إنستغرام، ولكن بعد معالجتها بواسطة الذكاء الاصطناعي في السحابة.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "أهم شيء في عملية تصميم CPS هو إيجاد الخ الرفيع بين عدد العناصر المؤتمتة الكافية والزائدة في سلسلة توريد خدمة المستخدم. بعبارة أخرى، أين هو الحد الأقصى لحجم CPS؟ للإجابة على هذا السؤال، يجب أن نلجأ إلى الرياضي الشهير نوربرت فينر.",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "في عام 1948، نشر أحد أساتذة الرياضيات في معهد ماساتشوستس للتكنولوجيا نوربرت وينر واحدة من أهم الأعمال الأساسية \"السيبرنيات: أو التحكم والاتصال في الحيوان والآلة\". استخدم مصطلح \"السيبرنيات\" للمرة الأولى للإشارة إلى آليات الرقابة الذاتية، وبالتالي، يُعتبر هذا النشر موعدًا معترفًا بعيد ميلاد السيبرنيات.",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "يتحدث نوربرت وينر عن جدوى النهج العلمي المتعدد التخصصات. على سبيل المثال، رسم التشابهات بين أنظمة التحكم الآلي وتحديات توسع وتعقيد المجتمع البشري.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "إذاً، بعبارة أخرى، يمكن تطبيق النهج السيبرني على حد سواء في العلاج النفسي والأحياء والتنقل الآلي. يستند إلى وظيفة النظام، وكيفية التحكم في الأعمال الفردية، وكيفية تفاعل العقد الفردية مع بعضها البعض.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "بناءً على منشورات رونالد كوز ونوربرت وينر، ومتابعة تطور الصناعة 4.0، يمكننا النظر في استخدام CPS كوكيل اقتصادي، أثناء تصميم الخدمات المؤتمتة. لتنظيم حجم CPS والتكيف مع التغيرات في احتياجات الأفراد، يمكننا استخدام آلية السوق.",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "وما هو مثير للاهتمام علمياً، بناءً على فكرة القيود التي يفرضها السوق على حجم الشركة، يمكننا أن نقول أن الحد الأقصى لزيادة CPS سيتم تحديده دائمًا بواسطة السوق ولا يلزم شيء آخر لذلك.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "الروبوفيرمز هي تمثيل مثالي للأنظمة السيبر-فيزيائية. إنها وحدة ذاتية إلى حد ما قادرة على تقديم خدمات للبشر والروبوتات الأخرى مقابل المال. نتيجة لذلك، يبدو لنا أن اقتصاد الروبوت هو مجموعة عامة من CPSs التي تقدم خدمات وسلع مباشرة إلى السوق.",
  "Bitcoin": "بيتكوين",
  "Money for robots": "المال للروبوتات",
  "Industry 1.0": "الصناعة 1.0",
  "Mechanization:": "الآلة:",
  "replacement of muscle power with steam energy.": "استبدال القوة العضلية بالطاقة البخارية.",
  "1784 y.": "1784 م.",
  "Industry 2.0": "الصناعة 2.0",
  "Electrification:": "الكهربة:",
  "introduction of assembly-line production.": "إدخال إنتاج خط التجميع.",
  "1870 y.": "1870 م.",
  "Industry 3.0": "الصناعة 3.0",
  "Automation:": "التشغيل التلقائي:",
  "introduction of automated systems with CNC.": "إدخال الأنظمة المؤتمتة مع الأجهزة الكمبيوترية العددية.",
  "1969 y.": "1969 م.",
  "Industry 4.0": "الصناعة 4.0",
  "Smart production:": "الإنتاج الذكي:",
  "development of cyber physical systems.": "تطوير الأنظمة الفيزيائية السيبرانية.",
  "Now": "الآن",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "في عالم الشركات الروبوتية، يتبين أنه من الطبيعي تزويد الروبوتات بوصول إلى المؤسسات الاجتماعية التي كانت مطلوبة فقط للبشر من قبل.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "لا تنشأ المؤسسات الاجتماعية لأن الناس لا يمكنهم العيش بدون البنوك والعقود وغيرها من أدوات المجتمع. إنها تنشأ فقط لأن الشخص في وقت ما يخطو خطوة مهمة نحو تسريع العمليات المحيطة في المجتمع والانتقال إلى علاقات أكثر تعقيداً.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "يجب أن تصبح المال والعقود متاحة للروبوتات، ليس لأن هذا هو وهم مرضي لمحبي الروبوتات الذين نسوا ما هو سكاينت. ولكن فقط لأن الثورة الصناعية الجديدة تضع لنفسها مهمة بناء سلاسل آلية معقدة، حيث ستؤثر العمليات فيها على تبادل المعلومات التقنية والمعلومات الاقتصادية، وستتم بسرعة غي متاحة للبشر.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "أحد أمثلة تجاربنا: التفاوض على مساحة الطريق ومدفوعات حق الأولوية للمركبات الذاتية للحد من الازدحام. ما لن يفعله الشخص على الإطلاق في حركة المرور، ستقوم السيارة بذلك بسهولة: إذا كنت ترغب في تغيير المسار، ستتبادل سيارتك وسيارة جارك العروض بشأن تكلفة هذه العملية بمعدل مئات الرسائل في الثانية، وسيتم الكشف عن سعر التوازن، وبذلك ستكون بالفعل في المسار التالي الأسرع. هذا يعني أنه الآن سيصبح من الممكن \"شحن\" رحلتك مع أوبر وجعلها أسرع.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "الروبوتات بحاجة إلى أموال تكون متاحة مباشرة لها من أجل أن تتمكن من القيام بالعمليات بدون وجود شخص بالسرعة التي يمكن للآلات فقط اتخاذ القرارات بها. وكل هذا يكون فقط من أجل أن يستمتع الشخص بالحياة في المدينة الذكية!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "وهنا نأتي بسلاسة إلى النقد الإلكتروني الأول - بيتكوين. حقيقة أن بيتكوين يمكن أن يتم تخزينه في حسابك على مبدأ ليس بنكًا ولكن نقدًا في محفظتك يجعله المال الأول الذي يمكن للروبوت إدارته بشكل مستقل، بالتحديد بشكل ذاتي. في الوقت نفسه، يمكننا القول اليوم أن بيتكوين ليس مجرد نقد إلكتروني، بل هو مؤسسة مالية عالمية حقيقية.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "نتيجة لذلك: حدث لم يتم اختراعه بواسطتنا، ولكنه يندرج بوضوح في رؤيتنا، يجعل بيتكوين المال الأول للروبوتات، أو، إذا نظرنا بعمق أكبر، فإنه بالضبط تلك المؤسسة الاجتماعية التي ستساعد في تشكيل الشركات الروبوتية.",
  "Smart contracts": "العقود الذكية",
  "Ethereum": "إيثيريوم",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "أصبحت بيتكوين أول أموال متاحة للروبوتات. في هذه الأثناء لا يمكننا التحدث عن بيتكوين في شكله الحالي كأداة للتبادل التقني والاقتصادي الكامل.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "الآن لدينا بالفعل عقود ذكية وأسواق ديفي وبنية تحتية لامركزية لتبادل الرسائل بين الروبوتات التي تفتح إمكانية للبشرية لإنشاء جزء مؤتمت تمامًا من الاقتصاد البشري - اقتصاد الروبوت.",
  "One of the great opportunity to build the economy of robots is": "إحدى الفرص الكبيرة لبناء اقتصاد الروبوتات هي",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "التكنولوجيا. مع وظائف إيثيريوم، يمكن للروبوتات عدم فقط تبادل الأموال، ولكن أيضًا الدخول في عقود مع البشر وبينها.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "ولكن ما هو الهدف من التواصل بين الآلات على أساس العقد (M2M)؟ هذا سؤال رائع! دعنا نعود إلى نظام CPS. عندما نتحدث عن التواصل المباشر بين الحساسات أو معدات الآلات أو أي عناصر أخرى ، نتحدث لا يزال عن التعاون ضمن نظام منظم واحد. ولكن إذا أردنا أن تكون خدمات المدن الذكية حية (أو حتى المنزل الذكي في بعض الحالات) ، فإننا بحاجة إلى إقامة اتصال مع عناصر الطرف الثالث المختلفة.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "لنتخيل خدمة توصيل الطرود بواسطة الطائرات بدون طيار. إذا كانت الطائرة بملكية DHL ، على سبيل المثال ، كيف يمكنها الوصول إلى مستودعات Amazon أو الوصول إلى الأجواء الجوية في المدينة بأكملها؟ هل ستكون هذه احتكارًا؟ هذا تحدي كبير للعديد من مبادرات الثورة الصناعية الرابعة!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "تقول معظم الشركات أنها تحتاج إلى حقوق تامة تقريبًا لمحيطها لأنها لا تعرف كيفية إعداد تبادل المعلومات التقنية بأمان بين الأنظمة الآلية خارج الهيكل الشركاتي الداخلي الخاص بها. في الوقت نفسه ، إذا نظرنا إلى العمليات التي يعمل فيها الشخص ، فإننا نرى أن تعاون مختلف الشركات قد استمر لفترة طويلة ونجح بنجاح. يمكنك بسهولة طلب توصيل البضائع التي تم شراؤها من موقع أمازون حتى باب المنزل ، وسيكون بإمكان الساعي قيادة سيارة عبر الطرق الحضرية ، واستلام الطلب في المستودع وتوصيله لك.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "ما الفرق؟ في الحالة الأولى ، لا يوجد طريقة لبناء علاقة تعاقدية بين الآلات ، وفي الحالة الثانية ، في عالم البشر ، توجد بالفعل علاقات تعاقدية.",
  "Parachains": "الشبكات الفرعية",
  "Polkadot": "بولكادوت",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "أكبر صعوبة تواجه روبونوميكس اليوم هو السعر المرتفع لإطلاق جهاز الإنترنت الأشياء باستخدام إيثريوم. في إيثريوم يجب عليك دفع عمولة على كل عملية بالدولار الأمريكي في نطاق 10 إلى 100 دولار. إنها مكلفة جدًا في معظم الحالات من الاقتصاد الحقيقي، سواء كانت رحلة مشاركة السيارات، أو استئجار شقة ذكية، أو توصيل طائرة بدون طيار، أو طباعة ثلاثية الأبعاد لبطل الأنمي المفضل لديك.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "من أجل العدالة، نود أن نلاحظ أن هناك سيناريوهات مربحة حتى مع رسوم المعاملات في شبكة إيثريوم لعامي 2018 - 2019. على سبيل المثال، المعاملات الآلية لتعويض أثر الكربون أو نقل الطلب مباشرة من الموقع إلى الإنتاج. ومع ذلك، لتطبيق تقنيات الويب3 بشكل جماهيري في مجال الإنترنت الأشياء، يتطلب تخفيض في السعر الذي يفرضه السحابة على الجهاز المتصل.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "بحثًا عن فرصة لتخفيض تكلفة التفاعل مع جهاز الإنترنت الأشياء، قام مطورو روبونوميكس بدراسة تطورات بديلة لإيثريوم. اختيارنا استقر على",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "الهندسة المعمارية، التي ستسمح لنا بتشغيل سلسلة الكتل الخاصة بنا، ضمن شبكة مشتركة، حيث يتم ضمان الأمان من قبل المحققين المستقلين عن مشروعنا.",
  "Ethereum 2.0": "إيثيريوم 2.0",
  "Heterogeneous Blockchain Network": "شبكة سلسلة كتل متنوعة",
  "Homogeneous Shard Network": "شبكة شارد متجانسة",
  "On-chain protocol control": "التحكم في البروتوكول على السلسلة",
  "Protection against the tyranny of the crowd": "حماية ضد طغيان الجماهير",
  "Auction of bandwidth in the common network": "مزاد لعرض النطاق الترددي في الشبكة المشتركة",
  "Payment for gas by users": "دفع رسوم الغاز من قبل المستخدمين",
  "Have you read this?": "هل قرأت هذا؟",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "الكتب العظيمة تؤدي إلى أفكار عظيمة. إذا كنت تبحث عن المزيد من الإلهام حول التواصل بين الإنسان والآلة، جرب قراءة كتب الخيال العلمي. علم الكتب التي قرأتها بالفعل وانظر ماذا يمكن أن نقدمه لك لمزيد من التأمل.",
  "Philip K. Dick": "فيليب ك. ديك",
  "Autofac": "أوتوفاك",
  "I, Robot": "أنا، الروبوت",
  "Isaac Asimov": "إسحاق أسيموف",
  "The Bicentennial Man": "الرجل المئتيني",
  "Neuromancer": "نيورومانسر",
  "William Gibson": "ويليام جيبسون",
  "Marionettes, Inc.": "عرائس الأشباح",
  "Ray Bradbury": "راي برادبري",
  "Open questions of teleology": "الأسئلة المفتوحة في التليولوجيا",
  "and a treatise by L. von Mises": "ومؤلف ل. فون ميزيس",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "في الختام، نود أن نذكر الأسئلة التي لا تزال مفتوحة من وجهة نظر عالمية. ما هو هدف الروبوتات؟",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "في الواقع، يرتبط اقتصاد الأشخاص في كثير من الأحيان بضمير أداء المهام ضمن إطار العقد، ورغبة الأطراف في تحقيق نتيجة، والسلوك الفردي الفرصي والإيثاري في المجتمع. جميع هذه المبادئ صعبة التطبيق على اقتصاد الروبوتات. ما هي دوافع اقتصاد الروبوتات؟ إنها سؤال مفتوح نحتاج إلى البحث والنقاش في المجتمع لفهم وتطبيق الروبوتات بشكل أفضل.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "للبدء، نقترح النظر في عمل ميزيس \"العمل البشري: مؤلف في الاقتصاد\" (النهج العملي) وفي مقالة نوربرت وينر الأولى \"السلوك والغرض والتليولوجيا\" (الرؤية التليولوجية).",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "تلهمنا البراكسيولوجيا بأفكار مثيرة حول سلوك الإنسان بدون الاعتماد المباشر على الأغراض. هذا يمنحنا الفرصة للعمل على عمليات اقتصاد الروبوتات بشكل مشروط كمع صندوق أسود دون التعمق في الأهداف النهائية. في الوقت نفسه، تطرح التليولوجيا تحديًا لشرح الأسباب.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "نأمل أن يتم العثور في مكان ما على تقاطع أعمال ميسيس ووينر، نقطة لمزيد من تطوير اقتصاد الروبوت قد يتم العثور عليها، ليس فقط كبروتوكول للتفاعل بين الناس والآلات ذات الطابع البراكسيولوجي، ولكن مع مراعاة العناصر التليولوجية لبناء التواصل بين الأنواع.",
  "RWS logos": "شعارات RWS",
  "You are currently opted out. Click here to opt in.": "لقد قمت بإلغاء الاشتراك حاليًا. انقر هنا للاشتراك.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "اكتمل إلغاء الاشتراك؛ لن يتم تسجيل زياراتك لهذا الموقع بواسطة أداة تحليلات الويب. لاحظ أنه إذا قمت بمسح ملفات تعريف الارتباط الخاصة بك، أو حذفت ملف تعريف ارتباط إلغاء الاشتراك، أو إذا قمت بتغيير أجهزة الكمبيوتر أو متصفحات الويب، فستحتاج إلى تنفيذ إجراء إلغاء الاشتراك مرة أخرى.",
  "Please click below to opt in:": "الرجاء النقر أدناه للاشتراك:",
  "You are currently opted in. Click here to opt out.": "أنت مشترك حاليًا. انقر هنا لإلغاء الاشتراك.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "يمكنك اختيار عدم تعيين رقم تعريف فريد لملف تعريف الارتباط لتحليلات الويب لجهاز الكمبيوتر الخاص بك لتجنب تجميع وتحليل البيانات التي تم جمعها على هذا الموقع.",
  "To make that choice, please click below to receive an opt-out cookie": "لإجراء هذا الاختيار، يرجى النقر أدناه لتلقي ملف تعريف ارتباط إلغاء الاشتراك",
  "Privacy Policy": "سياسة الخصوصية",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "تصف هذه السياسة المعلومات التي نجمعها منك، وكيفية استخدامنا لهذه المعلومات والأساس القانوني لدينا للقيام بذلك. ويغطي أيضًا ما إذا كان من الممكن مشاركة هذه المعلومات وكيفية مشاركتها وحقوقك واختياراتك فيما يتعلق بالمعلومات التي تقدمها لنا.",
  "Where are those annoying cookie consent pop-ups": "أين تلك النوافذ المنبثقة المزعجة الخاصة بالموافقة على ملفات تعريف الارتباط؟",
  "We don't need cookie consent is needed because": "لا نحتاج إلى موافقة ملفات تعريف الارتباط لأن",
  "Tracking cookies are not used": "لا يتم استخدام ملفات تعريف الارتباط للتتبع",
  "The data is not used for any other purpose than analytics": "لا يتم استخدام البيانات لأي غرض آخر غير التحليلات",
  "Visitors aren't tracked across websites": "لا يتم تتبع الزوار عبر مواقع الويب",
  "A user cannot be tracked across days within the same website": "لا يمكن تتبع المستخدم عبر أيام داخل نفس الموقع",
  "What We Collect and Receive": "ما نجمعه ونتلقاه",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include": "لكي نتمكن من توفير أفضل تجربة ممكنة لك على مواقعنا الإلكترونية، نحتاج إلى جمع ومعالجة معلومات معينة. اعتمادًا على استخدامك للخدمات، قد يشمل ذلك",
  "Contact us via email": "اتصل بنا عبر البريد الإلكتروني",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "على سبيل المثال، عندما ترسل نماذجنا، أو ترسل لنا أسئلة أو تعليقات، أو تبلغ عن مشكلة، فسوف نقوم بجمع اسمك وعنوان بريدك الإلكتروني ورسالتك وما إلى ذلك. ونستخدم هذه البيانات فقط فيما يتعلق بالإجابة على الاستفسارات التي نتلقاها.",
  "Usage data": "بيانات الاستخدام",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "عندما تزور موقعنا، سنقوم بتخزين: عنوان URL الذي قمت بزيارتنا منه، وصفحات الويب الخاصة بموقعنا الذي تزوره، وتاريخ ومدة زيارتك، وعنوان IP المجهول الخاص بك، ومواصفات الجهاز (نوع الجهاز، نظام التشغيل، دقة الشاشة، واللغة، والبلد الذي تتواجد فيه، ونوع متصفح الويب) الذي استخدمته أثناء زيارتك، و",
  "other": "آخر",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "البيانات غير الشخصية. نقوم بمعالجة بيانات الاستخدام هذه فقط على خادمنا، ولا نمررها إلى أطراف ثالثة",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "منصة تحليلات الويب التي تمنحنا ملكية البيانات بنسبة 100%. تساعدنا هذه التحليلات على تحسين تجربة المستخدم مع موقعنا الإلكتروني والتعرف على أي سوء استخدام وإيقافه.",
  "Non-personalized cookies": "ملفات تعريف الارتباط غير الشخصية",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "نحن نستخدم ملفات تعريف الارتباط غير التتبعية (ملفات البيانات الصغيرة المنقولة إلى أجهزة الكمبيوتر أو الأجهزة عن طريق المواقع) لأغراض حفظ السجلات وتعزيز الوظائف على موقعنا. يمكنك إلغاء تنشيط أو تقييد نقل ملفات تعريف الارتباط هذه عن طريق تغيير إعدادات متصفح الويب الخاص بك أو عن طريق إلغاء الاشتراك في هذه الصفحة في النموذج أدناه. قد يتم حذف ملفات تعريف الارتباط المخزنة بالفعل في أي وقت.",
  "Opt-out of website tracking": "إلغاء الاشتراك في تتبع موقع الويب",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "يمكنك إلغاء الاشتراك في التتبع من خلال مثيل Matomo Analytics الخاص بنا أدناه:",
  "Your Rights": "حقوقك",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "لديك الحق في أن تكون على علم بالبيانات الشخصية التي تعالجها Matomo، والحق في التصحيح/التصحيح والمحو وتقييد المعالجة. لديك أيضًا الحق في أن تطلب منا تنسيقًا منظمًا ومشتركًا وقابلاً للقراءة آليًا للبيانات الشخصية التي قدمتها لنا.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "لا يمكننا التعرف عليك إلا عبر عنوان بريدك الإلكتروني ولا يمكننا الالتزام بطلبك وتقديم المعلومات إلا إذا كانت لدينا بيانات شخصية عنك من خلال اتصالك بنا مباشرة و/أو استخدام موقعنا و/أو خدمتنا. لا يمكننا تقديم أو تصحيح أو حذف أي بيانات نقوم بتخزينها نيابة عن مستخدمينا أو عملائنا.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "لممارسة أي من الحقوق المذكورة في سياسة الخصوصية هذه و/أو في حالة وجود أسئلة أو تعليقات تتعلق باستخدام البيانات الشخصية، يمكنك الاتصال بنا.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "بالإضافة إلى ذلك، لديك الحق في تقديم شكوى إلى هيئة حماية البيانات في ولايتك القضائية.",
  "Retention of data": "الاحتفاظ بالبيانات",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Network legal rights.": "سنحتفظ بمعلوماتك طالما كان ذلك ضروريًا لتزويدك بالخدمات أو كما هو منصوص عليه في هذه السياسة. سنحتفظ أيضًا بهذه المعلومات ونستخدمها عند الضرورة للأغراض المنصوص عليها في هذه السياسة وبالقدر اللازم للامتثال لالتزاماتنا القانونية وحل النزاعات وإنفاذ اتفاقياتنا وحماية الحقوق القانونية لشبكة Robonomics.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations": "نقوم أيضًا بجمع والحفاظ على معلومات مجمعة أو مجهولة المصدر أو مستعارة والتي قد نحتفظ بها إلى أجل غير مسمى لحماية سلامة وأمن موقعنا أو تحسين خدماتنا أو الامتثال للالتزامات القانونية",
  "Robonomics Middleware Framework for ROS 2": "إطار عمل Robonomics الوسيط لـ ROS 2",
  "Twitter": "Twitter",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Bringing Together Web3 Techs and Robotic Frameworks": "الجمع بين تقنيات Web3 والأطر الروبوتية",
  "Playing with Human-Machine Interaction through Ethereum": "اللعب بالتفاعل بين الإنسان والآلة من خلال الإيثيريوم",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "لقد انتهت صلاحية معلومات هذه الدراسة. للحصول على أحدث الدروس وورش العمل، قم بزيارة موقعنا",
  "academy": "الأكاديمية",
  "It's gonna get worse": "سوف يزداد سوءًا",
  "DIY": "افعلها بنفسك",
  "your own safe": "مكان آمن خاص بك",
  "smart space": "مساحة ذكية",
  "manifest": "الميثاق",
  "Have you ever wondered why, in the process of evolution on Earth, the human species prevailed instead of, for example, fungi? Even now, it's challenging to provide a definitive answer to this question. The success of Homo sapiens is often attributed to successful cooperation, but then why not bees or ants? Our survival is also owed to a crucial characteristic—the autonomy of an individual within the population. In other words, the ability not to unquestionably submit to the queen bee. Ultimately, the group where each member has the right to be independent prevails.": "هل سبق لك أن تساءلت لماذا، في عملية التطور على الأرض، تفوقت الجنس البشري بدلاً من، على سبيل المثال، الفطريات؟ حتى الآن، من الصعب تقديم إجابة نهائية على هذا السؤال. يُرجع نجاح Homo sapiens في كثير من الأحيان إلى التعاون الناجح، ولكن لماذا ليس النحل أو النمل؟ يرجع بقاءنا أيضًا إلى سمة حاسمة - استقلالية الفرد داخل السكان. بعبارة أخرى، القدرة على عدم الخضوع بلا تحفظ للملكة النحل. في النهاية، يتفوق الفريق الذي يحق لكل عضو أن يكون مستقلاً.",
  "Unfortunately, those who proclaim themselves arbiters of human destinies rarely contemplate the true laws of nature. Politicians and major corporations engage in strategic games, where the populace is treated as mere units. This dynamic existed before the advent of computer games and has persisted since: 'buying units,' 'building units,' 'removing units'—throughout history, various ruling structures around the world have resorted to such dehumanizing terms when dealing with other people. However, almost invariably, to commit crimes against humanity, these rulers require enforcers, who, in turn, have their subordinates. Therefore, over the last 200 years, such stark dystopias in the vein of the book '1984' typically endure for no more than one or two generations.": "ولسوء الحظ، فإن أولئك الذين يعلنون أنفسهم حكامًا على مصائر الإنسان نادرًا ما يفكرون في قوانين الطبيعة الحقيقية. وينخرط السياسيون والشركات الكبرى في ألعاب استراتيجية، حيث يتم التعامل مع السكان على أنهم مجرد وحدات. كانت هذه الديناميكية موجودة قبل ظهور ألعاب الكمبيوتر واستمرت منذ ذلك الحين: 'شراء الوحدات'، 'بناء الوحدات'، 'إزالة الوحدات' - عبر التاريخ، لجأت الهياكل الحاكمة المختلفة حول العالم إلى مثل هذه المصطلحات اللاإنسانية عند التعامل مع أشخاص آخرين. ومع ذلك، في كل الأحوال تقريبًا، لارتكاب جرائم ضد الإنسانية، يحتاج هؤلاء الحكام إلى منفذين، والذين بدورهم يكون لديهم مرؤوسون. لذلك، على مدى المائتي عام الماضية، عادة ما تستمر مثل هذه الديستوبيا الصارخة في سياق كتاب '1984' لمدة لا تزيد عن جيل أو جيلين.",
  "This is exactly where we are all heading now. And this could be just the beginning of a widespread nightmare that will quietly embed itself in the lives of many modern people in a twisted way.": "هذا هو المكان الذي نتجه جميعًا الآن. ويمكن أن يكون هذا مجد بداية لكابوس واسع الانتشار سيتغلغل بصمت في حياة الكثير من الأشخاص الحديثين بطريقة ملتوية.",
  "We, the Robonomics team, aim to redirect the development of IoT towards a more open and secure path. We've": "نحن، فريق Robonomics، نهدف إلى إعادة توجيه تطوير إنترنت الأشياء نحو مسار أكثر انفتاحًا وأمانًا. لقد فعلنا",
  "introduced": "قدَّم",
  "an independent web3 cloud for IoT, allowing your home to stay connected autonomously, and communication with the manufacturer's server is only optional. Currently, we have started producing our own": "سحابة web3 مستقلة لإنترنت الأشياء، مما يسمح لمنزلك بالبقاء على اتصال بشكل مستقل، ويكون الاتصال بخادم الشركة المصنعة اختياريًا فقط. حاليًا، بدأنا في إنتاج منتجاتنا الخاصة",
  "IoT devices": "أجهزة إنترنت الأشياء",
  "based on open hardware and open software. Our goal is to create a fully open hardware-software system that won't let any digital intruders into your apartment. So, with our innovations, you can enjoy your time in the bedroom as you wish!": "تعتمد على الأجهزة المفتوحة والبرمجيات المفتوحة. هدفنا هو إنشاء نظام مفتوح بالكامل من الأجهزة والبرمجيات لن يسمح لأي متطفل رقمي بدخول شقتك. لذا، مع ابتكاراتنا، يمكنك الاستمتاع بوقتك في غرفة النوم كما ترغب!",
  "Home assistant themes": "ثيمات مساعد المنزل",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "قم بتخصيص Home Assistant الخاص بك باستخدام ثيماتنا المجانية للاستخدام. اتبع التعليمات للتثبيت على",
  "Why human?": "لماذا الإنسان؟",
  "In the name of free will...": "باسم الإرادة الحرة..",
  "Can IoT be dangerous?": "هل يمكن أن تكون إنترنت الأشياء خطيرة؟",
  "What can unsettle the balance between freedom and subordination is the Internet of Things (IoT). Completely confining people, for example, is no easy task these days. A recent case with the quarantine vividly illustrated this: in Shanghai, exits from homes were sealed, and it was such a disturbing action by the authorities that these measures remained in place for no more than 3 months.": "ما يمكن أن يزعزع التوازن بين الحرية والتبعية هو إنترنت الأشياء (IoT). على سبيل المثال، فإن عزل الناس بشكل كامل ليس بالمهمة السهلة هذه الأيام. وقد أوضحت حالة الحجر الصحي الأخيرة ذلك بوضوح: في شنغهاي، تم إغلاق مخارج المنازل، وكان هذا الإجراء مثيرًا للقلق من قبل السلطات لدرجة أن هذه الإجراءات ظلت سارية لمدة لا تزيد عن 3 أشهر.",
  "But what if goals could be achieved without turning to such obvious methods? What if you could ask a major telecommunications company to disable the lock-opening function in all the apartments in the city? What if you could start blocking essential functions in their customers' cars because they haven't paid a subscription or the surveillance policy (gathering necessary metrics) doesn't align with their region's policy on collecting information about citizens": "ولكن ماذا لو أمكن تحقيق الأهداف دون اللجوء إلى مثل هذه الأساليب الواضحة؟ ماذا لو كان بإمكانك أن تطلب من إحدى شركات الاتصالات الكبرى تعطيل وظيفة فتح القفل في جميع الشقق في المدينة؟ ماذا لو كان بإمكانك البدء في حظر الوظائف الأساسية في سيارات عملائهم لأنهم لم يدفعوا الاشتراك أو أن سياسة المراقبة (جمع المقاييس اللازمة) لا تتوافق مع سياسة منطقتهم بشأن جمع المعلومات عن المواطنين",
  "What’s the plan?": "ما هي الخطة؟",
  "Do you want": "هل ترغب",
  "to dive even deeper?": "في الغوص بعمق أكبر؟",
  "Our": "لدينا",
  "White Paper": "الورقة البيضاء",
  "Science": "العلم",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "شبكات البلوكشين لديها جميع القدرات لتوفير أعلى درجة من الأمان لتشغيل جهاز والحصول على بيانات القياس الخاصة به. يمكن فعلياً وصف التفاعل مع الجهاز عن طريق تغيير حالة التوأم الرقمي المخزن في شبكة البلوكشين وإرسال معلومات حول هذه التغييرات. في حالة البلوكشين غير المرخصة، يمكننا التحدث عن ضمانات التوفر العالمي لمقدمي خدمات الإنترنت للأشياء، فضلاً عن مستوى عالٍ من حماية بيانات التوأم الرقمي من التغييرات غير المرغوب فيها.",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "بفضل آلية العملات المشفرة والعقود الذكية، يمكننا توفير الوصول إلى الأنظمة الآلية مباشرة إلى الأسواق الرقمية. على سبيل المثال، تقوم إثيريوم بتنفيذ معظم الأدوات الأساسية للنشاط الاقتصادي التي يمكن استخدامها في تشغيل الأجهزة الآلية. ستكون التطبيقات التي تم إنشاؤها للتفاعل بين المستخدم النهائي وجهاز الإنترنت من أكثر فعالية بكثير إذا كانت شروط الخدمة والدفع لها لا يمكن فصلها عن معلمات تشغيل الجهاز.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "التقدم الحديث في تكنولوجيا الويب3 يمكن أن يحل مشكلة خصوصية المستخدم. مع الويب3 لا حاجة للمصادقة أو الاتصال بخوادم محددة للوصول إلى بيانات القياس والتحكم في الجهاز.",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "الفكرة الرئيسية التي حاول مؤلفو Robonomics توصيلها من قبل - هي التطور الطبيعي والمنطقي والذي يبدو لا مفر منه من المستوى الحالي للاقتصاد إلى خدمات متمكنة بالكامل. ستحتاج الخدمات المتمكنة إلى القدرة على التحدث بلغة الاقتصاد البشري وأيضاً الاقتصاد الخاص بالآلات لأداء عمليات مختلفة في العالم من حولها بسرعة غير متاحة للبشر.",
  "No posts yet": "لا توجد مشاركات بعد",
  "If you want to help us with translation": "إذا كنت ترغب في مساعدتنا في الترجمة",
  "contact us at": "اتصل بنا على",
  "send": "أرسل",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "نعتقد أن قراءة الكتب يمكن أن تفتح عقلك حقاً. سواء كانت الأفكار بسيطة ولكن ذكية أو أكثر تعقيداً، الكتب هي أفضل طريقة لدمج كل ذلك في عقلك. يمكنك الحصول على كتبنا مجاناً والاطلاع على قائمتنا بالكتب الموصى بها للغوص في عالم الروبوتات المثير!",
  "Download books about Robonomics": "تحميل كتب حول Robonomics",
  "Open your mind [list of recommendations]": "افتح عقلك [قائمة الاقتراحات]",
  "Robonomics R&D": "Robonomics R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "اقتصاد الروبوتات",
  "Eisenkoch, the robot chef": "إيزنكوتش، الطاهي الروبوت",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "حالة حقيقية للروبوت المجهز بجهازي وافل وخبز 6 وافل في نفس الوقت في 5-7 دقائق.",
  "Water environmental inspector": "مفتش بيئي للمياه",
  "Air monitoring network": "شبكة مراقبة الهواء",
  "Production quality control platform “Feecc”": "منصة مراقبة جودة الإنتاج “Feecc”",
  "Backup and archiving service for robotics companies": "خدمة النسخ الاحتياطي والأرشفة لشركات الروبوتيات",
  "Public lab with Boston Dynamics Spot": "مختبر عام مع Boston Dynamics Spot",
  "Autonomous telescope service": "خدمة التلسكوب الذاتي",
  "Smart home secure remote control and backup service": "خدمة التحكم عن بعد والنسخ الاحتياطي الآمنة للمنزل الذكي",
  "Blockchain as quality control system for chemistry": "البلوكشين كنظام لمراقبة الجودة للكيمياء",
  "Real CO2 emissions reduction with blockchain-proven certificates": "تقليل انبعاثات ثاني أكسيد الكربون الحقيقية مع شهادات مؤكدة بواسطة البلوكشين",
  "Robot-artist Gaka-Chu": "روبوت الفنان Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "عرض توضيحي “احصل على حالة الطقس لجبل فوجي”",
  "the Robonomics Parachain portal": "بوابة Robonomics Parachain",
  "via the Datalog function": "عبر وظيفة Datalog",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "صانع القهوة الخاص بنا على البلوكشين يقوم بتحضير القهوة في مركز Polkadot Web3",
  "DIY or how to build your own smart blockchain coffee machine": "DIY أو كيفية بناء جهاز صنع القهوة الذكي الخاص بك على البلوكشين",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "يمكنك العثور على دليل تفصيلي والمواصفات الفنية في مستودع GitHub مفتوح المصدر. تذكر أنه يمكنك استخدام أي جهاز صنع قهوة تفضله وتقريباً أي رمز تفضله لإحياء هذا المشروع في مساحتك الخاصة.",
  "Robonomics White Paper": "الورقة البيضاء لـ Robonomics",
  "This page has moved to a": "تم نقل هذه الصفحة إلى",
  "Automatic redirecting": "إعادة توجيه تلقائي",
  "World Economic Forum Annual Meeting 2022": "اجتماع منتدى الاقتصاد العالمي السنوي 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (برعاية Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "مدرسة الشتاء لـ Robonomics 2021 (مستضافة بواسطة Robonomics)",
  "Libelium": "Libelium",
  "Crypto Valley Conference 2018": "مؤتمر Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "ورشة عمل البرلمان الأوروبي ‘اقتصاد الروبوتات’",
  "Consensus 2018 conference": "مؤتمر Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "ندوة حول البلوكشين لأنظمة الروبوتات في معهد MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "مدرسة الصيف Robonomics-2018 التي استضافتها Robonomics.",
  "This page may need translation": "قد تحتاج هذه الصفحة إلى ترجمة",
  "Important news and announcements": "أخبار وإعلانات هامة",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "تمت مناقشة مسألة إمكانية الوصول إلى الشبكة للأجهزة التلقائية في جميع أنحاء الكوكب منذ الستينيات، وكانت هناك محاولات جادة جدًا في ذلك الوقت لحلها. على سبيل المثال، اقترح السايبرنيتيكي السوفيتي فيكتور غلوشكوف ونفذ جزئيًا جمع المعلومات تلقائيًا حول حجم الإنتاج في مصنع فردي كجزء من تصميم النظام الوطني للمعلومات",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "في الستينيات والسبعينيات. من المعروف على نطاق واسع كيف تم توصيل جهاز بيع مشروبات كوكاكولا بشبكة ARPANET في الثمانينيات حتى يمكن للآلات الإبلاغ عن توفر المشروبات ودرجة حرارتها.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "ولكن لا يزال تطوير الإنترنت من الأشياء يحدث اليوم، نظرًا للاستخدام الواسع للتقنيات الممكنة. وتعتبر النتائج التي تم تحقيقها في تطور تطبيقات الإنترنت من الأشياء من السائقين الرئيسيين للتطور السريع، وهذه النتائج تأتي من تطوير العديد من المجالات - بدءًا من الاتصالات اللاسلكية بمدى مختلف والأجهزة المضمنة، وصولًا إلى تحليلات السحابة والتعلم الآلي. وقد شهد عدد أجهزة الإنترنت من الأشياء نموًا مطردًا على مدى السنوات العشر الماضية (مع توقعات بوصولها إلى 25 مليار وحدة بحلول عام 2030)، وقد دفع ذلك الباحثين والمطورين إلى إنشاء تطبيقات جديدة للإنترنت من الأشياء في مجالات مختلفة مثل الرعاية الصحية والتحكم المنزلي والزراعة وحماية البيئة.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "نحن أكثر اهتمامًا بعملية بناء أنظمة الإنترنت من الأشياء والمهام التي تنشأ في هذه العملية. خلال سنوات البحث، تم اقتراح العديد من الهندسات المعمارية المختلفة، ومن خلال متوسطها، يمكننا التمييز بين ثلاث مكونات أساسية لنظام الإنترنت من الأشياء: الأجهزة، بنية الشبكة، والتحليل والحوسبة الأناليتيكية وآلات التحكم.",
  "New challenges": "التحديات الجديدة",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "لقد أظهر تطوير وتطبيق الإنترنت من الأشياء أن حل المشاكل النموذجية ليس كافيا. ظهرت مفاهيم ومبادئ جديدة تمامًا، استنادًا إلى الأخطاء السابقة والنقائص المحددة، بحلول الوقت الحاضر. تبين أن هذا النهج المريح لاستخدام خدمات السحابة يحمل عددًا من النقائص الحرجة المتعلقة بالقابلية للتوسع، الخصوصية، والأمان. في محاولة لحل هذه المشاكل، تم اقتراح جلب معالجة البيانات والمنطق والحساب أقرب إلى المكان الفوري الذي يتم فيه استخدامها. وهكذا، ظهرت مفاهيم الضباب وحوسبة الحافة، مع أنظمة وسيطة بين السحابة والأجهزة تتولى بعض وظائف السحابة. لذلك، أصبح إنشاء أنظمة الحواف واحدة من التحديات الجديدة لبناء الإنترنت من الأشياء.",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "تحدي آخر حديث لبناء الإنترنت من الأشياء كان مفهوم التوأم الرقمي - النسخة الرقمية للمعدات الحقيقية التي تنسخ مواصفاتها والبيانات التاريخية الخاصة بها. هذا المفهوم في أوجه في المجالات التي يكون فيها من الضروري أن يكون هناك مواصفة دقيقة وكاملة لعملية ما وأن تكون قادرة على توقع تطورها. يعمل الإنترنت من الأشياء كالمكامل الرئيسي للتوائم الرقمية، ولكن هذه المهمة أعمق بكثير من الاتصال التقليدي لأجهزة الإنترنت من الأشياء.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "في الوقت الحالي، نحن نشهد قطاعًا كاملاً من الشبكة، مصممًا ومريحًا ليس للأشخاص، ولكن للآلات. لم يعد الإنترنت من الأشياء مجرد ميكانيكية لربط جهاز بالشبكة، بل هو خدمات أكثر، تم إنشاؤها وتوفر خصيصًا للأجهزة. الإنترنت من الأشياء لا يقوم فقط بربط المستخدم والجهاز، بل يساعد أيضًا الأجهزة على التعامل مع مهام توفير خدمة للشخص، ولكن بشكل مستقل.",
  "Embedded iot systems": "أنظمة الإنترنت من الأشياء المضمنة",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "هذه الأنظمة ليس لديها واجهت مستخدم وعادة ما تستخدم على أدنى مستوى من النظم البيئية للإنترنت من الأشياء لتوفير وظائف أساسية. يجب أن تكون كفءة من حيث الطاقة وصغيرة الحجم. لديها موارد محدودة للحوسبة والاتصال. بوابات الإنترنت من الأشياء أو المراقبين عادة ما تعمل كمستقبلات إشارة.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "تعمل هذه الأنظمة كوصلة بين الأنظمة المضمنة المتاحة محليًا والإنترنت العالمي. عادة ما تدعم عدة بروتوكولات اتصال للأنظمة المضمنة وتنقل بيانات الاستشعار من الأجهزة إلى السحابة وإشارات التحكم بالعكس. غالبًا ما تكون هذه الأجهزة نسخة أكثر تطورًا من جهاز التوجيه WiFi، مجهزة بجهاز كمبيوتر لوحي لأداء المعالجة الأساسية للمعلومات من الأجهزة دون مغادرة الشبكة المحلية.",
  "Autonomous systems": "أنظمة مستقلة",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "تشمل هذه الفئة الآليات المعقدة (مثل Spot من Boston Dynamics)، التي تحتوي على مكون تحكم على مستوى كمبيوتر كامل مع معالج عالي الأداء ومية كبيرة من الذاكرة. في مثل هذه الحالات، يتم ربط الروبوت بالإنترنت دون حلول وسيطة إضافية (أنظمة الحواف). يتم تثبيت البرنامج اللازم للوصول إلى الإنترنت من الأشياء مباشرة على الكمبيوتر للنظام المستقل. يتم جمع البيانات ومعالجتها جزئيًا محليًا، ثم يتم بثها إلى الإنترنت بشكل مماثل لأي جهاز شبكة كامل.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "المهمة الرئيسية لمزودي الإنترنت من الأشياء هي توفير الوصول عن بعد للمستخدمين إلى البيانات والتحليلات، فضلاً عن إدارة الأجهزة الذكية عبر الإنترنت. المعايير الرئيسية لجودة المزود هي أمان العمليات، استقرار الاتصال وتوفر المزود من أي مكان في العالم.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "المخطط القياسي للعمل مع مزود إنترنت من الأشياء يتضمن: تثبيت البرنامج المتوافق مع الجهاز الذكي السحابي، إعداد خدمات إدارة الجانب السحابي بعد الاتصال الناجح الأول للجهاز، وصلة مختلفة من الخدمات التحليلية.",
  "Digital twins are the heart of the internet of things": "التوائم الرقمية هي قلب الإنترنت من الأشياء",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "عند الحديث عن التوائم الرقمية، يجب أن يُلاحظ أن تنفيذها مطلوب من الناحية المعمارية؛ كرفض إعطاء المستخدم وصولًا مباشرًا للتحكم في الأجهزة وتغيير حالاتها. من بين الأسباب الأكثر وضوحًا للرفض هي، أولاً، وجود متطلباتهم وشروطهم الخاصة في الأجهزة قبل الإطلاق. ثانيًا، إذا كانت الأجهزة التي يجب على عدة مستخدمين الوصول إلى مصدر بيانات واحد، فإعطاء التحكم الشخصي لكل مستخدم يمكن أن يكون حرجًا. وأخيرًا، من المفيد للغاية الاحتفاظ بآخر حالة فعلية للجهاز متاحة في حالة خروجه عن الخدمة.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "نتيجة لذلك، لدينا فصل لحلقة تبادل المعلومات مع المستخدم وتوليد البيانات الفعلية من قبل أجهزة الاستشعار. لتوضيح هذا المبدأ، أدناه عملية عمل المستخدم مع جهاز إنترنت من الأشياء باستخدام توأم رقمي.",
  "IoT data flows in cloud services": "تدفق البيانات في خدمات الحابة للإنترنت من الأشياء",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "قيم الإدخال لمشغلات السحابة. على سبيل المثال، يرسل خدمة السحابة إشعارات مختلفة إلى المستخدم في حالة تقرير من جهاز إنذار السيارة عن إضراب.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "بيانات الإخراج للتحليلات المعقدة التي لا يمكن إنتاجها على مستوى الحافة. على سبيل المثال، عند معالجة الفيديو لتعرف الوجوه في حشد.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "الأساس لتشكيل توأم رقمي للجهاز من أجل إنشاء صب من حالته. على سبيل المثال، بناءً على طلب المستخدم في التطبيق المحمول أو على الموقع.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "نظام منزل ذكي نموذجي يوفر مجموعة واسعة من الخيارات للتحكم في مساحتك المعيشية. بمساعدته يمكنك التحكم عن بعد في أقفال الأبواب، وضبط الوصول لمرة واحدة أو بانتظام إلى الغرفة كأفراد العائلة والأصدقاء، وللصيانة أو العمال الذين يقومون بالتوصيل. مع العديد من الأجهزة الاستشعارية وأجهزة التسجيل، يمكن للنظام تضمين تسجيل الفيديو عند تشغيل أجهزة الاستشعار الحركية، اتخاذ قرارات تلقائية لإيقاف إمداد المياه عند اكتشاف تسرب في نظام المياه، تشغيل مكنسة روبوتية مجدولة، وتوفير تقرير تنظيف لتطبيق المستخدم، وتغيير درجة حرارة الغرفة إلى القيمة المثلى اعتمادًا على جدولك.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "السيارات الذكية. من خلال توفير الوصول إلى الإنترنت المحمول لإلكترونيات السيارة، يحصل المستخدم على الوصول إلى التحكم عن بعد في وظائف السيارة المختلفة مباشرة من هاتفه الذكي: فتح الأبواب، تشغيل مكيف الهواء، التحكم في المصابيح. إذا تم استخدام مثل هذه السيارات لمشاركة السيارات، يمكنك إنشاء خريطة تفاعلية لموقع السيارات مع حالتها، والوقود المتبقي، وما إلى ذلك لعملاء هذه الخدمة.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "نظام تأجير المعدات الذكية. تقوم الشركة بتثبيت مناولات روبوتية على خط الإنتاج بموجب عقد مع الدفع عن عدد العمليات أو عن وقت الروبوت. توفر المناولات بانتظام سجل للعمليات التي تمت، والأخطاء والتحذيرات. يتم حساب رسوم تأجير الروبوت على أساس هذا، بالإضافة إلى الصيانة التنبؤية للروبوتات من البائع.",
  "Global availability": "التوفر العالمي",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "الهندسة المعمارية القياسية للعميل والخادم تتطلب تحديد نقاط النهاية عند توجيه الرسائل من أجهزة الإنترنت من الأشياء. وبالتالي، خلال حياة الجهاز الذكي، فإن عدم الاتصال يعني قيودًا في القدرة على التحكم والتفاعل مع الجهاز.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "على سبيل المثال، الحرب التجارية بين الصين والولايات المتحدة هي بالفعل سيف داموقليس يعلق فوق آلاف المستهلكين للأجهزة الذكية الصينية في الولايات المتحدة والعكس. في أي لحظة، يمكن أن يؤثر حظر خوادم شاومي من قبل السلطات الأمريكية على مستخدمي الأجهزة التي تتصل بخدمات السحابة للشركة المصنعة.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "بوجودك في محاذاة مباشرة لجهاز الإنترنت من الأشياء، لا يمكنك التحكم فيه من تطبيق الجوال إذا لم يكن هناك اتصال بالخوادم، من خلالها يتم توفير مصادقة المستخدم وجمع البيانات من اأجهزة أنفسها. وهذا يعني أن الجهاز يتم التحكم فيه فعليًا من قبل السحابة، ليس المستخدم.",
  "Cybersecurity": "أمن المعلومات",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "السبب الأهم في ضعف أمن المعلومات لمعظم حلول الإنترنت من الأشياء ينبع من المشكلة التقليدية لهندسة السحابة للعميل والخادم. على سبيل المثال، الهندسة المعمارية الأكثر شيوعًا للمنزل الذكي الآن عادة ما تكون محورًا للإنترنت من الأشياء، متصلة بخدمة سحابة. وبالتالي، يعد نظام الإنترنت من الأشياء النموذجي عنصر تحكم مركزي متصل بأنظمة خارجية متعددة. بالتأكيد، تكون خدمة السحابة أكثر أمانًا من الأجهزة على مستوى منخفض، ولكن تجميع التحكم المركزي على مئات الآلاف من هذه الأنظمة يجعل أي اختراق أمني وتسرب كارثة ضخمة.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "خوادم خدمة السحابة تخضع لجميع المشاكل النموذجية لأمن المعلومات: هجمات الشبكة، هجمات رفض الخدمة (دفع النظام للفشل)، التعديلات الخبيثة، اختطاف جلسة المستخدم، إلخ. ولكن التهديدات القوية تشمل أيضًا المشاكل غير المقصودة مثل أخطاء التصميم، السوء استخدام أو الكوارث الطبيعية التي تتسبب في فشل الخوادم. كما أن نقطة مهمة بالتأكيد أخرى هي الحاجة في المبدأ إلى الثقة في السحابة والأشخاص الذين يديرونها.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "كل هذا يتفاقم بسبب حجم حلول الإنترنت من الأشياء. عدد أنظمة الإنترنت من الأشياء. بالتأكيد، تكون خدمة السحابة أكثر أمانًا من الأجهزة على مستوى منخفض، ولكن تجميع التحكم المركزي على مئات الآلاف من هذه الأنظمة يجعل أي اختراق أمني وتسرب كارثة ضخمة.",
  "Data privacy": "خصوصية البيانات",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "يجب أن تكون نقطة الخصوصية منفصلة عن أمن المعلومات، لأن هذه المشكلة محددة لأنظمة الإنترنت من الأشياء. نظرًا للعدد الكبير وأنواع الأجهزة المتنوعة التي تكون أكثر اندماجًا في العالم الفعلي من مجرد الكمبيوترات والهواتف الذكية، يتضاعف نطاق أنواع البيانات الخاصة. لم يعد الأمر يتعلق فقط بالموقع الجغرافي بواسطة نظام تحديد المواقع العالمي، سجلات التسوق، المعاملات المالية والصور، بل أيضًا سجل دائم للفيديو والمحادثات، بصمات الصوت، الحالات الصحية وحتى قائمة بعادات الشخص. من بين أنواع التهديدات المتعلقة بالخصوصية: تحديد المعلومات، التموضع والتتبع، إنشاء ملف تعريف، هجوم التعداد، هجوم ربط البيانات.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "أكثر ما يثير الرعب هو أن المستخدمين لديهم القليل أو لا يملكون أي وعي بأنهم يتنازلون عن خصوصيتهم لأنهم لا يعرفون تقريبًا ما هي البيانات التي يتم جمعها وكيف يتم استخدامها. ينمو التهديد للخصوصية ليس فقط من المتطفلين، ولكن أيضًا من المنظمات والجهات الحكومية بالضبط بسبب هذا. تتطلب خدمات السحابة للإنترنت من الأشياء عادة أقصى قدر من نقل البيانات من الأجهزة، ولا توجد طرق لمنع أو تضييق نقل البيانات («قبول الشروط أو انقطاع الخدمة»). علاوة على ذلك، على الرغم من أن البيانات المجمعة هي أصل وله قيمة حقيقية، إلا أن الشخص الذي تم جمع البيانات منه لا يحق له الحق في التصرف بنشاط في تلك البيانات، بل حتى يتم منعه من أي تعويض عن جمع بياناته الخاصة واستخدامها.",
  "\"Main tasks of robonomics architecture": "\"المهام الرئيسية لهندسة الروبونوميكس",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "بناءً على الإنجازات والتحديات لمنصات السحابة، تهدف روبونوميكس إلى تقديم حلول إنترنت أكثر أمانًا وتقدمًا لسوق الإنترنت من الأشياء في كل مرحلة من مراحل التواصل بين الإنسان والآلة. أدناه تعدد المهام الرئيسية التي تهدف روبونوميكس إليها:",
  "Managing an IoT device using a decentralized cloud": "إدارة جهاز الإنترنت من الأشياء باستخدام سحابة مركزية",
  "Performing technical and economic transaction between people and machines": "أداء المعاملات التقنية والاقتصادية بين الأشخاص والآلات",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "روبونوميكس هي سحابة مركزية للتوائم الرقمية لأجهزة الإنترنت من الأشياء. تدعم روبونوميكس التنسيق التكنولوجي الاقتصادي للتواصل، بالإضافة إلى توفير تطبيقات خاصة للمستخدمين",
  "A human interface to access the system": "واجهة إنسانية للوصول إلى النظام",
  "A communication protocol": "بروتوكول الاتصال",
  "A machine interface": "واجهة الجهاز",
  "Human interface": "واجهة إنسانية",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "نقترح استخدام التطبيقات اللامركزية (dapps) كوسيلة رئيسية لربط المستخدمين بالتحكم في الأجهزة الذكية عبر الإنترنت. وبالتالي، سنتمكن من توفير واجهة مستخدم الأكثر أمانًا (من حيث البيانات) للنظام، التي ستكون قادرة على العمل بشكل متزامن في ظروف شبكة المدينة المحلية، ومن خلال شبكة عالمية مشتركة.",
  "Communication protocol": "بروتوكول الاتصال",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "يقوم بدوره شبكة Robonomics، وهي مواصفة وضعتها فريق المشروع الذي ينفذ شبكة لامركزية من مقدمي الخدمات الذين يوفرون نقل ومعالجة وتخزين المعلومات اللازمة لتشغيل أجهزة الإنترنت الأشياء. في الواقع، إنها تنفيذ لعقدة مخصصة لوظيفة لشبكات IPFS وEthereum وPolkadot.",
  "Machine interface": "واجهة الجهاز",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "هنا توجد رسم بياني عام لدورة تشغيل الجهاز الكاملة باستخدام منصة Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "تقوم تطبيقات المستخدم المركزية بإرسال طلب لوظيفة التحكم في الجهاز من خلال شبكة Robonomics.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "توفر شبكة Robonomics ترجمة الطلب باستخدام libp2p وتلتقط الأحداث في سلسلة الكتل Ethereum أو Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "يتم توفير التحكم في الجهاز من خلال شبكة مركزية، والتي يتم ضمان تخزين المعلومات اللازمة لتشغيل جهاز IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "يتلقى جهاز IoT معلومات بشكل مستقل من شبكات Ethereum و Polkadot حول الحالة الحالية للتوأم الرقمي. وهذا يضمن أن يمكن تشغيل الجهاز بأمان فقط بعد تسوية المعلمات الفنية والاقتصادية للبدء.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "نتيجة للعملية، يقوم جهاز IoT بنشر سجل بالعمليات المكتملة، والتي يمكن استخدامها كدليل على الخدمة المقدمة أو لتصحيح الأخطاء.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "يتم تحويل السجل إلى تقرير للمستخدم ويصبح متاحًا في تطبيقه.",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "احصل على منتجاتك ذات العلامة التجارية الفريدة مع فن Robonomics الذي رسمه فتياتنا الرائعات. لقد أنشأنا متاجر على أكبر الأسوا عبر الإنترنت للفنانين، تحقق منها واعثر على تي شيرتات وأكمام طويلة وهوديز وستائر الحمام ووسائد وبطاطين وأشياء أخرى مفيدة.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "لقد اخترنا إطار عمل الروبوتات الأكثر شهرة والمسمى نظام تشغيل الروبوت (ROS) باعتباره الواجهة القياسية لدمج أي نظام مادي إلكتروني متوافق. يدعم Robonomics عدة استخدامات لـ ROS. يتم تنفيذ Robonomics لشبكة Ethereum في شكل حزمة ROS robonomics_comm. بالنسبة لبنية ROS 2، نقوم بتنفيذ دعم Robonomics كطبقة برمجية وسيطة (راجع «Robonomics as ROS 2 Middleware» للحصول على التفاصيل). عندما يكون استخدام ROS زائدًا عن الحاجة (على سبيل المثال، عند العمل مع أجهزة إنترنت الأشياء)، فقد تم تطوير وحدة واجهة Python robonomics. فهو يساعد على الوصول إلى وظائف Robonomics محليًا ويعمل مع العقد المحلية والخاصة والبعيدة والعامة",
  "read our almanac": "اقرأ دليلنا",
  "Email me": "أرسل لي بريدًا إلكترونيًا",
  "Begin your adventure in the world of cyber punks": "ابدأ مغامرتك في عالم السايبر بانكس",
  "About membership pass": "حول تصريح العضوية",
  "Hardware for cyber punks 2025 line up": "الأجهزة لخط 2025 من السايبر بانكس",
  "Features of Each Device": "ميزات كل جهاز",
  "Pure Open Source": "مفتوح المصدر بشكل كامل",
  "Every device is fully open: you can find the source code, circuit schematics, and instructions for self-updating without the need to connect to any cloud servers. The devices are designed to ensure you can easily understand their structure and onboard components": "كل جهاز مفتوح بالكامل: يمكنك العثور على الشيفرة المصدرية والمخططات الدوائرية والتعليمات للتحديث الذاتي دون الحاجة للاتصال بأي خوادم سحابية. تم تصميم الأجهزة لضمان أن يمكنك بسهولة فهم هيكلها ومكوناتها الداخلية",
  "Local and Global Availability": "التوفر المحلي والعالمي",
  "The combination of p2p communication and web3 cloud guarantees that your devices will always be accessible for interaction. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "تضمن مزيج من الاتصال نقطة لنقطة وسحابة web3 أن تكون أجهزتك دائمًا متاحة للتفاعل. لا يوجد لديك وصول إلى الإنترنت؟ يمكنك الاتصال مباشرة بالجهاز. هل تنتقل إلى منطقة جديدة أو تذهب في عطلة؟ ستبقى أجهزتك على الإنترنت ومتاحة أينما كنت",
  "Privacy from the First Use": "الخصوصية منذ الاستخدام الأول",
  "By utilizing open source, p2p, and web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the web3 cloud.": "من خلال استخدام المصدر المفتوح والاتصال نقطة لنقطة و web3، لا يوجد مجال لحيل الشركات، مما يضمن حماية بياناتك الشخصية. يتم تخزين جميع المعلومات إما محليًا أو مشفرة بمفتاحك الشخصي في سحابة web3.",
  "Interested in how the team reached this stage?": "هل تهتم بكيفية وصول الفريق إلى هذه المرحلة؟",
  "The Robonomics Timeline": "الجدول الزمني لروبونوميكس",
  "can guide you through our journey": "يمكن أن يوجهك خلال رحلتنا",
  "Altruist outdoor sensor": "جهاز استشعار خارجي للإنساني",
  "RISC-V Smart Home Server": "خادم منزل ذكي RISC-V",
  "Device Design and Development": "تصميم وتطوير الأجهزة",
  "The best way to check open-source project": "أفضل طريقة لفحص مشروع مفتوح المصدر",
  "Follow for latest news and updates": "تابع لآخر الأخبار والتحديثات",
  "Useful, serious, cute videos, teasers etc.": "فيديوهات مفيدة وجادة ولطيفة وتشويقية وما إلى ذلك",
  "Chat with us and each other": "تحدث معنا ومع بعضكم البعض",
  "Smart devices": "الأجهزة الذكية",
  "Wearable merch": "الملابس القابلة للارتداء",
  "Academy": "الأكاديمية",
  "Wiki": "ويكي",
  "Science & White paper": "العلوم والورق الأبيض",
  "Tokenomics": "التوكينوميكس",
  "Cases": "الحالات",
  "Brand assets": "أصول العلامة التجارية",
  "Wallpapers": "خلفيات",
  "NFT": "NFT",
  "Books & reading inspiration": "الكتب والإلهام للقراءة",
  "Blog": "المدونة",
  "Contacts": "جهات الاتصال",
  "By clicking on the button “Email me” you agree to receive regular emails from Robonomics.": "بالنقر فوق زر “أرسل لي بريدًا إلكترونيًا”، فإنك توافق على تلقي رسائل بريد إلكتروني من Robonomics.",
  "A smart sensor that collects environmental data - noise, dust, and temperature, and stores them on a decentralized": "جهاز استشعار ذكي يجمع بيانات بيئية - الضوضاء، الغبار، ودرجة الحرارة، ويخزنها على نحو متميز",
  "sensor map": "خريطة الاستشعار",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "كن مزودًا لبيانات البيئة لأصدقائك وجيرانك في المنطقة. الوصول إلى قياسات متميزة حقًا لجودة الهواء، الضوضاء، درجة الحرارة، وشروط بيئية أخرى على خريطة الاستشعار.",
  "risc-v open source server": "خادم مصدره مفتوح risc-v",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "أكثر خوادم المنزل الذكي مصدرها مفتوح risc-v، مع سحابة Web3 تحل محل خوادم Google تحت الغطاء.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "أجهزة WI-FI الذكية ببرنامج تشغيل مفتوح المصدر Tasmota على اللوحة متوافقة تمامًا مع Home Assistant.",
  "Hikikomori smart Tamagotchi": "هيكيكوموري تاماغوتشي ذكي",
  "Finally, a smart Tamagotchi that’s more than just a game! A smart wearable station that checks the status of sensors from your home or clothing.": "أخيرًا، تاماغوتشي ذكي يعتبر أكثر من مجرد لعبة! محطة قابلة للارتداء ذكية تفحص حالة الأجهزة الاستشعارية من منزلك أو ملابسك.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "قم بربط منزلك الذكي وملابسك الذكية بـ هيكيكوموري لمراقبة بيانات الاستشعار - مباشرة بأطاف أصابعك. حرفيًا.",
  "Safe on a smart contract": "آمن على عقد ذكي",
  "A safe that unlocks with a smart contract based on user-defined conditions.": "خزانة تفتح بعقد ذكي يعتمد على شروط يحددها المستخدم.",
  "View logs of the safe’s openings and closings. Program the safe to suit your needs, such as granting access to trusted accounts after an extended period of inactivity.": "عرض سجلات فتح وإغلاق الخزانة. برمجة الخزانة لتناسب احتياجاتك، مثل منح الوصول إلى الحسابات الموثوق بها بعد فترة طويلة من عدم النشاط.",
  "Early access for community members": "الوصول المبكر لأعضاء المجتمع",
  "Coming soon": "قريباً",
  "How to get membership pass": "كيفية الحصول على تصريح العضوية",
  "Use case:": "حالة الاستخدام:",
  "Available for members": "متاح للأعضاء",
  "Usage": "الاستخدام",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "تعرف على الأجهزة الذكية والأجهزة المستقبلية من فريق مستقل لديه خبرة واسعة في مجال الروبوتات والبلوكشين والإنترنت الأشياء",
  "Into the map": "في الخريطة",
  "Connect your device as simple as other smart devices and look at your environmental outdoor data on a decentralized fully distributed sensor map": "قم بتوصيل جهازك بسهولة مثل أجهزة الذكية الأخرى وانظر إلى بعض البيانات البيئية الخارجية على خريطة جهاز استشعار موزعة بالكامل",
  "this": "هذا",
  "or any other independent fork": "أو أي فرع مستقل آخر",
  "Open-source under the hood: check our firmware": "مفتوح المصدر تحت الغطاء: تحقق من البرنامج الثابت الخاص بنا",
  "Join the Connectivity": "انضم إلى الاتصال",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "معالجة البيانات هي دائمًا مسألة حساسة. هذا هو السبب في أننا نقدم مصدرًا مفتوحًا بالكامل",
  "connectivity module": "وحدة الاتصال",
  "giving you the freedom to choose which servers to use for processing. No closed clouds, no opaque code.": "مما يمنحك حرية اختيار الخوادم التي ترغب في استخدامها للمعالجة. لا توجد سحب مغلقة، لا توجد رموز غامضة.",
  "Use Robonomics Connectivity": "استخدم توصيل Robonomics",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "أنشأ Robonomics ثلاثة مراكز توصيل لضمان اتصال مستقر. تم تشغيل هذا الخيار افتراضيًا على المحطة.",
  "Create your own Connectivity": "أنشئ توصيلك الخاص",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "يمكنك إطلاق مركز توصيل خاص بك لاستقبال البيانات من محطة Altruist Civil ومعالجتها بشكل أفضل.",
  "Steps to set up your Connectivity": "خطوات إعداد توصيلك",
  "Deploy Connectivity": "نشر التوصيل",
  "Technical requirements:": "المتطلبات التقنية:",
  "2 CPU cores;": "2 نوى معالج;",
  "4 GB RAM;": "4 جيجابايت رام;",
  "40 GB storage;": "40 جيجابايت تخزين;",
  "Static IP": "عنوان IP ثابت",
  "Than set up": "ثم قم بإعداد",
  "and follow": "واتبع",
  "the instructions": "التعليمات",
  "Connect a station to your connectivity": "قم بتوصيل محطة الاتصال بالشبكة الخاصة بك",
  "Open your sensor settings by its IP.": "افتح إعدادات الاستشعار الخاصة بك عن طريق عنوان IP الخاص به",
  "Go to APIs settings": "انتقل إلى إعدادات واجهات برمجة التطبيقات",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "تحقق من خانة الاختيار لإرسال البيانات إلى واجهة برمجة تطبيقات مخصصة واملأ الحقول المقابلة (عنوان IP للخادم، المنافذ، إلخ)",
  "Join with your setup to global map (optional)": "انضم مع إعدادك إلى الخريطة العالمية (اختياري)",
  "If you want to publish data to": "إذا كنت ترغب في نشر البعانات إلى",
  "the global map": "الخريطة العالمية",
  "you need to make two pull requests:": "عليك أن تقوم بعمل طلبات استحضار مزدوجة:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "أضف معرف IPFS الخاص باتصالك إلى قائمة الوكلاء في خريطة الاستشعار:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "أضف عنوان باراشين الخاص باتصالك إلى قائمة الوكلاء في خادم التخزين طويل الأجل:",
  "Open-source under the hood: check our connectivity module": "مفتوح المصدر: تحقق من وحدة الاتصال الخاصة بنا تحت الغطاء",
  "Your own air quality map": "خريطة جودة الهواء الخاصة بك",
  "You have an opportunity to become the administrator of a sovereign sensor infrastructure, giving you full control over how data is collected, processed, and shared within your own independent network.": "لديك فرصة لتصبح مسؤولًا عن بنية تحتية للمستشعرات ذات سيادة، مما يمنحك السيطرة الكاملة على كيفية جمع البيانات ومعالجتها ومشاركتها داخل شبكتك المستقلة الخاصة.",
  "Steps for launching your own map": "خطوات لإطلاق خريطتك الخاصة",
  "Deploy web interface": "نشر واجهة الويب",
  "Fork the map repository:": "انسخ مستودع الخريطة:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "قم بتحرير الإعدادات لتخصيص خريطتك، بما في ذلك النطاق ومزود الخدمة ونقطة البدء ومعرف IPFS الخاص بالاتصال الخاص بك لقائمة الوكلاء.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "نشر نسختك الخاصة من واجهة الويب وابدأ في استقبال البيانات في الوقت الحقيقي من مستشعرك.",
  "Full guide here:": "دليل كامل هنا:",
  "Launch long-term storage": "إطلاق تخزين طويل الأمد",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "جمع البيانات من الحساسات ببساطة ليس كافيًا؛ فإنه يحتاج إلى معالجة. ضبط خادم لجمع بيانات الحساس بناءً على برنامج node.js مفتوح المصدر",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "قياسات تحليلية وأرشيف الحساسات الروبونومية وعقدة (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "واحصل على خادم عمل خاص بك لتخزين بيانات الخريطة طويلة الأمد.",
  "Static IP.": "عنوان IP ثابت.",
  "Steps for launching a storage:": "خطوات لإطلاق تخزين:",
  "Fork the RoSeMAN repository:": "انشاء نسخة من مستودع RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "اختيار إصدار Docker أو Node.js (قاعدة بيانات MongoDB مطلوبة).",
  "Add a parachain address of your Connectivity to agents list.": "إضافة عنوان باراشين لاتصالك بقائمة الوكلاء.",
  "Run the project.": "تشغيل المشروع.",
  "Open-source under the hood: check our server-side software": "مفتوح المصدر تحت الغطاء: تحقق من برنامج الخادم الخاص بنا",
  "BECOME THE COMPLETE SOVEREIGN OF YOUR SMART HOME": "كن السيد الكامل لمنزلك الذكي",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "أول خادم لمنزل ذكي مبني بالكامل على المصدر المفتوح — من وحدة المعالجة المركزية إلى السحابة اللامركزية.",
  "Overview": "نظرة عامة",
  "RISC-V — Get Server with Open Architecture": "RISC-V — احصل على خادم ببنية مفتوحة",
  "RISC-V is an open and modular processor architecture based on a reduced instruction set (RISC). Unlike proprietary solutions, it offers flexibility for customization without licensing restrictions, making it ideal for IoT devices and servers. RISC-V enables highly efficient and cost-effective designs, which translate into lower power consumption and better performance of your home server.": "RISC-V هي بنية معالج مفتوحة ومعتمدة على مجموعة تعليمات مخفضة (RISC). على عكس الحلول الخاصة، توفر مرونة للتخصيص دون قيود ترخيص، مما يجعلها مثالية لأجهزة الإنترنت الأشياء والخوادم. تتيح RISC-V تصميمات فعالة وفعالة من حيث التكلفة، مما يترجم إلى استهلاك طاقة أقل وأداء أفضل لخادم منزلك.",
  "Specification of server:": "مواصفات الخادم:",
  "Processor:": "المعالج:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 مع معالج RISC-V رباعي النواة، ذاكرة مؘخرة L2 بسعة 2 ميجابايت، تصل إلى 1.5 جيجاهرتز، دعم ISA RV64GC",
  "GPU:": "بطاقة الرسومات:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1، تصل إلى 600 ميجاهرتز",
  "Memory:": "الذاكرة:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 جيجابايت LPDDR4 SDRAM، تصل إلى 2800 ميجابت في الثانية",
  "Storage:": "التخزين:",
  "32 GB TF card (minimum)": "طاقة TF بسعة 32 جيجابايت (الحد الأدنى)",
  "Interfaces:": "الواجهات:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "منافذ إيثرنت جيجابت مزدوجة، 4 منافذ USB 3.0 من النوع A، رأس GPIO بـ 40 دبوسًا، موصل M.2، مقبس eMMC، رأس مروحة بـ 2 دبوس",
  "Power:": "الطاقة:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5 فولت تيار مستمر عبر USB-C، تصل إلى 30 وات (الحد الأدنى 3 أمبير) أو إدخال 5 فولت عبر رأس GPIO بـ 40 دبوسًا",
  "OS:": "نظام التشغيل:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "check our setup guide": "تحقق من دليل الإعداد الخاص بنا",
  "Home Assistant — Install Open-Source Platform for Home Automation": "Home Assistant - قم بتثبيت منصة مفتوحة المصدر لأتمتة المنزل",
  "Home Assistant is an open-source home automation platform designed to give users full control over their smart devices. It runs entirely locally, ensuring maximum privacy and eliminating dependence on third-party cloud services. Its core strength lies in its flexibility, enabling users to create custom integrations and automations that suit their specific needs like lighting, security, and climate control, regardless of brand.": "Home Assistant هو منصة أتمتة منزلية مفتوحة المصدر مصممة لمنح المستخدمين السيطرة الكاملة على أجهزتهم الذكية. يعمل تمامًا محليًا، مما يضمن الخصوصية القصوى والتخلص من الاعتماد على خدمات السحابة من الأطراف الثالثة. تكمن قوته الأساسية في مرونته، مما يتيح للمستخدمين إنشاء تكاملات وأتمتة مخصصة تناسب احتياجاتهم الخاصة مثل الإضاءة والأمان والتحكم في المناخ، بغض النظر عن العلامة التجارية.",
  "Features:": "الميزات:",
  "Local control:": "التحكم المحلي:",
  "runs entirely on local hardware": "يعمل تمامًا على الأجهزة المحلية",
  "Modular design:": "تصميم قابل للتوسيع:",
  "Highly flexible, allowing users to add various components, automations and integrations": "مرن للغاية، مما يتيح للمستخدمين إضافة مكونات مختلفة وأتمتة وتكاملات",
  "No vendor lock-in:": "لا توجد قفل بائع:",
  "Supports over 3000 integrations with devices from various manufacturers": "يدعم أكثر من 3000 تكامل مع أجهزة من مصنعين مختلفين",
  "Home Assistant Core Installation": "تثبيت Home Assistant Core",
  "Robonomics Integration — Integrate Corporate-Free Cloud with P2P Remote Control": "Robonomics Integration — Integrate Corporate-Free Cloud with P2P Remote Control",
  "Robonomics has developed its own integration for Home Assistant, which brings all the benefits of a decentralized cloud and p2p communications to the smart home. Only you have cryptographic access to all the functions of the home and decide who will use it.": "لقد طوّرت Robonomics تكاملها الخاص لـ Home Assistant، الذي يجلب جميع فوائد السحابة اللامركزية والاتصالات نقطة لنقطة إلى المنزل الذكي. فقط أنت تمتلك وصولًا تشفيريًا إلى جميع وظائف المنزل وتقرر من سيستخدمها.",
  "Functions:": "الوظائف:",
  "Remote access to the current device states": "الوصول عن بعد إلى حالات الجهاز الحالية",
  "Remote device control via parachain or Libp2p": "التحكم في الجهاز عن بعد عبر parachain أو Libp2p",
  "Home Assistant users management": "إدارة مستخدمي Home Assistant",
  "Backing up and restoring HA configuration": "نسخ احتياطي واستعادة تكوين HA",
  "Storing digital twin of the home in a secure decentralized cloud": "تخزين نسخة رقمية مزدوجة للمنزل في سحابة لامركزية آمنة",
  "Secure report service for technical support providing": "خدمة تقارير آمنة لدعم فني",
  "Robonomics Integration Installation": "تثبيت تكامل Robonomics",
  "Zigbee/Wi-Fi Smart Devices — Add Thousands of Solutions for Any Needs": "أجهزة Zigbee/Wi-Fi الذكية — إضافة آلاف الحلول لأي احتياج",
  "Numerous Home Assistant integrations allow you to use almost any device based on the Zigbee and Wi-Fi protocols.": "تسمح التكاملات العديدة لـ Home Assistant باستخدام تقريبًا أي جهاز يعتمد على بروتوكولات Zigbee و Wi-Fi.",
  "Thanks to the power of Zigbee2MQTT": "بفضل قوة Zigbee2MQTT",
  "almost 4000 different devices": "تقريبًا 4000 جهاز مختلف",
  "are available to you right from the start: from simple temperature sensors to energy consumption monitoring.": "متاحة لك من البداية: من أجهزة استشعار درجة الحرارة البسيطة إلى مراقبة استهلاك الطاقة.",
  "Zigbee Devices in Zigbee2MQTT": "أجهزة Zigbee في Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "أضف مجال RoSeMAN إلى مزود الخرائط عن بعد.",
  "Community & Contacts": "المجتمع والاتصالات",
  "Meanwhile, you can check available translations": "وفي الوقت نفسه، يمكنك التحقق من الترجمات المتاحة",
  "All hardware": "جميع الأجهزة",
  "Use it": "استخدمها",
  "Learn": "تعلم",
  "Explore website": "استكشف الموقع",
  "Timeline since 2015": "الجدول الزمني منذ عام 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "يقوم الفريق بإكتساب مهارات جديدة في تصميم وبرمجة الأجهزة الذكية من الصفر.",
  "sensors.social": "المستشعرات.اجتماعية",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "تم إنشاء شبكة حيث تعمل أجهزة الاختبار التي طورها مهندسو Robonomics. تم أيضًا تطوير سلسلة من أجهزة المنزل الذكية بناءً على تقنية Tasmota Wi-Fi، ومنذ صيف عام 2024، كانت هذه السلسلة تخضع لعملية التصديق لسوق الاتحاد الأوروبي. في خريف عام 2024، ستقدم فريق المشروع سلسلة من الأجهزة مفتوحة المصدر والتي تعمل بتقنيات Web3، تحت اسم \"Hardware for Cryptopunks\".",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "تستمر Robonomics في النمو ضمن نظام Polkadot. تعمل شبكة Kusama parachain لأكثر من عامين، وابتداءً من خريف عام 2024، ستطلق أيضًا parachain على شبكة Polkadot. تم تسجيل أكثر من 5 ملايين عملية من أجهزة المستخدم على الشبكة. يواصل الفريق استكشاف إمكانيات دمج تطبيقاتهم عبر كل من Ethereum و Polkadot.",
  "Robo Smart Devices:": "أجهزة Robo Smart:",
  "Read books": "اقرأ الكتب",
  "Robonomics merch": "منتجات روبونوميكس",
  "Robonomics hardware": "أجهزة روبونوميكس"
}