{
  "What is Robonomics network?": "Robonomi̇ks nədi̇r?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics əşyaların interneti tətbiqləri üçün açıq mənbə platformasıdır. Biz istifadəçi proqramları, Əşyaların İnterneti xidmətləri və mürəkkəb robot texnikası arasında atomar əməliyyatları şəklində texniki və iqtisadi məlumat mübadiləsini həyata keçirən yeni nəsil İnternet texnologiyalarını (web3) dəstəkləyirik.",
  "Get started": "Start",
  "Explore Robonomics": "Robonomikanı kəşf edin",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonimika hər kəsə əlçatan olan IoT bazarı üçün açıq mənbə texnologiyasıdır. Daha ətraflı məlumat əldə etmək üçün icra məzmunu oxuyun.",
  "Get XRT": "XRT əldə edin",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT, Ethereum şəbəkəsi və Robonomika paraçeyn üzərində IoT cihazların idarə etməyə imkan verən faydalı tokendir",
  "Use a Dapp": "DApp-dan istifadə edin",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "IoT cihazlarını idarə etmək üçün mərkəzləşdirilməmiş tətbiqin Beta versiyasına nəzər salın",
  "Start building": "Qurmağa başlayın",
  "Robonomics objectives": "Robonomikanın məqsədləri",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Bulud platformalarının nailiyyətlərinə əsaslanaraq, Robonomika insan-maşın rabitəsinin hər mərhələsində IoT bazarına daha təhlükəsiz və daha təkmil İnternet həlləri təklif etməyi hədəfləyir. Robonomika inkişaf etdiyi əsas məqsədlər:",
  "IoT device management with a decentralized cloud": "Mərkəzləşdirilməmiş bulud ilə IoT cihazlarının idarə edilməsi",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Blockchain şəbəkələri cihazı işə salmaq və telemetriya qəbul etmək üçün ən yüksək təhlükəsizlik dərəcəsini təmin etmək üçün bütün parametrlərə malikdir. Bir cihazla qarşılıqlı əlaqə əslində blokçeyn şəbəkəsində saxlanılan rəqəmsal əkizin vəziyyətini dəyişdirməklə və bu dəyişikliklər haqqında məlumatı fiziki cihaza çatdırmaqla təsvir edilə bilər. “İcazəsiz blokçeyn”dən istifadə edildiyi halda, biz provayderlərin qlobal mövcudluğuna, eləcə də rəqəmsal əkizin məlumatların arzuolunmaz dəyişikliklərdən yüksək səviyyədə qorunmasına əmin ola bilərik.",
  "Techno-economic transactions between humans and machines": "İnsanlar və maşınlar arasında texno-iqtisadi əməliyyatlar",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Avtomatlaşdırılmış sistemlərin kriptovalyutalar və smart müqavilələr vasitəsilə birbaşa rəqəmsal bazarlara çıxışı baxımından institusional nailiyyətlərdən danışa bilərik. Məsələn, Ethereum artıq iqtisadi fəaliyyətin əsas alətlərinin əksəriyyətini həyata keçirir. Bu gün istifadəçini və IoT cihazlarını birləşdirmək üçün yaradılmış proqramlar, ödəniş və xidmət şərtləri cihazın işə salınma parametrlərindən ayrılmaz olarsa, daha səmərəli olacaq.",
  "Serverless IoT applications for users": "İstifadəçilər üçün serversiz IoT tətbiqləri",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Müasir tətbiqlərin istifadəçilərinin məxfiliyi məsələsi şirkətlərin web3 sahəsində müasir nailiyyətlərdən istifadə edə bilməməsində ilişib qalmamalıdır. Telemetriyaya daxil olmaq və cihazı idarə etmək üçün autentifikasiyaya və ya xüsusi serverlərə qoşulmağa ehtiyac yoxdur.",
  "Learn with Robonomics": "Robonomics İlə öyrəni̇n",
  "Introduction course": "Giriş kursu",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Müasir İOT proqramlarının yaradılması ilə bağlı yaranan problemlərə və IoT tərtibatçıları və istifadəçiləri üçün web3 texnologiyaları və Robonimics alətləri ilə mümkün həll yollarına nəzər salın.",
  "Boston dynamics spot software developing": "Boston Dynamics Spot Proqram təminatının hazırlanması",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Biz sizə Spot SDK təhsil proqramını təqdim etməkdən məmnunuq! Məqsədimiz sizi Spot-un SDK-sı ilə tanış etmək və laboratoriyamızda Boston Dynamics Spot robotundan istifadə edərək bacarıqlarınızı uzaqdan yoxlamağa imkan verməkdir.",
  "Sovereign smart home with robonomics and home assistant": "Robonimics və Ev Köməkçisi ilə Suveren Ağıllı Ev",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Bu kursda siz öz suveren ağıllı evinizi qurmaq üçün tələb olunan bütün addımlardan keçəcəksiniz, bunun əsas üstünlüyü istifadəçi məlumatlarının təhlükəsizliyi / məxfiliyidir.",
  "Shop": "Mağaza",
  "Science papers": "Elmi̇ məqələlər",
  "Books": "Ki̇tablar",
  "Logo and assets": "Logo və akti̇vlər",
  "Blog": "Blog",
  "Ambassador program": "Ambassador programi",
  "Contacts": "Əlaqə",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Xronologi̇ya",
  "Tokenomics": "Tokenomi̇k",
  "Parachain": "Parachain",
  "User (D)App": "Tətbiq",
  "Function request": "Demande de fonction",
  "Report": "Hesabat",
  "Control": "Kontrol",
  "Log": "Qeyd",
  "IoT Device": "İoT cihazi",
  "Decentralized application": "Mərkəzləşdi̇ri̇lməmi̇ş tətbi̇q",
  "Digital twin": "Rəqəmsal əkiz",
  "IoT / Smart device": "İoT / Ağilli ci̇haz",
  "Robonomics tokenomics": "Robonomi̇cs tokenomi̇cs-I",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": ",Ethereum Şəbəkəsinin və Polkadot ekosistemində Robonomics Parachain-də İOT cihazlarını idarə etməyə imkan verən faydalı tokendir.",
  "The task": "Tapşırıq",
  "Be aware of scammers": "Fırıldaqçılardan xəbərdar olun",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "XRT mübadiləsi üçün yalnız tanınmış bazarlardan istifadə edin. Hər hansı əməliyyat (token almaq və ya satmaq) keçirdmık istədiyiniz hallarda tokenlərinizi özəl mesajlarda sizə verilən hesablara göndərməyin. Rəbonomics token haqqında hər hansı bir 'yüksək səsli ifadələr' alsanız (fırıldaqçılar tez-tez 'airdrop elanı' kimi bir şey istifadə edirlər), bu veb saytı (https://robonomics.network/) və ya rəsmi",
  "for official updates. Be careful, be safe.": "-imizi yeniləmələr üçün yoxlayın. Ehtiyatlı olun, təhlükəsiz olun.",
  "XRT in Ethereum": "XRT Ethereum-da",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "2015-2018-ci illərdə Robonomics layihəsini tətbiq edərkən, layihə komandasının məqsədi, əsasən, robot-xidmət-kimi modelinə uyğun olaraq IoT cihazlarının işə salınması və Ethereum-dakı qaz haqlarının Robonomics təchizatçılarına geri ödənilməsi arasında əlaqəni tapmaq idi. Bir xidmət etmək üçün hər bir fərdi ağıllı cihazın öhdəliyinin ömrü haqqında düşünməliyik. Robonomics-də əvvəlcədən aparılan Tədqiqat və İnkişafın nəticəsi olaraq, komanda yaradılmış hər robot-xidmət-kimi smart kontraktının mükafatlandırılması üçün yeni tokenlər çıxarma mekanizmi ilə çıxış edib. Bu model, Ethereum üzərindəki Robonomics'ın gələcəyi üçün hələ də əlverişlidir, lakin yalnız Ethereumda əhəmiyyətli təkmilləşdirmələr edildikdə imkanlıdır.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "XRT-nin Ethereum ekosistemi üçün tarixi fonunu və komandanın uzunmüddətli planlarını öyrənmək üçün bunu oxuyun.",
  "Etherscan profile": "Etherscan profili",
  "View token smart contract and transactions in Ethereum network here.": "Buradakı Ethereum Şəbəkədəki Smart Müqaviləni və Əməliyyatlara baxın.",
  "Coingecko markets": "Coingecko bazarları",
  "Here you can find CEX and DEX markets for trading XRT.": "Burada XRT ticarəti üçün CEX və DEX bazarlarını tapa bilərsiniz.",
  "XRT In Polkadot": "XRT Polkadot-da",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Ethereum-dan Polkadot-a keçid zamanı, tokenomikada 'scaling up' etməliyik. Polkadot ekosistemindəki Parachain-lər, ağıllı müqavilənin ekvivalenti deyil, lakin ümumi şəbəkənin bir seqmentini icarəyə verən tam proqramlaşdırıla bilən bir blokchaindir.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Polkadot və Kusama parachain-ləri tərəfindən faktiki ödəniş, hərraclardan birini qazanmaq üçün kifayət qədər miqdarda yerli Relay zəncir tokenlərinin (DOT / KSM) uzunmüddətli bağlanmasıdır. Robonomics parachain-dəki XRT, slotların yenilənməsini və maraqlı tərəflər üçün mükafatları dəstəkləyir. IoT abunələrinin aktivləşdirilməsinin əsasını təşkil edən XRT yandırma mexanizmi inflyasiyanı minimuma endirmək, faiz dərəcəsini isə sıfıra endirilməsi üçün nəzərdə tutulub.",
  "Learn more": "Şəbəkə memarımızdan ",
  "in Twitter thread from our network architect.": "Twitter mövzusunda daha çox məlumat əldə edin.",
  "Usage:": "XRT İstifadəsi:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT həm parachain üzərində əməliyyatların yerinə yetirilməsi üçün rüsumların ödənilməsi, həm də cihazın və ya istifadəçinin IoT əməliyyatlarının prioritet işlənməsinə zəmanət verən IoT abunəsi almaq üçün istifadə edilə bilər.",
  "Rewards:": "Mükafatlar:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "İl ərzində kollatorları həvəsləndirmək üçün parachain az miqdarda XRT buraxır.",
  "The parameter of the total reward": "Kollatorlar üçün illik ümumi mükafat parametri token",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "sahibkarların tərəfindən on-chain səsvermə ilə müəyyən edilir və referendum keçirərək dəyişdirilə bilər.",
  "Use XRT": "XRT-ni istifadə et",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Mərkəzsizləşdirilmiş tətbiqimizdə IOT abunə alın. Heç bir mərkəzləşdirilmiş korporasiya müşahidə etmədən ağıllı cihazlarınızı blockchain üzərində idarə edin.",
  "Subscan profile": "Subscan profili",
  "View token statistics on top of Polkadot ecosystem.": "Polkadot ekosistemində olan token statistikasına baxın.",
  "Other questions": "Di̇gər suallar",
  "What is RWS?": "RWS nədir?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Əsas funksionallığın inkişafı mərhələsində] Mühəndislər üçün Core Dev komandası müxtəlif Robonomics istifadə modelləri yaratmağa çalışacaq və bu yolda ilk addım ömürlük abunə tokeni - RWS tokenini işə salmaqdır. Hər bir RWS tokeni sizə Robonomics Parachain vasitəsilə IoT cihazınızdan/cihaza saniyədə 1 əməliyyat (tps) verəcək. RWS tokeninizi aktivləşdirin və icradan əvvəl və proqnozlaşdırıla bilən gecikmə ilə 'gas free' əməliyyatları edin. RWS tokenini deaktiv edin və onu DEX-də ticarət edin.",
  "What is AIRA/AIR ID?": "AIRA/AIR ID nədir?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT tokeni 2017-ci ildə Ethereum-da gələcək Robonomics infrastrukturunun muxtar hissəsi kimi paylandı. 2019-cu ildə Ethereum üzərindən Robonomics-in uğurla işə salınmasından sonra, AIRA tokenləri, Pre-XRT-dan ERC-20 XRT-ə dəyişdirilməsinin avtonom və müstəqil prosesinə zəmanət verən",
  "ambix smart contract": "ambix smart müqaviləsi",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "vasitəsilə, layihənin yaradılmış infrastrukturuna qoşuldu.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Robonomomics tokenin, blokchain infrastrukturunda ağıllı şəhərlər və sənayə 4.0 xidmət üçün mərkəzləşdirilməmiş bir şəbəkənin işləməsini təmin etməkdir. Bu məqsədə çatmaq üçün, token iqtisadiyyatı şəbəkənin icrası üçün stimulları əks etdirməlidir.",
  "Token distribution": "Token dağıtımı",
  "Try our Dapp": "Dapp'imizi deneyin",
  "Attention please": "Diqqət xahiş olunur",
  "In addition": "Ek olarak",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "farklı bağımsız ekipler tarafından sağlanan araçlar kullanarak XRT'yi Polkadot (Kusama) ve Ethereum topluluklarında blok zincirleri içinde işletebilirsiniz.",
  "Within the Kusama network, you have the capability use": "Kusama ağı içinde,",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "Robonomics parachain ve diğer parachainler arasında iletişim kurmak için çeşitli merkezi olmayan uygulamalar (dApp'ler) kullanma yeteneğine sahipsiniz:",
  "Within the Ethereum network you can use decentralized application powered by the": "Ethereum ağı içinde, güçlendirilmiş merkezi olmayan uygulamaları kullanabilirsiniz.",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Lütfen dikkat",
  "announced": "Köprü işlemleri için Multichain hizmetini kullanıyorsanız, lütfen şu anda kullanmaktan kaçının, çünkü",
  "on the official Twitter of The Multichain.": "duyuruldu",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Mərkəzləşdirilməmiş proqram (dapp) Blockchain daxilində işləyir. Açıq mənbədir və onun məlumatları IPFS və Github-da xidmət göstərir. Bu texnologiyalar tətbiqin eyni zamanda təhlükəsiz və şəffaf olmasına imkan verir. Tərtibatçılarımız həm Robonomics proqramının inkişafı, həm də öz dap-nizi qurarkən istifadə edə biləcəyiniz kitabxanalar üzərində işləyirlər.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Rəqəmsal əkiz, Robonomics Veb Xidmətləri (RWS) tərəfindən təqdim edilən bir alətdir. O, həqiqi dünya avadanlığının rəqəmsal versiyası kimi çıxış edir və onun bütün texniki xüsusiyyətlərini köçürür. Bu, mərkəzləşdirilməmiş bir tətbiqi istifadəçinin əmrlərinə daha çox istifadə etməyə imkan verir.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Siz evinizin/ofisinizin müxtəlif aspektlərini avtomatlaşdırmaq və idarə etmək üçün geniş çeşiddə Zigbee ağıllı cihazları ilə Robonimics-dan istifadə edə və ya daha mürəkkəb sənaye tapşırıqları üçün ROS əsaslı robototexnika ilə istifadə edə bilərsiniz.",
  "Want emails from robonomics": "Robonimcs-dan e-poçt almaq istəyirəm",
  "Adding you to our special list...": "Sizi xüsusi siyahımıza əlavə edirik...",
  "Nice, you are in the list": "Əla, siyahıdasınız",
  "Something went  wrong. Try again later": "Xəta baş verdi. Biraz sonra yenidən cəhd edin",
  "Your email": "E-poçtunuz",
  "Community & Contacts": "Toplum & Əlaqələr",
  "Get latest updates": "Ən son yenilikləri alın",
  "Tell us something if you want": "Bir şey demək istəyirsinizsə bizə bildirin",
  "Submit": "Göndər",
  "Something went  wrong :( Try again later": "Bir şey səhv oldu :( Daha sonra yenidən cəhd edin",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "İl böyük bir nailiyyətlə başladı - Robonomics 20-ci parachain slot auksionunu qazandı və",
  "officially became": "rəsmi olaraq Kusama şəbəkəsində ID 2048 ilə parachain oldu.",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "Başlama, datalog, DigitalTwin, məsuliyyət funksiyaları və IoT abunəlikləri ekosistemin bütün istifadəçiləri üçün əlçatan oldu. Layihənin bu mərhələsi üçün təfərrüatları təmin etmək üçün əsas komanda",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "-ın ilk fəsillərini nəşr etdi.Substrate'da Robonomics 2.0 XCM mesajları dəstəyi ilə buraxıldı və funksionallığı bizim üçün son dərəcə faydalı olan digər parachainlərlə (Crust Shadow və Darwinia kimi) HRMP kanallarını açmağa başladıq.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Eyni zamanda, protokolumuzu IoT bazarına təqdim etmək üçün strategiyanı hazırladıq. IoT avadanlığı ilə apardığımız təcrübələr bizi mərkəzləşdirilmiş bulud xidməti təminatçılarından müstəqil olan suveren ağıllı ev konsepsiyasına gətirib çıxardı. Biz Home Assistant avtomatlaşdırma sistemi ilə",
  "integration": "inteqrasiyamızı",
  "with the Home Assistant automation system, and also designed our own": "inkişaf etdirdik, həmçinin ağıllı cihazları birləşdirmək üçün öz",
  "IoT gateway": "IoT şlüzümüzü",
  "for connecting smart devices.": "hazırladıq.",
  "We have launched two big initiatives in order to increase community engagement —": "İcma ilə əlaqəni artırmaq üçün iki böyük təşəbbüsə başladıq - ",
  "Robonomics Academy": "Robonomics Akademiyası",
  "Robonomics Ambassador Program": "Robonomics Ambassador Proqramı",
  "Additionally,": "Bundan əlavə,",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "payızda keçirildi ki, Robonomics icması bizim idarəetmə mexanizmlərimizi ilk dəfə sınaqdan keçirə bilsin. Bu yaxınlarda Robonomics komandası DAO IPCI layihəsinə ağıllı binalar üçün karbon əvəzləmə xidmətini təqdim etmək üçün parachain slotu əldə etməyə kömək etdi.",
  "In 2021, our": "2021-ci ildə",
  "main focus": "əsas diqqətimiz",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "IoT tətbiqlərinin Kusama şəbəkəsi üzərindəki parachain'imiz vasitəsilə istifadə oluna bilməsi üçün layihənin hazırlanmasına keçdi. Substrate'da Robonomics 1.0 buraxıldı və biz onların telemetriya məlumatlarını göndərmək üçün parachain-lə birləşdirən sensorları sınaqdan keçiririk, həmçinin rəqəmsal əkiz funksionallığı inkişaf etdiririk. İlin ortasında biz şəbəkəmizin tam dövrəsini sınaqdan keçirmək qərarına gəldik və Robonomics parachaininin inteqrasiya olunduğu (Kusama relay chain'ə keçməzdən əvvəl)",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "adlı öz relay chain yaratdıq. Kusamada bir parachain yuvası əldə etməyə çox diqqət yetirildi, bunun üçün bir neçə crowdloan kampaniyası təşkil etdik.",
  "There have been two big changes for the community. First, we launched the": "Cəmiyyət üçün iki böyük dəyişiklik oldu. Birincisi, biz web3, robototexnika və IoT layihələrinin R&D tapşırıqları üçün maliyyə almasına imkan verən",
  "Robonomics Grant Program": "Robonimika Qrant Proqramını",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "işə saldıq. İlin sonuna qədər proqramda dörd aktiv layihə iştirak etmişdir. İkincisi, komanda Ethereum token sahiblərinə XRT tokenlərini parachain-ə köçürməyə imkan verən",
  "Exodus process": "Exodus prosesinə",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "başladı.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Əməkdaşlıqlar arasında, MerkleBot-da Boston Dynamics Spot-un diqqətəlayiq görünüşünü xatırlaya bilərik, bunun üçün icarəyə",
  "rental remote control system": "verilən uzaqdan idarəetmə sistemi",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "hazırlanmışdır. Robonomics mühəndislərindən ibarət komanda tərəfindən yaradılmış şəxsi layihə olan Multi-Agent Systems şirkəti haqqında da sizə məlumat vermək istərdik. Onlar qəhvəxana sahibləri üçün yemək bişirmə tapşırıqlarını yerinə yetirən Eisenkoch adlı robot vafli bişirən maşın hazırlayıblar.",
  "There came a time when the existing limitations of Ethereum": "Ethereum-un mövcud məhdudiyyətlərinin",
  "began to stand out clearly": "aydın şəkildə fərqlənməyə başladığı",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "bir vaxt gəldi (xüsusən, zəif miqyas, aşağı sürət və əməliyyatların çox yüksək qiyməti). ETH2.0-a yüksəlmə vəziyyəti düzəltməli idi, lakin bu təkmilləşdirmə dəfələrlə gecikdirildi. Ethereum şəbəkəsindən ayrılmaq istəməsək də, indiki vəziyyətdə istifadə hallarımızı həyata keçirməyin çətin olduğunu başa düşdük və alternativ şəbəkə axtarmağa başladıq. Parçalanmış blokçeyn ekosistemi Polkadot bu alternativ oldu. Əsas Robonimics xüsusiyyətlərini köçürmək və öz test şəbəkəmizi yerləşdirmək üçün Substrate framework'u ilə sınaqdan başladıq. Bu mərhələnin sonunda biz parachain-imizi Rococo test şəbəkəsində yerləşdirdik və Kusama şəbəkəsində slot əldə etməyə hazırlaşmağa başladıq.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Əşyaların İnterneti sistemlərinin öyrənilməsini davam etdirərək, biz istifadəçilərə əlavə dəyər yarada bilən Robonomics-in əsas funksionallığını – IoT üçün mərkəzləşdirilməmiş bulud funksiyasını müəyyən etdik. Bu ideya",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "əsasını təşkil etmişdir. RWS infrastrukturu tipik mərkəzləşdirilmiş buludun bütün funksiyalarını öz üzərinə götürdü, lakin qlobal mövcudluq, təhlükəsizlik və məxfilik kimi standart problemlər olmadan. Bundan əlavə, biz abunə sahiblərinə hər bir əməliyyat üçün heç bir ödəniş etmədən blokçeyn şəbəkəsindən istifadə etməyə imkan verən parachain IoT abunələri ideyası ilə gəldik. IoT abunəliyi ilə bağlı ilk təcrübə sahibinə blok başına 1 tranzaksiya göndərməyə imkan verən RWS tokeninin emissiyası olub. Bundan əlavə, biz smart cihazların idarə edilməsi üçün öz aparat dəstimizi (DAOS konsepsiyası) inkişaf etdirmək üçün ilk addımları atmağa başladıq.",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Təbii ki, Ethereum-da Robonomics-ə dəstək dayanmayıb. Robonomics kommunikasiya stack-ı",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "versiyasına uyğunlaşdırılıb. XRT tokeni bir neçə birjada (xüsusilə, Uniswap DEX) ticarətə başlayıb və likvidliyin stimullaşdırılması proqramı işə salınıb.",
  "The team actively developed ways to interact with the community. The first version of our": "Komanda fəal şəkildə cəmiyyətlə əlaqə qurmağın yollarını inkişaf etdirdi. Bizim",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "saytımızın və Robonomics Wiki-nin ilk versiyası istifadəyə verildi. Layihənin daha şəffaf və rahat idarə olunması üçün biz",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "-dan istifadə etməyə başladıq. Layihəyə yeni gələnlər üçün 2019-cu ildə",
  "Robonomics Winter School": "Robonimika Qış Məktəbini",
  "in 2019 for newcomers to the project.": "ikeçirdik.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Xoş layihələrlə əməkdaşlıq da davam etdirildi. Robonomics və DAO IPCI sensor məlumatların toplanması və təhlili üçün",
  "Robonomics became the foundation for the": "xidməti təqdim etdi. Robonomics robot avadanlıqlarının ağıllı lizinq sistemini inkişaf etdirən",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "layihəsinin təməli oldu.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Biz başa düşdük ki, muxtar agentlərə onların etibarlı texniki və iqtisadi əməliyyatlarını təmin edəcək mühit lazımdır. Bir neçə ildir ki, biz robot agentlərə öz xidmətlərini göstərməyə kömək edən mərkəzləşdirilməmiş provayderlər şəbəkəsi yaratmaq üçün protokol hazırlayırdıq.Ethereum və ROS arasında rabitə yığını və şəbəkəyə texniki xidmət üçün alətlər hazırlanmışdır. 2018-ci ildə biz",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "nəşr etdik və Robonomics Network-ün alfa versiyası Ethereum şəbəkəsində istifadəyə verildi. XRT token generasiya tədbiri üçün aktiv hazırlıqlar davam etdi (bu, ilk kripto qışı səbəbindən 2019-cu ilin yazında baş verdi).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Bu dövrdən etibarən Robonomics Sənaye 4.0 ilə əlaqəli istifadə hallarını dinamik şəkildə inkişaf etdirməyə başladı - ağıllı fabriklər, ağıllı şəhərlər və ağıllı evlər - və bu, IoT dünyasına diqqətimizi cəlb etdi. Yenilik axtarışında komanda bir neçə böyük və unikal elmi-tədqiqat demolarını təqdim etdi: mülki",
  "sensor network": "sensor şəbəkəsi",
  "a water drone": "ətraf mühitin monitorinqi üçün su dronu",
  "for environmental monitoring (supported by a sensor systems manufacturer": "(sensor sistemləri istehsalçısı",
  "a smart factory model": "tərəfindən dəstəklənir), ağıllı fabrik modeli",
  "a self-employed": "öz-özünə işləyən",
  "robot artist Gaka-chu": "robot rəssamı Gaka-chu",
  "and a": "və",
  "drone traffic management system": "dron nəqliyyatının idarə edilməsi sistemi",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomiks web3 texnologiyaları və IoT cihazlarından istifadə etməklə ekoloji aktivlərin idarə edilməsi üzrə DAO IPCI layihəsi ilə əməkdaşlığa başlayıb.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Bu, p2p texnologiyalarının robototexnika üçün əvvəllər mövcud olmayan imkanlara malik olduğu bir sıra tapşırıqları müəyyən etdiyimiz fəal R&D dövrü idi. Ethereum kompüterini, IPFS fayl saxlama sistemini və Robot Əməliyyat Sistemini (ROS) birləşdirərək, hər hansı bir cihazın potensial olaraq",
  "autonomous intelligent robot agent": "avtonom ağıllı robot agentinə",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "çevrilə biləcəyini başa düşdük. Öz növbəsində bu, bizim üçün Robot-Servis-Kimi və robot iqtisadiyyatı anlayışlarına yol açdı.",
  "Our publications in scientific journals of this period are available in the": "Bu dövrə aid elmi jurnallardakı nəşrlərimiz",
  "Papers section": "Papers bölməsində mövcuddur",
  "We have collected all R&D projects over the years in the": "İllər ərzində bütün R&D layihələrini",
  "a handy book": "lazımlı bir kitabda topladıq",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Hamısı Ethereum öz ana şəbəkəsini yenicə işə saldıqda təsisçilərin ağlına gələn bir fikirlə başladı. Əgər robot kriptovalyuta üçün müştəri üçün tapşırıq yerinə yetirirsə və onun məntiqi ağıllı müqavilə ilə idarə olunursa?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "İdeyanı yoxlamaq üçün istifadəçi ödəniş əməliyyatını tamamladıqdan sonra müəyyən edilmiş GPS koordinatlarına nail olmaq üçün Ethereum kompüteri tərəfindən idarə olunan dronun işə salındığı demo hazırladıq.",
  "The demo is available on": "Demo",
  "YouTube": "YouTube-da mövcuddur.",
  "Infrastructure && tech development timeline": "İnfrastruktur və texnoloji̇ İnki̇şaf təqvi̇mi̇",
  "Notable events": "Görkəmli tədbirlər",
  "World Economic Forum Annual Meeting 2022": "Dünya İqtisadi Forumunun İllik Toplantısı 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "Suveren Ev Avtomatlaşdırma Yolunda",
  "Becoming a Parachain for IoT Applications": "IoT Tətbiqləri üçün Parachain olmaq",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (Robonomics tərəfindən dəstəklənib)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (Robonomics tərəfindən təşkil olunub)",
  "Transition to Multinetwork — Along Came Polkadot": "Multişəbəkəyə keçid - Polkadot gəldi",
  "The Rise of Robonomics Network": "Robonomika Şəbəkəsinin Yüksəlişi",
  "Crypto Valley Conference 2018": "Kripto Vadisi Konfransı 2018",
  "European Parliament workshop 'The Economy of Robots'": "Avropa Parlamentində “Robotların İqtisadiyyatı” seminarı",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MIT Media Laboratoriyasında Robotik Sistemlər üçün Blockchain üzrə Simpozium",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics komandasının təşkilatı ilə “Robonomics-2018” yay məktəbi",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Web3 Texnologiyaların və Robotik Framework-lərin bir araya gətirilməsi",
  "Playing with Human-Machine Interaction through Ethereum": "Ethereum vasitəsilə insan-maşın qarşılıqlı əlaqəsi ilə oynamaq",
  "Robonomics whitepaper 2022 welcome guide": "Robonomika whitepaper 2022 təli̇mati",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Biz Ethereum və IPFS üzərində işləyən texno-iqtisadi maşın rabitə protokolu hazırlamışıq və onu Polkadot parachain əsasında bulud əsaslı IoT platformasının elementləri ilə tamamlayırıq. Bu gün artıq futuristik IoT tətbiqləri yaratmaq üçün hibrid platformamız var. Qlobal mərkəzləşdirilməmiş kompüterin nəzarəti altında olan cihazlarla qarşılıqlı əlaqəni təmin edir. Robonomics platformasından istifadə edərək təhlükəsiz, serversiz və futuristik IoT proqramları yaratmağa başlamazdan əvvəl gəlin nəzəriyyəyə bir az nəzər salaq...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomika white paper-in ilk iki fəsli artıq istifadəçilər üçün mövcuddur.",
  "Chapter 1.": "Fəsi̇l 1.",
  "At the intersection of cybernetics and economics": "Kibernetika və iqtisadiyyatin sərhəddində",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Biz robot cihazların əvvəllər insanlar üçün nəzərdə tutulmuş əsas iqtisadi fəaliyyətləri yerinə yetirə bilən müstəqil agentlər kimi çıxış etdiyi iqtisadi sistem təqdim etdik. Bu fəsildə biz insanların həyatının mühüm hissəsinə çevrilə bilən və gələcəkdə iqtisadiyyatın hazırkı səviyyəsini tam avtomatlaşdırılmış xidmətlərə çevirə bilən robot iqtisadiyyatının aktuallığından danışacağıq.",
  "In this chapter you will learn": "Bu fəsildə aşağıdakıları öyrənəcəksiniz",
  "Ronald Coase and The Nature of the Firm": "Ronald Kouz və firmanın təbiəti",
  "CPS - cyber-physical system": "CPS - kiber-fiziki sistem",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener və həyatda və maşında nümunələrin axtarış",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Dördüncü Sənaye İnqilabı, Robotlar üçün Pul və Bitcoin",
  "Ethereum Smart Contracts": "Ethereum Ağıllı Müqavilələri",
  "Polkadot Parachains": "Polkadot parachainləri",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Teleologiya və Mizesin işinin açıq sualları",
  "Read chapter 1": "1-ci fƏsli oxuyun",
  "Chapter 2.": "Fəsi̇l 2.",
  "Robonomics architecture": "Robonomi̇ka arxitekturasi",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "İkinci fəsildə siz müasir İnternet texnologiyasından istifadə edərək insan-maşın qarşılıqlı əlaqəsi haqqında oxuyacaqsınız - IoT cihazlarından mərkəzləşdirilməmiş və qlobal olaraq əlçatan provayderlər şəbəkəsinə qədər. Biz IoT sistemlərinin yaradıcılarının qarşılaşdıqları və Robonimikanın həllinə yönəlmiş əsas problemləri vurğulamaq üçün Əşyaların İnternetinin əsaslarına nəzər salacağıq.",
  "Overview of the state of the Internet of Things (IoT)": "Əşyaların İnternetinin (IoT) vəziyyətinə baxış",
  "Classification of IoT devices": "IoT cihazlarının təsnifatı",
  "Embedded IoT systems": "Quraşdırılmış IoT sistemləri",
  "Edge-systems: IoT gateways and controllers": "Edge sistemləri: IoT şlüzləri və nəzarətçiləri",
  "Autonomous Systems": "Avtonom sistemlər",
  "Internet of Things providers": "Əşyaların İnterneti təminatçıları",
  "Digital twins are the heart of the Internet of Things": "Rəqəmsal əkizlər Əşyaların İnternetinin ürəyidir",
  "IoT data flows in cloud service": "IoT məlumatları bulud xidmətində axır",
  "Popular examples of IoT solutions": "IoT həllərinin məşhur nümunələri",
  "Current problems of building IoT solutions": "IoT həllərinin qurulmasının aktual problemləri",
  "Main tasks of Robonomics architecture": "Robonimikanın arxitekturasının əsas vəzifələri",
  "Basic components of Robonomics architecture": "Robonimikanın arxitekturasının əsas komponentləri",
  "A simple representation of Robonomics architecture": "Robonimika arxitekturasının sadə bir təqdimatı",
  "Read chapter 2": "2-ci fəsli oxuyun",
  "We continue to update the white paper of Robonomics": "Robonimikanın white paper-ı yeniləməyə davam edirik",
  "stay tuned for new parts on our website and in Discord": "saytımızda və Discord-da yeni hissələr üçün bizi izləməyə davam edin",
  "Join our discord": "Discord-umuza qoşulun",
  "Robonomics logos and usage": "Robonomics logolari və İsti̇fadəsi̇",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Onu necə istifadə edə biləcəyinizi göstərmək üçün biz Robonomics loqolarını, rənglərini, aktivlərini və təlimatlarını bir araya gətirdik.",
  "Download Robonomics logo": "Robonomics logonu yüklə",
  "Download RWS logo": "RWS logonu yüklə",
  "Download wiki logo": "Vi̇ki̇ logonu yüklə",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Robonomics, RWS və ya Robonomics Viki ilə əlaqə yaratmaq üçün bu icazə verilən loqolardan istifadə edin",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Robonomics ilə inteqrasiya olunduğunuzu başqalarına bildirmək üçün icazə verilən Robonomics loqosundan istifadə edin",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Robonomics texnologiyası və inteqrasiya olunmuş layihələr haqqında bloq yazılarında, məqalələrdə və slaydlarda icazə verilən loqolardan istifadə edin.",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Rəngin, ölçülərin dəyişdirilməsi və ya digər sözlər və ya dizayn elementləri ilə birləşdirilməsi daxil olmaqla, icazə verilən Robonomics loqolarını dəyişdirməyin",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Robonomics loqosu və adından sizin Robonomics olduğunuzu, təklifinizin və ya layihənizin Robonomics tərəfindən olduğunu və ya Robonomics DAO tərəfindən təsdiq edilmədiyi təqdirdə, Robonomics-in sizi və ya təklifinizi və ya layihənizi dəstəklədiyini göstərən şəkildə istifadə etməyin",
  "Robonomics Color pallet": "Robonomi̇cs rəng pali̇trasi",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "İnterfeyslərimizdə, printerlərimizdə və digər vizual görüntülərimizdə istifadə etdiyimiz bu rənglər. </br> Onu slaydlarınız, Robonomics haqqında danışan yazılar üçün bannerlər və s. üçün istifadə edin.",
  "Robonomics art shop": "Robonomics sənət mağazası",
  "Welcome to our brand new online shop on": "Yeni onlayn mağazamıza xoş gəlmisiniz",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Mağazamız robotika, texnologiya və sənət sevgimizi təmsil edən geyim, aksesuar, ev dekoru və digər məhsullar təklif edir. T-shirt, uzun kollu paltarlar, hudi, duş perdesi, yastıq, yorgan və digər istifadəli məhsulları, Robonomics sənətkarları tərəfindən hazırlanan unikal dizaynlı və Threadless tərəfindən işlənmiş istehsal və göndərişləri ilə tapa bilərsiniz. Zövq alın!",
  "Shop now on threadless": "Həzirən threadless-də mağaza",
  "alternative shop": "alternativ mağaza",
  "Do Androids Dream of Electric Sheep?": "Androidlər Elektrik Qoyun Düşləyir?",
  "Sleeping Mew Space": "Yatan Mew Məkanı",
  "Are you ready for Mars?": "Marsa hazırsınız?",
  "Shiva Robot": "Shiva Robot",
  "Space Travelers": "Cosmic Səyahətçilər",
  "Retro Astronaut": "Retro Astronavt",
  "New Newton": "Yeni Newton",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines’ own economics to perform various operations in the world around them at a speed not available to humans.": "Bizim izah etməyə çalışdığımız əsas ideya - iqtisadiyyatın hazırkı səviyyəsindən tam avtomatlaşdırılmış xidmətlərə təbii, məntiqli və zahirən qaçılmaz təkamüldür. Avtomatlaşdırılmış xidmətlər ətraf aləmdə müxtəlif əməliyyatları insanların əlçatmaz sürətlə yerinə yetirmək üçün həm insan iqtisadiyyatı dilində danışmaq qabiliyyətinə, həm də maşınların öz iqtisadiyyat dilinə malik olmalıdır.",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Daha sonra, müasir İnternet texnologiyalarından istifadə edərək insan-maşın qarşılıqlı əlaqəsinin praktik sahələrinə müraciət edirik. Biz bulud xidmətləri vasitəsilə texniki məlumat mübadiləsini nəzərdə tutan tanış IoT cihaz arxitekturasından mərkəzləşdirilməmiş, qlobal şəkildə əlçatan təminatçılar şəbəkəsi vasitəsilə texniki-iqtisadi qarşılıqlı əlaqənin təşkilinə keçəcəyik.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Başlamaq üçün, avtomatlaşdırılmış sistemlərin şəbəkə bağlantısı ilə ən aydın şəkildə əlaqəli olan sahəni araşdırmalıyıq. Bundan sonra biz IoT sistemlərinin yaradıcılarının qarşılaşdıqları və Robonimikanın həllinə yönəlmiş əsas problemləri vurğulamaq üçün Əşyaların İnternetinin əsaslarına nəzər salacağıq.",
  "Overview of the state of the internet of things (IoT)": "Əşyələri̇n İnterneti̇ni̇n vəzi̇yyəti̇nə İcmal (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Avtomatik cihazların şəbəkəyə əlçatanlığı məsələsi 60-cı illərdən bəri bütün planetdə müzakirə olunur və artıq o dövrdə onun həlli üçün kifayət qədər ciddi cəhdlər edilmişdir. Məsələn, sovet kibernetikaçısı Viktor Qluşkov 60-70-ci illərdə",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "milli informasiya sisteminin layihələndirilməsi çərçivəsində fərdi zavodun istehsal həcmləri haqqında məlumatların avtomatlaşdırılmış şəkildə yığılmasını təklif etdi və qismən həyata keçirdi. Hamıya məlumdur ki, Coca-Cola avtomatı 1980-ci illərdə ARPANET-ə qoşulmuşdu ki, maşınlar içkilərin mövcudluğu və onların temperaturu barədə məlumat verə bilsinlər.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Bununla belə, IoT-nin faktiki inkişafı bu gün imkan verən texnologiyaların geniş tətbiqi sayəsində baş verir. Əşyaların İnterneti proqramlarının sürətli təkamülünün əsas amilləri (ev avtomatlaşdırması, smart şəbəkə, sağlamlığın uzaqdan monitorinqi, ətraf mühitin monitorinqi və s.) bir çox sahələrin inkişafının nəticələridir - Müxtəlif diapazonların simsiz rabitəsindən və quraşdırılmış cihazların tutmuş bulud analitikasına və maşın öyrənməsinə qədər. Son 10 ildə IoT cihazlarının sayı durmadan artır (2030-cu ilə qədər 25 milyard ədəd proqnozlaşdırılır) və bu, tədqiqatçıları və tərtibatçıları müxtəlif sahələrdə yeni IoT tətbiqləri yaratmağa təkan verdi: səhiyyə, ev avtomatlaşdırılması, aqrobiznes, ətraf mühitin mühafizəsi.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Bizi daha çox IoT sistemlərinin qurulması prosesi və bu prosesdə yaranan tapşırıqlar maraqlandırır. Tədqiqat illəri ərzində bir çox fərqli arxitektura təklif edilmişdir və onların orta hesabla çıxarılması ilə biz IoT sisteminin üç əsas komponentini ayıra edə bilərik: cihazlar; şəbəkə infrastrukturu; analitik, hesablama və idarəetmə maşınları.",
  "New challenges": "Yeni̇ çəti̇nli̇klər",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud’s functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Əşyaların İnternetinin inkişafı və tətbiqi, tipik problemlərin həllinin kifayət etmədiyini göstərdi. Əvvəlki səhvlərə və aşkar edilmiş çatışmazlıqlara əsaslanan tamamilə yeni anlayışlar və prinsiplər bu gün yaranmışdır. Bu, şübhəsiz ki, əlverişli yanaşmanın genişlənmə, məxfilik və təhlükəsizliklə bağlı bir sıra kritik çatışmazlıqları olduğu ortaya çıxdı. Bu, şübhəsiz ki, əlverişli yanaşmanın genişlənmə, məxfilik və təhlükəsizliklə bağlı bir sıra kritik çatışmazlıqları var idi. Bu problemləri həll etmək üçün məlumatların işlənməsini, məntiqini və hesablamasını onların bilavasitə istifadə etdikləri yerə yaxınlaşdırmaq təklif edilmişdir. Beləliklə, bulud və qurğular arasında ara sistemlər bulud funksiyalarının bir hissəsini öz üzərinə götürdükdə fog və edge hesablama anlayışları meydana çıxdı. Buna görə də edge sistemlərin yaradılması Əşyaların İnternetinin qurulmasının yeni çətinliklərindən birinə çevrildi.",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Əşyaların İnternetinin qurulması üçün digər problem rəqəmsal əkiz konsepsiyası olub - real avadanlıqların spesifikasiyalarını və tarixi məlumatlarını kopyalayan rəqəmsal versiyası. Bu konsepsiya prosesin dəqiq və tam spesifikasiyasına malik olmaq və onun inkişafını proqnozlaşdırmaq qabiliyyətinə malik olmaq lazım olan sahələrdə ən effektivdir. Əşyaların İnterneti rəqəmsal əkizlərin əsas inteqratoru kimi çıxış edir, lakin bu vəzifə IoT cihazlarının adi əlaqəsindən qat-qat dərindir.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Hal-hazırda biz şəbəkənin insanlar üçün yox, maşınlar üçün nəzərdə tutulmuş və rahat olan bütün seqmentinin şahidi oluruq. Əşyaların İnterneti artıq sadəcə cihazı şəbəkəyə qoşmaq mexanikası deyil, yaradılmış və cihazlar üçün əlçatan olan daha çox xidmətdir. Əşyaların İnterneti yalnız istifadəçini və cihazı birləşdirmir, həm də cihazlara bir şəxsə xidmət göstərmək vəzifələrinin öhdəsindən gəlməyə kömək edir, lakin avtonom şəkildə.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Belə sistemlərin istifadəçi interfeysləri yoxdur və adətən əsas funksionallığı təmin etmək üçün IoT ekosistemlərinin ən aşağı səviyyəsində istifadə olunur. Onlar enerjiyə qənaətcil və kiçik olmalıdırlar, ona görə də belə cihazların hesablama və rabitə resursları məhduddur. IoT şlüzləri və ya nəzarətçiləri adətən siqnal qəbulediciləri kimi çıxış edirlər.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Bu sistemlər lokal quraşdırılmış sistemlərlə qlobal İnternet arasında əlaqə rolunu oynayır, buna görə də onlar kənardadırlar. Bir qayda olaraq, onlar çoxlu daxili sistem rabitə protokollarını dəstəkləmək və telemetriyanı cihazlardan buludlara ötürmək, həmçinin əks istiqamətdə siqnalları idarə etmək vəzifəsini yerinə yetirirlər. Çox vaxt bu cihazlar bir platalı kompüterlə təchiz edilmiş WiFi marşrutlaşdırıcısının daha mürəkkəb bir versiyasıdır, buna görə cihazlardan məlumatın ilkin emalı yerli şəbəkədən çıxmadan baş verir.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Bu sinfə mürəkkəb maşınlar (məsələn, Boston Dynamics tərəfindən Spot kimi) daxildir, onların tərkibində yüksək məhsuldar prosessor və böyük həcmdə yaddaşa malik tam hüquqlu kompüter səviyyəsində idarəetmə komponenti var. Belə hallarda robot əlavə ara həllər (edge-sistemlər) olmadan İnternetə qoşulur. Əşyaların İnternetinə daxil olmaq üçün lazımi proqram təminatı birbaşa müstəqil sistemin kompüterində quraşdırılır. Məlumatlar yerli olaraq toplanır və qismən işlənir və sonra hər hansı bir tam hüquqlu şəbəkə cihazı ilə eyni şəkildə İnternetə yayımlanır.",
  "Internet of things providers": "IoT təmi̇natçilari",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "IoT təminatçıların işi - istifadəçilərə, məlumatlara və analitikaya uzaqdan giriş imkanı təmin etmək, həmçinin İnternet üzərindən ağıllı cihazların idarə edilməsini təmin etməkdir. IoT təminatçılarına aid olan əsas keyfiyyət meyarları, istifadəçiyə aid olduqda, əməliyyatın təhlükəsizliyi, əlaqənin sabitliyi və təminatçıların dünyanın istənilən yerindən əlçatanlığıdır.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "IoT təminatçı ilə işləməyin standart sxeminə aşağıdakılar daxildir: buludla uyğun gələn smart cihazda proqram təminatının quraşdırılması; cihazın ilk uğurlu qoşulmasından sonra bulud tərəfi idarəetmə xidmətlərinin qurulması; müxtəlif növ analitik xidmətlərin qoşulması",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Rəqəmsal əkizlərdən danışarkən qeyd etmək lazımdır ki, memarlıq baxımından onların həyata keçirilməsi tələb olunur; istifadəçiyə nəzarət cihazlarına birbaşa çıxışı təmin etməkdən və onların vəziyyətini dəyişdirməkdən imtina kimi. İmtina etmənin açıq səbəblərindən biri, ilk növbədə, işə salma əmrlərindən dərhal əvvəl yoxlanıla bilən cihazın öz tələblərinin və şərtlərinin olmasıdır. İkincisi, birdən çox istifadəçi cihazı bir məlumat mənbəyinə daxil olmalıdırsa, hər bir istifadəçiyə fərdi nəzarətin verilməsi kritik ola bilər. Nəhayət, cihazın işdən çıxması halında onun son faktiki vəziyyətini qeyd etmək olduqca faydalıdır.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Nəticədə, istifadəçi ilə məlumat mübadiləsi dövrəsinin ayrılması və sensorlar tərəfindən faktiki məlumatların əmələ gəlməsi var. Bu prinsipi göstərmək üçün aşağıda istifadəçinin rəqəmsal əkizdən istifadə edərək IoT cihazı ilə işləmə prosesi verilmişdir.", 
  "IoT data flows in cloud services": "Bulud xi̇dmətləri̇ndə IoT məlumatlarinin hərəkəti̇",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Bulud trigerləri üçün daxiletmə dəyərləri. Məsələn, bulud xidməti avtomobilin siqnalizasiya sensorundan vurulma barədə məlumat aldıqda istifadəçiyə müxtəlif bildirişlər göndərir.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Edge səviyyədə işlənə bilməyən mürəkkəb analitika üçün çıxış məlumatları. Məsələn, izdihamda üz tanıma üçün videonun işlənməsi.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Cihazın rəqəmsal əkizinin formalaşdırılması üçün əsas onun vəziyyətini yaratmaqdır. Məsələn, mobil proqramda və ya veb saytında istifadəçinin istəyi ilə.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Tipik bir ağıllı ev sistemi yaşayış sahəsini idarə etmək üçün geniş seçimlər təqdim edir. Onun köməyi ilə siz qapı qıfıllarını uzaqdan idarə edə, ailəniz və dostlarınız, həmçinin texniki xidmət və ya çatdırılma işçiləri üçün mənzilinizə birdəfəlik və ya müntəzəm giriş imkanı yarada bilərsiniz. Çoxsaylı sensorlar və qeyd cihazları sayəsində sistem hərəkət sensorları işə salındıqda video çəkilişi işə sala, su təchizatı sistemində sızma aşkar edildikdə su təchizatının dayandırılması barədə avtonom qərarlar qəbul edə, robot tozsoranı işə sala bilir, istifadəçi proqramına təmizlik hesabatı təqdim edərək, qrafikinizdən asılı olaraq otaq temperaturunu optimal dəyərə dəyişdirin.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Ağıllı avtomobillər. Avtomobilin bort kompüterini mobil internetə çıxışla təmin edən istifadəçi birbaşa öz smartfonundan avtomobilin müxtəlif funksiyalarını uzaqdan idarə etmək imkanı əldə edir: qapıları açmaq, kondisioneri yandırmaq, faraları idarə etmək. Əgər bu cür avtomobillərdən carsharing üçün istifadə olunursa, o zaman siz bu xidmətin müştəriləri üçün avtomobillərin statusu, qalan yanacağı və s. göstərilməklə onların yerləşdiyi yerin interaktiv xəritəsini yarada bilərsiniz.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Ağıllı avadanlıq lizinq sistemi. Şirkət əməliyyatların sayına və ya robotun işlədiyi vaxta görə ödəniş etməklə müqavilə əsasında konveyer xəttində robot manipulyatorlar quraşdırır. Manipulyatorlar müntəzəm olaraq yerinə yetirilən əməliyyatlar, səhvlər və xəbərdarlıqlar jurnalını təqdim edirlər. Robotun lizinq haqqı bunun əsasında hesablanır, həmçinin satıcının robotlara proqnozlaşdırıcı texniki xidməti.",
  "Global availability": "Qlobal mövcudluq",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Standart müştəri-server arxitekturası IoT cihazlarından mesajları yönləndirərkən son nöqtələrin təyin edilməsini tələb edir. Beləliklə, smart cihazın ömrü ərzində əlaqənin olmaması cihazla idarə və qarşılıqlı əlaqə imkanlarının məhdudlaşdırılması deməkdir.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Məsələn, Çin və Birləşmiş Ştatlar arasındakı ticarət müharibəsi artıq ABŞ-da və əksinə, Çin ağıllı cihazlarının minlərlə istehlakçısının üstündən asılan Damokl qılıncıdır. Hər an Xiaomi serverlərinin ABŞ səlahiyyətliləri tərəfindən bloklanması istehsalçının bulud xidmətlərinə qoşulan cihazların istifadəçilərinə təsir göstərə bilər.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "IoT cihazının bilavasitə yaxınlığında olduğunuz halda, istifadəçilərin identifikasiyası və cihazların telemetriya kolleksiyasının təmin olunduğu serverlərlə əlaqə yoxdursa, onu mobil proqramdan idarə edə bilməzsiniz. Yəni, cihaz əslində istifadəçi yox, bulud tərəfindən idarə olunur.",
  "Cybersecurity": "Ki̇ber təhlükəsi̇zli̇k",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Əksər IoT həllərinin zəif kibertəhlükəsizliyinin ən mühüm səbəbi bulud müştəri-server arxitekturasının problemli mirası ilə bağlıdır. Məsələn, hazırda ən çox yayılmış ağıllı ev arxitekturası adətən bulud xidmətinə qoşulan IoT qovşağıdır. Beləliklə, tipik IoT sistemi bir neçə xarici sistemə qoşulmuş mərkəzi idarəetmə elementidir. Şübhəsiz ki, bulud xidməti aşağı səviyyəli cihazlardan daha təhlükəsizdir, lakin yüz minlərlə belə sistemlər üzərində mərkəzləşdirilmiş nəzarətin konsolidasiyası istənilən təhlükəsizlik pozuntularına və sızmalara böyük fəlakət gətirir.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Bulud xidməti serverləri bütün tipik kibertəhlükəsizlik problemlərinə məruz qalır: şəbəkə hücumları, DoS hücumları (sistemi uğursuzluğa sürükləyən), zərərli dəyişikliklər, istifadəçi sessiyasının oğurlanması və s. Lakin güclü təhdidlərə həmçinin serverlərin sıradan çıxmasına səbəb olan dizayn xətaları, sui-istifadə və ya təbii fəlakətlər kimi təsadüfi problemlər də daxildir. Başqa bir vacib məqam, prinsipcə buluda və onu təmin edən insanlara etibar etmək ehtiyacıdır.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Bütün bunlar IoT həllərinin miqyası ilə daha da ağırlaşır. IoT sistemlərinin sayı. Şübhəsiz ki, bulud xidməti aşağı səviyyəli cihazlardan daha təhlükəsizdir, lakin yüz minlərlə belə sistemlər üzərində mərkəzləşdirilmiş nəzarətin konsolidasiyası istənilən təhlükəsizlik pozuntularına və sızmalara böyük fəlakət gətirir.",
  "Data privacy": "Məlumatlarin məxfi̇lli̇yi̇",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Məxfilik nöqtəsini kibertəhlükəsizlikdən ayırmaq lazımdır, çünki bu problem IoT sistemlərinə xasdır. Kompüterlər və smartfonlardan daha çox fiziki dünyaya inteqrasiya olunmuş cihaz növlərinin çoxluğu və müxtəlifliyi səbəbindən fərdi məlumat növlərinin çeşidi artır. Bu, artıq yalnız GPS yeri, alış-veriş qeydləri, maliyyə əməliyyatları və fotoşəkillər deyil, həm də video və söhbətlərin, səs izlərinin, sağlamlıq vəziyyətinin və hətta insanın vərdişlərinin siyahısıdır. Məxfiliklə bağlı təhdid növləri arasında: məlumatın identifikasiyası, lokalizasiyası və izlənilməsi, profilləşdirmə, inventar hücumu, məlumat bağlantısı hücumu var.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "Ən qorxulu tərəfi odur ki, istifadəçilər məxfilikdən imtina etdikləri barədə az və ya heç bir məlumatlı deyillər, çünki onlar hansı məlumatların toplandığını və necə istifadə edildiyini demək olar ki, heç bir təsəvvürləri yoxdur. Məxfiliyə təhlükə təkcə müdaxilə edənlər tərəfindən deyil, həm də təşkilatlar və dövlət qurumları tərəfindən məhz buna görə artır. Bulud IoT xidmətləri adətən cihazlardan maksimum məlumat ötürülməsini tələb edir və məlumat ötürülməsini qadağan etmək və ya daraltmaq üçün heç bir yol yoxdur (“Şərtləri qəbul edin və ya Rədd olun”). Üstəlik, toplanmış məlumatların aktiv olmasına və real dəyərə malik olmasına baxmayaraq, onun toplandığı şəxs nəinki həmin məlumatlara aktiv şəkildə sərəncam vermək hüququndan məhrum edilir, hətta öz məlumatlarının toplanması və istifadəsi üçün hər hansı kompensasiya almaqdan belə imtina edilir.",
  "Main tasks of robonomics architecture": "Robonomi̇ka arxitekturasinin əsas vəzi̇fələri̇",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Bulud platformalarının nailiyyətləri və çağırışlarına əsaslanaraq, Robonomika insan-maşın rabitəsinin hər mərhələsində IoT bazarına daha təhlükəsiz və daha təkmil İnternet həlləri təklif etməyi hədəfləyir. Robonomikanın qarşıya qoyduğu əsas vəzifələr aşağıdakılardır:",
  "Managing an IoT device using a decentralized cloud": "Mərkəzləşdi̇ri̇lməmi̇ş buluddan İsti̇fadə edi̇lən iot ci̇hazinin İdarə edi̇lməsi̇",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Blockchain şəbəkələri cihazı idarə etmək və onun telemetriyasını əldə etmək üçün ən yüksək təhlükəsizlik dərəcəsini təmin etmək üçün bütün imkanlara malikdir. Cihazla qarşılıqlı əlaqə əslində blokçeyn şəbəkəsində saxlanılan rəqəmsal əkizin vəziyyətini dəyişdirməklə və bu dəyişikliklər haqqında məlumat göndərməklə təsvir edilə bilər. İcazəsiz blokçeyn vəziyyətində, IoT üçün təminatçıların qlobal mövcudluğunun təminatlarından, həmçinin rəqəmsal əkiz məlumatların arzuolunmaz dəyişikliklərdən yüksək səviyyədə qorunmasından danışa bilərik.",
  "Performing technical and economic transaction between people and machines": "Nsanlar və maşinlar arasinda texni̇ki̇ və İqti̇sadi̇ əməli̇yyatlarin həyata keçİri̇lməsi̇",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Kriptovalyutalar və ağıllı müqavilələr mexanizmi sayəsində biz avtomatlaşdırılmış sistemlərə birbaşa rəqəmsal bazarlara çıxışı təmin edə bilərik. Məsələn, Ethereum artıq avtonom cihazların istismarında istifadə edilə bilən iqtisadi fəaliyyətin əsas alətlərinin əksəriyyətini həyata keçirir. Son istifadəçi ilə IoT cihazı arasında qarşılıqlı əlaqə üçün yaradılmış proqramlar, xidmət şərtləri və onun üçün ödəniş cihazın işə salınma parametrlərindən ayrılmaz olarsa, daha effektiv olacaqdır.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Web3-texnologiyasındakı müasir irəliləyişlər istifadəçi məxfiliyi məsələsini həll edə bilər. web3 ilə telemetriyaya daxil olmaq və cihazı idarə etmək üçün autentifikasiyaya və ya xüsusi serverlərə qoşulmağa ehtiyac yoxdur.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomika IoT cihazlarının rəqəmsal əkizləri üçün mərkəzləşdirilməmiş buluddur. Robonomika rabitə üçün texno-iqtisadi formatı dəstəkləyir, həmçinin istifadəçilər üçün şəxsi proqramlar təqdim edir",
  "A human interface to access the system": "Sistemə daxil olmaq üçün insan interfeysi",
  "A communication protocol": "Rabitə protokolu",
  "A machine interface": "Maşın interfeysi",
  "Human interface": "İnsan İnterfeysi̇",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Biz istifadəçiləri internet üzərindən smart cihazları idarə etmək üçün birləşdirmək üçün əsas üsul kimi mərkəzləşdirilməmiş proqramların (dapps) istifadəsini təklif edirik. Beləliklə, biz həm yerli şəhər şəbəkəsi şəraitində, həm də ümumi qlobal şəbəkə vasitəsilə eyni vaxtda işləyə biləcək sistemə ən təhlükəsiz (məlumat baxımından) istifadəçi interfeysini təqdim edə biləcəyik.",
  "Communication protocol": "Rabi̇tə protokolu",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "IoT cihazlarını idarə etmək üçün lazım olan məlumatların ötürülməsini, işlənməsini və saxlanmasını təmin edən mərkəzləşdirilməmiş təminatçılar şəbəkəsini həyata keçirən layihə qrupu tərəfindən hazırlanmış bir spesifikasiya olan Robonomika şəbəkəsi oynayır.",
  "Machine interface": "Maşin İnterfeysi̇",
  "We have chosen the most well-known robotics framework called Robot Operating System Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Biz istənilən uyğun kiberfiziki sistemin inteqrasiyası üçün standart interfeys kimi Robot Əməliyyat Sistemi (ROS) adlı ən məşhur robototexnika platformasını seçmişik. Robonimika ROS üçün bir neçə istifadəni dəstəkləyir. Ethereum şəbəkəsi üçün Robonomics-in tətbiqi robonomics_comm ROS paketi şəklindədir. ROS 2 arxitekturası üçün biz Robonomikaya orta proqram təbəqəsi kimi dəstəyi həyata keçiririk (ətraflı məlumat üçün “Robonomics as ROS 2 Middleware” bölməsinə baxın). ROS-dan istifadə lazımsız olduqda (məsələn, IoT cihazları ilə işləyərkən) Python robonomika-interfeysi modulu hazırlanmışdır. O, yerli olaraq Robonomikanın funksiyalarına daxil olmağa kömək edir və həm yerli, həm özəl, həm də uzaq və ictimai qovşaqlarla işləyir.",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Robonomikanın platformasından istifadə edərək cihazın tam işə salınma dövrünün ümumi diaqramı budur:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "İstifadəçinin mərkəzləşdirilməmiş tətbiqi Robonomika şəbəkəsi vasitəsilə cihaza nəzarət funksiyası üçün sorğu göndərir.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "Robonomika şəbəkəsi libp2p istifadə edərək sorğu tərcüməsini təmin edir və Ethereum blockchain və ya Robonomika parachain-də hadisələri çəkir.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Qurğuya nəzarət IoT cihazını işə salmaq üçün lazımi məlumatların saxlanmasına zəmanət verilən mərkəzləşdirilməmiş şəbəkə tərəfindən təmin edilir.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "IoT cihazı müstəqil olaraq Ethereum və Polkadot şəbəkələrindən rəqəmsal əkizin hazırkı vəziyyəti haqqında məlumat alır. Bu, cihazın yalnız texniki və iqtisadi işəsalma parametrləri tənzimləndikdən sonra təhlükəsiz işə salınmasını təmin edir.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Əməliyyat nəticəsində Əşyaların İnterneti cihazı tamamlanmış əməliyyatların jurnalını dərc edir, ondan təqdim olunan xidmətin sübutu kimi və ya səhvləri aradan qaldırmaq üçün istifadə edilə bilər.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Jurnal istifadəçi üçün hesabata çevrilir və onun dapp-da mövcud olur.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Robonomics Parachain-də IoT üçün mərkəzləndirilməmiş tətəbiqlərin və Veb Xidmətlərinin qurulması",
  "Sergei Lonshakov, software architect": "Sergey Lonshakov, proqram memarı",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Yada salaq ki, robot qul əməyinin tam iqtisadi ekvivalentidir. Qul əməyi ilə rəqabət aparan istənilən əmək, qul əməyinin iqtisadi nəticələrini qəbul etməlidir",
  "Norbert Wiener": "Norbert Viner",
  "cybernetics": "kibernetika",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Bu gün robotlar yetkin uşaqlar kimidir - onlar artıq pulu idarə edə, hüquqi münasibətlərə girə və müstəqil ola bilirlər",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Bəşəriyyətin gələcəyi robotlara öz qabiliyyətlərini idarə etməyi necə öyrətməyimizdən asılıdır.",
  "Robonomics tools": "Robonomics alətləri",
  "Operate with digital twins of IoT devices": "İoT cihazlarının rəqəmsal əkizləri ilə işlər",
  "The first tools of the robot economy: money for robots, contracts for robots": "Robot iqtisadiyyatının ilk alətləri: pul və robotlar üçün müqavilələr",
  "Software for connecting devices to a decentralized cloud": "Cihazların mərkəzləşdirilməmiş buluda qoşulması üçün proqram təminatı",
  "API library for custom IoT applications": "Əşyaların İnternetinin xüsusi tətbiqləri üçün APİ kitabxanası",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonimics həm robototexnika, həm də istifadəçi interfeysi üçün Əşyaların İnterneti tətbiqlərini inkişaf etdirmək üçün alətlərin tam dəstini ehtiva edir. İstifadəçi ilə cihaz arasında əlaqə Web3 dünyasının ən uğurlu texnologiyalarından - IPFS, Ethereum və Polkadot-dan istifadə etməklə həyata keçirilir. Beləliklə, tərtibatçılar ağıllı şəhərlər və Sənaye 4.0 üçün müasir və təhlükəsiz tətbiqlər yarada bilərlər.",
  "Robonomics Connectivity": "Robonomics-in uyğunluğu",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Tərtibatçıların rahatlığı üçün Robonomics birləşdirmək üçün bir sıra proqram təminatı ehtiva edir: HTTP / MQTT protokolundan istifadə edən Əşyaların İnterneti, Robot Əməliyyat Sistemindən (ROS) istifadə edən mürəkkəb robot sistemləri.",
  "Connect a sensor": "Sensoru Robonomics şəbəkəsinə",
  "to the Robonomics network": "qoşun",
  "Try": "Sadə prototipləmə aləti",
  "a simple prototyping tool": "sınayın",
  "Start building your own cyber physical system with": "AIRA OS",
  "Aira OS": "ilə kiber-fiziki sisteminizi qurmağa başlayın",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics yüzlərlə robotları qutudan dəstəkləyir",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Platforma istifadəçiləri ROS-ə uyğun robotları bir neçə dəqiqə ərzində rəqəmsal iqtisadiyyata qoşa bilərlər. Dəstəklənən robotların tam siyahısı üçün, keçiddən istifadə edin",
  "Decentralized Cloud infrastructure for IoT": "Əşyaların interneti üçün mərkəzləşdirilməmiş bulud strukturu",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) Robonimics parachain və IPFS-ə əsaslanan robototexnika və Əşyaların İnterneti üçün əsas infrastruktur xidmətidir.",
  "Robonomics web services (RWS)": "Robonomi̇cs veb xi̇dmətləri̇ (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "Robotlarin İqti̇sadi̇yyati",
  "Core RWS features available for IoT today": "Bu günə mövcud olan əşyaların interneti üçün əsas RWS funksiyaları",
  "RWS PubSub Message Broker": "RWS PubSub Mesaj Brokeri",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "IPFS protokolu əsasında p2p şəbəkəsi üzərində limitsiz mesajlaşmadan istifadə edin",
  "RWS Data Blockchainization Service": "Məlumatların blokçeynləşdirilməsi üçün RWS xidməti",
  "RWS Robot Actions": "RWS ilə robot hərəkətləri",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Mərkəzləşdirilməmiş kompüterin nəzarəti altında IoT cihazlarınızı işə salın və dayandırın",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "IoT tətbiqinizin ürəyi - blokçeyndə rəqəmsal əkizdir",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Texniki memarlıqda IoT rəqəmsal əkizləri əşyaların və əlaqəli hadisələrin görünməsini və monitorinqini təmin edir (məsələn, məhsulun mənşəyini avtomatik müəyyən etmək üçün IoT cihazlarından istifadə etməklə), blokçeyn isə bu əşyaların həyat dövrləri və əlaqəli iş hadisələri boyu vəziyyəti haqqında həqiqətin vahid versiyasını paylaşmağa imkan verir",
  "from Gartner research": "Gartner tədqiqatından",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomikanın Paraçeyni rəqəmsal əkiz model yaratmağa və onun vəziyyətini hər 6 saniyədən bir yeniləməyə imkan verir.",
  "App Store for Robotics - Robonomics Marketplace": "Robototexnika üçün tətbiq mağazası - Robonomikanln Ticarət Platformasıdır",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "IoT-yə qoşulan məhsul və avadanlıq dizayn və istehsal edən şirkətlər, həyata keçirmə maneələrini azaltmaq üçün çevik rəqəmsal əkiz çatdırılma modelini qəbul etməlidilər. Məsələn, rəqəmsal əkizləri yalnız öz xüsusi çatdırılma modeli ilə yox, ticarət platformalardan etməsi ilə.",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry": "Hazırlanmış rəqəmsal əkiz model birbaşa şirkətinizin Əşyalar İnterneti sənayesi üçün təmin etdiyi əlavə xidmətləri ilə əlaqələndirilə bilər.",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service": "Çatdırılma prosesini yüzlərlə müştəri üçün rahat və asanlaşdırmaq üçün biz robot ticarət platforması üçün xidmətlər bölməsi əlavə etdik. Rəqəmsal əkiz model və şirkətin avtomatlaşdırılmış xidməti arasında həyata keçirilən əlaqələrin ilk nümunələrinə nəzər salın",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "Robotlar və ya istifadəçilər üçün xidmətinizlə bağlı fikriniz varmı? Robonomika platformasında IoT tətbiqinizi qurmaq üçün addım-addım təlimatlara əməl edin.",
  "Secure": "əhlükəsiz",
  "Serverless": "Serversiz",
  "Futuristic": "Futuristik",
  "IoT applications": "IoT tətbiqləri",
  "Robonomics network vision": "Robonomika şəbəkəsinin konsepsiyası",
  "At the frontier of cybernetics and economics": "Kibernetika və iqtisadiyyatın sərhəddində",
  "Build your IoT services on Robonomics platform": "Iot xi̇dmətləri̇ni̇zi̇ robonomi̇ka platformasinda qurun",
  "taking full advantage of decentralized architecture": "mərkəzləşdirilməmiş arxitekturanın bütün üstünlüklərindən istifadə etməklə",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics istifadəçilərə autentifikasiya üçün istifadəçi məlumatlarının ötürülməsinitələb etməyən mərkəzləşdirilməmiş proqramlardan (dapp) istifadə edərək ağıllıcihazlara qoşulmağa imkan verir. Rabitə mərkəzləşdirilməmiş provayderlər şəbəkəsivasitəsilə tək bir nasazlıq nöqtəsi olmadan baş verir və cihaz işləmək, icra etməkvə ya məlumatları uzaqdan ötürmək üçün müstəqil olaraq blokçeyn şəbəkəsindən məlumatəldə edir. Beləliklə, Robonomics istifadəçi tətbiqindən tutmuş smart cihazın işəsalınmasına qədər kommunikasiyanın bütün mərhələlərində cihazın yüksək səviyyədəkibertəhlükəsizliyini və istifadəçi məlumatlarının məxfiliyini təmin edir.",
  "From smart contracts to cross chain IoT platform": "Smart müqavi̇lələrdən kros çeyn iot platformasina",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Robonomics layihəsinin 6 ildən çox yaşı var. Biz Ethereum şəbəkəsinin ilk günlərindən2015-ci ildə müstəqil mərkəzləşdirilməmiş provayder şəbəkəsindən istifadə edərəkinsan-maşın rabitəsini nümayiş etdirən ilk təcrübəyə hazırlaşmağa başladıq. 2021-ciilin əvvəlinə qədər layihə komandası Ethereum və IPFS üzərində işləyən texno-iqtisadimaşın rabitə protokolu yaratmağa və onu Polkadot paraçeyn əsasında bulud əsaslıIoT platformasının elementləri ilə tamamlamağa nail oldu.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Nəticədə, bu gün biz qlobal mərkəzləşdirilməmiş kompüterin nəzarəti altındaolan cihazlarla qarşılıqlı əlaqəyə imkan verən futuristik IoT proqramlarının yaradılmasıüçün artıq hibrid platformaya sahibik.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Robonomikanın yaradıcıları yanaşmanın elmi əsaslılığını başa düşməyə və proqramhəllinin bütün arxitekturasının əsasını təşkil etməli olan prinsipləri təqdimetməkdə aydınlığa nail olmağa çalışan eksperimentçilər, mühəndislər və alimlərdir.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "2017 və 2020-ci illər arasındakı məqalələrimizdə cəmiyyətə robot iqtisadiyyatıideyası ətrafında birləşmiş bir çox həll yolları təqdim etdik. Bu, robot cihazlarınəvvəllər insanlar üçün nəzərdə tutulmuş əsas iqtisadi fəaliyyətləri yerinə yetirəbilən müstəqil agentlər kimi çıxış etdiyi iqtisadi sistemdir. Elmi məqalələribu",
  "this link": "inkdən oxuya bilərsiniz",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Robot iqtisadiyyatının meydana gəlməsini əsaslandırmaq və ümumi şəkildə izahetmək istərdik ki, nə üçün bu xüsusi konsepsiya yeni sənaye inqilabının irimiqyaslırobot sistemlərinin işləməsi sualına qaçılmaz və aşkar cavab olduğuna inanırıq.",
  "Move towards the factory of the future": "Gələcəyi̇n fabri̇ki̇nə doğru hərəkət edi̇n",
  "Inspired by Ronald Coase": "Ronald Kouzdan ilhamlanıb",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "İqtisadiyyat üzrə Nobel mükafatı laureatı Ronald Kouz 1937-ci ildə yazdığı “FirmanınTəbiəti” əsərində “iyerarxiyaya qarşı azad bazar” dixotomiyasını ən yaxşı şəkildənümayiş etdirdi və təşkilatların, xüsusən də firmaların mövcudluğunun səbəbləriniizah etdi. Kouz əməliyyat xərclərinin (məlumatların toplanması və emalı xərcləri)müqavilə bağlamaq qərarına və onun icrasına nəzarətə təsirini müzakirə edir. Firma,iyerarxik bazardankənar strukturu ilə, hazırda istehlakçıya ən aşağı əməliyyatxərcləri ilə hədəf məhsulu təmin etməyin ən səmərəli yolu kimi formalaşmışdır.Bu prosesi vizuallaşdırmaq üçün avtomobil almağın illüstrativ nümunəsinə baxın.Təsəvvür edin ki, bir avtomobili hissə-hissə almağa çalışırsınız və qarajınızdakıbütün komponentləri yığmaq üçün nə qədər pul və vaxt sərf edəcəyinizi hesablayın.Hissələrin alınmasının riskləri və danışıqlar xərcləri hazır Tesla Model X iləmüqayisədə çox yüksəkdir.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Buna baxmayaraq, bu, dünyada hər şeyin istehsalı üzrə yeganə firmanın yaranmasınagətirib çıxarmır. Bunun səbəbi, eyni əməliyyat xərclərinin firmaların ölçüsü iləbağlı məhdudiyyətlər qoymasıdır. Kouz yazdığı kimi:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...firma daxilində əlavə əməliyyatın təşkili xərcləri açıq bazarda mübadiləyolu ilə eyni əməliyyatın həyata keçirilməsi xərclərinə bərabər olana qədər firmagenişlənməyə meylli olacaq...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Başqa sözlə, firma daxilində iyerarxiya nə qədər mürəkkəbdirsə, daxili xərclərbir o qədər çox olur. Bu o deməkdir ki, müəyyən bir nöqtədə daxili xərclər sərbəstbazardan istifadə xərcləri ilə müqayisədə həddindən artıq olur. Buna görə də,inkişafı təmin etmək üçün (bu, biznesin əsas göstəricilərindən biridir) sahibkarlarhəmişə bu xərcləri azaltmaq yollarını axtarırlar.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Biznes prosesinin bütün iştirakçılarının (istehsal, logistika, istehlak) dahayaxın səviyyədə birləşdirilməsi yolu ilə tranzaksiya xərclərinin azaldılması ideyasıavtomatlaşdırma həlləri istehsalçılarının üzləşdiyi",
  "clearly correlates": "problemlər və çətinliklərlə aydın şəkildə əlaqələndirilir",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": ". Son 50 il ərzində böyük şirkətlərin əksər biznes proseslərinin standart/müntəzəməməliyyatları demək olar ki, tamamilə avtomatlaşdırılmışdır. İstehsalçılar, əsasən,təchizat zəncirinin tam avtomatlaşdırılmış hissələri arasında təhlükəsiz rabitəqurmağı tərk edirlər və bu məsələ avtomatlaşdırma vasitəsilə tranzaksiya xərclərinindaha da azaldılmasına mane olan amildir. Qismən avtomatlaşdırılmış firmalar əvəzinədaha rəqabətqabiliyyətli məhsul və ya xidmətlərin bazara çıxarılması",
  "firms spurs the search for solutions to": "istəyi bu problemlərin həlli yollarının",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "axtarışına təkan verir. Göründüyü kimi, hər şey robot firmaların yaranmasınadoğru gedir - bütün iş prosesinin tam avtomatlaşdırıldığı və benefisiarlar vəistehlakçılar istisna olmaqla, insan iştirakını tələb etməyən təşkilatlar.",
  "Get rid of transaction costs": "Əməli̇yyat xərcləri̇ndən qurtarin",
  "Our future in smart cities": "Ağilli şəhərlərdə gələcəyi̇mi̇z",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Bu gün avtomatlaşdırma istehsalçılarının qarşısında duran tapşırığın xüsusi adı var - kiber-fiziki sistemlərin qurulması (qısaldılmış CPS). Tərifinə",
  "definition,": "görə,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "CPS çoxsaylı hesablama, şəbəkə və fiziki proseslərin güclü birləşməsi və qarşılıqlı inteqrasiyasıdır.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "CPS-nin qurulması tapşırığları yeni (dördüncü) sənaye inqilabında təsvir olunanhər hansı bir ideyanın mərkəzidir. Buna görə də, CPS hər yerdə özünü göstərənAğıllı Şəhərlərdə gələcək həyatımızın təməl daşıdır. Gələcəyin kiber-fiziki sistemlərininnümunələri: Hər smartfonda “Uber” kimi avtopilot xidmətləri; Instagram üçün parkda dron selfiləri; Minlərlə yerli sensordan havanın çirklənməsi məlumatlarına abunə; Metro stansiyalarında 3D printerlər şəbəkəsi;- Amazon-a çıxışı olan ev robotu Rosie; İstehsal dövrünü avtonom şəkildə yenidən quran və ya birbaşa müştəri ilə işləyənağıllı fabrik",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "CPS bir çox əlaqəli elementlərdən ibarət mürəkkəb strukturlardır: telefondakıproqramdan şəhər üzərində uçuş zamanı dronun idarə edilməsinə qədər uzanır vəsonra əldə edilən fotoşəkilləri Instagram-da dərc etməyə davam edir, ancaq bulud AI tərəfindən emal edildikdən sonra",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "CPS dizayn prosesində ən vacib şey incə xətti tapmaqdır xidmət istifadəçisində kifayət qədər və həddindən artıq sayda avtomatlaşdırılmış elementlər arasında təchizat zənciri. Başqa sözlə, CPS-in ölçü həddi haradadır? Buna cavab vermək üçün sualı ilə məşhur riyaziyyatçı Norbert Vinerə müraciət etməliyik.",
  "Self-regulating systems": "Özünü tənzi̇m edən si̇stemlər",
  "Inspired by Norbert Wiener": "Norbert Wiener-dən ilhamlanıb",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works 'Cybernetics: Or Control and Communication in the Animal and the Machine'. He used the term 'cybernetics' as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday": "1948-ci ildə MIT-nin riyaziyyat professoru Norbert Wiener ən əsas əsərlərdənbirini nəşr etdirdi ;'Kibernetika: Və ya Heyvanlarda və Maşınlarda Nəzarət və Rabitə'. O, 'kibernetika' terminini ilk dəfə özünütənzimləyən mexanizmlər kimi istifadəetmişdir və buna görə də bu nəşr tanınmış Kibernetik ad günü hesab olunur.",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener fənlərarası elmi yanaşmanın həyat qabiliyətindən danışır. Məsələn,o, avtomatlaşdırılmış idarəetmə sistemləri ilə insan cəmiyyətinin miqyası və mürəkkəbliyininartması problemləri arasında paralellər çəkdi.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Başqa sözlə, kibernetik yanaşma psixoterapiya, biologiya və avtomatlaşdırılmışnaviqasiyaya bərabər şəkildə tətbiq oluna bilər. Bu, sistemin funksiyasına, fərdihərəkətlərin necə idarə olunduğuna və fərdi qovşaqların bir-biri ilə necə qarşılıqlıəlaqəsinə əsaslanır.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Ronald Coase və Norbert Wiener-in nəşrlərini nəzərə alaraq, Sənaye 4.0-ın inkişafınıizləməklə, biz robotlaşdırılmış xidmətlərin layihələndirilməsi zamanı CPS-dəniqtisadi agent kimi istifadə etməyi nəzərdən keçirə bilərik. CPS-in ölçüsünü tənzimləməkvə insanların dəyişən ehtiyaclarına uyğunlaşmaq üçün biz bazar mexanizmindən istifadəedə bilərik.",
  "And what’s so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this": "Və elmi cəhətdən maraqlı olan, bazarın firmanın ölçüsünə qoyduğu məhdudiyyətlərideyasını əsas götürərək, CPS-nin böyümə həddinin həmişə bazar tərəfindən müəyyənediləcəyini söyləmək olar və bunun üçün başqa heç nə tələb olunmur. ",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Robofirmalar kiberfiziki sistemlər üçün ideal təmsilçilikdir. Onlar pul müqabilindəhəm insanlara, həm də digər robotlara xidmət göstərə bilən kifayət qədər muxtarbölmədir. Nəticə etibarilə, robot iqtisadiyyatı bizə birbaşa bazara xidmətlərvə mallar təqdim edən ümumi CPS-lər dəsti kimi görünür.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Robotlar üçün pul",
  "Industry 1.0": "Sənaye 1.0",
  "Mechanization:": "Mexanizasiya:",
  "replacement of muscle power with steam energy.": " Əzələ gücünün buxar enerjisi ilə əvəz edilməsi.",
  "1784 y.": "1784-cü il",
  "Industry 2.0": "Sənaye 2.0",
  "Electrification:": "Elektrikləşdirmə:",
  "introduction of assembly-line production.": "Konveyer istehsalının tətbiqi.",
  "1870 y.": "1870-ci il",
  "Industry 3.0": "Sənaye 3.0",
  "Automation:": "Avtomatlaşdırma:",
  "introduction of automated systems with CNC.": "CNC ilə avtomatlaşdırılmış sistemlərin tətbiqi.",
  "1969 y.": "1969-cu il",
  "Industry 4.0": "Sənaye 4.0",
  "Smart production:": "Ağıllı istehsal:",
  "development of cyber physical systems.": "Kiberfiziki sistemlərin inkişafı.",
  "Now": "İndi",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "Dördüncü sənaye inqilabı dalğasında robotların genişlənməsinin ən çox ehtimalolunan forması kimi robot firmalarla bağlı iddialarımız doğrudursa, robotlaraəvvəllər yalnız insanlara ehtiyac duyulan və mövcud olan bir çox sosial institutlaragirişin təmin edilməsi təbiidir.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Sosial institutlar ona görə yaranmayıb ki, biz insanlar banklar, müqavilələrvə digər sosial alətlər olmadan Homo Sapiens növü kimi mövcud ola bilmərik. Əslsəbəb odur ki, insan keçmişdə hansısa məqamda cəmiyyətdə daha mürəkkəb münasibətlərəqədəm qoyub və ətrafımızda gedən prosesləri sürətləndirmək istiqamətində mühümaddım atıb.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Pul və müqavilələr robotlar üçün əlçatan olmalıdır, çünki bu, Skynet-in nə olduğunuunutmuş robot həvəskarlarının xəstə fantaziyası olduğuna görə deyil, yalnız onagörə ki, yeni sənaye inqilabı mürəkkəb avtomatlaşdırılmış zəncirlər qurmaq məqsədiniqoyur. Bu proseslər həm texniki informasiya, həm də iqtisadi informasiya mübadiləsinətəsir göstərəcək, həm də insanlar üçün əlçatmaz sürətlə davam edəcək.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to “charge” your ride with uber and make it faster.": "Eksperimentlərimizin nümunələrindən biri: tıxacları azaltmaq üçün avtonom nəqliyyatvasitələri üçün yol sahəsi və keçid haqqının ödənilməsi ilə bağlı danışıqlarınaparılması. Bir insanın tıxacda qətiyyən etməyəcəyi şeyi, avtomobil sizin üçünçətinlik çəkmədən edəcək: siz zolaqları, avtomobilinizi və qonşunuzun avtomobilmübadiləsini saniyədə yüzlərlə mesaj sürətində belə bir əməliyyatın qiyməti iləbağlı təkliflərini dəyişmək istəyirsiniz, onlar tarazlıq qiymətini ortaya çıxaracaqvə beləliklə, siz artıq növbəti daha sürətli hərəkət zolağındasınız. Bu o deməkdirki, indi siz əlavə ödəniş ilə “Uber” gedişinizi sürətləndirə biləcəksiniz.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Robotlar yalnız maşınların qərar verə biləcəyi sürətlə əməliyyatlar həyata keçirəbilmək üçün pulu birbaşa idarə etməlidirlər. Bütün bunlar yalnız insanın AğıllıŞəhərdə həyatdan həzz alması üçün nəzərdə tutulub!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "Burada biz asanlıqla ilk rəqəmsal nağd pula - kriptovalyutalara və ilk növbədəBitcoin-ə gəlirik. Kriptovalyuta nağd pul xüsusiyyətinə malikdir, çünki o, hesabınızdabank prinsipinə uyğun deyil, pul kisəsindən istifadə edirmiş kimi saxlanılır.Bitcoin bir robotun avtonom şəkildə idarə edə biləcəyi ilk puldur. Üstəlik, kriptovalyutalarbu gün artıq həqiqətən qlobal maliyyə institutudur və çox güman ki, o, insan cəmiyyətindərobot firmalar tərəfindən pul toplamaq üçün əsas vasitəyə çevriləcək.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Nəticə olaraq: bizim icad etmədiyimiz, lakin açıq-aydın bizim vizyonumuza daxilolan odur ki, Bitcoin robotlar üçün ilk puldur və ya daha dərindən baxsaq, robotfirmaların formalaşmasına kömək edəcək məhz həmin sosial qurumdur.",
  "Smart contracts": "Smart müqavi̇lələr",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin robotlar üçün mövcud olan ilk pul oldu. Bu arada, tam hüquqlu texnikivə iqtisadi mübadilə üçün bir vasitə kimi hazırkı formada Bitcoin haqqında danışabilmərik.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "İndi bizdə artıq ağıllı müqavilələr, DeFi bazarları və robotlar arasında mesajmübadiləsi üçün mərkəzləşdirilməmiş infrastruktur var ki, bu da bəşəriyyət üçüninsan iqtisadiyyatının tam avtomatlaşdırılmış hissəsini – robot iqtisadiyyatınıyaratmaq imkanını açır",
  "One of the great opportunity to build the economy of robots is": "Robotların iqtisadiyyatını qurmaq üçün əla fürsətlərdən biri",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "texnologiyasıdır. Ethereum funksionallığı ilə robotlar nəinki pul mübadiləsi, həm də insanlarla və öz aralarında müqavilələr bağlaya bilirlər.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Bəs maşından maşına (m2m) müqavilə əsaslı rabitənin nə mənası var? Bu, əla sualdır!Gəlin CPS-ə qayıdaq. Sensorlar, maşın avadanlığı və ya hər hansı digər elementlərarasında birbaşa əlaqə haqqında danışarkən, hələ də bir tənzimlənən sistem daxilindəəməkdaşlıq haqqında danışırıq. Ancaq ağıllı şəhər xidmətlərinin (bəzi hallardahətta ağıllı ev) canlı olmasını istəyiriksə, müxtəlif üçüncü tərəf elementləriilə əlaqə qurmalıyıq.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Dron çatdırılma xidmətini təsəvvür edək. Məsələn, bir dron DHL-in mülkiyyətidirsə,o, Amazon-un anbarlarına və ya şəhərin bütün hava məkanına necə daxil ola bilər?Bu monopoliyadır? Bu, bir çox 4-cü sənaye inqilabı təşəbbüsləri üçün böyük problemdir!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Əksər korporasiyalar öz daxili korporativ strukturlarından kənarda avtomatlaşdırılmışsistemlər arasında texniki məlumat mübadiləsini necə təhlükəsiz qurmağı bilmədiklərinəgörə ətraflarına demək olar ki, tam hüquqlara ehtiyac duyduqlarını söyləyirlər.Eyni zamanda, insan münasibətlərini əhatə edən proseslərə nəzər salsaq, aydıngörərik ki, müxtəlif korporasiyalar arasında əməkdaşlıq ən çox yayılmış təcrübədir.Siz Amazon-da asanlıqla qapıdan qapıya çatdırılma sifariş edə bilərsiniz və kuryerşəhər yollarında asanlıqla avtomobilinizə qədər gedib, anbarda sifarişinizi alıbsizə çatdıracaq.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Bu vəziyyətlər necə fərqlidir? Birinci halda maşınlar arasında müqavilə əlaqəsiqurmaq mümkün deyil. İkinci halda, müqavilə münasibətləri insan aləmində qədimzamanlardan qurulmuşdur.",
  "Parachains": "Paraçeynlər",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Robonomics-in üzləşdiyi bu günün əsas problemi Ethereum smart müqavilələrindənistifadə edərək IoT cihazını idarə etməyin yüksək qiymətidir. Hazırkı vəziyyətindəEthereum real iqtisadiyyatın bir çox sahələrində 10 ilə 100 ABŞ dolları arasındadəyişən rüsumların ödənilməsi zərurəti ilə əlaqədar az istifadə edilir. İstəravtomobil paylaşma səfəri, ağıllı mənzil kirayəsi, drone çatdırılması və ya sifarişetdiyiniz sevimli anime qəhrəmanınızın 3D çapı olsun, real iqtisadiyyatdan əksərhallarda olduqca baha başa gəlir.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Ədalətli olmaq üçün, biz bu əməliyyat qiymətinin (və hətta daha çoxunun) faydalıola biləcəyi ssenariləri görmüşük: məsələn, bərpa olunan enerji mənbələri üçünyaşıl sertifikatların avtomatlaşdırılmış şəkildə verilməsi və ya b2b sifarişininİnternet saytından birbaşa istehsala ötürülməsi. Bununla belə, IoT sahəsində web3-texnologiyasınınkütləvi tətbiqi və qəbulu üçün hər bir qoşulan cihaz üçün xidmət protokolu iləhesablanan qiymətdə əhəmiyyətli azalma olmalıdır..",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "IoT cihazı ilə qarşılıqlı əlaqənin dəyərini azaltmaq üçün bir fürsət axtaranRobonomics tərtibatçıları Ethereum-a alternativ həlləri araşdırdılar. Seçimimiz,təhlükəsizliyin layihəmizdən asılı olmayan validatorlar tərəfindən təmin edildiyiümumi şəbəkə daxilində öz blokçeynimizi idarə etməyə imkan verən",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "arxitekturasında qərarlaşdı.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Heterojen Blokçeyn Şəbəkəsi",
  "Homogeneous Shard Network": "Homojen Şard Şəbəkəsi",
  "On-chain protocol control": "Zəncir üzərində protokol nəzarəti",
  "Protection against the tyranny of the crowd": "Kütlənin zülmündən müdafiə",
  "Auction of bandwidth in the common network": "Ümumi şəbəkədə bant genişliyi auksionu",
  "Payment for gas by users": "İstifadəçilər tərəfindən qazın ödənilməsi",
  "Have you read this?": "Siz bunu oxumusunuz?",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection": "Əla kitablar əla ideyalara səbəb olur. Əgər insan-maşın əlaqəsi haqqında dahaçox ilham axtarırsınızsa, elmi fantastika kitablarını oxumağa çalışın. Artıq oxuduğunuzkitabları qeyd edin və daha ətraflı düşünmək üçün sizə başqa nə təklif edə biləcəyimizəbaxın.",
  "Philip K. Dick": "Filip K. Dik",
  "Autofac": "Autofac",
  "I, Robot": "Mən, Robot",
  "Isaac Asimov": "Ayzek Azimov",
  "The Bicentennial Man": "İki yüz yaşlı adam",
  "Neuromancer": "Neuromanser",
  "William Gibson": "Vilyam Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Rey Bredberi",
  "Open questions of teleology": "Teleologiyanın açıq sualları",
  "and a treatise by L. von Mises": "və L. von Mizesin traktatı",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Sonda qlobal nöqteyi-nəzərdən açıq qalan sualları qeyd etmək istərdik. Robotların məqsədi nədir?",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots": "Əslində insanların iqtisadiyyatı çox vaxt müqavilə çərçivəsində tapşırıqlarınvicdanla yerinə yetirilməsi, tərəflərin nəticə əldə etmək istəyi, fərdin cəmiyyətdəfürsətçi və fədakar davranışı ilə əlaqələndirilir. Bütün bu prinsipləri robotiqtisadiyyatına tətbiq etmək çətindir. Robot iqtisadiyyatının motivləri hansılardır?Robotları daha yaxşı başa düşmək və tətbiq etmək üçün cəmiyyətdə araşdırmalı vəmüzakirə etməli olduğumuz açıq bir sualdır.",
  "For the start we suggest to look at Mises's work 'Human Action: A Treatise on Economics' (praxeological approach) and at early article by Norbert Wiener 'Behavior, Purpose and Teleology' (teleological vision).": "Başlanğıc üçün Mizesin 'İnsan Fəaliyyəti: İqtisadiyyat üzrə Traktat' (prakseoloji yanaşma) əsərinə və Norbert Vinerin 'Davranış, Məqsəd və Teleologiya' adlı ilk məqaləsinə (teleoloji baxış) baxmağı təklif edirik.",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Prakseologiya bizi məqsədlərdən birbaşa asılı olmadan insan davranışı haqqındamaraqlı fikirlərlə ruhlandırır. Bu, bizə şərti olaraq robotların iqtisadiyyatproseslərinin üzərində son məqsədlərə varmadan qara qutu ilə işləmək imkanı verir.Bu, bizə şərti olaraq robot iqtisadiyyatının prosesləri üzərində, qara qutudaolduğu kimi, yekun məqsədlərə varmadan işləmək imkanı verir. Eyni zamanda, teleologiyasəbəbləri izah etməkdə çətinlik yaradır.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Ümid edirik ki, Mises və Wiener işlərinin kəsişdiyi yerdə robot iqtisadiyyatınındaha da inkişafı üçün bir nöqtə tapıla bilər, yalnız prakseoloji xarakterli insanlarınvə maşınların qarşılıqlı əlaqəsi üçün bir protokol kimi yox, həm də növlərarasıünsiyyətin qurulmasının teleoloji elementlərini nəzərə alaraq.",
  "or": "və ya"
}