{
  "What is Robonomics network?": "Robonomi̇ks nədi̇r?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics əşyaların interneti tətbiqləri üçün açıq mənbə platformasıdır. Biz istifadəçi proqramları, Əşyaların İnterneti xidmətləri və mürəkkəb robot texnikası arasında atomar əməliyyatları şəklində texniki və iqtisadi məlumat mübadiləsini həyata keçirən yeni nəsil İnternet texnologiyalarını (web3) dəstəkləyirik.",
  "Get started": "Start",
  "Explore Robonomics": "Robonomikanı kəşf edin",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonimika hər kəsə əlçatan olan IoT bazarı üçün açıq mənbə texnologiyasıdır. Daha ətraflı məlumat əldə etmək üçün icra məzmunu oxuyun.",
  "Get XRT": "XRT əldə edin",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT, Ethereum şəbəkəsi və Robonomika paraçeyn üzərində IoT cihazların idarə etməyə imkan verən faydalı tokendir",
  "Use a Dapp": "DApp-dan istifadə edin",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "IoT cihazlarını idarə etmək üçün mərkəzləşdirilməmiş tətbiqin Beta versiyasına nəzər salın",
  "Start building": "Qurmağa başlayın",
  "Robonomics objectives": "Robonomikanın məqsədləri",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Bulud platformalarının nailiyyətlərinə əsaslanaraq, Robonomika insan-maşın rabitəsinin hər mərhələsində IoT bazarına daha təhlükəsiz və daha təkmil İnternet həlləri təklif etməyi hədəfləyir. Robonomika inkişaf etdiyi əsas məqsədlər:",
  "IoT device management with a decentralized cloud": "Mərkəzləşdirilməmiş bulud ilə IoT cihazlarının idarə edilməsi",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Blockchain şəbəkələri cihazı işə salmaq və telemetriya qəbul etmək üçün ən yüksək təhlükəsizlik dərəcəsini təmin etmək üçün bütün parametrlərə malikdir. Bir cihazla qarşılıqlı əlaqə əslində blokçeyn şəbəkəsində saxlanılan rəqəmsal əkizin vəziyyətini dəyişdirməklə və bu dəyişikliklər haqqında məlumatı fiziki cihaza çatdırmaqla təsvir edilə bilər. “İcazəsiz blokçeyn”dən istifadə edildiyi halda, biz provayderlərin qlobal mövcudluğuna, eləcə də rəqəmsal əkizin məlumatların arzuolunmaz dəyişikliklərdən yüksək səviyyədə qorunmasına əmin ola bilərik.",
  "Techno-economic transactions between humans and machines": "İnsanlar və maşınlar arasında texno-iqtisadi əməliyyatlar",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Avtomatlaşdırılmış sistemlərin kriptovalyutalar və smart müqavilələr vasitəsilə birbaşa rəqəmsal bazarlara çıxışı baxımından institusional nailiyyətlərdən danışa bilərik. Məsələn, Ethereum artıq iqtisadi fəaliyyətin əsas alətlərinin əksəriyyətini həyata keçirir. Bu gün istifadəçini və IoT cihazlarını birləşdirmək üçün yaradılmış proqramlar, ödəniş və xidmət şərtləri cihazın işə salınma parametrlərindən ayrılmaz olarsa, daha səmərəli olacaq.",
  "Serverless IoT applications for users": "İstifadəçilər üçün serversiz IoT tətbiqləri",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Müasir tətbiqlərin istifadəçilərinin məxfiliyi məsələsi şirkətlərin web3 sahəsində müasir nailiyyətlərdən istifadə edə bilməməsində ilişib qalmamalıdır. Telemetriyaya daxil olmaq və cihazı idarə etmək üçün autentifikasiyaya və ya xüsusi serverlərə qoşulmağa ehtiyac yoxdur.",
  "Learn with Robonomics": "Robonomics İlə öyrəni̇n",
  "Introduction course": "Giriş kursu",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Müasir İOT proqramlarının yaradılması ilə bağlı yaranan problemlərə və IoT tərtibatçıları və istifadəçiləri üçün web3 texnologiyaları və Robonimics alətləri ilə mümkün həll yollarına nəzər salın.",
  "Boston dynamics spot software developing": "Boston Dynamics Spot Proqram təminatının hazırlanması",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Biz sizə Spot SDK təhsil proqramını təqdim etməkdən məmnunuq! Məqsədimiz sizi Spot-un SDK-sı ilə tanış etmək və laboratoriyamızda Boston Dynamics Spot robotundan istifadə edərək bacarıqlarınızı uzaqdan yoxlamağa imkan verməkdir.",
  "Sovereign smart home with robonomics and home assistant": "Robonimics və Ev Köməkçisi ilə Suveren Ağıllı Ev",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Bu kursda siz öz suveren ağıllı evinizi qurmaq üçün tələb olunan bütün addımlardan keçəcəksiniz, bunun əsas üstünlüyü istifadəçi məlumatlarının təhlükəsizliyi / məxfiliyidir.",
  "Shop": "Mağaza",
  "Science papers": "Elmi̇ məqələlər",
  "Books": "Ki̇tablar",
  "Logo and assets": "Logo və akti̇vlər",
  "Blog": "Blog",
  "Ambassador program": "Ambassador programi",
  "Contacts": "Əlaqə",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Xronologi̇ya",
  "Tokenomics": "Tokenomi̇k",
  "Parachain": "Parachain",
  "User (D)App": "Tətbiq",
  "Function request": "Demande de fonction",
  "Report": "Hesabat",
  "Control": "Kontrol",
  "Log": "Qeyd",
  "IoT Device": "İoT cihazi",
  "Decentralized application": "Mərkəzləşdi̇ri̇lməmi̇ş tətbi̇q",
  "Digital twin": "Rəqəmsal əkiz",
  "IoT / Smart device": "İoT / Ağilli ci̇haz",
  "Robonomics tokenomics": "Robonomi̇cs tokenomi̇cs-I",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": ",Ethereum Şəbəkəsinin və Polkadot ekosistemində Robonomics Parachain-də İOT cihazlarını idarə etməyə imkan verən faydalı tokendir.",
  "The task": "Tapşırıq",
  "Be aware of scammers": "Fırıldaqçılardan xəbərdar olun",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "XRT mübadiləsi üçün yalnız tanınmış bazarlardan istifadə edin. Hər hansı əməliyyat (token almaq və ya satmaq) keçirdmık istədiyiniz hallarda tokenlərinizi özəl mesajlarda sizə verilən hesablara göndərməyin. Rəbonomics token haqqında hər hansı bir 'yüksək səsli ifadələr' alsanız (fırıldaqçılar tez-tez 'airdrop elanı' kimi bir şey istifadə edirlər), bu veb saytı (https://robonomics.network/) və ya rəsmi",
  "for official updates. Be careful, be safe.": "-imizi yeniləmələr üçün yoxlayın. Ehtiyatlı olun, təhlükəsiz olun.",
  "XRT in Ethereum": "XRT Ethereum-da",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "2015-2018-ci illərdə Robonomics layihəsini tətbiq edərkən, layihə komandasının məqsədi, əsasən, robot-xidmət-kimi modelinə uyğun olaraq IoT cihazlarının işə salınması və Ethereum-dakı qaz haqlarının Robonomics təchizatçılarına geri ödənilməsi arasında əlaqəni tapmaq idi. Bir xidmət etmək üçün hər bir fərdi ağıllı cihazın öhdəliyinin ömrü haqqında düşünməliyik. Robonomics-də əvvəlcədən aparılan Tədqiqat və İnkişafın nəticəsi olaraq, komanda yaradılmış hər robot-xidmət-kimi smart kontraktının mükafatlandırılması üçün yeni tokenlər çıxarma mekanizmi ilə çıxış edib. Bu model, Ethereum üzərindəki Robonomics'ın gələcəyi üçün hələ də əlverişlidir, lakin yalnız Ethereumda əhəmiyyətli təkmilləşdirmələr edildikdə imkanlıdır.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "XRT-nin Ethereum ekosistemi üçün tarixi fonunu və komandanın uzunmüddətli planlarını öyrənmək üçün bunu oxuyun.",
  "Etherscan profile": "Etherscan profili",
  "View token smart contract and transactions in Ethereum network here.": "Buradakı Ethereum Şəbəkədəki Smart Müqaviləni və Əməliyyatlara baxın.",
  "Coingecko markets": "Coingecko bazarları",
  "Here you can find CEX and DEX markets for trading XRT.": "Burada XRT ticarəti üçün CEX və DEX bazarlarını tapa bilərsiniz.",
  "XRT In Polkadot": "XRT Polkadot-da",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Ethereum-dan Polkadot-a keçid zamanı, tokenomikada 'scaling up' etməliyik. Polkadot ekosistemindəki Parachain-lər, ağıllı müqavilənin ekvivalenti deyil, lakin ümumi şəbəkənin bir seqmentini icarəyə verən tam proqramlaşdırıla bilən bir blokchaindir.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Polkadot və Kusama parachain-ləri tərəfindən faktiki ödəniş, hərraclardan birini qazanmaq üçün kifayət qədər miqdarda yerli Relay zəncir tokenlərinin (DOT / KSM) uzunmüddətli bağlanmasıdır. Robonomics parachain-dəki XRT, slotların yenilənməsini və maraqlı tərəflər üçün mükafatları dəstəkləyir. IoT abunələrinin aktivləşdirilməsinin əsasını təşkil edən XRT yandırma mexanizmi inflyasiyanı minimuma endirmək, faiz dərəcəsini isə sıfıra endirilməsi üçün nəzərdə tutulub.",
  "Learn more": "Şəbəkə memarımızdan ",
  "in Twitter thread from our network architect.": "Twitter mövzusunda daha çox məlumat əldə edin.",
  "Usage:": "XRT İstifadəsi:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT həm parachain üzərində əməliyyatların yerinə yetirilməsi üçün rüsumların ödənilməsi, həm də cihazın və ya istifadəçinin IoT əməliyyatlarının prioritet işlənməsinə zəmanət verən IoT abunəsi almaq üçün istifadə edilə bilər.",
  "Rewards:": "Mükafatlar:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "İl ərzində kollatorları həvəsləndirmək üçün parachain az miqdarda XRT buraxır.",
  "The parameter of the total reward": "Kollatorlar üçün illik ümumi mükafat parametri token",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "sahibkarların tərəfindən on-chain səsvermə ilə müəyyən edilir və referendum keçirərək dəyişdirilə bilər.",
  "Use XRT": "XRT-ni istifadə et",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Mərkəzsizləşdirilmiş tətbiqimizdə IOT abunə alın. Heç bir mərkəzləşdirilmiş korporasiya müşahidə etmədən ağıllı cihazlarınızı blockchain üzərində idarə edin.",
  "Subscan profile": "Subscan profili",
  "View token statistics on top of Polkadot ecosystem.": "Polkadot ekosistemində olan token statistikasına baxın.",
  "Other questions": "Di̇gər suallar",
  "What is RWS?": "RWS nədir?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Əsas funksionallığın inkişafı mərhələsində] Mühəndislər üçün Core Dev komandası müxtəlif Robonomics istifadə modelləri yaratmağa çalışacaq və bu yolda ilk addım ömürlük abunə tokeni - RWS tokenini işə salmaqdır. Hər bir RWS tokeni sizə Robonomics Parachain vasitəsilə IoT cihazınızdan/cihaza saniyədə 1 əməliyyat (tps) verəcək. RWS tokeninizi aktivləşdirin və icradan əvvəl və proqnozlaşdırıla bilən gecikmə ilə 'gas free' əməliyyatları edin. RWS tokenini deaktiv edin və onu DEX-də ticarət edin.",
  "What is AIRA/AIR ID?": "AIRA/AIR ID nədir?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT tokeni 2017-ci ildə Ethereum-da gələcək Robonomics infrastrukturunun muxtar hissəsi kimi paylandı. 2019-cu ildə Ethereum üzərindən Robonomics-in uğurla işə salınmasından sonra, AIRA tokenləri, Pre-XRT-dan ERC-20 XRT-ə dəyişdirilməsinin avtonom və müstəqil prosesinə zəmanət verən",
  "ambix smart contract": "ambix smart müqaviləsi",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "vasitəsilə, layihənin yaradılmış infrastrukturuna qoşuldu.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Robonomomics tokenin, blokchain infrastrukturunda ağıllı şəhərlər və sənayə 4.0 xidmət üçün mərkəzləşdirilməmiş bir şəbəkənin işləməsini təmin etməkdir. Bu məqsədə çatmaq üçün, token iqtisadiyyatı şəbəkənin icrası üçün stimulları əks etdirməlidir.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Mərkəzləşdirilməmiş proqram (dapp) Blockchain daxilində işləyir. Açıq mənbədir və onun məlumatları IPFS və Github-da xidmət göstərir. Bu texnologiyalar tətbiqin eyni zamanda təhlükəsiz və şəffaf olmasına imkan verir. Tərtibatçılarımız həm Robonomics proqramının inkişafı, həm də öz dap-nizi qurarkən istifadə edə biləcəyiniz kitabxanalar üzərində işləyirlər.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Rəqəmsal əkiz, Robonomics Veb Xidmətləri (RWS) tərəfindən təqdim edilən bir alətdir. O, həqiqi dünya avadanlığının rəqəmsal versiyası kimi çıxış edir və onun bütün texniki xüsusiyyətlərini köçürür. Bu, mərkəzləşdirilməmiş bir tətbiqi istifadəçinin əmrlərinə daha çox istifadə etməyə imkan verir.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Siz evinizin/ofisinizin müxtəlif aspektlərini avtomatlaşdırmaq və idarə etmək üçün geniş çeşiddə Zigbee ağıllı cihazları ilə Robonimics-dan istifadə edə və ya daha mürəkkəb sənaye tapşırıqları üçün ROS əsaslı robototexnika ilə istifadə edə bilərsiniz.",
  "Want emails from robonomics": "Robonimcs-dan e-poçt almaq istəyirəm",
  "Adding you to our special list...": "Sizi xüsusi siyahımıza əlavə edirik...",
  "Nice, you are in the list": "Əla, siyahıdasınız",
  "Something went  wrong. Try again later": "Xəta baş verdi. Biraz sonra yenidən cəhd edin",
  "Your email": "E-poçtunuz",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "İl böyük bir nailiyyətlə başladı - Robonomics 20-ci parachain slot auksionunu qazandı və",
  "officially became": "rəsmi olaraq Kusama şəbəkəsində ID 2048 ilə parachain oldu.",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "Başlama, datalog, DigitalTwin, məsuliyyət funksiyaları və IoT abunəlikləri ekosistemin bütün istifadəçiləri üçün əlçatan oldu. Layihənin bu mərhələsi üçün təfərrüatları təmin etmək üçün əsas komanda",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "-ın ilk fəsillərini nəşr etdi.Substrate'da Robonomics 2.0 XCM mesajları dəstəyi ilə buraxıldı və funksionallığı bizim üçün son dərəcə faydalı olan digər parachainlərlə (Crust Shadow və Darwinia kimi) HRMP kanallarını açmağa başladıq.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Eyni zamanda, protokolumuzu IoT bazarına təqdim etmək üçün strategiyanı hazırladıq. IoT avadanlığı ilə apardığımız təcrübələr bizi mərkəzləşdirilmiş bulud xidməti təminatçılarından müstəqil olan suveren ağıllı ev konsepsiyasına gətirib çıxardı. Biz Home Assistant avtomatlaşdırma sistemi ilə",
  "integration": "inteqrasiyamızı",
  "with the Home Assistant automation system, and also designed our own": "inkişaf etdirdik, həmçinin ağıllı cihazları birləşdirmək üçün öz",
  "IoT gateway": "IoT şlüzümüzü",
  "for connecting smart devices.": "hazırladıq.",
  "We have launched two big initiatives in order to increase community engagement —": "İcma ilə əlaqəni artırmaq üçün iki böyük təşəbbüsə başladıq - ",
  "Robonomics Academy": "Robonomics Akademiyası",
  "Robonomics Ambassador Program": "Robonomics Ambassador Proqramı",
  "Additionally,": "Bundan əlavə,",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "payızda keçirildi ki, Robonomics icması bizim idarəetmə mexanizmlərimizi ilk dəfə sınaqdan keçirə bilsin. Bu yaxınlarda Robonomics komandası DAO IPCI layihəsinə ağıllı binalar üçün karbon əvəzləmə xidmətini təqdim etmək üçün parachain slotu əldə etməyə kömək etdi.",
  "In 2021, our": "2021-ci ildə",
  "main focus": "əsas diqqətimiz",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "IoT tətbiqlərinin Kusama şəbəkəsi üzərindəki parachain'imiz vasitəsilə istifadə oluna bilməsi üçün layihənin hazırlanmasına keçdi. Substrate'da Robonomics 1.0 buraxıldı və biz onların telemetriya məlumatlarını göndərmək üçün parachain-lə birləşdirən sensorları sınaqdan keçiririk, həmçinin rəqəmsal əkiz funksionallığı inkişaf etdiririk. İlin ortasında biz şəbəkəmizin tam dövrəsini sınaqdan keçirmək qərarına gəldik və Robonomics parachaininin inteqrasiya olunduğu (Kusama relay chain'ə keçməzdən əvvəl)",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "adlı öz relay chain yaratdıq. Kusamada bir parachain yuvası əldə etməyə çox diqqət yetirildi, bunun üçün bir neçə crowdloan kampaniyası təşkil etdik.",
  "There have been two big changes for the community. First, we launched the": "Cəmiyyət üçün iki böyük dəyişiklik oldu. Birincisi, biz web3, robototexnika və IoT layihələrinin R&D tapşırıqları üçün maliyyə almasına imkan verən",
  "Robonomics Grant Program": "Robonimika Qrant Proqramını",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "işə saldıq. İlin sonuna qədər proqramda dörd aktiv layihə iştirak etmişdir. İkincisi, komanda Ethereum token sahiblərinə XRT tokenlərini parachain-ə köçürməyə imkan verən",
  "Exodus process": "Exodus prosesinə",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "başladı.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Əməkdaşlıqlar arasında, MerkleBot-da Boston Dynamics Spot-un diqqətəlayiq görünüşünü xatırlaya bilərik, bunun üçün icarəyə",
  "rental remote control system": "verilən uzaqdan idarəetmə sistemi",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "hazırlanmışdır. Robonomics mühəndislərindən ibarət komanda tərəfindən yaradılmış şəxsi layihə olan Multi-Agent Systems şirkəti haqqında da sizə məlumat vermək istərdik. Onlar qəhvəxana sahibləri üçün yemək bişirmə tapşırıqlarını yerinə yetirən Eisenkoch adlı robot vafli bişirən maşın hazırlayıblar.",
  "There came a time when the existing limitations of Ethereum": "Ethereum-un mövcud məhdudiyyətlərinin",
  "began to stand out clearly": "aydın şəkildə fərqlənməyə başladığı",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "bir vaxt gəldi (xüsusən, zəif miqyas, aşağı sürət və əməliyyatların çox yüksək qiyməti). ETH2.0-a yüksəlmə vəziyyəti düzəltməli idi, lakin bu təkmilləşdirmə dəfələrlə gecikdirildi. Ethereum şəbəkəsindən ayrılmaq istəməsək də, indiki vəziyyətdə istifadə hallarımızı həyata keçirməyin çətin olduğunu başa düşdük və alternativ şəbəkə axtarmağa başladıq. Parçalanmış blokçeyn ekosistemi Polkadot bu alternativ oldu. Əsas Robonimics xüsusiyyətlərini köçürmək və öz test şəbəkəmizi yerləşdirmək üçün Substrate framework'u ilə sınaqdan başladıq. Bu mərhələnin sonunda biz parachain-imizi Rococo test şəbəkəsində yerləşdirdik və Kusama şəbəkəsində slot əldə etməyə hazırlaşmağa başladıq.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Əşyaların İnterneti sistemlərinin öyrənilməsini davam etdirərək, biz istifadəçilərə əlavə dəyər yarada bilən Robonomics-in əsas funksionallığını – IoT üçün mərkəzləşdirilməmiş bulud funksiyasını müəyyən etdik. Bu ideya",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "əsasını təşkil etmişdir. RWS infrastrukturu tipik mərkəzləşdirilmiş buludun bütün funksiyalarını öz üzərinə götürdü, lakin qlobal mövcudluq, təhlükəsizlik və məxfilik kimi standart problemlər olmadan. Bundan əlavə, biz abunə sahiblərinə hər bir əməliyyat üçün heç bir ödəniş etmədən blokçeyn şəbəkəsindən istifadə etməyə imkan verən parachain IoT abunələri ideyası ilə gəldik. IoT abunəliyi ilə bağlı ilk təcrübə sahibinə blok başına 1 tranzaksiya göndərməyə imkan verən RWS tokeninin emissiyası olub. Bundan əlavə, biz smart cihazların idarə edilməsi üçün öz aparat dəstimizi (DAOS konsepsiyası) inkişaf etdirmək üçün ilk addımları atmağa başladıq.",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Təbii ki, Ethereum-da Robonomics-ə dəstək dayanmayıb. Robonomics kommunikasiya stack-ı",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "versiyasına uyğunlaşdırılıb. XRT tokeni bir neçə birjada (xüsusilə, Uniswap DEX) ticarətə başlayıb və likvidliyin stimullaşdırılması proqramı işə salınıb.",
  "The team actively developed ways to interact with the community. The first version of our": "Komanda fəal şəkildə cəmiyyətlə əlaqə qurmağın yollarını inkişaf etdirdi. Bizim",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "saytımızın və Robonomics Wiki-nin ilk versiyası istifadəyə verildi. Layihənin daha şəffaf və rahat idarə olunması üçün biz",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "-dan istifadə etməyə başladıq. Layihəyə yeni gələnlər üçün 2019-cu ildə",
  "Robonomics Winter School": "Robonimika Qış Məktəbini",
  "in 2019 for newcomers to the project.": "ikeçirdik.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Xoş layihələrlə əməkdaşlıq da davam etdirildi. Robonomics və DAO IPCI sensor məlumatların toplanması və təhlili üçün",
  "Robonomics became the foundation for the": "xidməti təqdim etdi. Robonomics robot avadanlıqlarının ağıllı lizinq sistemini inkişaf etdirən",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "layihəsinin təməli oldu.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Biz başa düşdük ki, muxtar agentlərə onların etibarlı texniki və iqtisadi əməliyyatlarını təmin edəcək mühit lazımdır. Bir neçə ildir ki, biz robot agentlərə öz xidmətlərini göstərməyə kömək edən mərkəzləşdirilməmiş provayderlər şəbəkəsi yaratmaq üçün protokol hazırlayırdıq.Ethereum və ROS arasında rabitə yığını və şəbəkəyə texniki xidmət üçün alətlər hazırlanmışdır. 2018-ci ildə biz",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "nəşr etdik və Robonomics Network-ün alfa versiyası Ethereum şəbəkəsində istifadəyə verildi. XRT token generasiya tədbiri üçün aktiv hazırlıqlar davam etdi (bu, ilk kripto qışı səbəbindən 2019-cu ilin yazında baş verdi).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Bu dövrdən etibarən Robonomics Sənaye 4.0 ilə əlaqəli istifadə hallarını dinamik şəkildə inkişaf etdirməyə başladı - ağıllı fabriklər, ağıllı şəhərlər və ağıllı evlər - və bu, IoT dünyasına diqqətimizi cəlb etdi. Yenilik axtarışında komanda bir neçə böyük və unikal elmi-tədqiqat demolarını təqdim etdi: mülki",
  "sensor network": "sensor şəbəkəsi",
  "a water drone": "ətraf mühitin monitorinqi üçün su dronu",
  "for environmental monitoring (supported by a sensor systems manufacturer": "(sensor sistemləri istehsalçısı",
  "a smart factory model": "tərəfindən dəstəklənir), ağıllı fabrik modeli",
  "a self-employed": "öz-özünə işləyən",
  "robot artist Gaka-chu": "robot rəssamı Gaka-chu",
  "and a": "və",
  "drone traffic management system": "dron nəqliyyatının idarə edilməsi sistemi",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomiks web3 texnologiyaları və IoT cihazlarından istifadə etməklə ekoloji aktivlərin idarə edilməsi üzrə DAO IPCI layihəsi ilə əməkdaşlığa başlayıb.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Bu, p2p texnologiyalarının robototexnika üçün əvvəllər mövcud olmayan imkanlara malik olduğu bir sıra tapşırıqları müəyyən etdiyimiz fəal R&D dövrü idi. Ethereum kompüterini, IPFS fayl saxlama sistemini və Robot Əməliyyat Sistemini (ROS) birləşdirərək, hər hansı bir cihazın potensial olaraq",
  "autonomous intelligent robot agent": "avtonom ağıllı robot agentinə",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "çevrilə biləcəyini başa düşdük. Öz növbəsində bu, bizim üçün Robot-Servis-Kimi və robot iqtisadiyyatı anlayışlarına yol açdı.",
  "Our publications in scientific journals of this period are available in the": "Bu dövrə aid elmi jurnallardakı nəşrlərimiz",
  "Papers section": "Papers bölməsində mövcuddur",
  "We have collected all R&D projects over the years in the": "İllər ərzində bütün R&D layihələrini",
  "a handy book": "lazımlı bir kitabda topladıq",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Hamısı Ethereum öz ana şəbəkəsini yenicə işə saldıqda təsisçilərin ağlına gələn bir fikirlə başladı. Əgər robot kriptovalyuta üçün müştəri üçün tapşırıq yerinə yetirirsə və onun məntiqi ağıllı müqavilə ilə idarə olunursa?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "İdeyanı yoxlamaq üçün istifadəçi ödəniş əməliyyatını tamamladıqdan sonra müəyyən edilmiş GPS koordinatlarına nail olmaq üçün Ethereum kompüteri tərəfindən idarə olunan dronun işə salındığı demo hazırladıq.",
  "The demo is available on": "Demo",
  "YouTube": "YouTube-da mövcuddur.",
  "Infrastructure && tech development timeline": "İnfrastruktur və texnoloji̇ İnki̇şaf təqvi̇mi̇",
  "Notable events": "Görkəmli tədbirlər",
  "World Economic Forum Annual Meeting 2022": "Dünya İqtisadi Forumunun İllik Toplantısı 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "Suveren Ev Avtomatlaşdırma Yolunda",
  "Becoming a Parachain for IoT Applications": "IoT Tətbiqləri üçün Parachain olmaq",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (Robonomics tərəfindən dəstəklənib)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (Robonomics tərəfindən təşkil olunub)",
  "Transition to Multinetwork — Along Came Polkadot": "Multişəbəkəyə keçid - Polkadot gəldi",
  "The Rise of Robonomics Network": "Robonomika Şəbəkəsinin Yüksəlişi",
  "Crypto Valley Conference 2018": "Kripto Vadisi Konfransı 2018",
  "European Parliament workshop 'The Economy of Robots'": "Avropa Parlamentində “Robotların İqtisadiyyatı” seminarı",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MIT Media Laboratoriyasında Robotik Sistemlər üçün Blockchain üzrə Simpozium",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics komandasının təşkilatı ilə “Robonomics-2018” yay məktəbi",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Web3 Texnologiyaların və Robotik Framework-lərin bir araya gətirilməsi",
  "Playing with Human-Machine Interaction through Ethereum": "Ethereum vasitəsilə insan-maşın qarşılıqlı əlaqəsi ilə oynamaq",
  "Robonomics whitepaper 2022 welcome guide": "Robonomika whitepaper 2022 təli̇mati",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Biz Ethereum və IPFS üzərində işləyən texno-iqtisadi maşın rabitə protokolu hazırlamışıq və onu Polkadot parachain əsasında bulud əsaslı IoT platformasının elementləri ilə tamamlayırıq. Bu gün artıq futuristik IoT tətbiqləri yaratmaq üçün hibrid platformamız var. Qlobal mərkəzləşdirilməmiş kompüterin nəzarəti altında olan cihazlarla qarşılıqlı əlaqəni təmin edir. Robonomics platformasından istifadə edərək təhlükəsiz, serversiz və futuristik IoT proqramları yaratmağa başlamazdan əvvəl gəlin nəzəriyyəyə bir az nəzər salaq...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomika white paper-in ilk iki fəsli artıq istifadəçilər üçün mövcuddur.",
  "Chapter 1.": "Fəsi̇l 1.",
  "At the intersection of cybernetics and economics": "Kibernetika və iqtisadiyyatin sərhəddində",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Biz robot cihazların əvvəllər insanlar üçün nəzərdə tutulmuş əsas iqtisadi fəaliyyətləri yerinə yetirə bilən müstəqil agentlər kimi çıxış etdiyi iqtisadi sistem təqdim etdik. Bu fəsildə biz insanların həyatının mühüm hissəsinə çevrilə bilən və gələcəkdə iqtisadiyyatın hazırkı səviyyəsini tam avtomatlaşdırılmış xidmətlərə çevirə bilən robot iqtisadiyyatının aktuallığından danışacağıq.",
  "In this chapter you will learn": "Bu fəsildə aşağıdakıları öyrənəcəksiniz",
  "Ronald Coase and The Nature of the Firm": "Ronald Kouz və firmanın təbiəti",
  "CPS - cyber-physical system": "CPS - kiber-fiziki sistem",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener və həyatda və maşında nümunələrin axtarış",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Dördüncü Sənaye İnqilabı, Robotlar üçün Pul və Bitcoin",
  "Ethereum Smart Contracts": "Ethereum Ağıllı Müqavilələri",
  "Polkadot Parachains": "Polkadot parachainləri",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Teleologiya və Mizesin işinin açıq sualları",
  "Read chapter 1": "1-ci fƏsli oxuyun",
  "Chapter 2.": "Fəsi̇l 2.",
  "Robonomics architecture": "Robonomi̇ka arxitekturasi",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "İkinci fəsildə siz müasir İnternet texnologiyasından istifadə edərək insan-maşın qarşılıqlı əlaqəsi haqqında oxuyacaqsınız - IoT cihazlarından mərkəzləşdirilməmiş və qlobal olaraq əlçatan provayderlər şəbəkəsinə qədər. Biz IoT sistemlərinin yaradıcılarının qarşılaşdıqları və Robonimikanın həllinə yönəlmiş əsas problemləri vurğulamaq üçün Əşyaların İnternetinin əsaslarına nəzər salacağıq.",
  "Overview of the state of the Internet of Things (IoT)": "Əşyaların İnternetinin (IoT) vəziyyətinə baxış",
  "Classification of IoT devices": "IoT cihazlarının təsnifatı",
  "Embedded IoT systems": "Quraşdırılmış IoT sistemləri",
  "Edge-systems: IoT gateways and controllers": "Edge sistemləri: IoT şlüzləri və nəzarətçiləri",
  "Autonomous Systems": "Avtonom sistemlər",
  "Internet of Things providers": "Əşyaların İnterneti təminatçıları",
  "Digital twins are the heart of the Internet of Things": "Rəqəmsal əkizlər Əşyaların İnternetinin ürəyidir",
  "IoT data flows in cloud service": "IoT məlumatları bulud xidmətində axır",
  "Popular examples of IoT solutions": "IoT həllərinin məşhur nümunələri",
  "Current problems of building IoT solutions": "IoT həllərinin qurulmasının aktual problemləri",
  "Main tasks of Robonomics architecture": "Robonimikanın arxitekturasının əsas vəzifələri",
  "Basic components of Robonomics architecture": "Robonimikanın arxitekturasının əsas komponentləri",
  "A simple representation of Robonomics architecture": "Robonimika arxitekturasının sadə bir təqdimatı",
  "Read chapter 2": "2-ci fəsli oxuyun",
  "We continue to update the white paper of Robonomics": "Robonimikanın white paper-ı yeniləməyə davam edirik",
  "stay tuned for new parts on our website and in Discord": "saytımızda və Discord-da yeni hissələr üçün bizi izləməyə davam edin",
  "Join our discord": "Discord-umuza qoşulun",
  "Robonomics logos and usage": "Robonomics logolari və İsti̇fadəsi̇",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Onu necə istifadə edə biləcəyinizi göstərmək üçün biz Robonomics loqolarını, rənglərini, aktivlərini və təlimatlarını bir araya gətirdik.",
  "Download Robonomics logo": "Robonomics logonu yüklə",
  "Download RWS logo": "RWS logonu yüklə",
  "Download wiki logo": "Vi̇ki̇ logonu yüklə",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Robonomics, RWS və ya Robonomics Viki ilə əlaqə yaratmaq üçün bu icazə verilən loqolardan istifadə edin",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Robonomics ilə inteqrasiya olunduğunuzu başqalarına bildirmək üçün icazə verilən Robonomics loqosundan istifadə edin",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Robonomics texnologiyası və inteqrasiya olunmuş layihələr haqqında bloq yazılarında, məqalələrdə və slaydlarda icazə verilən loqolardan istifadə edin.",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Rəngin, ölçülərin dəyişdirilməsi və ya digər sözlər və ya dizayn elementləri ilə birləşdirilməsi daxil olmaqla, icazə verilən Robonomics loqolarını dəyişdirməyin",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Robonomics loqosu və adından sizin Robonomics olduğunuzu, təklifinizin və ya layihənizin Robonomics tərəfindən olduğunu və ya Robonomics DAO tərəfindən təsdiq edilmədiyi təqdirdə, Robonomics-in sizi və ya təklifinizi və ya layihənizi dəstəklədiyini göstərən şəkildə istifadə etməyin",
  "Robonomics Color pallet": "Robonomi̇cs rəng pali̇trasi",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "İnterfeyslərimizdə, printerlərimizdə və digər vizual görüntülərimizdə istifadə etdiyimiz bu rənglər. </br> Onu slaydlarınız, Robonomics haqqında danışan yazılar üçün bannerlər və s. üçün istifadə edin."
}