{
  "What is Robonomics network?": "什么是Robonomics网络？",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics是一个开源平台，用于物联网应用程序，可以在用户应用程序、物联网服务和复杂机器人之间以原子交易的形式交换技术和经济信息。",
  "Get started": "开始",
  "Explore Robonomics": "探索Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics是一个开源技术，适用于物联网市场，适用于所有。阅读执行摘要以了解更多信息",
  "Get XRT": "获取XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT是一种实用令牌，可以在以太坊网络和Robonomics平行链上控制物联网设备",
  "Use a Dapp": "使用Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "查看用于管理物联网设备的去中心化应用程序的Beta版本",
  "Start building": "开始构建",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "通过教程和在Robonomics WIKI中进行实用实验来学习Robonomics",
  "Robonomics objectives": "Robonomics目标",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "基于云平台的成就，Robonomics旨在为物联网市场提供更安全、更先进的互联网解决方案，以满足人机通信的各个阶段的需求。以下是Robonomics正在开发的主要任务",
  "IoT device management with a decentralized cloud": "使用去中心化云进行物联网设备管理",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "区块链网络具备确保设备启动和接收遥测的最高安全级别的所有参数。与设备的交互实际上可以通过改变存储在区块链网络中的数字孪生状态并向物理设备传递有关这些变化的信息来描述。在使用无许可区块链的情况下，我们可以确保提供者的全球可用性，以及对数字孪生的数据保护的高水平，以防止不必要的更改。",
  "Techno-economic transactions between humans and machines": "人与机器之间的技术经济交易",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "我们可以谈论自动化系统直接通过加密货币和智能合约访问数字市场的机构成就。例如，以太坊已经实现了大部分经济活动的基本工具。如果支付和服务条款与设备的启动参数不可分割，那么今天建的连接最终用户和物联网设备的应用程序将更加高效。",
  "Serverless IoT applications for users": "用户的无服务器物联网应用程序",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "现代应用程序用户的隐私问题不应该受到公司无法使用Web3领域的现代进展的限制。无需进行身份验证或要求连接到特定服务器即可访问遥测和控制设备。",
  "Learn with Robonomics": "与Robonomics一起学习",
  "Introduction course": "入门课程",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "深入探讨构建现代物联网应用程序和使用Web3技术和Robonomics工具解决可能出现的问题的可能解决方案，适用于物联网开发人员和用户。",
  "Boston dynamics spot software developing": "波士顿动力Spot软件开发",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "我们很高兴向您介绍Spot SDK教育计划！我们的目标是让您熟悉Spot的SDK，并允许您在我们的实验室中远程测试您的技能，使用波士顿动力Spot机器人。",
  "Sovereign smart home with robonomics and home assistant": "Robonomics和Home Assistant的主权智能家居",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "在本课程中，您将完成构建自己的主权智能家居所需的所有步骤，其主要优势是用户数据的安全/隐私。",
  "Shop": "商店",
  "Science papers": "科学论文",
  "Books": "书籍",
  "Logo and assets": "标志和资产",
  "Wallpapers": "壁纸",
  "Blog": "博客",
  "Cases": "案例",
  "Ambassador program": "大使计划",
  "Contacts": "联系人",
  "Robonomics is 100% open-source.": "Robonomics是100%开源的。",
  "Anyone can contribute to": "任何人都可以贡献",
  "the code base": "代码库",
  "or": "或者",
  "build services with Robonomics": "使用Robonomics构建服务",
  "White Paper 2022": "白皮书2022",
  "Timeline": "时间线",
  "Tokenomics": "代币经济学",
  "Parachain": "平行链",
  "User (D)App": "用户（D）应用程序",
  "Function request": "功能请求",
  "Report": "报告",
  "Control": "控制",
  "Log": "日志",
  "IoT Device": "物联网设备",
  "Decentralized application": "去中心化应用程序",
  "Digital twin": "数字孪生",
  "IoT / Smart device": "物联网/智能设备",
  "Robonomics tokenomics": "Robonomics通证经济学",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "是一种实用通证，将使得在以太坊网络和Polkadot生态系统中的Robonomics平行链上控制物联网设备成为可能。",
  "Token distribution": "通证分配",
  "The task": "任务",
  "Try our Dapp": "尝试我们的Dapp",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "您可以使用Polkadot（Kusama）和以太坊社区提供的工具在区块链内操作XRT。",
  "Within the Kusama network, you have the capability use": "在Kusama网络内，您可以使用各种去中心化应用程序（dApps）",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "在Robonomics平行链和其他平行链之间进行通信。",
  "Attention please": "请注意",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "如果您一直在使用多链服务进行桥接交易，请暂时停止使用，因为它已经在多链的官方推特上宣布。",
  "announced": "注意骗子",
  "on the official Twitter of The Multichain.": "请只使用知名市场进行XRT交易。不要将您的代币发送到通过私人消息给您的帐户，无论您想进行什么交易（购买或出售代币）。如果您收到任何关于Robonomics通证的“大声声明”（骗子经常使用类似空投公告的方式），请检查此网站（https://robonomics.network/）或我们的",
  "Be aware of scammers": "以获取官方更新。请小心，保持安全。",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "以太坊中的XRT",
  "for official updates. Be careful, be safe.": "在2015年至2018年实施Robonomics项目时，项目团队需要找到Robonomics Network提供有用功能的连接，即根据机器人即服务模型启动物联网设备，并对Robonomics提供者在以太坊中的燃气费用进行补偿。我们需要考虑每个单独智能设备履行服务的责任生命周期。作为Robonomics早期研发的结果，团队提出了一种挖掘新代币以奖励每个创建的机器人即服务智能合约的机制。这个模型在以太坊上仍然可行，但需要在以太坊中进行重大改进。",
  "XRT in Ethereum": "阅读此内容以了解XRT在以太坊生态系统中的历史背景和长期计划。",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Etherscan资料",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "在以太坊网络中查看代币智能合约和交易。",
  "Etherscan profile": "Coingecko市场",
  "View token smart contract and transactions in Ethereum network here.": "在这里可以找到用于交易XRT的中心化交易所和去中心化交易所市场。",
  "Coingecko markets": "Polkadot中的XRT",
  "Here you can find CEX and DEX markets for trading XRT.": "从以太坊转移到Polkadot，我们需要在通证经济学上进行“扩展”。Polkadot生态系统中的平行链不等同于智能合约，而是一种完全可编程的区块链，租用整个网络的一部分。",
  "XRT In Polkadot": "Polkadot和Kusama平行链的实际支付是长期绑定足够数量的本地中继链代币（DOT / KSM）以赢得其中一次拍卖。Robonomics平行链中的XRT支持插槽续约和利益相关者的奖励。激活物联网订阅的XRT销毁机制旨在将通胀降至最低，并在兴趣增加时降至零。",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "了解更多",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "在我们的网络架构师的Twitter帖子中。",
  "Learn more": "用途:",
  "in Twitter thread from our network architect.": "XRT既可以用于支付平行链上的交易费用，也可以用于购买物联网订阅，以确保设备或用户的物联网交易得到优先处理。",
  "Usage:": "奖励:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "在一年中，平行链发行少量XRT以激励平行链整理者。",
  "Rewards:": "整理者的总奖励参数",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "由代币持有者的链上投票确定，并可以通过举行公投进更改。",
  "The parameter of the total reward": "使用XRT",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "在我们的去中心化应用程序中购买物联网订阅。在区块链上控制您的智能设备，无需任何集中式公司的观察。",
  "Use XRT": "Subscan资料",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "在Polkadot生态系统顶部查看代币统计信息。",
  "Subscan profile": "其他问题",
  "View token statistics on top of Polkadot ecosystem.": "什么是RWS？",
  "Other questions": "[核心功能开发中]对于工程师，核心开发团队将尝试创建不同的Robonomics使用模型，而这个过程的第一步是推出终身订阅代币 - RWS代币。每个RWS代币将为您提供每秒1次（tps）的从/到您的物联网设备在Robonomics平行链上的交易。激活您的RWS代币，并在执行之前和可预测的延迟下进行“免费燃气”交易。停用RWS代币并在去中心化交易所上交易。",
  "What is RWS?": "什么是AIRA/AIR ID？",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "在2017年作为Robonomics基础设施的自治部分分发的预-XRT代币。在2019年成功启动Robonomics在以太坊上后，AIRA代币通过",
  "What is AIRA/AIR ID?": "ambix智能合约",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "与项目创建的基础设施连接，以确保预-XRT到ERC-20 XRT的自主和独立交换过程。",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Robonomics代币的目的是确保在区块链基础设施中维护智能城市和工业4.0的去中心化网络的运行。为了实现这个目标，代币经济需要反映出对网络实施的激励。",
  "In addition": "此外",
  "ambix smart contract": "ambix智能合约",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "保证了将pre-XRT交换为ERC-20 XRT的自主和独立过程。",
  "Within the Ethereum network you can use decentralized application powered by the": "在以太坊网络中，您可以使用由去中心化应用程序提供支持的",
  "Translation was executed by AI so there may be some inaccuracies": "翻译是由人工智能执行的，所以可能存在一些不准确之处",
  "Inform us": "请告知我们",
  "please": "如果您发现任何问题",
  "if you find any": "如果你发现任何",
  "Scientific Papers with Robonomics": "Robonomics科学论文",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "去中心化应用程序（dapp）在区块链内运行。它是开源的，其数据存储在IPFS和Github上。这些技术使应用程序既安全又透明。我们的开发人员正在同时开发Robonomics应用程序和您在构建自己的dapp时可以使用的库。",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "数字孪生是Robonomics Web Services（RWS）提供的工具之一。它充当真实设备的数字版本，并复制其所有技术特性。它使得去中心化应用程序对用户的命令更加响应。",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "您可以将Robonomics与各种Zigbee智能设备配合使用，以自动化和控制家庭/办公室的各个方面，或者将其与基于ROS的机器人技术一起使用，以执行更复杂的工业任务。",
  "Robot and electrics sheep artboard": "机器人和电子绵羊画板",
  "Robot and apple artboard": "机器人和苹果画板",
  "Robot and cosmonaut artboard": "机器人和宇航员画板",
  "Robot and cat artboard": "机器人和猫画板",
  "Space travelers artboard": "太空旅行者画板",
  "Coloured astronaut artboard": "彩色宇航员画板",
  "Black and white astronaut artboard": "黑白宇航员画板",
  "icons for macos": "macOS图标",
  "icons for windows": "Windows图标",
  "Do Androids Dream of Electric Sheep?": "安卓梦见电子绵羊吗？",
  "Sleeping Mew Space": "睡觉的Mew太空",
  "Are you ready for Mars?": "你准备好去火星了吗？",
  "Shiva Robot": "Shiva机器人",
  "Space Travelers": "太空旅行者",
  "Retro Astronaut": "复古宇航员",
  "New Newton": "新牛顿",
  "White Paper / May 12, 2018": "白皮书/2018年5月12日",
  "If you want to go deeper into learning Robonomics Network, read this document (.pdf ~ 2 MB).": "如果您想深入了解Robonomics Network的学习，请阅读此文档（.pdf〜2 MB）。",
  "2021, Robot-as-a-Service: From Cloud to Peering Technologies": "2021年，机器人即服务：从云到对等技术",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov，Sergey Lonshakov，Vitaly Bulatov，Babak Kia Montazam，James White",
  "2020, Trustable Environmental Monitoring by means of Sensors Networks on Swarming Autonomous Marine Vessels and Distributed Ledger Technology": "2020年，通过传感器网络和分布式账本技术实现可信环境监测",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman，Enrica Zereik，Aleksandr Kapitonov，Fabio Bonsignorio，Alisher Khasanov，Aziza Oripova，Sergey Lonshakov，Vitaly Bulatov",
  "2019, Digital Passport for Unmanned Vehicles": "2019年，无人驾驶车辆的数字护照",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko，Aleksandr Kapitonov，Ivan Berman",
  "2019, Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "2019年，Robonomics作为基于区块链的无人交通管理平台",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov；Ivan Berman；Vadim Manaenko；Vyacheslav Rzhevskiy；Vitaly Bulatov；Artemii Zenkin",
  "2019, Towards Blockchain-based Multi-Agent Robotic Systems: Analysis, Classification and Applications": "2019年，面向基于区块链的多Agent机器人系统：分析、分类和应用",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev，Alexander Kolotov，Ruslan Rezin，Konstantin Danilov，Manuel Mazzara，Subham Chakraborty，Alexey Kashevnik，Andrey Chechulin，Aleksandr Kapitonov，Vladimir Jotsov，Andon Topalov，Nikola Shakev，Sevil Ahmed",
  "2019, Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "2019年，基于分布式技术的新范式智能城市的机器人服务",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov，Sergey Lonshakov，Ivan Berman，Eduardo Castelló Ferrer，Fabio P Bonsignorio，Vitaly Bulatov，Aleksandr Svistov",
  "2019, Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "2019年，工厂中基于市场机制的分散自治代理网络组织协议",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov，Ivan Berman，Sergey Lonshakov，Aleksandr Krupenkin，Vitaly Bulatov",
  "2018, Towards Blockchain-Based Robonomics: Autonomous Agents Behavior Validation": "2018年，基于区块链的Robonomics：自主Agent行为验证",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov；Ruslan Rezin；Ilya Afanasyev；Alexander Kolotov",
  "2018, Transforming climate finance and green investment with blockchains": "2018年，通过区块链改变气候金融和绿色投资",
  "Alastair Marke": "Alastair Marke",
  "2018, Robonomics: platform for integration of cyber physical systems into human economy": "2018年，Robonomics：将网络物理系统整合到人类经济中的平台",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov，Aleksandr Krupenkin，Aleksandr Kapitonov，Evgeny Radchenko，Alisher Khassanov，Aleksandr Starostin",
  "2018, Blockchain based protocol for economical communication in industry 4.0": "2018年，工业4.0中基于区块链的经济通信协议",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov，Ivan Berman，Sergey Lonshakov，Aleksandr Krupenkin",
  "2018, Robonomics based on blockchain as a principle of creating smart factories": "2018年，基于Robonomics的智能工厂创建原则",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov，Ivan Berman，Vitaly Bulatov，Sergey Lonshakov，Aleksandr Krupenkin",
  "2018, Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "2018年，碳市场、环境资产、权益和责任的区块链生态系统：概念设计和实施",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich，Sergey Lonshakov，Alexey Shadrin",
  "2017, Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "2017年，基于区块链的无人机多Agent系统的自主业务活动协议",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov，Sergey Lonshakov，Aleksandr Krupenkin，Ivan Berman",
  "The latest Robonomics news here.": "这里是最新的Robonomics新闻。",
  "Follow us": "关注我们",
  "Video tutorials, screencasts, interviews, events.": "视频教程、屏幕录像、采访、活动。",
  "Watch videos": "观看视频",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "与我们和社区聊天。随时提问并讨论您的建议。",
  "Join chat": "加入聊天",
  "Medium Blog": "Medium博客",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "我们对Robonomics、以太坊、Polkadot网络、绿色市场、机器人技术以及与Robonomics相关的一切的过去、现在和未来的愿景。",
  "Read": "阅读",
  "Telegram chat": "Telegram聊天",
  "Local communities & news. You are welcome!": "本地社区和新闻。欢迎您！",
  "Updated use cases for connected robots within web3 technologies.": "连接的机器人在web3技术中的最新用例。",
  "17 use cases for connected robots within Polkadot and Ethereum.": "Polkadot和以太坊中连接的机器人的17个用例。",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "在这里，我们解释了一个网络物理系统的概念，它如何帮助扩大制造业，并解决机器人的责任问题。",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "这里的基准是，自由经济原则足以在自动化世界中生活。机器人可以成为我们的朋友，我们不需要集中化来使其舒适可靠。",
  "Additional icons for the wallpaper:": "壁纸的附加图标：",
  "Want emails from robonomics": "想要来自Robonomics的电子邮件",
  "Adding you to our special list...": "将您添加到我们的特殊列表中...",
  "Nice, you are in the list": "很好，您已经在列表中了",
  "Something went  wrong. Try again later": "出了点问题。请稍后再试",
  "Our library": "我们的图书馆",
  "Free E-Books": "免费电子书",
  "Our recommendations": "我们的推荐",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "如果您想更深入、更有灵感和自我教育地参与机器人技术在这个领域取得进步并了解其背后的经济学，我们推荐这些书籍给您。您可以从其他来源下载或购买这些书籍。",
  "Community & Contacts": "社区与联系方式",
  "Get latest updates": "获取最新更新",
  "Your email": "您的电子邮件",
  "Tell us something if you want": "如果您愿意，请告诉我们一些信息",
  "Submit": "提交",
  "Something went  wrong :( Try again later": "出了点问题 :( 请稍后再试",
  "Robonomics nfts": "Robonomics NFT",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "在这里，我们汇集了在我们广泛的加密货币之旅中铸造的NFT的收藏品，无论是独立完成还是与伟大的团队合作。这些独特的代币在区块链上提供可验证的所有权，并为您的区块链账户增添了很棒的装饰品。您可以在拍卖中竞标其中一些，甚至可以铸造您自己独特的作品。",
  "Robonomics Pioneer": "Robonomics 先锋",
  "1. Robonomics Pioneer": "1. Robonomics 先锋",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "在我们最初的 Kusama 众贷活动中，我们决定奖励我们的加密货币先锋贡献者的不仅仅是代币 - 我们还赠送了他们一张丰富多彩的 NFT。这张卡对我们来说意义重大，如果有人拥有它，我们知道他们是 Robonomics 价值观的出色支持者：自由和去中心化。",
  "Robonomics crypto girls": "Robonomics 加密女孩",
  "2. Robonomics crypto girls": "2. Robonomics 加密女孩",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "我们很高兴向您介绍我们的特别系列数字资产 - Robonomics 加密女孩，由 Robonomics 艺术与科学团队创建。该系列中的每个 NFT 都是 Robonomics 使用的技术或建立在 Robonomics 用例之的独特图形表示。我们才华横溢的艺术家以 Robonomics 的标志性风格手绘了每个女孩。您可以选择与您共鸣的女孩或收集整个系列！通过购买这些 NFT，您不仅为您的收藏品增添了时尚的装饰品，还支持我们继续创新和实施机器人的去中心化连接。敬请期待系列的新作品！",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. 季节性 NFT 收藏",
  "On demand minting": "按需铸造",
  "SEASONAL SPOT NFT COLLECTIONS": "季节性 NFT 收藏",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "这些季节性 NFT 收藏代表了用户与 Robonomics 平行链中的 Spot 之间独特互动的数字资产。用户可以在浏览器上绘制任何东西，机器人将复制他们的动作以创建手绘图像。互动完成后，NFT 将在 Singular 市场上铸造到用户的 Polkadot 账户中。现在，任何人都可以与位于加利福尼亚实验室的真实机器人互动，创建个性化和独特的数字资产，就像任何其他数字资产一样拥有、购买和出售。",
  "Create your NFT": "创建您的 NFT",
  "4. automated telescope collection": "4. 自动望远镜收藏",
  "automated telescope collection": "自动望远镜收藏",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "位于智利的阿塔卡马沙漠，可以通过一个去中心化应用程序访问实时捕捉深空天体图像的物理望远镜。每个有互联网连接的用户都可以使用 $STRGZN 代币在应用程序中使用信用卡购买它。选择一个天体对象，发送命令给望远镜拍照，然后等待在 Singular 平台上铸造的 NFT。请注意，由于望远镜的运行时间，该应用程序仅在 GMT-3 时区的晚上 11 点至早上 6 点之间可用。",
  "Try yourself": "亲自尝试",
  "5. Robonomics Polka pet": "5. Robonomics Polka 宠物",
  "In collaboration with Polkapets": "与 Polkapets 合作",
  "and": "和",
  "Robonomics Polka pet": "Robonomics Polka 宠物",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "作为 Polkadot 生态系统的自豪成员，Robonomics 参与了 Polka Pets World。与 Polka Pets 团队一起，我们铸造了 1200 个 NFT，展示了一个独特的设计概念，展示了我们的核心连接理念。为了将这个理念变为现实，我们创造了一个人物形象：一个专门帮助人类与任何机器人实体连接的机器人。",
  "6. Mecha Arm Jetpack": "6. 机械臂喷气背包",
  "Mecha Arm Jetpack": "机械臂喷气背包",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "2021 年，Robonomics 开始承诺支持将 RMRK 的调色板集成到其运行时中，从而实现与世界上最先进的 NFT 逻辑的本地集成。为了庆祝这一重要里程碑，我们推出了一个特殊的 Kanaria 兼容物品 - 一个可以装备到 Kanaria 鸟身上的子 NFT，并可能在 RMRK 的元宇宙中提供优势。",
  "RMRK Partnerships": "RMRK 合作",
  "Robonomics wallpapers": "Robonomics 壁纸",
  "Regular wallpapers": "常规壁纸",
  "Wallpapers for phones": "手机壁纸",
  "Hidden wallpapers": "隐藏壁纸",
  "Important news & announcements": "重要新闻和公告"
}