{
  "What is Robonomics network?": "什么是ROBONOMICS？",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics是一个开源平台，用于物联网应用，它可以使用户应用程序、物联网服务和复杂机器人之间以原子交易的形式交换技术和经济信息",
  "Get started": "新手入门",
  "Explore Robonomics": "探索Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics 是一项面向物联网市场的开源技术，可供所有人使用。阅读执行摘要，了解详情",
  "Get XRT": "获取XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT 是一种效用代币，可以控制以太坊和 Robonomics 平行链之上的物联网设备",
  "Use a Dapp": "使用Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "查看物联网设备去中心化管理应用程序的测试版本",
  "Start building": "开始构建",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "通过 Robonomics WIKI 中的教程和实用体验，了解 Robonomics",
  "Robonomics objectives": "Robonomics 的目标",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Robonomics 基于云平台的成果，其目标是在人机通信的各个阶段为物联网市场提供更加安全和更加先进的互联网解决方案。开发 Robonomics 的主要任务有",
  "IoT device management with a decentralized cloud": "通过去中心化的云，管理物联网设备",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "区块链网络具有所有参数，以确保设备启动和接收遥测的最高安全级别。与设备的交互实际上可以通过更改存储在区块链网络中的数字孪生状态并将更改信息传递给物理设备进行描述。在使用无需许可区块链的情况下，我们可以确保提供者的全球可用性，以及数字孪生的高级数据保护，免受不必要的更改.",
  "Techno-economic transactions between humans and machines": "人机之间的技术经济交易",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "我们可以谈论自动化系统通过加密货币和智能合约直接进入数字市场方面的机构成就。例如，以太坊已经实现了经济活动的大部分基本工具。如果付款和服务条款与设备的启动参数密不可分，那么，今天为连接终端用户和物联网设备而创建的应用程序将更加高效",
  "Serverless IoT applications for users": "面向用户的无服务器物联网应用",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "现代应用程序用户的隐私问题不应该停留在公司无法使用 web3 领域的现代进步中。无需验证或要求连接到特定服务器即可访问遥测和控制设备。",
  "Learn with Robonomics": "与Robonomics一起学习",
  "Introduction course": "入门课程",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "深入探讨构建现代物联网应用程序时出现的问题，以及使用 web3 技术和 Robonomics 工具为 IoT 开发人员和用户提供的可能解决方案。",
  "Boston dynamics spot software developing": "波士顿动力Spot软件开发",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "我们很高兴向您介绍Spot SDK教育计划！我们的目标是让您熟悉Spot的SDK，并允许您在我们的实验室中远程测试您的技能，使用波士顿动力Spot机器人。",
  "Sovereign smart home with robonomics and home assistant": "具有 Robonomics 和 Home Assistant 的主权智能家居",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "在本课程中，您将完成构建自己的主权智能家居所需的所有步骤，其主要优势是用户数据的安全/隐私.",
  "Shop": "商店",
  "Science papers": "科学论文",
  "Books": "书籍",
  "Logo and assets": "标志和资产",
  "Wallpapers": "壁纸",
  "Blog": "博客",
  "Cases": "案例",
  "Ambassador program": "大使计划",
  "Contacts": "联系人",
  "Robonomics is 100% open-source.": "Robonomics是100%开源的。",
  "Anyone can contribute to": "任何人都可以贡献",
  "the code base": "代码库",
  "or": "或者",
  "build services with Robonomics": "使用Robonomics构建服务",
  "White Paper 2022": "白皮书2022",
  "Timeline": "时间线",
  "Tokenomics": "代币经济学",
  "Parachain": "平行链",
  "User (D)App": "用户（D）应用程序",
  "Function request": "功能请求",
  "Report": "报告",
  "Control": "控制",
  "Log": "日志",
  "IoT Device": "物联网设备",
  "Decentralized application": "去中心化应用程序",
  "Digital twin": "数字孪生",
  "IoT / Smart device": "物联网/智能设备",
  "Robonomics tokenomics": "Robonomics通证经济学",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "是一种实用代币，它将使得在以太坊网络和 Polkadot 生态系统中的 Robonomics Parachain 上控制物联网设备成为可能。",
  "Token distribution": "代币分发",
  "The task": "任务",
  "Try our Dapp": "尝试我们的Dapp",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "您可以使用Polkadot（Kusama）和以太坊社区提供的工具在区块链内操作XRT。",
  "Within the Kusama network, you have the capability use": "在Kusama网络内，您可以使用各种去中心化应用程序（dApps）",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "在Robonomics平行链和其他平行链之间进行通信。",
  "Attention please": "请注意",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "如果您一直在使用多链服务进行桥接交易，请暂时停止使用，因为它已经在多链的官方推特上宣布。",
  "announced": "宣布",
  "on the official Twitter of The Multichain.": "在 The Multichain 的官方 Twitter 上。",
  "Be aware of scammers": "请注意骗子",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "请仅在知名市场上进行 XRT 的交换。不要将您的令牌发送到私人消息中给您的帐户，无论您要进行的交易（购买或出售令牌）。如果您收到关于 Robonomics 代币的任何“大声声明”（骗子经常使用类似空投公告），请在此网站（https://robonomics.network/）或我们的 ",
  "for official updates. Be careful, be safe.": "上查询官方更新。小心，保险。",
  "XRT in Ethereum": "以太坊中的 XRT.",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "2015年至2018年实施Robonomics项目，项目团队需要找到Robonomics Network提供有用功能与以机器人为服务模型发布物联网设备的费用报酬之间的联系。我们需要思考每个单独智能设备执行服务的责任生命周期。结果是，Robonomics早期研究发展出了一种挖掘新代币的机制，以奖励每个创建的机器人为服务智能合约。该模型对Ethereum上的Robonomics的未来仍然是可行的，但仅在Ethereum有了重大改进的情况下。",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "阅读本文可了解团队在以太坊生态系统中XRT的历史背景和长期计划。",
  "Etherscan profile": "Etherscan配置",
  "View token smart contract and transactions in Ethereum network here.": "在以太坊网络中这里查看令牌智能合约和交易。",
  "Coingecko markets": "Coingecko市场",
  "Here you can find CEX and DEX markets for trading XRT.": "在这里您可以找到用于交易 XRT 的 CEX 和 DEX 市场.",
  "XRT In Polkadot": "POLKADOT中的XRT",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "转移从以太坊到 Polkadot，我们需要在代币经济学上进行“扩大”。在 Polkadot 生态系统中的 Parachains 不等同于智能合约，而是一个完全可编程的区块链，租用整个网络的一部分。",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "实际上，Polkadot 和 Kusama 中空链的支付方式是长期抵押本地中继链令牌（DOT/KSM）的数量足以赢得拍卖。Robonomics 中空链中的 XRT 支持槽位续约和对利益相关者的奖励。支持物联网订阅激活的 XRT 燃烧机制旨在将通膨降到最低，并在兴趣增加时降为零。",
  "Learn more": "请在我们的网络架构师的 Twitter",
  "in Twitter thread from our network architect.": "线程中了解更多信息.",
  "Usage:": "用法",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT 可以用来支付在 Parachain 上执行交易的费用，也可以用来购买 IoT 订阅，以保证设备或用户 IoT 交易的优先处理。",
  "Rewards:": "奖励",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "贯穿整年，该 parachain 发行了少量 XRT 以激励 parachain collators。",
  "The parameter of the total reward": "该年 collators 的总奖励参数由代",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "币持有者的链上投票决定，并可以通过举行全民公决进行更改。",
  "Use XRT": "使用 XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "在我们的去中心化应用程序中购买物联网订阅。通过区块链控制智能设备，而不会有任何集中的公司观察。",
  "Subscan profile": "Subscan配置",
  "View token statistics on top of Polkadot ecosystem.": "在 Polkadot 生态系统之上查看令牌统计信息.",
  "Other questions": "其他问题",
  "What is RWS?": "什么是 RWS？",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[正在开发核心功能] 对于工程师，Core Dev 团队将尝试制定不同的 Robonomics 使用模型，第一步是推出终生订阅令牌 - RWS 令牌。每个 RWS 令牌将为您的物联网设备在 Robonomics Parachain 上提供每秒 1 次（tps）的转账。激活您的 RWS 令牌并使用免费气体进行交易，以先前执行并具有可预测的延迟。停用 RWS 令牌并在 DEX 上交易。",
  "What is AIRA/AIR ID?": "AIRA/AIR ID是什么？",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "自主的Robonomics基础设施的一部分，Pre-XRT代币在2017年分配。在2019年Robonomics成功在以太坊上发布后。",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Robonomics代币的目的是确保在区块链基础设施中维护智能城市和工业4.0的去中心化网络的运行。为了实现这个目标，代币经济需要反映出对网络实施的激励。",
  "In addition": "此外",
  "ambix smart contract": "ambix智能合约",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "与该项目的创建基础设施连接，该合约保证了Pre-XRT与ERC-20 XRT的自主和独立的交换过程。",
  "Within the Ethereum network you can use decentralized application powered by the": "在以太坊网络中，您可以使用由去中心化应用程序提供支持的",
  "Translation was executed by AI so there may be some inaccuracies": "翻译是由人工智能执行的，所以可能存在一些不准确之处",
  "Inform us": "请告知我们",
  "please": "如果您发现任何问题",
  "if you find any": "如果你发现任何",
  "Scientific Papers with Robonomics": "Robonomics科学论文",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "去中心化应用程序（dapp）在区块链内运行。它是开源的，其数据存储在IPFS和Github上。这些技术使应用程序既安全又透明。我们的开发人员正在同时开发Robonomics应用程序和您在构建自己的dapp时可以使用的库。",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "数字孪生是Robonomics Web Services（RWS）提供的工具之一。它充当真实设备的数字版本，并复制其所有技术特性。它使得去中心化应用程序对用户的命令更加响应。",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "您可以将Robonomics与各种Zigbee智能设备配合使用，以自动化和控制家庭/办公室的各个方面，或者将其与基于ROS的机器人技术一起使用，以执行更复杂的工业任务。",
  "Robot and electrics sheep artboard": "机器人和电子绵羊画板",
  "Robot and apple artboard": "机器人和苹果画板",
  "Robot and cosmonaut artboard": "机器人和宇航员画板",
  "Robot and cat artboard": "机器人和猫画板",
  "Space travelers artboard": "太空旅行者画板",
  "Coloured astronaut artboard": "彩色宇航员画板",
  "Black and white astronaut artboard": "黑白宇航员画板",
  "icons for macos": "macOS图标",
  "icons for windows": "Windows图标",
  "Do Androids Dream of Electric Sheep?": "机器人会梦见电子羊吗?",
  "Sleeping Mew Space": "睡眠的Mew空间",
  "Are you ready for Mars?": "你准备好去火星了吗?",
  "Shiva Robot": "Shiva机器人",
  "Space Travelers": "太空旅行者",
  "Retro Astronaut": "复古宇航员",
  "New Newton": "新牛顿",
  "White Paper / May 12, 2018": "白皮书/2018年5月12日",
  "If you want to go deeper into learning Robonomics Network, read this document (.pdf ~ 2 MB).": "如果您想深入了解Robonomics Network的学习，请阅读此文档（.pdf〜2 MB）。",
  "2021, Robot-as-a-Service: From Cloud to Peering Technologies": "2021年，机器人即服务：从云到对等技术",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov，Sergey Lonshakov，Vitaly Bulatov，Babak Kia Montazam，James White",
  "2020, Trustable Environmental Monitoring by means of Sensors Networks on Swarming Autonomous Marine Vessels and Distributed Ledger Technology": "2020年，通过传感器网络和分布式账本技术实现可信环境监测",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman，Enrica Zereik，Aleksandr Kapitonov，Fabio Bonsignorio，Alisher Khasanov，Aziza Oripova，Sergey Lonshakov，Vitaly Bulatov",
  "2019, Digital Passport for Unmanned Vehicles": "2019年，无人驾驶车辆的数字护照",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko，Aleksandr Kapitonov，Ivan Berman",
  "2019, Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "2019年，Robonomics作为基于区块链的无人交通管理平台",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov；Ivan Berman；Vadim Manaenko；Vyacheslav Rzhevskiy；Vitaly Bulatov；Artemii Zenkin",
  "2019, Towards Blockchain-based Multi-Agent Robotic Systems: Analysis, Classification and Applications": "2019年，面向基于区块链的多Agent机器人系统：分析、分类和应用",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev，Alexander Kolotov，Ruslan Rezin，Konstantin Danilov，Manuel Mazzara，Subham Chakraborty，Alexey Kashevnik，Andrey Chechulin，Aleksandr Kapitonov，Vladimir Jotsov，Andon Topalov，Nikola Shakev，Sevil Ahmed",
  "2019, Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "2019年，基于分布式技术的新范式智能城市的机器人服务",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov，Sergey Lonshakov，Ivan Berman，Eduardo Castelló Ferrer，Fabio P Bonsignorio，Vitaly Bulatov，Aleksandr Svistov",
  "2019, Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "2019年，工厂中基于市场机制的分散自治代理网络组织协议",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov，Ivan Berman，Sergey Lonshakov，Aleksandr Krupenkin，Vitaly Bulatov",
  "2018, Towards Blockchain-Based Robonomics: Autonomous Agents Behavior Validation": "2018年，基于区块链的Robonomics：自主Agent行为验证",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov；Ruslan Rezin；Ilya Afanasyev；Alexander Kolotov",
  "2018, Transforming climate finance and green investment with blockchains": "2018年，通过区块链改变气候金融和绿色投资",
  "Alastair Marke": "Alastair Marke",
  "2018, Robonomics: platform for integration of cyber physical systems into human economy": "2018年，Robonomics：将网络物理系统整合到人类经济中的平台",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov，Aleksandr Krupenkin，Aleksandr Kapitonov，Evgeny Radchenko，Alisher Khassanov，Aleksandr Starostin",
  "2018, Blockchain based protocol for economical communication in industry 4.0": "2018年，工业4.0中基于区块链的经济通信协议",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov，Ivan Berman，Sergey Lonshakov，Aleksandr Krupenkin",
  "2018, Robonomics based on blockchain as a principle of creating smart factories": "2018年，基于Robonomics的智能工厂创建原则",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov，Ivan Berman，Vitaly Bulatov，Sergey Lonshakov，Aleksandr Krupenkin",
  "2018, Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "2018年，碳市场、环境资产、权益和责任的区块链生态系统：概念设计和实施",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich，Sergey Lonshakov，Alexey Shadrin",
  "2017, Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "2017年，基于区块链的无人机多Agent系统的自主业务活动协议",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov，Sergey Lonshakov，Aleksandr Krupenkin，Ivan Berman",
  "The latest Robonomics news here.": "这里是最新的Robonomics新闻。",
  "Follow us": "关注我们",
  "Video tutorials, screencasts, interviews, events.": "视频教程、屏幕录像、采访、活动。",
  "Watch videos": "观看视频",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "与我们和社区聊天。随时提问并讨论您的建议。",
  "Join chat": "加入聊天",
  "Medium Blog": "Medium博客",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "我们对Robonomics、以太坊、Polkadot网络、绿色市场、机器人技术以及与Robonomics相关的一切的过去、现在和未来的愿景。",
  "Read": "阅读",
  "Telegram chat": "Telegram聊天",
  "Local communities & news. You are welcome!": "本地社区和新闻。欢迎您！",
  "Updated use cases for connected robots within web3 technologies.": "连接的机器人在web3技术中的最新用例。",
  "17 use cases for connected robots within Polkadot and Ethereum.": "Polkadot和以太坊中连接的机器人的17个用例。",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "在这里，我们解释了一个网络物理系统的概念，它如何帮助扩大制造业，并解决机器人的责任问题。",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "这里的基准是，自由经济原则足以在自动化世界中生活。机器人可以成为我们的朋友，我们不需要集中化来使其舒适可靠。",
  "Additional icons for the wallpaper:": "壁纸的附加图标：",
  "Want emails from robonomics": "想要来自Robonomics的电子邮件",
  "Adding you to our special list...": "将您添加到我们的特殊列表中...",
  "Nice, you are in the list": "很好，您已经在列表中了",
  "Something went  wrong. Try again later": "出了点问题。请稍后再试",
  "Our library": "我们的图书馆",
  "Free E-Books": "免费电子书",
  "Our recommendations": "我们的推荐",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "如果您想更深入、更有灵感和自我教育地参与机器人技术在这个领域取得进步并了解其背后的经济学，我们推荐这些书籍给您。您可以从其他来源下载或购买这些书籍。",
  "Community & Contacts": "社区与联系方式",
  "Get latest updates": "获取最新更新",
  "Your email": "您的电子邮件",
  "Tell us something if you want": "如果您愿意，请告诉我们一些信息",
  "Submit": "提交",
  "Something went  wrong :( Try again later": "出了点问题 :( 请稍后再试",
  "Robonomics nfts": "Robonomics NFT",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "在这里，我们汇集了在我们广泛的加密货币之旅中铸造的NFT的收藏品，无论是独立完成还是与伟大的团队合作。这些独特的代币在区块链上提供可验证的所有权，并为您的区块链账户增添了很棒的装饰品。您可以在拍卖中竞标其中一些，甚至可以铸造您自己独特的作品。",
  "Robonomics Pioneer": "Robonomics 先锋",
  "1. Robonomics Pioneer": "1. Robonomics 先锋",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "在我们最初的 Kusama 众贷活动中，我们决定奖励我们的加密货币先锋贡献者的不仅仅是代币 - 我们还赠送了他们一张丰富多彩的 NFT。这张卡对我们来说意义重大，如果有人拥有它，我们知道他们是 Robonomics 价值观的出色支持者：自由和去中心化。",
  "Robonomics crypto girls": "Robonomics 加密女孩",
  "2. Robonomics crypto girls": "2. Robonomics 加密女孩",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "我们很高兴向您介绍我们的特别系列数字资产 - Robonomics 加密女孩，由 Robonomics 艺术与科学团队创建。该系列中的每个 NFT 都是 Robonomics 使用的技术或建立在 Robonomics 用例之的独特图形表示。我们才华横溢的艺术家以 Robonomics 的标志性风格手绘了每个女孩。您可以选择与您共鸣的女孩或收集整个系列！通过购买这些 NFT，您不仅为您的收藏品增添了时尚的装饰品，还支持我们继续创新和实施机器人的去中心化连接。敬请期待系列的新作品！",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. 季节性 NFT 收藏",
  "On demand minting": "按需铸造",
  "SEASONAL SPOT NFT COLLECTIONS": "季节性 NFT 收藏",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "这些季节性 NFT 收藏代表了用户与 Robonomics 平行链中的 Spot 之间独特互动的数字资产。用户可以在浏览器上绘制任何东西，机器人将复制他们的动作以创建手绘图像。互动完成后，NFT 将在 Singular 市场上铸造到用户的 Polkadot 账户中。现在，任何人都可以与位于加利福尼亚实验室的真实机器人互动，创建个性化和独特的数字资产，就像任何其他数字资产一样拥有、购买和出售。",
  "Create your NFT": "创建您的 NFT",
  "4. automated telescope collection": "4. 自动望远镜收藏",
  "automated telescope collection": "自动望远镜收藏",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "位于智利的阿塔卡马沙漠，可以通过一个去中心化应用程序访问实时捕捉深空天体图像的物理望远镜。每个有互联网连接的用户都可以使用 $STRGZN 代币在应用程序中使用信用卡购买它。选择一个天体对象，发送命令给望远镜拍照，然后等待在 Singular 平台上铸造的 NFT。请注意，由于望远镜的运行时间，该应用程序仅在 GMT-3 时区的晚上 11 点至早上 6 点之间可用。",
  "Try yourself": "亲自尝试",
  "5. Robonomics Polka pet": "5. Robonomics Polka 宠物",
  "In collaboration with Polkapets": "与 Polkapets 合作",
  "and": "和",
  "Robonomics Polka pet": "Robonomics Polka 宠物",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "作为 Polkadot 生态系统的自豪成员，Robonomics 参与了 Polka Pets World。与 Polka Pets 团队一起，我们铸造了 1200 个 NFT，展示了一个独特的设计概念，展示了我们的核心连接理念。为了将这个理念变为现实，我们创造了一个人物形象：一个专门帮助人类与任何机器人实体连接的机器人。",
  "6. Mecha Arm Jetpack": "6. 机械臂喷气背包",
  "Mecha Arm Jetpack": "机械臂喷气背包",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "2021 年，Robonomics 开始承诺支持将 RMRK 的调色板集成到其运行时中，从而实现与世界上最先进的 NFT 逻辑的本地集成。为了庆祝这一重要里程碑，我们推出了一个特殊的 Kanaria 兼容物品 - 一个可以装备到 Kanaria 鸟身上的子 NFT，并可能在 RMRK 的元宇宙中提供优势。",
  "RMRK Partnerships": "RMRK 合作",
  "Robonomics wallpapers": "Robonomics 壁纸",
  "Regular wallpapers": "常规壁纸",
  "Wallpapers for phones": "手机壁纸",
  "Hidden wallpapers": "隐藏壁纸",
  "Robonomics art shop": "ROBONOMICS艺术商店",
  "Welcome to our brand new online shop on": "欢迎来到我们全新的在 robonomics.threadless.com 上的在线商店！",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "我们的商店提供了装饰服饰、配件、家居用品等，展现了我们对机器人、科技和艺术的热爱。你可以在我们的店里找到各种T恤、长袖衫、帽衫、浴帘、枕头、毯子和其他有用的产品，它们都是由Robonomics的艺术家以独特的设计制作的，并由Threadless的团队处理生产和运输。请享用！",
  "Shop now on threadless": "在THREADLESS购买",
  "alternative shop": "另一个商店",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "这一年开始了一项重大的成就 - Robonomics 赢得了第 20 次 parachain 拍卖的槽位, 并",
  "officially became": "正式成为了",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "Kusama 网络中 ID 为 2048 的 parachain。发射、datalog、DigitalTwin、责任功能和 IoT 订阅已经对生态系统的所有用户开放。为了详细说明这个阶段的项目，核心团队已经发布了 ",
  "Robonomics Whitepaper 2.0.": "Robonomics 白皮书 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 在 Substrate 上发布，支持 XCM 消息，并且我们开始与其他 parachains（如 Crust、Shadow 和 Darwinia）建立 HRMP 通道，它们的功能对我们非常有用。",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "同时，我们已经找到了向 IoT 市场介绍我们协议的策略。我们对 IoT 设备的实验引导我们探索了主权智能家居的概念，它独立于中央云服务提供商。我们已经开发了与 Home Assistant",
  "integration": "自动化系统的集成",
  "with the Home Assistant automation system, and also designed our own": "并为连接智能设备设计了自己的",
  "IoT gateway": "IoT 网关",
  "for connecting smart devices.": "用于连接智能设备。",
  "We have launched two big initiatives in order to increase community engagement —": "为了提高社区参与度，我们启动了两个大型举措：",
  "Robonomics Academy": "Robonomics 学院",
  "Robonomics Ambassador Program": "Robonomics 大使计划",
  "Additionally,": "此外,",
  "Robonomics Town Hall": "Robonomics 城市大厅",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "在秋季举行，以便 Robonomics 社区首次体验我们的治理机制。最近，Robonomics 团队帮助 DAO IPCI 项目获得了应用于智能建筑的碳抵消服务的平行链槽位。",
  "In 2021, our": "2021年，我们",
  "main focus": "的主要重点",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "转向了准备项目，以便通过我们在 Kusama 网络上的平行链使用 IoT 应用。Robonomics 1.0 在 Substrate 上已经发布，我们一直在测试将传感器连接到平行链以发送其遥测数据，并开发数字双胞胎功能。在年中，我们决定测试我们网络的完整周期，并创建了我们自己的中继链，称为",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "并将 Robonomics 平行链集成到其中（在迁移到 Kusama 中继链之前）。我们组织了几次众筹活动，以获得 Kusama 的平行链槽位。",
  "There have been two big changes for the community. First, we launched the": "对社区来说有两个重大变化。首先，我们推出了",
  "Robonomics Grant Program": "Robonomics 奖助金计划",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "允许 web3、机器人和 IoT 项目获得研发任务的资金。到年底，有四个活跃项目参加了该计划。其次，团队开始了",
  "Exodus process": "Exodus 过程",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "允许以太坊代币持有者将其 XRT 代币移动到平行链.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "在合作中，我们可以回忆起波士顿动力学公司的 Spot 在 MerkleBot 的引人注目表现, 为此开发",
  "rental remote control system": "了租赁远程控制系统",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "我们还想告诉您，Multi-Agent Systems 公司是一个由 Robonomics 工程师组成的个人项目。他们开发了一种名为 Eisenkoch 的机器人烤饼机，为咖啡店老板进行烹饪任务.",
  "There came a time when the existing limitations of Ethereum": "Ethereum 的现有局限性",
  "began to stand out clearly": "开始明显地体现出来",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "（特别是可扩展性差、速度低、交易成本高）的时候到了。ETH2.0 的升级本来是为了解决这个问题，但这次升级一再被推迟。尽管我们不想离开以太坊网络，但我们意识到在目前的情况下很难实现我们的用例，因此我们开始寻找替代网络。分片区块链生态系统 Polkadot 成为了这个替代方案。我们首先使用 Substrate 框架进行实验，以迁移主要的 Robonomics 功能并部署自己的测试网络。在这个阶段结束时，我们已经在 Rococo 测试网络上部署了我们的平行链，并开始准备在 Kusama 网络上获得槽位",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "继续研究 IoT 系统，我们已经确定了 Robonomics 可以为用户增加价值的主要功能 —— IoT 的去中心化云功能。这个想法形成了",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "的基础. RWS 基础架构承担了典型中心云的所有功能，但没有全球可用性、安全性和隐私性的标准问题。此外，我们提出了平行链 IoT 订阅的想法，允许订阅者在不为每笔交易付费的情况下使用区块链网络。第一次 IoT 订阅的实验是 RWS 代币的发行，其所有者可以在每个区块中发送 1 笔交易。此外，我们开始采取第一步措施，为智能设备的控制开发自己的硬件套件（DAOS 概念).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "当然，对 Robonomics 在以太坊的支持并未停止。Robonomics 通信堆栈已经完成到",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "版本。XRT 代币已经在几个交易所（特别是 Uniswap DEX）上开始交易，并启动了流动性激励计划。",
  "The team actively developed ways to interact with the community. The first version of our": "团队积极开发与社区互动的方式。我们的第一个 ",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "网站和 Robonomics Wiki 已经推出。为了更透明和方便的项目管理，我们开始使用",
  "Aragon DAO": "Aragon DAO",
  "We hosted": " 我们在 2019 年举办了",
  "Robonomics Winter School": "Robonomics 冬季学校",
  "in 2019 for newcomers to the project.": "2019年针对项目新手。",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "与意向项目的合作也在继续。 Robonomics 和 DAO IPCI 推出了一项用于收集和分析感官数据的服务 — ",
  "Robonomics became the foundation for the": "Robonomics 成为了",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "项目的基础，该项目正在开发一个智能租赁机器人设备的系统。",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "我们理解自主代理需要一个能够保证其可靠技术和经济操作的环境。多年来，我们一直在开发一种协议，用于创建一个去中心化的服务提供商网络，帮助机器人代理提供其服务。开发了维护网络和以太坊与 ROS 之间通信堆栈的工具。在 2018 年，我们发布了",
  "Robonomics Whitepaper": "Robonomics 白皮书",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "和 Robonomics 网络的 alpha 版，并在以太坊主网上启动了它。为 XRT 代币生成事件（最终在 2019 年春天发生，原因是第一次加密冬天）进行了积极的准备工作。",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "从这个时期开始，Robonomics开始动态发展与工业4.0相关的用例，包括智能工厂、智慧城市和智慧家庭，这引起了我们对物联网世界的密切关注。为了寻求创新，团队提出了几个大型和独特的研发演示： 一个民用",
  "sensor network": "传感器网络",
  "a water drone": "一个环境监测水无人机",
  "for environmental monitoring (supported by a sensor systems manufacturer": "由传感器系统制造商",
  "a smart factory model": "一个 智能工厂模型",
  "a self-employed": "一个自营",
  "robot artist Gaka-chu": "机器人艺术家Gaka-chu",
  "and a": "和 一个",
  "drone traffic management system": "无人机交通管理系统",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics开始与DAO IPCI项目合作，使用Web3技术和物联网设备管理环境资产.",
  "Important news &amp; announcements": "重要新闻和公告",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "这是一个积极研发的时期，我们确定了许多任务，其中P2P技术具有之前机器人不具备的能力。结合以太坊计算机、IPFS文件存储和机器人操作系统（ROS），我们意识到任何设备都有可能成为",
  "autonomous intelligent robot agent": "自主智能机器人代理",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "进而，这为我们开辟了机器人即服务和机器人经济的概念。",
  "Our publications in scientific journals of this period are available in the": "我们在这个时期在科学期刊上发表的文章可在",
  "Papers section": "Papers 部分中找到.",
  "We have collected all R&D projects over the years in the": "我们把所有研发项目收集在",
  "a handy book": "一本方便的书中",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "一切始于创始人在以太坊发布其主网络时的一个想法。如果机器人为客户以加密货币执行任务，其逻辑由智能合约控制，会是什么情况",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "为了测试这个想法，我们做了一个演示，在用户完成付款交易后，启动了一架由以太坊计算机控制的无人机，使其达到指定的GPS坐标",
  "The demo is available on": "该演示可在",
  "YouTube": "微博上 观看",
  "Infrastructure && tech development timeline": "基础设施和技术发展时间线",
  "Notable events": "П重要事件",
  "World Economic Forum Annual Meeting 2022": "2022年世界经济论坛年会",
  "Polkadot Decoded 2022": "2022年 Polkadot 解密",
  "On the Way to Sovereign Home Automation": "通往主权家庭自动化的道路",
  "Becoming a Parachain for IoT Applications": "成为 IoT 应用的平行链",
  "Polkadot Decoded 2021": "Polkadot 解密 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021（由 Robonomics 赞助）",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics 冬季学校 2021（由 Robonomics 主办）",
  "Transition to Multinetwork — Along Came Polkadot": "过渡到多网络 —— Polkadot 登场",
  "The Rise of Robonomics Network": "Robonomics 网络的崛起",
  "Crypto Valley Conference 2018": "加密谷会议2018",
  "European Parliament workshop 'The Economy of Robots'": "欧洲议会研讨会“机器人经济",
  "Consensus 2018": "共识2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MIT媒体实验室区块链机器人系统研讨会",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics-2018夏季学校由Robonomics团队主办",
  "Bringing Together Web3 Techs and Robotic Frameworks": "将Web3技术和机器人框架结合在一起",
  "Playing with Human-Machine Interaction through Ethereum": "通过以太坊玩人机交互",
  "Robonomics whitepaper 2022 welcome guide": "Robonomics 白皮书 2022 ：欢迎指南",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "我们已经开发出了一种运行在以太坊和IPFS上的机器技术经济协议，并通过基于Polkadot parachain的云物联网平台元素加强了它。因此，我们现在拥有了一个可以开发未来物联网应用的混合平台。它能够与由全球去中心化计算机网络管理的设备互动。在我们开始使用Robonomics平台创建安全、无服务器和充满未来感的物联网应用之前，让我们更深入地了解理论....",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomics白皮书的前两章已经向用户开放。",
  "Chapter 1.": "第一章.",
  "At the intersection of cybernetics and economics": "在控制论和经济学的交汇处",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "我们提出了一个让机器人设备充当独立代理人的经济体系，它们能够执行以往只由人类执行的关键经济活动。在本章中，我们将探讨机器人经济的重要性，它有望成为人们生活的重要组成部分，并将当前的经济水平提升到未来的全自动化服务。",
  "In this chapter you will learn": "在本章中您将学到",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase 和企业的本质",
  "CPS - cyber-physical system": "CPS - 网络物理系统",
  "Norbert Wiener and the search for patterns in living and machine": "诺伯特·维纳和对生物和机器系统模式的探索",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "第四次工业革命，为机器人和比特币提供资金",
  "Ethereum Smart Contracts": "以太坊智能合约",
  "Polkadot Parachains": "Polkadot 平行链",
  "Polkadot VS Ethereum 2.0": "Polkadot 与 Ethereum 2.0 的比较",
  "Open questions of teleology and Mises' work": "末德论和 Mises 的作品的开放性问题",
  "Read chapter 1": "阅读第 1 章",
  "Chapter 2.": "第 2 章",
  "Robonomics architecture": "Robonomics 架构",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "在第二章，您将阅读关于使用现代互联网技术的人机交互 - 从物联网设备到分散且全球可访问的提供商网络。我们将深入了解物联网的基础知识，以突出创建物联网系统的人面临的问题和主要挑战，并介绍Robonomics的解决方案。",
  "Overview of the state of the Internet of Things (IoT)": "物联网 (IoT) 现状概述",
  "Classification of IoT devices": "物联网设备的分类",
  "Embedded IoT systems": "嵌入式物联网系统",
  "Edge-systems: IoT gateways and controllers": "边缘系统：物联网网关和控制器",
  "Autonomous Systems": "自治系统",
  "Internet of Things providers": "物联网服务提供商",
  "Digital twins are the heart of the Internet of Things": "数字双胞胎是物联网的核心",
  "IoT data flows in cloud service": "物联网数据在云服务中的流动",
  "Popular examples of IoT solutions": "一些流行的物联网解决方案示例",
  "Current problems of building IoT solutions": "当前构建物联网解决方案的问题",
  "Main tasks of Robonomics architecture": "Robonomics 架构的主要任务",
  "Basic components of Robonomics architecture": "Robonomics 架构的基本组件",
  "A simple representation of Robonomics architecture": " Robonomics 架构的简单表示",
  "Read chapter 2": "阅读第 2 章",
  "We continue to update the white paper of Robonomics": "我们继续更新 Robonomics 白皮书",
  "stay tuned for new parts on our website and in Discord": "请关注我们网站和Discord频道上的新产品",
  "Join our discord": "加入我们的Discord社区",
  "Robonomics logos and usage": "Robonomics 的徽标和使用方法",
  "We have put together Robonomics logos and guidelines to show how you may use it": "我们已经整理了 Robonomics 的徽标、颜色、资产和指导方针，以展示您如何使用它。",
  "Download Robonomics logo": "下载Robonomics徽标",
  "Download RWS logo": "下载RWS徽标",
  "Download wiki logo": "下载维基徽标",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "使用这些允许的徽标链接到 Robonomics、RWS 或 Robonomics维基",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "使用允许的Robonomics徽标告诉他人您已经与 Robonomics 集成",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "在有关 Robonomics 技术和集成项目的博客文章、文章和幻灯片中使用允许的徽标",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "不要修改允许的 Robonomics 徽标，包括更改颜色、尺寸或与其他文字或设计元素结合",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "请不要在未经 Robonomics DAO 批准的情况下，以任何方式使用 Robonomics 的 logo 和名称，以表示您与 Robonomics 有关联、认可或支持，或者您的产品或项目是由 Robonomics 推出的",
  "Robonomics Color pallet": "Robonomics 颜色方案",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "我们在界面、印刷品和其他视觉元素中使用的颜色， </br> 可以用于您的幻灯片、帖子的横幅等，以宣传和告知关于 Robonomics 的信息。",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "在robonomics平行链上构建物联网去中心化应用 (dapp) 和web服务",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov，软件架构师",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "我们不要忘记，自动机器在经济上完全等同于被奴役的劳动力。任何 与被奴役劳动力竞争的劳动力都必须接受被奴役劳动力的经济后果。",
  "Norbert Wiener": "诺伯特·维纳",
  "cybernetics": "控制论",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "如今，机器人就像已经长大的孩子——它们已经可以管理金钱，进入法务部门，并能独立运作。",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": " 人类自身的未来取决于我们如何教机器人处理它们的能力。",
  "Robonomics tools": "Robonomics包含内容",
  "Operate with digital twins of IoT devices": "使用物联网设备的数字孪生进行操作",
  "The first tools of the robot economy: money for robots, contracts for robots": "机器人经济学的第一个工具：机器人的资金，机器人的合同",
  "Software for connecting devices to a decentralized cloud": "用于将设备连接到去中心化云端的软件",
  "API library for custom IoT applications": "定制物联网应用程序的API库",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics包含用于在机器人和用户界面端开发物联网应用程序的一整套工具。用户和设备之间的通信使用Web3世界中最成功的技术——IPFS、以太坊和Polkadot。因此，开发人员可以为智慧城市和工业4.0打造现代化的安全应用程序。",
  "Robonomics Connectivity": "Robonomics连通性",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "为了方便开发人员，Robonomics包含一整套互连性工具：使用HTTP/MQTT协议的物联网设备，使用机器人操作系统 (ROS) 的复杂机器人系统。",
  "Connect a sensor": "连接传感器",
  "to the Robonomics network": "与Robonomics网络建立连接。",
  "Try": "试用",
  "a simple prototyping tool": "简单的原型制作工具",
  "Start building your own cyber physical system with": "开始使用构建您自己的网络物理系统",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics支持上百种机器人开箱即用",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "平台用户可以将兼容ROS的机器人在数分钟内连接至数字经济。如需了解适用的机器人完整列表，请访问链接",
  "Decentralized Cloud infrastructure for IoT": "适用于物联网的去中心化云基础架构",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web服务 (RWS) 是基于Robonomics平行链和IPFS的机器人和物联网基础架构服务。",
  "Robonomics web services (RWS)": "Robonomics网络服务",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "机器人经济",
  "Core RWS features available for IoT today": "适用于当今物联网的核心RWS功能",
  "RWS PubSub Message Broker": "RWS PubSub消息代理",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "在基于IPFS协议的p2p网络上使用无限制的消息传递",
  "RWS Data Blockchainization Service": "RWS：数据区块链化服务。",
  "RWS Robot Actions": "RWS：机器动作",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "开关开启/关闭；在去中心化的电脑控制下启动或停止您的物联网设备",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "您物联网应用程序的核心 - 区块链上的数字孪生",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "在技术架构中，物联网数字孪生提供了物和相关活动的可见性和监控（例如：使用物联网设备自动捕获产品的源产地），而区块链支持共享单一版本的真相，以了解它们的生命周期和相关的业务活动",
  "from Gartner research": "来自Gartner（高德纳）研究报告",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics平行链提供了机会，可以创建数字孪生模型并每6秒更新一次状态。",
  "App Store for Robotics - Robonomics Marketplace": "机器人的应用商店 - Robonomics Marketplace",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "设计和制造物联网连接产品和设备的公司应采用灵活的数字孪生交付模式来降低采用障碍（例如通过市场提供）数字孪生，而不是仅通过他们自己的专有交付模型提供数字孪生",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry": "开发数字孪生模型可以直接与您的公司为物联网行业提供的附加服务相关联",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service": "为了使数百名客户的交付过程更加方便和简单，我们为机器人市场添加了一部分服务。查看已实施的数字孪生模型和公司自动化服务捆绑包的第一个示例",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "您有为机器人或用户提供服务的想法吗？然后继续执行在Robonomics平台上构建物联网应用程序的分步说明。",
  "This page is out of your space": "未找到此页面",
  "No posts yet": "还没有帖子",
  "If you want to help us with translation": "如果您想帮助我们进行翻译"
}