{
  "Timeline": "Tijdlijn",
  "Github": "Github",
  "or": "of",
  "Privacy Policy": "Privacybeleid",
  "You are currently opted out. Click here to opt in.": "Je hebt momenteel gekozen om geen gegevens te delen. Klik hier om je keuze te wijzigen.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out voltooid; je bezoeken aan deze website worden niet geregistreerd door de Web Analytics-tool. Houd er rekening mee dat als je je cookies wist, de opt-out-cookie verwijdert, of als je van computer of webbrowser verandert, je de opt-out-procedure opnieuw moet uitvoeren.",
  "Please click below to opt in:": "Klik hieronder om je keuze te wijzigen:",
  "You are currently opted in. Click here to opt out.": "Je hebt momenteel gekozen om gegevens te delen. Klik hier om je keuze te wijzigen.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Je kunt ervoor kiezen om geen uniek webanalyse-cookie-identificatienummer aan je computer toe te wijzen om de aggregatie en analyse van gegevens die op deze website zijn verzameld te vermijden.",
  "To make that choice, please click below to receive an opt-out cookie": "Om die keuze te maken, klik hieronder om een opt-out-cookie te ontvangen",
  "User (D)App": "Gebruiker (D)App",
  "Function request": "Functieverzoek",
  "Report": "Rapport",
  "Digital twin": "Digitale tweeling",
  "Control": "Besturing",
  "Log": "Log",
  "IoT Device": "IoT-apparaat",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Decentrale applicatie (dapp) werkt binnen Blockchain. Het is open source en de gegevens worden geserveerd op IPFS en Github. Deze technologieën zorgen ervoor dat de applicatie veilig en transparant is. Onze ontwikkelaars werken zowel aan de ontwikkeling van de Robonomics-applicatie als aan de bibliotheken die je kunt gebruiken bij het bouwen van je eigen dapp.",
  "Decentralized application": "Decentrale applicatie",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digitale Tweeling is een van de instrumenten die worden aangeboden door Robonomics Web Services (RWS). Het fungeert als een digitale versie van de echte apparatuur en kopieert al zijn technische kenmerken. Het maakt het mogelijk om een gedecentraliseerde app responsiever te maken op de opdrachten van de gebruiker.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Je kunt Robonomics gebruiken met een breed scala aan Zigbee slimme apparaten om verschillende aspecten van je huis/kantoor te automatiseren en te controleren, of je kunt het gebruiken met op ROS gebaseerde robotica voor complexere industriële taken.",
  "IoT / Smart device": "IoT / Slim apparaat",
  "Notable events": "Belangrijke gebeurtenissen",
  "Important news &amp; announcements": "Belangrijk nieuws en aankondigingen",
  "All posts": "Alle berichten",
  "Your email": "Je e-mail",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Deze zaak is momenteel in beweging; mis geen nieuws - abonneer je op updates in het onderstaande vak",
  "R&D cases": "R&D-zaken",
  "This page is out of your space": "Deze pagina is niet beschikbaar",
  "Check url once more or create an": "Controleer de URL nogmaals of maak een",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "melding dat je een 404-fout hebt (vergeet niet de huidige URL te vermelden)",
  "What is Robonomics network?": "Wat is het Robonomics-netwerk?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics is een open-source platform voor IoT-toepassingen waarmee de uitwisseling van technische en economische informatie mogelijk wordt gemaakt in de vorm van atomaire transacties tussen gebruikerstoepassingen, IoT-services en complexe robotica.",
  "Serverless IoT applications for users": "Serverloze IoT-toepassingen voor gebruikers",
  "Robonomics Ambassador Program": "Robonomics Ambassador Programma",
  "Robonomics architecture": "Robonomics-architectuur",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Het belangrijkste idee dat de auteurs van Robonomics probeerden over te brengen, is de natuurlijke, logische en ogenschijnlijk onvermijdelijke evolutie van het huidige niveau van de economie naar volledig geautomatiseerde diensten. Geautomatiseerde diensten moeten zowel de mogelijkheid hebben om de taal van de menselijke economie te spreken als de eigen economie van de machines om verschillende operaties in de wereld om hen heen uit te voeren met een snelheid die voor mensen niet beschikbaar is.",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Nu willen we u graag de praktische gebieden van mens-machine-interactie laten zien met behulp van moderne internettechnologie. We zullen ons verplaatsen van de vertrouwde IoT-apparaatarchitectuur van technische informatie-uitwisseling via cloudservices naar de organisatie van technisch-economische interactie via een gedecentraliseerd, wereldwijd toegankelijk netwerk van providers.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Om te beginnen moeten we een excursie maken naar het gebied dat het meest direct verband houdt met de netwerkverbinding van geautomatiseerde systemen. Daarna zullen we de basisprincipes van het Internet of Things bekijken om de problemen en belangrijkste uitdagingen te benadrukken waarmee de makers van IoT-systemen worden geconfronteerd en waaraan Robonomics is gericht.",
  "Overview of the state of the internet of things (IoT)": "Overzicht van de stand van zaken van het internet der dingen (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Het probleem van de netwerktoegankelijkheid van automatische apparaten wordt al sinds de jaren 60 over de hele planeet besproken, en al in die tijd werden er behoorlijk serieuze pogingen ondernomen om het op te lossen. Zo stelde de Sovjet-cyberneticus Viktor Glushkov voor en gedeeltelijk geïmplementeerd de geautomatiseerde verzameling van informatie over de productievolumes van een individuele fabriek als onderdeel van het ontwerp van het",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "nationale informatiesysteem in de jaren 60 en 70. Het is algemeen bekend hoe de Coca-Cola-automaten in de jaren 80 werden aangesloten op het ARPANET, zodat de machines de beschikbaarheid van dranken en hun temperatuur konden melden.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Maar toch vindt de daadwerkelijke ontwikkeling van IoT vandaag plaats, vanwege het wijdverbreide gebruik van faciliterende technologieën. De belangrijkste drijfveren van de snelle evolutie van toepassingen voor het Internet of Things zijn het resultaat van de ontwikkeling van vele gebieden - van draadloze communicatie van verschillende bereiken en ingebedde apparaten tot cloud-analyse en machine learning. Het aantal IoT-apparaten is de afgelopen 10 jaar gestaag gegroeid (met een voorspelling van 25 miljard eenheden tegen 2030), en dit heeft onderzoekers en ontwikkelaars aangespoord om nieuwe IoT-toepassingen te creëren op verschillende gebieden zoals gezondheidszorg, huisautomatisering, agribusiness en milieubescherming.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "We zijn meer geïnteresseerd in het proces van het bouwen van IoT-systemen en de taken die hierbij ontstaan. In de loop van jaren van onderzoek zijn er veel verschillende architecturen voorgesteld, en door ze te middelen, kunnen we drie basiscomponenten van een IoT-systeem onderscheiden: apparaten, netwerkinfrastructuur, analytische, reken- en besturingsmachines.",
  "New challenges": "Nieuwe uitdagingen",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "De ontwikkeling en toepassing van het Internet of Things heeft aangetoond dat het oplossen van typische problemen niet voldoende is. Volledig nieuwe concepten en principes, gebaseerd op eerdere fouten en geïdentificeerde tekortkomingen, zijn tegenwoordig ontstaan. Deze handige benadering van het gebruik van cloudservices bleek echter een aantal kritieke tekortkomingen te hebben op het gebied van schaalbaarheid, privacy en beveiliging. In een poging om deze problemen op te lossen, werd voorgesteld om gegevensverwerking, logica en berekening dichter bij de directe plaats te brengen waar ze worden gebruikt. Zo ontstonden de concepten van mist en edge computing, waarbij tussenliggende systemen tussen de cloud en apparaten enkele functies van de cloud overnemen. Daarom is het creëren van edge-systemen een van de nieuwe uitdagingen bij het bouwen van het Internet of Things.",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Een andere recente uitdaging bij het bouwen van IoT is het concept van de digitale tweeling - een digitale versie van echt apparatuur die de specificaties en historische gegevens kopieert. Dit concept komt het beste tot zijn recht op gebieden waar het noodzakelijk is om een nauwkeurige en volledige specificatie van een proces te hebben en de ontwikkeling ervan te kunnen voorspellen. Het Internet of Things fungeert als de belangrijkste integrator van digitale tweelingen, maar deze taak is veel diepgaander dan alleen de gebruikelijke connectiviteit van IoT-apparaten.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Op dit moment zijn we getuige van een heel segment van het netwerk dat is ontworpen en handig is, niet voor mensen, maar voor machines. Het Internet of Things is niet langer alleen de mechanica van het verbinden van een apparaat met het netwerk, maar meer diensten die specifiek voor apparaten zijn gemaakt en beschikbaar zijn. Het Internet of Things verbindt niet alleen de gebruiker en het apparaat, maar helpt ook de apparaten om de taken van het leveren van een service voor de persoon autonoom uit te voeren.",
  "Classification of IoT devices": "Classificatie van IoT-apparaten",
  "Embedded iot systems": "Ingebedde IoT-systemen",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Dergelijke systemen hebben geen gebruikersinterfaces en worden meestal gebruikt op het laagste niveau van de IoT-ecosystemen om basisfunctionaliteit te bieden. Ze moeten energiezuinig en klein zijn. Ze hebben beperkte reken- en communicatieressources. IoT-gateways of controllers fungeren meestal als signaalontvangers.",
  "Edge-systems: IoT gateways and controllers": "Edge-systemen: IoT-gateways en controllers",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Deze systemen fungeren als een schakel tussen lokaal toegankelijke ingebedde systemen en het wereldwijde internet. Ze ondersteunen meestal meerdere communicatieprotocollen van ingebedde systemen en verzenden telemetrie van apparaten naar de cloud en besturingsignalen terug. Vaak zijn deze apparaten een geavanceerdere versie van de WiFi-router, uitgerust met een single board computer om primaire verwerking van informatie van apparaten uit te voeren zonder het lokale netwerk te verlaten.",
  "Autonomous systems": "Autonome systemen",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Deze klasse omvat complexe automaten (zoals Spot van Boston Dynamics), die een besturingscomponent hebben op het niveau van een volledige computer met een krachtige processor en een grote hoeveelheid geheugen. In dergelijke gevallen is de robot verbonden met het internet zonder extra tussenoplossingen (edge-systemen). De benodigde software voor toegang tot het Internet of Things is rechtstreeks geïnstalleerd op de computer van het zelfstandige systeem. Gegevens worden lokaal verzameld en gedeeltelijk verwerkt, waarna ze worden uitgezonden naar het internet, vergelijkbaar met elk volwaardig netwerkapparaat.",
  "Internet of Things providers": "Internet of Things-providers",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "De belangrijkste taak van IoT-providers is het bieden van gebruikers op afstand toegang tot gegevens en analyses, evenals het beheer van slimme apparaten via internet. De belangrijkste criteria voor de kwaliteit van de provider zijn de beveiliging van de operaties, de stabiliteit van de verbinding en de beschikbaarheid van de provider vanaf elke locatie ter wereld.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Het standaardschema voor het werken met een IoT-provider omvat: het installeren van software die compatibel is met het cloud slimme apparaat, het instellen van cloud-side beheerdiensten na de eerste succesvolle verbinding van een apparaat, het aansluiten van verschillende soorten analytische diensten.",
  "Digital twins are the heart of the internet of things": "Digitale tweelingen zijn het hart van het internet der dingen",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Als we het hebben over digitale tweelingen, moet worden opgemerkt dat hun implementatie architectonisch vereist is; als een weigering om de gebruiker directe toegang te geven tot het bedienen van apparaten en het wijzigen van hun status. Uit de meest voor de hand liggende redenen voor afwijzing zijn, ten eerste, de aanwezigheid van hun eigen vereisten en voorwaarden in de apparaten vlak voor de lancering. Ten tweede, als meerdere gebruikersapparaten toegang moeten hebben tot een enkele gegevensbron, kan gepersonaliseerde controle voor elke gebruiker kritiek zijn. Ten slotte is het uiterst nuttig om de laatste werkelijke status van het apparaat beschikbaar te houden voor het geval het buiten werking raakt.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Als gevolg hiervan hebben we een scheiding van de lus van informatie-uitwisseling met de gebruiker en de daadwerkelijke generatie van feitelijke gegevens door de sensoren. Om dit principe te illustreren, volgt hier het proces van de gebruiker die werkt met een IoT-apparaat met behulp van een digitale tweeling.",
  "IoT data flows in cloud services": "IoT-gegevens stromen in cloudservices",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Ingangswaarden voor cloudtriggers. Bijvoorbeeld, de cloudservice stuurt verschillende meldingen naar de gebruiker in geval van een melding van een autosensor voor een staking.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Uitvoergegevens voor complexe analyses die niet op het randniveau kunnen worden geproduceerd. Bijvoorbeeld, bij het verwerken van video voor gezichtsherkenning in een menigte.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "De basis voor het vormen van een digitale tweeling van het apparaat om een afgietsel van de staat te creëren. Bijvoorbeeld, op verzoek van de gebruiker in de mobiele app of op de website.",
  "Popular examples of IoT solutions": "Populaire voorbeelden van IoT-oplossingen",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Een typisch slim huissysteem biedt een breed scala aan opties voor het regelen van uw leefruimte. Met behulp hiervan kunt u op afstand de deursloten bedienen, eenmalige of regelmatige toegang tot de kamer instellen voor familie en vrienden, en voor onderhouds- of bezorgpersoneel. Met talrijke sensoren en opnameapparaten kan het systeem video-opnames maken wanneer bewegingssensoren worden geactiveerd, autonoom beslissingen nemen om de watervoorziening af te sluiten wanneer er een lek wordt gedetecteerd in het watersysteem, een geplande robotstofzuiger starten en een schoonmaakrapport verstrekken aan de gebruikersapp, de kamertemperatuur aanpassen aan de optimale waarde afhankelijk van uw schema.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Slimme auto's. Door de boord-elektronica van de auto toegang te geven tot mobiel internet, krijgt de gebruiker toegang tot de externe bediening van verschillende autofuncties rechtstreeks vanaf zijn smartphone: deuren openen, airconditioning inschakelen, koplampen bedienen. Als dergelijke auto's worden gebruikt voor autodelen, kunt u een interactieve kaart maken van de locatie van auto's met hun status, de resterende brandstof, enz. voor de klanten van deze service.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Intelligent lease-systeem voor apparatuur. Het bedrijf installeert robotmanipulatoren op de transportband onder een contract met betaling voor het aantal bewerkingen of voor de tijd van de robot. Manipulatoren verstrekken regelmatig een logboek van uitgevoerde bewerkingen, fouten en waarschuwingen. De leasekosten van de robot worden berekend op basis hiervan, evenals het voorspellend onderhoud van de robots door de leverancier.",
  "Current problems of building IoT solutions": "Huidige problemen bij het bouwen van IoT-oplossingen",
  "Global availability": "Algemene beschikbaarheid",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "De standaard client-serverarchitectuur vereist het specificeren van eindpunten bij het routeren van berichten van IoT-apparaten. Dus gedurende het leven van een slim apparaat betekent het ontbreken van verbinding een beperking in de mogelijkheid om het apparaat te bedienen en ermee te communiceren.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Bijvoorbeeld, de handelsoorlog tussen China en de Verenigde Staten is al een zwaard van Damocles dat boven duizenden consumenten van Chinese slimme apparaten in de Verenigde Staten en vice versa hangt. Op elk moment kan het blokkeren van Xiaomi-servers door de Amerikaanse autoriteiten van invloed zijn op gebruikers van apparaten die verbinding maken met de cloudservices van de fabrikant.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Als u zich in de onmiddellijke nabijheid van een IoT-apparaat bevindt, kunt u het niet bedienen vanuit een mobiele app als er geen verbinding is met de servers, via welke de gebruikersauthenticatie en telemetriegegevens van de apparaten zelf worden verzorgd. Dat wil zeggen, het apparaat wordt feitelijk gecontroleerd door de cloud, niet door de gebruiker.",
  "Cybersecurity": "Cyberbeveiliging",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "De belangrijkste reden voor de lage cyberbeveiliging van de meeste IoT-oplossingen komt voort uit de problematische erfenis van de cloud-client-serverarchitectuur. Bijvoorbeeld, de meest voorkomende slimme thuisarchitectuur op dit moment is meestal een IoT-hub, verbonden met een cloudservice. Zo is een typisch IoT-systeem een centraal controle-element dat is verbonden met meerdere externe systemen. Zeker, de cloudservice is veiliger dan apparaten op laag niveau, maar de consolidatie van gecentraliseerde controle over honderdduizenden van dergelijke systemen maakt elke beveiligingsinbreuk en lekken tot een enorme ramp.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "De servers van de cloudservice zijn onderhevig aan alle typische cyberbeveiligingsproblemen: netwerkaanvallen, DoS-aanvallen (het systeem tot falen brengen), kwaadwillige wijzigingen, overname van gebruikerssessies, enz. Maar sterke bedreigingen omvatten ook onbedoelde problemen zoals ontwerpfouten, misbruik of natuurrampen die leiden tot het falen van servers. Ook een zeker belangrijk punt is de noodzaak om in principe vertrouwen te hebben in de cloud en de mensen die deze onderhouden.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Dit alles wordt verergerd door de schaal van IoT-oplossingen. Het aantal IoT-systemen. Zeker, de cloudservice is veiliger dan apparaten op laag niveau, maar de consolidatie van gecentraliseerde controle over honderdduizenden van dergelijke systemen maakt elke beveiligingsinbreuk en lekken tot een enorme ramp.",
  "Data privacy": "Gegevensprivacy",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Het privacypunt moet worden gescheiden van cybersecurity, omdat dit probleem specifiek is voor IoT-systemen. Vanwege het grote aantal en de verschillende soorten apparaten die veel meer geïntegreerd zijn in de fysieke wereld dan alleen computers en smartphones, wordt het scala aan soorten privégegevens vermenigvuldigd. Het gaat niet langer alleen om GPS-locatie, winkelgegevens, financiële transacties en foto's, maar ook om een permanent record van video's en gesprekken, stemafdrukken, gezondheidscondities en zelfs een lijst van iemands gewoonten. Onder de soorten bedreigingen met betrekking tot privacy vallen: identificatie van informatie, lokaliseren en volgen, profileren, inventarisatieaanval, gegevenskoppelingsaanval.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "Het engste deel is dat gebruikers weinig of geen bewustzijn hebben dat ze hun privacy opgeven, omdat ze bijna geen idee hebben welke gegevens worden verzameld en hoe deze worden gebruikt. De bedreiging voor privacy groeit niet alleen door indringers, maar ook door organisaties en overheidsinstanties juist vanwege dit feit. De cloud IoT-services vereisen meestal maximale gegevensoverdracht van apparaten, en er zijn geen manieren om gegevensoverdracht te verbieden of te beperken («Accepteer de voorwaarden of rot op»). Bovendien wordt, ondanks het feit dat de verzamelde gegevens een bezitting zijn en echte waarde hebben, de persoon van wie de gegevens zijn verzameld niet alleen het recht ontzegd om actief over die gegevens te beschikken, maar wordt zelfs elke compensatie voor het verzamelen en gebruik van hun eigen gegevens ontzegd.",
  "\"Main tasks of robonomics architecture": "Belangrijkste taken van de Robonomics-architectuur",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Voortbouwend op de prestaties en uitdagingen van cloudplatforms, heeft Robonomics tot doel veiligere en geavanceerdere internetoplossingen te bieden voor de IoT-markt in elke fase van de communicatie tussen mens en machine. Hieronder staan de belangrijkste taken waarop Robonomics zich richt:",
  "Managing an IoT device using a decentralized cloud": "Het beheren van een IoT-apparaat met behulp van een gedecentraliseerde cloud",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Blockchain-netwerken hebben alle mogelijkheden om het hoogste beveiligingsniveau te bieden voor het uitvoeren van een apparaat en het verkrijgen van de telemetrie ervan. De interactie met het apparaat kan eigenlijk worden beschreven door de staat van de digitale tweeling die is opgeslagen in het blockchain-netwerk te veranderen en informatie over deze veranderingen te verzenden. In het geval van een toestemmingsloze blockchain kunnen we praten over de garanties van wereldwijde beschikbaarheid van providers voor IoT, evenals een hoog niveau van bescherming van gegevens van de digitale tweeling tegen ongewenste veranderingen.",
  "Performing technical and economic transaction between people and machines": "Het uitvoeren van technische en economische transacties tussen mensen en machines",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Dankzij het mechanisme van cryptocurrencies en slimme contracten kunnen we directe toegang bieden tot geautomatiseerde systemen voor digitale markten. Ethereum implementeert bijvoorbeeld al de meeste basisinstrumenten voor economische activiteit die kunnen worden gebruikt bij de werking van autonome apparaten. De applicaties die zijn gemaakt voor de interactie tussen de eindgebruiker en het IoT-apparaat zullen veel effectiever zijn als de servicevoorwaarden en betaling ervoor onlosmakelijk verbonden zijn met de lanceerparameters van het apparaat.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Moderne ontwikkelingen in Web3-technologie kunnen het probleem van de privacy van gebruikers oplossen. Met Web3 is het niet nodig om te authenticeren of verbinding te maken met specifieke servers om toegang te krijgen tot telemetrie en controle over het apparaat.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics is een gedecentraliseerde cloud voor digitale tweelingen van IoT-apparaten. Robonomics ondersteunt het techno-economische formaat voor communicatie en biedt ook privétoepassingen voor gebruikers.",
  "Basic components of Robonomics architecture": "Basiscomponenten van de Robonomics-architectuur",
  "A human interface to access the system": "Een menselijke interface om toegang te krijgen tot het systeem",
  "A communication protocol": "Een communicatieprotocol",
  "A machine interface": "Een machine-interface",
  "Human interface": "Menselijke interface",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "We stellen voor om gedecentraliseerde applicaties (dapps) te gebruiken als de belangrijkste manier om gebruikers te verbinden met het bedienen van slimme apparaten via internet. Op deze manier kunnen we de meest veilige (qua gegevens) gebruikersinterface bieden voor het systeem, die tegelijkertijd kan werken in de omstandigheden van het lokale stadsnetwerk en via een gemeenschappelijk wereldwijd netwerk.",
  "Communication protocol": "Communicatieprotocol",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "De rol hiervan wordt gespeeld door het Robonomics-netwerk, een specificatie ontwikkeld door het projectteam dat een gedecentraliseerd netwerk van providers implementeert die de overdracht, verwerking en opslag van informatie bieden die nodig is voor het uitvoeren van IoT-apparaten. In feite is het een implementatie van een functie-specifieke knoop voor IPFS, Ethereum en Polkadot-netwerken.",
  "Machine interface": "Machine-interface",
  "A simple representation of Robonomics architecture": "Een eenvoudige weergave van de Robonomics-architectuur",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Hier is een algemeen diagram van de volledige opstartcyclus van een apparaat met behulp van het Robonomics-platform:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "De gedecentraliseerde applicatie van de gebruiker stuurt een verzoek voor een apparaatbesturingsfunctie via het Robonomics-netwerk.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "Het Robonomics-netwerk biedt verzoekvertaling aan met behulp van libP2P en legt gebeurtenissen vast in de Ethereum-blockchain of Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "De controle over het apparaat wordt geleverd door een gedecentraliseerd netwerk, dat gegarandeerd de benodigde informatie opslaat om het IoT-apparaat te laten werken.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "Het IoT-apparaat ontvangt onafhankelijk informatie van Ethereum- en Polkadot-netwerken over de huidige status van de digitale tweeling. Dit zorgt ervoor dat het apparaat veilig kan worden gestart nadat de technische en economische opstartparameters zijn vastgesteld.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Als gevolg van de werking publiceert het IoT-apparaat een logboek van voltooide handelingen, dat als bewijs van de geleverde service kan worden gebruikt of voor het opsporen van fouten.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Het logboek wordt omgezet in een rapport voor de gebruiker en wordt beschikbaar in zijn dapp.",
  "No posts yet": "Nog geen berichten",
  "If you want to help us with translation": "Als u ons wilt helpen met vertaling",
  "contact us at": "neem contact met ons op",
  "send": "stuur",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics is een 100% open-source, veilig, kosteneffectief en futuristisch IoT-platform voor het verbinden van robotica onder Polkadot- en Ethereum-controle. Iedereen kan diensten bouwen met Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Hieronder een lijst van onze bewezen toepassingen van moderne roboticatechnologieën.",
  "By interest:": "Op interesse:",
  "Sort by progress:": "Sorteer op voortgang:",
  "Any progress": "Elke voortgang",
  "Complete": "Voltooid",
  "Proceeding": "Bezig",
  "Sort by time:": "Sorteer op tijd:",
  "Recent": "Recent",
  "Earliest": "Vroegste",
  "Show more": "Toon meer",
  "Fronius Solar.web integration with Home Assistant": "Fronius Solar.web-integratie met Home Assistant",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Samenwerking met vastgoedontwikkelaar op Cyprus voor het volgen van de dagelijkse distributie, consumptie en compensatie van eventuele overtollige CO2-uitstoot.",
  "Robonomics Middleware Framework for ROS 2": "Robonomics Middleware Framework voor ROS 2",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Een van onze doelen bij het ontwikkelen van deze case is om van Robonomics een ROS 2 Middleware te maken. Dit stelt ons in staat om Robonomics op Substrate te gebruiken om een dapp te maken die ROS 2 rechtstreeks vanuit de browser kan uitvoeren!",
  "Eisenkoch, the robot chef": "Eisenkoch, de robotkok",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Echt geval voor de robot uitgerust met twee wafelijzers en het bakken van 6 wafels tegelijk in 5-7 minuten.",
  "Blockchain-powered smart coffee machine": "Blockchain-aangedreven slimme koffiemachine",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics-koffie - is een slimme koffiemachine geïntegreerd in het Robonomics-netwerk. Dit project heeft tot doel het potentieel van Robonomics in de IoT-sfeer te laten zien aan de hand van een real-world voorbeeld.",
  "Water environmental inspector": "Watermilieutoezichthouder",
  "Air monitoring network": "Luchtbewakingsnetwerk",
  "Production quality control platform “Feecc”": "Productiekwaliteitscontroleplatform “Feecc”",
  "Backup and archiving service for robotics companies": "Back-up- en archiveringsdienst voor robotica-bedrijven",
  "Public lab with Boston Dynamics Spot": "Openbaar lab met Boston Dynamics Spot",
  "Autonomous telescope service": "Autonome telescoopdienst",
  "Smart home secure remote control and backup service": "Beveiligde externe bediening en back-upservice voor slimme woningen",
  "Blockchain as quality control system for chemistry": "Blockchain als kwaliteitscontrolesysteem voor chemie",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Echte CO2-uitstootvermindering met blockchain-gecertificeerde certificaten",
  "Robot-artist Gaka-Chu": "Robot-kunstenaar Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Demo “Ontvang het weer van de berg Fuji”",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "De 'Robonomics Coffee' is een slimme koffiemachine geïntegreerd in het Robonomics-netwerk. Dit project heeft tot doel het potentieel van Robonomics in de IoT-sfeer te illustreren aan de hand van een real-world voorbeeld.",
  "Establishing democracy with smart contracts": "Het vestigen van democratie met slimme contracten",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Laten we ons een klein kantoor voorstellen met een team van 10-15 mensen. Terwijl iedereen zich richt op hun eigen deadlines voor hun belangrijkste professionele taken, lijkt niemand zich druk te maken om het onderhoud van de kantoorruimte. De meest voorkomende oplossing om te voorkomen dat we in chaos verzinken, is het inhuren van externe personen voor ondersteuning. Een andere aanpak is om het initiatief te nemen en boetes op te leggen aan degenen die een puinhoop creëren of voorraden uitputten zonder ze aan te vullen. Maar is het ethisch om te leven onder tirannie in onze toekomstige crypto-anarchistische wereld, waarvan wordt verwacht dat iedereen verantwoordelijk is en van vrijheid geniet? Laten we streven naar het creëren van een meer democratische samenleving met behulp van slimme contracten en de nieuwe generatie internettechnologieën (vaak aangeduid als Web3). We hebben tools nodig die ons kunnen helpen samen beslissingen te nemen en ervoor te zorgen dat ze goed werken zonder dat mensen er direct bij betrokken hoeven te zijn.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Wie heeft alle koffie gedronken?!' of de tragedie van de commons",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Er is een concept dat veel besproken wordt in de economie, ecologie en andere wetenschappen, bekend als de 'tragedie van de commons'. Dit heeft betrekking op een scenario waarin individuen die toegang hebben tot een gedeelde bron hun eigen belangen prioriteren en uiteindelijk de bron uitputten. Koffie lijkt sterk op zo'n bron, omdat het verslechtert door ongecontroleerde consumptie op kantoor. Echter, tegelijkertijd zijn meestal geen van de teamleden geneigd om hun tijd en geld te investeren in het verkrijgen van een extra pakket koffiebonen. Dus blijven ze koffie drinken zonder nieuwe voorraden te krijgen.",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Strategie om de koffiemachine om te vormen tot een autonoom robotapparaat",
  "How to formulate the task in numbers.": "Hoe de taak in cijfers te formuleren.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Stel dat er een maandelijks koffiebudget is van $100, wat ongeveer gelijk is aan 150 kopjes voor ons team van 10 personen, dan heeft elke persoon elke 2 dagen 1 kopje. Nu gaan we in op de technische details. De vraag is: hoe kunnen we een autonome koffiemachine tot leven brengen op kantoor?",
  "Step 1: automated coffee bean ordering": "Stap 1: geautomatiseerde koffiebonenbestelling",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "We hebben een afspraak gemaakt met de barista, Nikita, die in de buurt van kantoor is gevestigd. Hij zal ons voorzien van koffiebonen zodra hij een melding van de bot ontvangt. De bot stuurt een bericht wanneer de koffie bijna op is, waarin de hoeveelheid koffie (in kilogram) die nodig is voor de bestelling en het overeenkomstige betalingsbedrag dat door het team is bepaald, wordt gespecificeerd. Met deze gegevens kan Nikita de koffie naar zijn voorkeur selecteren.",
  "Step 2: automatic access to smart office.": "Stap 2: automatische toegang tot slim kantoor.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Tegelijkertijd met de bestelling genereert de koffiemachine een QR-code. Nikita presenteert vervolgens deze QR-code aan de camera voor toegang tot kantoor.",
  "Step 3: distribution of coffee tokens to the team.": "Stap 3: verdeling van koffietokens aan het team.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Zodra de lokale camera de QR-code scant, initieert het slimme huishoudbeheersysteem een betaling aan Nikita en verdeelt nieuwe koffietokens onder de teamleden.",
  "Step 4: drink coffee!": "Stap 4: koffie drinken!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Om een vers kopje koffie te ontvangen, moet een teamlid een koffietoken naar het adres van de koffiemachine sturen.",
  "Coffee beans delivery process:": "Proces van koffiebonenlevering:",
  "Unlock new possibilities with this concept": "Ontgrendel nieuwe mogelijkheden met dit concept",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Bovendien introduceert zo'n geautomatiseerde koffiemachine verschillende economische en sociale dimensies. Laten we eens kijken naar enkele van deze dimensies:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Ontwikkelaars kunnen extra koffietokens storten wanneer het verbruik onder de limiet komt. Dit creëert een transparant systeem voor gevarieerd koffiegebruik binnen de limiet.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "De koffiemachine kan een gedeelde rekening bijhouden, waardoor kantoorleden geld kunnen bijdragen vanuit hun persoonlijke rekeningen voor een koffie-ervaring van hogere kwaliteit de volgende keer.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Het team beslist gezamenlijk over de hoeveelheid koffie die de machine bij elke bestelling zal bestellen via een DAO-stemming. Dit biedt vrijheid om de uitdaging aan te gaan met beperkte middelen.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Programmeerbare processen verminderen de invloed van menselijke factoren en bieden ook meer flexibiliteit bij het aanpassen van instellingen voor specifieke teams.",
  "How we smarten up our coffee machine in real life": "Hoe we onze koffiemachine in het echte leven slimmer maken",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Om hands-on controle over de koffiemachine te krijgen, hebben we een single-board computer geïntegreerd, specifiek de Raspberry Pi 4, samen met een algemeen verkrijgbare massamarkt koffiemachine die ondersteuning bood voor GPIO-verbinding. Onze voorkeur ging uit naar de",
  "selected for its affordability and the convenience of its easily removable front panel.": "geselecteerd vanwege de betaalbaarheid en het gemak van het eenvoudig verwijderbare voorpaneel.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Vervolgens hebben we de operationele details uitgewerkt, met name met betrekking tot welke tokens gebruikers kunnen sturen en het onderliggende algoritme. Hier is het resultaat:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Om te genieten van een kopje heerlijke koffie moeten gebruikers een bepaald bedrag aan fondsen (in ons geval 1 Statemine-token ACT, id=3077) naar het adres van de koffiemachine sturen vanuit een parachain (Statemine). Daarna begint het koffie schenken en wordt er vervolgens een actielogboek gepubliceerd op",
  "the Robonomics Parachain portal": "het Robonomics Parachain-portaal",
  "via the Datalog function": "via de Datalog-functie",
  "When the concept extends beyond the office": "Wanneer het concept zich uitbreidt buiten het kantoor",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Dit concept biedt talloze mogelijkheden voor het uitbreiden van het idee. Het is succesvol geïmplementeerd bij de Polkadot Web3 Hub tijdens het World Economic Forum 2022 in Davos. Deelnemers konden koffie bestellen en hun gewenste koffiesoort (bijv. espresso, americano, cappuccino) specificeren door een bepaald aantal tokens te sturen. Laten we foto's en video's delen van dit evenement:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Onze blockchain-koffiemaker maakt koffie bij de Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "DIY of hoe je je eigen slimme blockchain-koffiemachine kunt bouwen",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Je kunt een gedetailleerde handleiding en technische specificaties vinden in het open-source GitHub-repository. Houd er rekening mee dat je elke koffiemachine kunt gebruiken die je verkiest en bijna elke token naar keuze om dit project tot leven te brengen in je eigen ruimte.",
  "In a nutshell": "In een notendop",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Tegenwoordig wordt het steeds duidelijker dat energieverbruik een belangrijke bijdrage levert aan de CO2-voetafdruk, waardoor het steeds belangrijker wordt om manieren te vinden om onze milieueffecten te verminderen. Kantoren en commerciële gebouwen spelen een belangrijke rol in dit energieverbruik. De ingenieurs van Robonomics hebben een systeem geïnstalleerd in het kantoor van BBF, een vastgoedontwikkelaar in Cyprus, om elektriciteitsmetingen bij te houden en te verzamelen. Dit systeem biedt ook een praktische manier om de CO2-voetafdruk te compenseren.",
  "1. Monitoring surplus energy generation": "1. Monitoring van overtollige energieopwekking",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "Bij het kantoorgebouw van het BBF-bedrijf zijn verschillende zonnepanelen geïnstalleerd en geïntegreerd in het Solarweb-systeem, waardoor gemakkelijk gegevens kunnen worden verzameld. Het systeem biedt gegevens over het totale elektriciteitsverbruik van het gebouw en de elektriciteit die wordt opgewekt door de zonnepanelen. Een cruciale ontbrekende functie is echter de mogelijkheid om de koolstofvoetafdruk te compenseren die het gevolg is van het verbruik van elektriciteit dat niet wordt opgewekt door de zonnepanelen.",
  "2. Converting excess energy power to CO2 offset": "2. Het omzetten van overtollige energie in CO2-compensatie",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Het hebben van gegevens over het totale elektriciteitsverbruik en de elektriciteitsproductie van de zonnepanelen maakt een eenvoudige berekening van de koolstofvoetafdruk mogelijk. Er wordt aangenomen dat elektriciteit van zonnepanelen een koolstofvoetafdruk van 0 heeft, wat betekent dat compensatie alleen nodig is voor de overtollige elektriciteit die wordt verbruikt buiten wat de zonnepanelen hebben opgewekt.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "Opmerkelijk genoeg verschillen CO2-uitstoot per land. In Cyprus bedraagt de gemiddelde vervuiling 587 g/kWh, volgens Hannah Ritchie, Max Roser en Pablo Rosado (2022) - \"Energie\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Om de koolstofvoetafdruk te compenseren, worden koolstofkredieten gebruikt, waarbij elk krediet 1 ton CO2 vertegenwoordigt. Deze credits spelen een vitale rol bij het compenseren van de milieueffecten veroorzaakt door het verbruik van elektriciteit buiten de bijdrage van de zonnepanelen.",
  "3. Managing blockchain-verified carbon footprint offset": "3. Beheer van blockchain-geverifieerde compensatie van de koolstofvoetafdruk",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Met gegevens over energieverbruik, zonnepanelenproductie en de Cypriotische coëfficiënt is het eenvoudig om het aantal benodigde tokens voor de compensatie van de koolstofvoetafdruk te bepalen.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Om dit te bereiken, hebben we een Raspberry Pi geïntegreerd, Home Assistant geconfigureerd om analytische gegevens te verzamelen en een integratie ontwikkeld voor het compenseren van de voetafdruk. Het Home Assistant energiedashboard toont de volgende details:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Bovendien verbetert onze integratie het systeem door een handig bedieningspaneel te bieden om statistieken te bekijken en compensatie te activeren:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Hieronder volgt een illustratief voorbeeld van hoe de compensatie van de koolstofvoetafdruk plaatsvindt via onze integratie. Na succesvolle voltooiing verloopt de",
  "transaction": "transactie",
  "unfolds as follows:": "als volgt:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Het verminderen van het energieverbruik op kantoor is net zo belangrijk als het compenseren van de koolstofemissies. Dit kunnen we bereiken door kleine veranderingen door te voeren, zoals het gebruik van energiezuinige verlichting en apparaten en het goed onderhouden van kantoormateriaal.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Energieverbruik is een groot onderdeel van onze koolstofvoetafdruk en bedrijven moeten hun steentje bijdragen aan een milieuvriendelijkere wereld. Het hebben van een systeem dat het energieverbruik bijhoudt en helpt bij het compenseren van koolstofemissies kan de impact van een kantoorgebouw op het milieu aanzienlijk verminderen. Door de juiste aanpak te kiezen, kunnen bedrijven bijdragen aan een groenere toekomst.",
  "The way forward": "De weg vooruit",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics is een open-source platform dat zowel eenvoudige IoT-services als complexe robotica mogelijk maakt, waardoor effectieve communicatie tussen agenten mogelijk is, of ze nu menselijk of robotisch zijn. Om robots in dit systeem te integreren, maken we gebruik van ROS. In dit artikel willen we een overzicht geven van ons proces voor het integreren van Robonomics in ROS 2.",
  "Why ROS 2 in Robonomics?": "Waarom ROS 2 in Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, het Robot Operating System, is een van de oudste open-source frameworks voor robotica. Het is een verzameling softwarebibliotheken en -tools om robots te laten werken. Het heeft alles, van de basisprincipes tot geavanceerde functies, en wordt geleverd met handige tools voor programmeurs. Het wordt wereldwijd veel gebruikt door universiteiten voor onderwijs en onderzoek op het gebied van robotica, dus het is goed gevestigd, werkt met veel soorten robots en heeft een grote gemeenschap van ontwikkelaars.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Sinds de start van ROS in 2007 hebben er belangrijke veranderingen plaatsgevonden op het gebied van robotica en binnen de ROS-gemeenschap. Als reactie op deze ontwikkelingen werd ROS 2 geïntroduceerd met als doel zich aan te passen aan deze veranderingen. Het bouwt voort op de sterke punten van ROS 1 en lost de beperkingen ervan op. We hebben ROS vanaf het allereerste begin gebruikt in Robonomics en nu is het tijd voor ons om over te stappen naar ROS 2.",
  "You might find this interesting": "Dit vind je misschien interessant",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Er zijn talloze open-source robots en complexe robotplatforms die ROS ondersteunen. Dit betekent dat je een indrukwekkend multi-robot systeem kunt creëren om je specifieke doelstellingen te bereiken. Voor",
  "the most current list of supported robots": "de meest actuele lijst van ondersteunde robots",
  "please visit the ROS website.": "bezoek je de ROS-website.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Laten we eens kijken hoe ROS wordt gebruikt binnen het Robonomics-framework door het hele systeem voor te stellen met Robonomics als verschillende lagen:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "Op de 'Machine Interface'-laag hebben we tools nodig om robots naadloos te verbinden met software. ROS 2 biedt een robuuste set ontwikkelaarstools die perfect geschikt zijn voor deze taak.",
  "Robonomics packages for ROS and ROS 2": "Robonomics-pakketten voor ROS en ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "Het bouwen van een multi-robot systeem houdt vaak de uitdaging in om apparaten van verschillende leveranciers, of zelfs apparaten binnen een enkele leverancier, te verbinden, elk met verschillende protocollen. Of het nu gaat om een slimme woningopstelling of geautomatiseerde productie, effectieve communicatie tussen uw machines is cruciaal. ROS (en natuurlijk ROS 2) biedt verschillende modi om dit aan te pakken. Wat als u taken kunt aanpassen terwijl ROS de communicatie tussen nodes beheert?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Het Robonomics-team heeft verschillende pakketten voor ROS gemaakt om robots slimmer te maken en specifieke taken te kunnen uitvoeren wanneer dat nodig is. Om te zien welke taken we hebben voltooid met ROS, bekijk onze R&D-cases pagina. Bijna elke interactie met een robot is afhankelijk van ROS. Je kunt onze open-source Robonomics-pakketten voor ROS vinden op GitHub, en hier zijn er een paar van:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Robonomics communicatiestack bevat een set ROS-pakketten voor economische communicatiedoeleinden.",
  "Robonomics' contribution in the ROS 2 community": "De bijdrage van Robonomics aan de ROS 2-community",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics combineert robotica met Web3-technologieën en we streven ernaar om op deze gebieden te groeien. Sinds de introductie van ROS 2 hebben we drie belangrijke uitdagingen geïdentificeerd die betrekking hebben op het ondersteunen van de ROS 2-community en het verbeteren van de mogelijkheden van Robonomics:",
  "Creating ROS 2 tools for Rust:": "Het creëren van ROS 2-tools voor Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Deze tools stellen ontwikkelaars in staat om ROS 2-toepassingen te schrijven met behulp van Rust. Voor meer informatie over waarom we voor Rust hebben gekozen en de betekenis van dit project voor ons, kun je",
  "additional details": "aanvullende details",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Gebouw Dapps && Web Services voor IoT op Robonomics Parachain",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, software architect",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Laten we niet vergeten dat de automatische machine het precieze economische equivalent is van slavenarbeid. Elke arbeid die concurreert met slavenarbeid moet de economische gevolgen van slavenarbeid accepteren.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "cybernetica",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Robots zijn vandaag de dag als volwassen kinderen - ze kunnen al geld beheren en juridische relaties aangaan, onafhankelijk zijn.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "De toekomst van de mensheid zelf hangt af van hoe we robots leren omgaan met hun mogelijkheden.",
  "Robonomics tools": "Robonomics tools",
  "Operate with digital twins of IoT devices": "Werken met digitale tweelingen van IoT-apparaten",
  "The first tools of the robot economy: money for robots, contracts for robots": "De eerste tools van de robot-economie: geld voor robots, contracten voor robots",
  "Software for connecting devices to a decentralized cloud": "Software voor het verbinden van apparaten met een gedecentraliseerde cloud",
  "API library for custom IoT applications": "API-bibliotheek voor aangepaste IoT-toepassingen",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics bevat een volledige set tools voor het ontwikkelen van IoT-toepassingen, zowel aan de robotica- als aan de gebruikersinterfacezijde. Communicatie tussen de gebruiker en het apparaat vindt plaats met behulp van de meest succesvolle technologieën uit de Web3-wereld - IPFS, Ethereum en Polkadot. Ontwikkelaars kunnen dus moderne en veilige toepassingen creëren voor Smart Cities en Industry 4.0.",
  "Robonomics Connectivity": "Robonomics Connectiviteit",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Voor het gemak van de ontwikkelaars bevat Robonomics een set software voor het verbinden van: IoT-apparaten met behulp van het HTTP/MQTT-protocol, complexe robotische systemen met behulp van het Robot Operating System (ROS).",
  "Connect a sensor": "Verbind een sensor",
  "to the Robonomics network": "met het Robonomics-netwerk",
  "Try": "Probeer",
  "Robonomics IO": "Robonomics IO",
  "a simple prototyping tool": "een eenvoudige prototyping tool",
  "Start building your own cyber physical system with": "Begin met het bouwen van uw eigen cyber-fysiek systeem met",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics ondersteunt honderden robots direct uit de doos",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Gebruikers van het platform kunnen ROS-compatibele robots in enkele minuten aansluiten op de digitale economie. Voor een volledige lijst van ondersteunde robots kunt u de link volgen",
  "Decentralized Cloud infrastructure for IoT": "Gedecentraliseerde Cloud-infrastructuur voor IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) is de basisinfrastructuurdienst voor Robotica en IoT bovenop Robonomics Parachain en IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "economie van robots",
  "Core RWS features available for IoT today": "Kernfuncties van RWS beschikbaar voor IoT vandaag",
  "RWS PubSub Message Broker": "RWS PubSub Message Broker",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Maak gebruik van onbeperkte berichtenuitwisseling over een P2P-netwerk op basis van het IPFS-protocol",
  "RWS Data Blockchainization Service": "RWS Data Blockchainization Service",
  "Put data into IPFS and store hashes in a public Blockchain": "Plaats gegevens in IPFS en sla hashes op in een openbare Blockchain",
  "RWS Robot Actions": "RWS Robot Actions",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Schakel in/uit; start of stop uw IoT-apparaten onder controle van een gedecentraliseerde computer",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Het hart van uw IoT-toepassing - Digitale Tweeling op Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "In de technische architectuur bieden IoT-digitale tweelingen zichtbaarheid en monitoring van dingen en gerelateerde gebeurtenissen (bijv. het automatisch vastleggen van de oorsprong van een product met behulp van IoT-apparaten), en blockchain maakt de gedeelde enkelvoudige versie van de waarheid mogelijk met betrekking tot de status van deze dingen gedurende hun levenscyclus en bijbehorende zakelijke gebeurtenissen",
  "from Gartner research": "van Gartner-onderzoek",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachain biedt de mogelijkheid om een model van een digitale tweeling te creëren en de status ervan elke 6 seconden bij te werken.",
  "logos and assets": "logo's en assets",
  "Download the Robonomics logos here. We've got two options for your": "Download hier de Robonomics-logo's. We hebben twee opties voor uw",
  "basic needs": "basisbehoeften",
  "and one designed for": "en een ontworpen voor",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "token. Ontdek ook het optimale",
  "color palette": "kleurenpalet",
  "for the distinguished Robonomics brand": "voor het onderscheidende Robonomics-merk",
  "Robonomics logos": "Robonomics-logo's",
  "Download all": "Download alle",
  "XRT logos": "XRT-logo's",
  "RWS logos": "RWS-logo's",
  "Recommended color palette": "Aanbevolen kleurenpalet",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Hier hebben we een verzameling NFT's samengesteld die zijn gemunt tijdens onze uitgebreide crypto-reis, zowel onafhankelijk als met geweldige teams. Deze unieke tokens bieden verifieerbaar eigendom op de blockchain en zijn geweldig om je blockchain-account te versieren. U kunt bieden op sommige van hen bij veilingen of zelfs uw eigen unieke stuk maken.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Tijdens onze initiële Kusama crowdloan-campagne hebben we besloten om onze crypto-pioniers niet alleen te belonen met tokens, maar ook met een kleurrijke NFT. Deze kaart heeft grote betekenis voor ons, en als iemand deze bezit, weten we dat ze een fantastische supporter zijn van de waarden van Robonomics: vrijheid en decentralisatie.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "We zijn enthousiast om onze speciale serie digitale activa te introduceren - Robonomics Crypto Girls, gemaakt door het Robonomics Art&Science team. Elke NFT in deze collectie is een unieke grafische representatie van de technologie die wordt gebruikt in Robonomics of gebouwd is op basis van Robonomics use cases. Onze getalenteerde kunstenaars hebben elk meisje met de hand getekend in de kenmerkende Robonomics stijl. Je kunt degene kiezen die bij je past of de hele serie verzamelen! Door deze NFT's te kopen, voeg je niet alleen een stijlvolle toevoeging toe aan je collectie, maar ondersteun je ons ook bij het blijven innoveren en implementeren van gedecentraliseerde connectiviteit voor robots. Blijf op de hoogte van nieuwe toevoegingen aan de collectie!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. SEIZOENSGEBONDEN SPOT NFT-COLLECTIES",
  "On demand minting": "On demand minting",
  "SEASONAL SPOT NFT COLLECTIONS": "SEIZOENSGEBONDEN SPOT NFT-COLLECTIES",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Deze seizoensgebonden NFT-collecties vertegenwoordigen een unieke digitale activa die de unieke interactie tussen de gebruiker en Spot binnen de Robonomics parachain vastlegt. Gebruikers kunnen alles tekenen in de browser en de robot zal hun bewegingen repliceren om een handgetekende afbeelding te maken. Zodra de interactie is voltooid, wordt de NFT gemint op de Singular marktplaats voor het Polkadot-account van de gebruiker. Nu kan iedereen communiceren met een echte robot die zich in een laboratorium in Californië bevindt om gepersonaliseerde en unieke digitale activa te creëren die kunnen worden bezeten, gekocht en verkocht, net als elke andere digitale activa.",
  "Create your NFT": "Maak je eigen NFT",
  "4. automated telescope collection": "4. geautomatiseerde telescoopcollectie",
  "automated telescope collection": "geautomatiseerde telescoopcollectie",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Gelegen in de Atacama-woestijn, Chili, kan een fysieke telescoop worden benaderd via een gedecentraliseerde app om realtime beelden van astronomische objecten in de diepe ruimte vast te leggen. Elke gebruiker met een internetverbinding kan er toegang toe krijgen met $STRGZN-tokens, die beschikbaar zijn voor aankoop in de app met een creditcard. Selecteer een astronomisch object, stuur een opdracht naar de telescoop om een foto te maken en wacht op de geminte NFT op het Singular-platform. Houd er rekening mee dat de app alleen beschikbaar is voor gebruik van 11 uur 's avonds tot 6 uur 's ochtends GMT-3 vanwege de bedrijfsuren van de telescoop.",
  "Try yourself": "Probeer het zelf",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "In samenwerking met Polkapets",
  "and": "en",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Als trotse deelnemer aan het Polkadot-ecosysteem heeft Robonomics deelgenomen aan Polka Pets World. Samen met het Polka Pets-team hebben we 1200 NFT's gemint met een uniek ontwerpconcept dat onze kernidee van connectiviteit laat zien. Om dit idee tot leven te brengen, hebben we een persoonlijkheid gecreëerd: een android die gespecialiseerd is in het helpen van mensen om verbinding te maken met elke robotachtige entiteit.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "In 2021 is Robonomics begonnen met de ondersteuning van de toevoeging van RMRK's pallets aan hun runtime, wat zou resulteren in native integratie met de meest geavanceerde NFT-logica ter wereld. Om deze opmerkelijke mijlpaal te vieren, hebben we een speciaal Kanaria-compatibel item gelanceerd - een kind-NFT dat kan worden uitgerust op de Kanaria-vogel van iemand en voordelen kan bieden in RMRK's metaverse.",
  "RMRK Partnerships": "RMRK Partnerships",
  "Research papers": "Onderzoekspapers",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Zonder academisch onderzoek kan de vooruitgang van complexe systemen die in ons dagelijks leven kunnen worden geïntegreerd, zijn doel verliezen of zelfs risico's met zich meebrengen. We moeten zorgvuldig nadenken over onze richting, doelstellingen en mogelijke gevolgen. De gebieden waar Robonomics actief is, met name Robotica, Economische relaties en Web3-technologieën, zijn het waard om afzonderlijk te bestuderen, te verkennen hoe ze met elkaar kunnen worden geïntegreerd en hun mogelijke impact op ons leven te beoordelen.",
  "Robonomics White Paper": "Robonomics White Paper",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Hier kun je de allereerste Robonomics white paper vinden en downloaden (helemaal gratis natuurlijk), die in mei 2018 werd geïntroduceerd. Hoewel er sindsdien veel is geëvolueerd, worden de fundamenten van Robonomics nog steeds beschreven in dit document.",
  "English": "Engels",
  "Russian": "Russisch",
  "Chinese": "Chinees",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Een zelfstandige autonome robotkunstenaar",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Coöperatieve gradientvrije lokalisatie en tracking van bewegende omgevingsgrenzen door teams van niet-holonome robots",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robot-as-a-Service: Van cloud naar peering technologieën",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Betrouwbare milieumonitoring door middel van sensor-netwerken op zwermende autonome marineschepen en gedistribueerde grootboektechnologie",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Naar blockchain-gebaseerde multi-agent robotische systemen: Analyse, classificatie en toepassingen",
  "Digital Passport for Unmanned Vehicles": "Digitale paspoort voor onbemande voertuigen",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics als een op blockchain gebaseerd platform voor het beheer van onbemand verkeer van mobiele voertuigen",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Towards blockchain-based Robonomics: autonomous agents behavior validation",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Transforming Climate Finance and Green Investment with Blockchains": "Transforming Climate Finance and Green Investment with Blockchains",
  "Alastair Marke": "Alastair Marke",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: platform for integration of cyber physical systems into human economy",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Blockchain based protocol for economical communication in industry 4.0": "Blockchain based protocol for economical communication in industry 4.0",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics based on blockchain as a principle of creating smart factories",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "This page has moved to a": "Deze pagina is verhuisd naar een",
  "Automatic redirecting": "Automatische doorverwijzing",
  "Do Androids Dream of Electric Sheep?": "Dromen Androids van elektrische schapen?",
  "On the Way to Sovereign Home Automation": "Op weg naar soevereine thuisautomatisering",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Het jaar begon met een belangrijke prestatie - Robonomics won de 20e parachain-slotveiling en",
  "officially became": "werd officieel",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "een parachain met ID 2048 op het Kusama-netwerk. De lancering, datalog, DigitalTwin, aansprakelijkheidsfuncties en IoT-abonnementen zijn beschikbaar geworden voor alle gebruikers van het ecosysteem. Om details te verstrekken voor deze fase van het project, heeft het kernteam de eerste hoofdstukken van de",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 op Substraat is uitgebracht met ondersteuning voor XCM-berichten, en we zijn begonnen met het openen van HRMP-kanalen met andere parachains (zoals Crust Shadow en Darwinia), waarvan de functionaliteit uiterst nuttig voor ons is.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Tegelijkertijd hebben we een strategie ontgrendeld om de IoT-markt kennis te laten maken met ons protocol. Onze experimenten met IoT-apparatuur hebben ons geleid naar het concept van een soeverein slim huis, dat onafhankelijk is van gecentraliseerde cloudserviceproviders. We hebben onze",
  "integration": "integratie",
  "with the Home Assistant automation system, and also designed our own": "met het Home Assistant automatiseringssysteem gelanceerd en hebben ook onze eigen",
  "IoT gateway": "IoT-gateway",
  "for connecting smart devices.": "ontworpen voor het verbinden van slimme apparaten.",
  "We have launched two big initiatives in order to increase community engagement —": "We hebben twee grote initiatieven gelanceerd om de betrokkenheid van de gemeenschap te vergroten -",
  "Robonomics Academy": "Robonomics Academy",
  "Additionally,": "Daarnaast werd",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "gehouden in de herfst zodat de Robonomics-gemeenschap onze governance-mechanismen voor het eerst kon uitproberen. Onlangs heeft het Robonomics-team het DAO IPCI-project geholpen om een parachain-slot te verkrijgen om een carbon offsetting-service voor slimme gebouwen te presenteren.",
  "World Economic Forum Annual Meeting 2022": "World Economic Forum Annual Meeting 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Een parachain worden voor IoT-toepassingen",
  "In 2021, our": "In 2021 verschoof onze",
  "main focus": "belangrijkste focus",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "naar het voorbereiden van het project zodat IoT-toepassingen kunnen worden gebruikt via onze parachain op het Kusama-netwerk. Robonomics 1.0 op Substraat is uitgebracht en we hebben getest hoe sensoren kunnen worden aangesloten op de parachain om hun telemetriegegevens te verzenden, evenals het ontwikkelen van de functionaliteit van de digitale tweeling. In het midden van het jaar besloten we de volledige cyclus van ons netwerk te testen en creëerden we onze eigen relay chain genaamd",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "waaraan de Robonomics parachain was geïntegreerd (voordat deze werd gemigreerd naar de Kusama relay chain). Er is veel aandacht besteed aan het verkrijgen van een parachain-slot in Kusama, waarvoor we verschillende crowdloan-campagnes hebben georganiseerd.",
  "There have been two big changes for the community. First, we launched the": "Er zijn twee grote veranderingen geweest voor de gemeenschap. Ten eerste hebben we het",
  "Robonomics Grant Program": "Robonomics Grant Programma",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "gelanceerd, waarmee Web3-robotica- en IoT-projecten financiering kunnen ontvangen voor R&D-taken. Aan het einde van het jaar namen vier actieve projecten deel aan het programma. Ten tweede is het team begonnen met het",
  "Exodus process": "Exodus-proces",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "waarmee Ethereum-tokenhouders hun XRT-tokens naar de parachain kunnen verplaatsen.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Onder de samenwerkingen kunnen we de opmerkelijke verschijning van Boston Dynamics Spot bij MerkleBot noemen, waarvoor een",
  "rental remote control system": "verhuur op afstand bedieningssysteem",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "werd ontwikkeld. We willen u ook informeren over het bedrijf Multi-Agent Systems, dat een persoonlijk project is dat is gevormd door een team van Robonomics-engineers. Ze hebben een robotwafelbakker genaamd Eisenkoch ontwikkeld die kooktaken uitvoert voor koffiebar-eigenaren.",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (gesponsord door Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (georganiseerd door Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Overgang naar Multinetwork - Along Came Polkadot",
  "There came a time when the existing limitations of Ethereum": "Er kwam een tijd dat de bestaande beperkingen van Ethereum",
  "began to stand out clearly": "duidelijk naar voren kwamen",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(met name slechte schaalbaarheid, lage snelheid en zeer hoge transactiekosten). De upgrade naar ETH2.0 zou de situatie moeten verhelpen, maar deze upgrade werd herhaaldelijk uitgesteld. Hoewel we het Ethereum-netwerk niet wilden verlaten, realiseerden we ons dat het in de huidige situatie moeilijk was om onze use cases te implementeren, en we begonnen te zoeken naar een alternatief netwerk. Het gesharde blockchain-ecosysteem Polkadot werd dit alternatief. We begonnen met experimenteren met het Substrate-framework om de belangrijkste Robonomics-functies te migreren en onze eigen testnetwerk te implementeren. Aan het einde van deze fase hadden we onze parachain geïmplementeerd op het Rococo-testnetwerk en begonnen we ons voor te bereiden om een ​​slot te krijgen op het Kusama-netwerk.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Terwijl we IoT-systemen blijven bestuderen, hebben we de belangrijkste functionaliteit van Robonomics geïdentificeerd, die waarde kan toevoegen voor gebruikers - de functie van gedecentraliseerde cloud voor IoT. Dit idee vormde de basis van",
  "Robonomics Web Services": "Robonomics Web Services",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "De RWS-infrastructuur nam alle functies van een typische gecentraliseerde cloud over, maar zonder de standaardproblemen van wereldwijde beschikbaarheid, beveiliging en privacy. Daarnaast kwamen we op het idee van parachain IoT-abonnementen waarmee abonnementhouders het blockchain-netwerk kunnen gebruiken zonder een vergoeding te betalen voor elke transactie. Het eerste experiment met IoT-abonnementen was de uitgifte van de RWS-token, waarmee de eigenaar 1 transactie per blok kan verzenden. Bovendien begonnen we de eerste stappen te zetten om onze eigen hardwarekit te ontwikkelen voor de controle van slimme apparaten (het DAOS-concept).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Natuurlijk is de ondersteuning voor Robonomics op Ethereum niet gestopt. De Robonomics-communicatiestack is afgerond tot versie",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "De XRT-token is begonnen met handelen op verschillende beurzen (in het bijzonder de Uniswap DEX) en het liquiditeitsstimuleringsprogramma is gelanceerd.",
  "The team actively developed ways to interact with the community. The first version of our": "Het team ontwikkelde actief manieren om met de gemeenschap te communiceren. De eerste versie van onze",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "site en Robonomics Wiki zijn gelanceerd. Voor meer transparant en handig projectbeheer zijn we begonnen met het gebruik van",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "We organiseerden",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "in 2019 voor nieuwkomers in het project.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Samenwerkingen met gelijkgestemde projecten gingen ook door. Robonomics en DAO IPCI introduceerden een service voor het verzamelen en analyseren van sensorgegevens -",
  "RoSeMAN": "RoSeMAN",
  "Robonomics became the foundation for the": "Robonomics werd de basis voor het",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "project, dat een systeem ontwikkelt voor slim leasen van robotapparatuur.",
  "The Rise of Robonomics Network": "De opkomst van het Robonomics-netwerk",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "We begrepen dat autonome agenten een omgeving nodig hadden die hun betrouwbare technische en economische werking zou waarborgen. Gedurende enkele jaren hebben we een protocol ontwikkeld voor het creëren van een gedecentraliseerd netwerk van providers die robotagenten helpen bij het leveren van hun diensten. Tools voor netwerkonderhoud en voor de communicatiestack tussen Ethereum en ROS zijn ontwikkeld. In 2018 publiceerden we het",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "en de alfaversion van Robonomics Network werd gelanceerd op het Ethereum-mainnet. Actieve voorbereidingen gingen door voor het XRT-token-generatie-evenement (dat uiteindelijk plaatsvond in het voorjaar van 2019 vanwege de eerste crypto-winter).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Vanaf deze periode begon Robonomics dynamisch gebruiksscenario's te ontwikkelen die verband hielden met Industry 4.0 - slimme fabrieken, slimme steden en slimme huizen - en dit trok onze nauwe aandacht voor de IoT-wereld. Op zoek naar innovatie heeft het team verschillende grote en unieke R&D-demonstraties gepresenteerd: een civiel",
  "sensor network": "sensornetwerk",
  "a water drone": "een waterdrone",
  "for environmental monitoring (supported by a sensor systems manufacturer": "voor milieumonitoring (ondersteund door een fabrikant van sensorsystemen",
  "Libelium": "Libelium",
  "a smart factory model": "een model van een slimme fabriek",
  "a self-employed": "een zelfstandige",
  "robot artist Gaka-chu": "robotkunstenaar Gaka-chu",
  "and a": "en een",
  "drone traffic management system": "drones-verkeersbeheersysteem",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Robonomics begon samenwerking met het project DAO IPCI voor het beheer van milieuactiva met behulp van Web3-technologieën en IoT-apparaten.",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Workshop van het Europees Parlement 'De economie van robots'",
  "Consensus 2018 conference": "Conferentie Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Symposium over Blockchain voor Robotische Systemen bij MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Robonomics-2018 zomerschool georganiseerd door Robonomics.",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Het samenbrengen van Web3 Techs en Robotic Frameworks",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Dit was een periode van actief R&D waarin we een reeks taken identificeerden waarin P2P-technologieën mogelijkheden hebben die voorheen niet beschikbaar waren voor robotica. Door Ethereum-computer, IPFS-bestandsopslag en Robot Operating System te combineren, realiseerden we ons dat elk apparaat potentieel een",
  "autonomous intelligent robot agent": "autonome intelligente robotagent kon worden",
  "Robonomics whitepaper 2022 welcome guide": "Robonomics whitepaper 2022 welkomstgids",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "We hebben een techno-economisch protocol voor machinecommunicatie ontwikkeld dat draait op Ethereum en IPFS, en we vullen het aan met elementen van een cloudgebaseerd IoT-platform op basis van de Polkadot parachain. Vandaag de dag hebben we al een hybride platform voor het creëren van futuristische IoT-toepassingen. Het biedt interactie met apparaten onder controle van een wereldwijde gedecentraliseerde computer. Voordat we beginnen met het creëren van veilige, serverloze en futuristische IoT-toepassingen met behulp van het Robonomics-platform, laten we ons een beetje verdiepen in de theorie...",
  "Chapter 1.": "Hoofdstuk 1.",
  "At the intersection of cybernetics and economics": "Op het snijvlak van cybernetica en economie",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "We hebben een economisch systeem gepresenteerd waarin robotapparaten optreden als onafhankelijke agenten die in staat zijn om belangrijke economische activiteiten uit te voeren, die voorheen voorbehouden waren aan mensen. In dit hoofdstuk zullen we praten over de relevantie van de robot-economie, die een belangrijk onderdeel kan worden van het leven van mensen en het huidige niveau van de economie volledig geautomatiseerde diensten kan veranderen in de toekomst.",
  "In this chapter you will learn": "In dit hoofdstuk leer je",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase en de aard van het bedrijf",
  "CPS - cyber-physical system": "CPS - cyber-fysiek systeem",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener en de zoektocht naar patronen in levende en machine",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "De Vierde Industriële Revolutie, Geld voor Robots en Bitcoin",
  "Ethereum Smart Contracts": "Ethereum Smart Contracts",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Open vragen over teleologie en het werk van Mises",
  "Read chapter 1": "Lees hoofdstuk 1",
  "Chapter 2.": "Hoofdstuk 2.",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "In het tweede hoofdstuk lees je over de interactie tussen mens en machine met behulp van moderne internettechnologie - van IoT-apparaten tot een gedecentraliseerd en wereldwijd toegankelijk netwerk van aanbieders. We zullen kijken naar de basisprincipes van het Internet of Things om de problemen en belangrijkste uitdagingen te belichten waarmee de makers van IoT-systemen worden geconfronteerd en waaraan Robonomics is gericht op de oplossing.",
  "Overview of the state of the Internet of Things (IoT)": "Overzicht van de stand van zaken van het Internet of Things (IoT)",
  "Embedded IoT systems": "Ingebouwde IoT-systemen",
  "Autonomous Systems": "Autonome systemen",
  "Digital twins are the heart of the Internet of Things": "Digitale tweelingen zijn het hart van het Internet of Things",
  "IoT data flows in cloud service": "IoT-gegevensstromen in cloudservice",
  "Main tasks of Robonomics architecture": "Belangrijkste taken van de Robonomics-architectuur",
  "Read chapter 2": "Lees hoofdstuk 2",
  "We continue to update the white paper of Robonomics": "We blijven het whitepaper van Robonomics bijwerken",
  "stay tuned for new parts on our website and in Discord": "Blijf op de hoogte van nieuwe delen op onze website en in Discord",
  "Join our discord": "Doe mee aan onze Discord",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Op zijn beurt opende dit de weg voor ons naar de concepten van Robot-as-a-Service en de robot-economie.",
  "Our publications in scientific journals of this period are available in the": "Onze publicaties in wetenschappelijke tijdschriften van deze periode zijn beschikbaar in het",
  "Papers section": "Papers gedeelte",
  "We have collected all R&D projects over the years in the": "We hebben alle R&D-projecten over de jaren heen verzameld in het",
  "a handy book": "een handig boek",
  "Playing with Human-Machine Interaction through Ethereum": "Spelen met mens-machine-interactie via Ethereum",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Het begon allemaal met een idee dat bij de oprichters opkwam toen Ethereum net zijn mainnet had gelanceerd. Wat als de robot een taak uitvoert voor een klant voor cryptocurrency, en de logica ervan wordt gecontroleerd door een smart contract?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Om het idee te testen, hebben we een demo gemaakt waarin een drone die wordt bestuurd door een Ethereum-computer werd gelanceerd om de opgegeven GPS-coördinaten te bereiken nadat de gebruiker een betalingstransactie had voltooid.",
  "The demo is available on": "De demo is beschikbaar op",
  "YouTube": "YouTube",
  "Robonomics tokenomics": "Robonomics tokenomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "is de utility token die het mogelijk zal maken om IoT-apparaten te controleren bovenop het Ethereum-netwerk en de Robonomics parachain in het Polkadot-ecosysteem.",
  "Token distribution": "Tokenverdeling",
  "The task": "De taak",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "van de Robonomics-token is om de werking van een gedecentraliseerd netwerk voor het onderhoud van Slimme Steden en Industrie 4.0 in blockchain-infrastructuur te waarborgen. Om dit doel te bereiken, moet de token-economie de prikkels weerspiegelen voor de implementatie van het netwerk.",
  "Try our Dapp": "Probeer onze Dapp",
  "In addition": "Daarnaast",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "kunt u XRT bedienen binnen blockchains met behulp van tools die worden geleverd door verschillende onafhankelijke teams in de Polkadot (Kusama) en Ethereum-gemeenschappen.",
  "Within the Kusama network, you have the capability use": "Binnen het Kusama-netwerk heeft u de mogelijkheid om",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "communicatie tussen de Robonomics parachain en andere parachains te gebruiken met behulp van verschillende gedecentraliseerde applicaties (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Binnen het Ethereum-netwerk kunt u gedecentraliseerde applicaties gebruiken die worden aangedreven door de",
  "Be aware of scammers": "Wees op uw hoede voor oplichters",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "gebruik alleen bekende markten om XRT uit te wisselen. Stuur uw tokens niet naar accounts die u in privéberichten worden gegeven, wat voor transactie u ook wilt uitvoeren (token kopen of verkopen). Als u enige 'luide verklaringen' heeft ontvangen over de Robonomics-token (oplichters gebruiken vaak zoiets als een airdrop-aankondiging), controleer dan deze website (https://robonomics.network/) of onze",
  "for official updates. Be careful, be safe.": "voor officiële updates. Wees voorzichtig, wees veilig.",
  "XRT in Ethereum": "XRT in Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Bij de implementatie van het Robonomics-project in 2015 - 2018 moest het projectteam een verbinding vinden tussen het leveren van een nuttige functie door Robonomics Network, namelijk het lanceren van IoT-apparaten volgens het robot-als-een-service-model, en de vergoeding van de kosten aan Robonomics-providers voor gasvergoedingen in Ethereum. We moesten nadenken over de levenscyclus van de aansprakelijkheid van elk individueel slim apparaat om een dienst uit te voeren. Als gevolg van het vroege R&D-werk in Robonomics kwam het team met een mechanisme voor het delven van nieuwe tokens om elk gecreëerd slim contract voor robot-als-een-service te belonen. Dit model blijft levensvatbaar voor de toekomst van Robonomics op Ethereum, maar alleen met aanzienlijke verbeteringen in Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lees dit om de historische achtergrond en langetermijnplannen van het team voor XRT in het Ethereum-ecosysteem te kennen.",
  "Etherscan profile": "Etherscan-profiel",
  "View token smart contract and transactions in Ethereum network here.": "Bekijk hier het slimme contract en de transacties van de token in het Ethereum-netwerk.",
  "Coingecko markets": "Coingecko-markten",
  "Here you can find CEX and DEX markets for trading XRT.": "Hier vindt u CEX- en DEX-markten voor de handel in XRT.",
  "XRT In Polkadot": "XRT in Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Bij de overstap van Ethereum naar Polkadot moeten we een 'opschaling' in tokenomics doen. Parachains in het Polkadot-ecosysteem zijn niet het equivalent van een slim contract, maar zijn een volledig programmeerbare blockchain die een segment van het algehele netwerk least.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "De werkelijke betaling namens Polkadot en Kusama parachains is een langdurige binding van native Relay chain tokens (DOT / KSM) in voldoende hoeveelheid om een van de veilingen te winnen. De XRT in de Robonomics parachain ondersteunt slotvernieuwing en beloningen voor stakeholders. Het XRT-verbrandingsmechanisme dat ten grondslag ligt aan de activering van IoT-abonnementen is ontworpen om de inflatie tot een minimum te beperken en in geval van toenemende interesse tot nul te verlagen.",
  "Learn more": "Lees meer",
  "in Twitter thread from our network architect.": "in Twitter-thread van onze netwerkarchitect.",
  "Usage:": "Gebruik:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT kan worden gebruikt om zowel kosten te betalen voor het uitvoeren van transacties op de parachain als voor de aankoop van een IoT-abonnement dat prioriteit geeft aan de verwerking van apparaat- of gebruikerstransacties voor IoT.",
  "Rewards:": "Beloningen:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Gedurende het jaar geeft de parachain een kleine hoeveelheid XRT uit om parachain-collators te stimuleren.",
  "The parameter of the total reward": "De parameter van de totale beloning",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "voor collators voor het jaar wordt bepaald door on-chain stemming van tokenhouders en kan worden gewijzigd door het houden van een referendum.",
  "Use XRT": "Gebruik XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Koop een IoT-abonnement in onze gedecentraliseerde applicatie. Beheer uw slimme apparaten via blockchain zonder enige gecentraliseerde onderneming die toezicht houdt.",
  "Subscan profile": "Subscan-profiel",
  "View token statistics on top of Polkadot ecosystem.": "Bekijk hier statistieken van de token bovenop het Polkadot-ecosysteem.",
  "Other questions": "Andere vragen",
  "What is RWS?": "Wat is RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[In ontwikkeling van kernfunctionaliteit] Voor ingenieurs zal het Core Dev-team proberen verschillende Robonomics-gebruiksmodellen te maken en de eerste stap op deze weg is het lanceren van een levenslang abonnementstoken - RWS-token. Elk RWS-token geeft u 1 transactie per seconde (tps) van/naar uw IoT-apparaat via Robonomics Parachain. Activeer uw RWS-token en maak 'gratis gas'-transacties met een voorspelbare latentie. Deactiveer RWS-token en verhandel het op DEX.",
  "What is AIRA/AIR ID?": "Wat is AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT-token werd in 2017 gedistribueerd als een autonoom onderdeel van de verdere Robonomics-infrastructuur op Ethereum. Na de succesvolle lancering van Robonomics over Ethereum in 2019 werden AIRA-tokens verbonden met de gecreëerde infrastructuur van het project via het ambix smart contract, dat een autonoom en onafhankelijk proces garandeerde voor het omwisselen van pre-XRT naar ERC-20 XRT.",
  "ambix smart contract": "ambix slim contract",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "die gegarandeerd autonoom en onafhankelijk proces van het omwisselen van pre-XRT naar ERC-20 XRT.",
  "Secure": "Veilig",
  "Serverless": "Serverloos",
  "Futuristic": "Toekomstgericht",
  "IoT applications": "IoT-toepassingen",
  "Robonomics network vision": "Visie van het Robonomics-netwerk",
  "At the frontier of cybernetics and economics": "Aan de voorhoede van cybernetica en economie",
  "Build your IoT services on Robonomics platform": "Bouw uw IoT-services op het Robonomics-platform",
  "taking full advantage of decentralized architecture": "Profiteer optimaal van gedecentraliseerde architectuur",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics stelt gebruikers in staat om verbinding te maken met slimme apparaten via gedecentraliseerde applicaties (dapp) die geen gegevensoverdracht van de gebruiker vereisen voor authenticatie. Communicatie vindt plaats via een gedecentraliseerd netwerk van providers zonder enkelvoudig faalpunt, en het apparaat verkrijgt onafhankelijk informatie van het blockchain-netwerk om uit te voeren of gegevens op afstand te verzenden. Zo biedt Robonomics een hoog niveau van apparaatbeveiliging en privacy van gebruikersgegevens in alle communicatiestadia, van de gebruikersapplicatie tot de lancering van het slimme apparaat.",
  "From smart contracts to cross chain IoT platform": "Van slimme contracten tot een cross-chain IoT-platform",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Het Robonomics-project is meer dan 6 jaar oud. We begonnen ons voor te bereiden op het eerste experiment waarin mens-machine communicatie werd gedemonstreerd met behulp van een onafhankelijk gedecentraliseerd provider-netwerk in 2015, vanaf de vroege dagen van het Ethereum-netwerk. Begin 2021 slaagde het projectteam erin een techno-economisch machinecommunicatieprotocol te creëren dat draait op Ethereum en IPFS, en het aan te vullen met elementen van een cloudgebaseerd IoT-platform op basis van de Polkadot parachain.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Als gevolg hiervan hebben we vandaag de dag al een hybride platform voor het creëren van futuristische IoT-toepassingen die interactie mogelijk maken met apparaten onder controle van een wereldwijde gedecentraliseerde computer.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "De makers van Robonomics zijn experimenteerders, ingenieurs en wetenschappers die zich bekommeren om het begrijpen van de wetenschappelijke geldigheid van de aanpak en het bereiken van duidelijkheid bij het presenteren van de principes die de basis moeten vormen van de gehele architectuur van de softwareoplossing.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "In onze artikelen tussen 2017 en 2020 hebben we de wetenschappelijke gemeenschap veel concepten en oplossingen gepresenteerd die verenigd zijn rond het idee van de robot-economie, een economisch systeem waarin robotische apparaten optreden als onafhankelijke agenten die in staat zijn om belangrijke economische activiteiten uit te voeren die voorheen voorbehouden waren aan mensen. U kunt de wetenschappelijke artikelen lezen op",
  "this link": "deze link",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "We willen de opkomst van de robot-economie rechtvaardigen en in algemene termen uitleggen waarom we geloven dat dit concept het onvermijdelijke en voor de hand liggende antwoord is op het functioneren van grootschalige robotische systemen van de nieuwe industriële revolutie.",
  "Move towards the factory of the future": "Beweeg richting de fabriek van de toekomst",
  "Inspired by Ronald Coase": "Geïnspireerd door Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "De Nobelprijswinnaar in de economie Ronald Coase heeft in zijn werk uit 1937 'The Nature of the Firm' het dichotomie 'hiërarchie vs vrije markt' het beste gedemonstreerd en een verklaring gegeven voor het bestaan van organisaties, met name bedrijven. Coase bespreekt de impact van transactiekosten (de kosten van het verzamelen en verwerken van informatie) om beslissingen te nemen over het sluiten van een contract en om de uitvoering ervan te controleren. Het bedrijf, met al zijn hiërarchische extra-marktstructuur, wordt gevormd als de meest efficiënte manier om de consument het gewenste product te bieden met de laagste transactiekosten op het moment dat de transactie-inspanning om hetzelfde product te creëren via meerdere uitwisselingen op de markt tussen individuen veel hoger wordt. Om dit proces het beste te visualiseren, kijk naar het illustratieve voorbeeld van het kopen van een auto. Probeer een auto te kopen door de onderdelen en bereken hoeveel geld en tijd je alleen al kwijt bent om alle componenten in je garage te monteren. De risico's en onderhandelingskosten van het kopen van onderdelen zijn te hoog in vergelijking met de kant-en-klare Tesla Model X.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Desalniettemin leidt dit niet tot het ontstaan van het enige bedrijf ter wereld voor de productie van alles. Het punt is dat dezelfde transactiekosten ook beperkingen opleggen aan de omvang van bedrijven. Coase schrijft:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "\"...een bedrijf zal geneigd zijn uit te breiden totdat de kosten van het organiseren van een extra transactie binnen het bedrijf gelijk worden aan de kosten van het uitvoeren van dezelfde transactie via een uitwisseling op de open markt...\"",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Met andere woorden, hoe complexer de hiërarchie binnen het bedrijf, hoe hoger de interne kosten, en op een bepaald punt blijken ze buitensporig te zijn in vergelijking met de kosten van terugkeer naar de markt. Daarom zoeken ondernemers naar manieren om deze kosten te verlagen om hun groei als een van de drijfveren te waarborgen.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Het idee om transactiekosten te verlagen door de mogelijkheid van alle deelnemers aan het bedrijfsproces (productie, logistiek, consumptie) om op een nauwer niveau samen te werken, komt duidelijk overeen met de problemen en uitdagingen waarmee fabrikanten van automatiseringsoplossingen worden geconfronteerd. In de afgelopen 50 jaar zijn de standaard/reguliere activiteiten van de meeste bedrijfsprocessen van grote bedrijven vrijwel volledig geautomatiseerd. De fabrikanten zijn in wezen belast met de taak om een veilige communicatie op te bouwen tussen volledig geautomatiseerde onderdelen van de toeleveringsketen, en deze taak vormt een belemmering voor verdere verlaging van transactiekosten door automatisering. De wens om meer concurrerende producten of diensten op de markt te brengen in vergelijking met gedeeltelijk geautomatiseerde bedrijven stimuleert de zoektocht naar oplossingen voor deze uitdagingen. Het lijkt erop dat alles erop gericht is dat robofirma's ontstaan - organisaties waarin de hele bedrijfscyclus volledig geautomatiseerd is en geen menselijke tussenkomst vereist, behalve als begunstigden en consumenten.",
  "clearly correlates": "Afscheid nemen van transactiekosten",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "Onze toekomst in slimme steden",
  "firms spurs the search for solutions to": "De taak waar automatiseringsfabrikanten vandaag de dag voor staan, heeft een specifieke naam - de bouw van cyber-fysieke systemen (afgekort als CPS). Volgens de definitie is een CPS een sterke vereniging en wederzijdse integratie van meerdere computationele, netwerk- en fysieke processen.",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "De taken van het bouwen van CPS zijn essentieel voor elk idee dat wordt beschreven in de nieuwe (vierde) industriële revolutie. Daarom is CPS de hoeksteen van ons toekomstige leven in slimme steden, die zich overal manifesteren. Voorbeelden van cyber-fysieke systemen van de toekomst zijn: Uber-autopiloot, drone-selfies, netwerk van 3D-printers op metrostations.",
  "Get rid of transaction costs": "CPS is een complexe structuur van veel verbonden elementen: van de app op de telefoon strekt het zich uit tot het controleren van de drone tijdens de vlucht over de stad, en gaat dan verder met het publiceren van de resulterende foto's op Instagram, maar pas na verwerking door cloud AI.",
  "Our future in smart cities": "Het belangrijkste bij het ontwerpproces van CPS is het vinden van de juiste balans tussen voldoende en overmatig aantal geautomatiseerde elementen in de servicegebruikersketen. Met andere woorden, waar ligt de groottegrens van de CPS? Om deze vraag te beantwoorden, moeten we ons wenden tot de beroemde wiskundige Norbert Wiener.",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Zelfregulerende systemen",
  "definition,": "Geïnspireerd door Norbert Wiener",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "In 1948 publiceerde Norbert Wiener, een professor in de wiskunde aan het MIT, een van de meest baanbrekende werken 'Cybernetics: Or Control and Communication in the Animal and the Machine'. Hij gebruikte voor het eerst de term 'cybernetica' als zelfregulerende mechanismen en daarom wordt deze publicatie beschouwd als een erkende cybernetische verjaardag.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Norbert Wiener spreekt over de levensvatbaarheid van een interdisciplinaire wetenschappelijke benadering. Hij trok bijvoorbeeld parallellen tussen geautomatiseerde controlesystemen en uitdagingen van schaalvergroting en toenemende complexiteit van de menselijke samenleving.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "Met andere woorden, de cybernetische benadering kan evenzeer worden toegepast op psychotherapie, biologie en geautomatiseerde navigatie. Het is gebaseerd op de functie van het systeem, hoe de individuele acties worden gecontroleerd en hoe de individuele knooppunten met elkaar communiceren.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Rekening houdend met de publicaties van Ronald Coase en Norbert Wiener, bij het volgen van de ontwikkeling van Industrie 4.0, kunnen we overwegen om CPS te gebruiken als een economische agent bij het ontwerpen van gerobotiseerde diensten. Om de omvang van de CPS te reguleren en aan te passen aan de veranderende behoeften van individuen, kunnen we marktmechanismen gebruiken.",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "En wat zo wetenschappelijk interessant is, uitgaande van het idee van de beperkingen die de markt oplegt aan de omvang van het bedrijf, kunnen we zeggen dat de limiet van de groei van CPS altijd bepaald zal worden door de markt en er niets anders voor nodig is.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Robofirma's zijn een ideale representatie voor cyber-fysieke systemen. Ze zijn een redelijk autonome eenheid die in staat is om diensten te verlenen aan zowel mensen als andere robots tegen betaling. Als gevolg hiervan lijkt de robot-economie voor ons een algemene set van CPS's te zijn die direct diensten en goederen aan de markt leveren.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Geld voor robots",
  "Industry 1.0": "Industrie 1.0",
  "Mechanization:": "Mechanisatie:",
  "replacement of muscle power with steam energy.": "vervanging van spierkracht door stoomenergie.",
  "1784 y.": "1784 n.C.",
  "Industry 2.0": "Industrie 2.0",
  "Electrification:": "Elektrificatie:",
  "introduction of assembly-line production.": "introductie van assemblagelijnproductie.",
  "1870 y.": "1870 n.C.",
  "Industry 3.0": "Industrie 3.0",
  "Automation:": "Automatisering:",
  "introduction of automated systems with CNC.": "introductie van geautomatiseerde systemen met CNC.",
  "1969 y.": "1969 n.C.",
  "Industry 4.0": "Industrie 4.0",
  "Smart production:": "Slimme productie:",
  "development of cyber physical systems.": "ontwikkeling van cyber-fysieke systemen.",
  "Now": "Nu",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "In de wereld van robofirma's blijkt het natuurlijk te zijn om robots toegang te geven tot sociale instellingen die voorheen alleen nodig waren voor mensen.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Sociale instellingen ontstaan niet omdat mensen niet zonder banken, contracten en andere instrumenten van de samenleving kunnen leven. Ze ontstaan alleen omdat een persoon op een bepaald moment op het pad van complexere relaties in de samenleving is gestapt en een belangrijke stap heeft gezet in het versnellen van de omringende processen.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Geld en contracten zouden beschikbaar moeten worden gesteld aan robots, niet omdat dit een zieke fantasie is van robotfans die vergeten zijn wat Skynet is. Maar alleen omdat de nieuwe industriële revolutie zichzelf tot taak stelt om complexe geautomatiseerde ketens te bouwen, waarvan de processen zowel technische informatie als economische informatie zullen beïnvloeden, en ook zullen verlopen met een snelheid die voor mensen onbereikbaar is.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Het belangrijkste in het ontwerpproces van CPS is het vinden van de juiste balans tussen voldoende en overmatig aantal geautomatiseerde elementen in de servicegebruikersketen. Met andere woorden, waar ligt de groottegrens van CPS? Om deze vraag te beantwoorden, moeten we ons wenden tot de beroemde wiskundige Norbert Wiener.",
  "Self-regulating systems": "Zelfregulerende systemen",
  "Inspired by Norbert Wiener": "Geïnspireerd door Norbert Wiener",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "In 1948 publiceerde Norbert Wiener, een professor in de wiskunde aan het MIT, een van de meest baanbrekende werken \"Cybernetics: Or Control and Communication in the Animal and the Machine\". Hij gebruikte de term \"cybernetica\" voor het eerst als zelfregulerende mechanismen en daarom wordt deze publicatie beschouwd als een erkende cybernetische verjaardag.",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener spreekt over de levensvatbaarheid van een interdisciplinaire wetenschappelijke benadering. Hij trok bijvoorbeeld parallellen tussen geautomatiseerde controlesystemen en de uitdagingen van schaalvergroting en toenemende complexiteit van de menselijke samenleving.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Met andere woorden, de cybernetische benadering kan evenzeer worden toegepast op psychotherapie, biologie en geautomatiseerde navigatie. Het is gebaseerd op de functie van het systeem, hoe de individuele acties worden gecontroleerd en hoe de individuele knooppunten met elkaar communiceren.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Een van de voorbeelden van onze experimenten: onderhandelen over ruimte op de weg en betalingen voor voorrang voor autonome voertuigen om congestie te verminderen. Wat een persoon absoluut niet zou doen in het verkeer, zal de auto voor u doen zonder moeilijkheden: u wilt van rijbaan wisselen, uw auto en de auto van uw buurman wisselen aanbiedingen uit over de kosten van zo'n operatie met een snelheid van honderden berichten per seconde, ze zullen een evenwichtsprijs onthullen, en zo bevindt u zich al in de volgende sneller bewegende rijbaan. Dit betekent dat het nu mogelijk wordt om uw rit met Uber te 'betalen' en sneller te maken.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Robots hebben geld nodig dat direct beschikbaar is om operaties uit te voeren zonder een persoon op de snelheid waarmee alleen machines beslissingen kunnen nemen. En dit alles is uitsluitend bedoeld om een persoon te laten genieten van het leven in de Slimme Stad!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "En hier komen we soepel bij de eerste elektronische cash - Bitcoin. Het feit dat Bitcoin kan worden opgeslagen op uw account volgens het principe van niet een bank, maar contant geld in uw portemonnee, maakt het de eerste geldsoort die de robot zelfstandig kan beheren, nauwkeuriger gezegd autonoom. Tegelijkertijd kunnen we vandaag al zeggen dat Bitcoin niet alleen elektronisch geld is, maar een werkelijk wereldwijde financiële instelling.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Als resultaat: een gebeurtenis die niet door ons is bedacht, maar duidelijk past in onze visie, maakt Bitcoin het eerste geld voor robots, of, als we nog dieper kijken, is het precies die sociale instelling die zal helpen bij de vorming van robotbedrijven.",
  "Smart contracts": "Smart contracts",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin werd het eerste geld dat beschikbaar is voor robots. Ondertussen kunnen we niet praten over Bitcoin in zijn huidige vorm als een instrument voor volwaardige technische en economische uitwisseling.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Nu hebben we al slimme contracten, DeFi-markten en een gedecentraliseerde infrastructuur voor het uitwisselen van berichten tussen robots, die de mogelijkheid bieden voor de mensheid om een volledig geautomatiseerd deel van de menselijke economie te creëren - de robot-economie.",
  "One of the great opportunity to build the economy of robots is": "Een van de geweldige kansen om de economie van robots op te bouwen is technologie. Met de functionaliteit van Ethereum kunnen robots niet alleen geld uitwisselen, maar ook contracten aangaan met mensen en onderling.",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Maar wat is het nut van machine-naar-machine (m2m) contractgebaseerde communicatie? Dat is een geweldige vraag! Laten we teruggaan naar CPS. Wanneer we praten over directe communicatie tussen sensoren, machineapparatuur of andere elementen, praten we nog steeds over samenwerking binnen één gereguleerd systeem. Maar als we willen dat slimme stadsdiensten levend zijn (of zelfs slimme woning in sommige gevallen), moeten we communicatie tot stand brengen met verschillende externe elementen.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Laten we ons een dronebezorgservice voorstellen. Als een drone bijvoorbeeld eigendom is van DHL, hoe kan het dan toegang krijgen tot de magazijnen van Amazon of toegang krijgen tot het hele luchtruim van de stad? Wordt het een monopolie? Dit is een grote uitdaging voor veel initiatieven van de vierde industriële revolutie!",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "De meeste bedrijven zeggen dat ze bijna volledige rechten nodig hebben voor hun omgeving, omdat ze niet weten hoe ze veilig de uitwisseling van technische informatie tussen geautomatiseerde systemen buiten hun eigen interne bedrijfsstructuur kunnen opzetten. Tegelijkertijd, als we kijken naar de processen waarin een persoon werkt, zien we dat de samenwerking van verschillende bedrijven al lang en succesvol bestaat. U kunt gemakkelijk deur-tot-deur levering van gekochte goederen bestellen op de website van Amazon, en de koerier kan met een auto over stadsstraten rijden, een bestelling in het magazijn ontvangen en deze bij u brengen.",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Wat is het verschil? In het eerste geval is er geen manier om een contractuele relatie tussen machines op te bouwen, en in het tweede geval, in de wereld van mensen, bestaan contractuele relaties al.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Wat is het verschil? In het eerste geval is er geen manier om een contractuele relatie tussen machines op te bouwen, en in het tweede geval, in de wereld van mensen, bestaan er al contractuele relaties.",
  "Parachains": "Parachains",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Het belangrijkste probleem waarmee Robonomics vandaag de dag te maken heeft, is de hoge prijs voor het lanceren van een IoT-apparaat met behulp van Ethereum. Bij Ethereum moet je een commissie betalen voor elke transactie in termen van Amerikaanse dollars in het bereik van $10 tot $100. Het is behoorlijk duur voor de meeste gevallen uit de echte economie, of het nu gaat om een carsharing-trip, het huren van een slim appartement, dronebezorging of het 3D-printen van je favoriete anime-held om te bestellen.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Uit eerlijkheid willen we opmerken dat er winstgevende scenario's zijn, zelfs met transactiekosten in het Ethereum-netwerk van 2018 - 2019. Bijvoorbeeld, geautomatiseerde transacties voor het compenseren van de CO2-voetafdruk of het rechtstreeks overbrengen van de bestelling van de website naar de productie. Maar toch is er voor de massale toepassing van Web3-technologieën op het gebied van IoT een verlaging van de prijs nodig die de cloud in rekening brengt voor het verbonden apparaat.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Op zoek naar een mogelijkheid om de kosten van interactie met een IoT-apparaat te verlagen, hebben de ontwikkelaars van Robonomics alternatieve ontwikkelingen voor Ethereum bestudeerd. Onze keuze viel op de",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "architectuur, die ons in staat zou stellen onze eigen blockchain uit te voeren, binnen een gemeenschappelijk netwerk, waarbij de beveiliging wordt gewaarborgd door validators die onafhankelijk zijn van ons project.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Heterogene Blockchain Network",
  "Homogeneous Shard Network": "Homogene Shard Network",
  "On-chain protocol control": "On-chain protocol control",
  "Protection against the tyranny of the crowd": "Bescherming tegen de tirannie van de menigte",
  "Auction of bandwidth in the common network": "Veiling van bandbreedte in het gemeenschappelijke netwerk",
  "Payment for gas by users": "Betaling voor gas door gebruikers",
  "Have you read this?": "Heb je dit gelezen?",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Geweldige boeken leiden tot geweldige ideeën. Als je op zoek bent naar meer inspiratie over communicatie tussen mens en machine, probeer dan sciencefictionboeken te lezen. Markeer de boeken die je al hebt gelezen en kijk wat we nog meer kunnen bieden voor verdere reflectie.",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "I, Robot",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "The Bicentennial Man",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionettes, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Open vragen over teleologie",
  "and a treatise by L. von Mises": "en een verhandeling van L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Tot slot willen we vragen noemen die vanuit een mondiaal perspectief open blijven. Wat is het doel van robots?",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "In feite wordt de economie van mensen vaak geassocieerd met het gewetensvol uitvoeren van taken binnen het kader van het contract, de wens van de partijen om een resultaat te bereiken, het opportunistische en altruïstische gedrag van het individu in de samenleving. Al deze principes zijn moeilijk toe te passen op de robot-economie. Wat zijn de motieven van de robot-economie? Het is een open vraag die we moeten onderzoeken en bespreken in de samenleving voor een beter begrip en toepassing van robots.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Voor het begin stellen we voor om te kijken naar het werk van Mises \"Human Action: A Treatise on Economics\" (praxeologische benadering) en naar het vroege artikel van Norbert Wiener \"Behavior, Purpose and Teleology\" (teleologische visie).",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Praxeologie inspireert ons met interessante ideeën over menselijk gedrag zonder directe afhankelijkheid van de doelen. Dit geeft ons de mogelijkheid om te werken aan de processen van de economie van robots conditioneel als met een black box zonder in te gaan op de uiteindelijke doelen. Tegelijkertijd stelt teleologie ons voor de uitdaging om oorzaken te verklaren.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "We hopen dat ergens op het snijvlak van het werk van Mises en Wiener een punt voor verdere ontwikkeling van de robot-economie kan worden gevonden, niet alleen als een protocol van interactie tussen mensen en machines van praxeologische aard, maar rekening houdend met de teleologische elementen van het opbouwen van intersoortelijke communicatie.",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Deze studie-informatie is verlopen. Voor actuele lessen en workshops bezoek onze",
  "academy": "academie",
  "Developing Robonomics Middleware for ROS 2:": "Ontwikkeling van Robonomics Middleware voor ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Dit speelt een belangrijke rol bij het zorgen voor naadloze integratie van Robonomics in verschillende multi-agent robotica systemen met behulp van ROS 2. Het kan de integratie van robots in Web 3 blockchain technologieën vergemakkelijken en tegelijkertijd fouten verminderen tijdens het integratieproces, waardoor zowel tijd als kosten worden bespaard.",
  "Creating a robotics lab with ROS 2:": "Het creëren van een robotica lab met ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Nu ROS 2 populairder wordt in de robotica gemeenschap, zijn we enthousiast om meer robots en hardware te zien werken met ROS 2. Ons doel is om ze te verbinden met het Web3 ecosysteem met behulp van Robonomics.",
  "Home assistant themes": "Home assistant-thema's",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Pas je Home Assistant aan met onze gratis te gebruiken thema's. Volg de instructies voor installatie op",
  "Do you want": "Wil je nog",
  "to dive even deeper?": "dieper duiken?",
  "Our": "Ons",
  "White Paper": "Witboek",
  "Science": "Wetenschap",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "We denken dat het lezen van boeken je geest echt kan openen. Of het nu gaat om eenvoudige maar slimme ideeën of meer complexe, boeken zijn de beste manier voor je brein om alles op te nemen. Je kunt onze boeken gratis downloaden en onze lijst met aanbevolen boeken bekijken om je onder te dompelen in de spannende wereld van robotica!",
  "Download books about Robonomics": "Download boeken over Robonomics",
  "Open your mind [list of recommendations]": "Open je geest [lijst van aanbevelingen]",
  "Robonomics R&D": "Robonomics R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Robot economie",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": " Grijp je merchandise met unieke Robonomics-kunst geschilderd door onze prachtige meiden. We hebben winkels gemaakt op de grootste online markten voor kunstenaars, bekijk het en vind t-shirts, longsleeves, hoodies, douchegordijnen, kussens, dekens en andere handige spullen.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "We hebben het meest bekende robotica-framework genaamd Robot Operating System (ROS) gekozen als de standaard interface voor het integreren van elk compatibel cyber-fysiek systeem. Robonomics ondersteunt verschillende toepassingen voor ROS. De implementatie van Robonomics voor het Ethereum-netwerk is in de vorm van het ROS-pakket robonomics_comm. Voor de ROS 2-architectuur implementeren we ondersteuning voor Robonomics als een tussenlaag (zie «Robonomics als ROS 2 Middleware» voor details). Wanneer het gebruik van ROS overbodig is (bijvoorbeeld bij het werken met IoT-apparaten), is er een Python robonomics-interface module ontwikkeld. Het helpt om toegang te krijgen tot de functies van Robonomics op een native manier en werkt met zowel lokale en private als externe en openbare nodes.",
  "read our almanac": "lees onze almanak",
  "Begin your adventure in the world of cyberpunks": "Begin je avontuur in de wereld van cyberpunks",
  "Pure open source": "Pure open source",
  "Local and Global Availability": "Lokale en wereldwijde beschikbaarheid",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Door gebruik te maken van open source, P2P en Web3 is er geen ruimte voor bedrijfstrucs, waardoor je persoonlijke gegevens beschermd zijn. Alle informatie wordt lokaal opgeslagen of versleuteld met je persoonlijke sleutel in de Web3-cloud.",
  "Interested in how the team reached this stage?": "Geïnteresseerd in hoe het team dit stadium heeft bereikt?",
  "The Robonomics Timeline": "De Robonomics-tijdlijn",
  "can guide you through our journey": "kan je door onze reis leiden",
  "Device Design and Development": "Apparaatontwerp en -ontwikkeling",
  "Smart devices": "Slimme apparaten",
  "Wearable merch": "Draagbare merch",
  "Academy": "Academie",
  "Wiki": "Wiki",
  "Science & White paper": "Wetenschap & White paper",
  "Tokenomics": "Tokenomics",
  "Cases": "Gevallen",
  "Brand assets": "Merkassets",
  "Wallpapers": "Achtergronden",
  "NFT": "NFT",
  "Blog": "Blog",
  "Contacts": "Contacten",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Word een leverancier van milieugegevens voor uw vrienden en buren in de omgeving. Toegang tot echt gedecentraliseerde metingen van luchtkwaliteit, geluid, temperatuur en andere milieutoestanden op de sensorkaart.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "De meest open-source slimme thuisserver, aangedreven door RISC-V, met een Web3-cloud die Google-servers onder de motorkap vervangt.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Slimme WI-FI MQTT-apparaten met open-source firmware Tasmota op het bord volledig compatibel met Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Verbind uw slimme huis en slimme kleding met de Hikikomori om sensorgegevens te monitoren - letterlijk binnen handbereik.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Ontmoet slimme apparaten en futuristische hardware van een autonoom team met uitgebreide expertise in robotica, blockchain en IoT",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "Gegevensverwerking is altijd een gevoelige kwestie. Daarom bieden we een volledig open-source",
  "connectivity module": "connectiviteitsmodule",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Robonomics heeft drie Connectiviteit hubs opgezet om een stabiele verbinding te garanderen. Deze optie is standaard ingeschakeld op het station.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Je kunt je eigen hub lanceren om gegevens te ontvangen van Altruist Civil Station en verder te verwerken.",
  "Steps to set up your Connectivity": "Stappen om je Connectiviteit in te stellen",
  "Deploy Connectivity": "Implementeer Connectiviteit",
  "Technical requirements:": "Technische vereisten:",
  "2 CPU cores;": "2 CPU-cores;",
  "4 GB RAM;": "4 GB RAM;",
  "40 GB storage;": "40 GB opslag;",
  "Static IP": "Statisch IP",
  "Than set up": "Stel vervolgens in",
  "and follow": "en volg",
  "the instructions": "de instructies",
  "Connect a station to your connectivity": "Verbind een station met uw connectiviteit",
  "Open your sensor settings by its IP.": "Open uw sensorinstellingen op basis van het IP-adres.",
  "Go to APIs settings": "Ga naar API-instellingen",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Vink het selectievakje aan om gegevens naar aangepaste API te verzenden en vul de overeenkomstige velden in (server-IP, poorten, enz.).",
  "Join with your setup to global map (optional)": "Voeg uw setup toe aan de wereldkaart (optioneel)",
  "If you want to publish data to": "Als u gegevens wilt publiceren op",
  "the global map": "de wereldkaart",
  "you need to make two pull requests:": "moet u twee pull-verzoeken doen:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Voeg het IPFS-ID van uw Connectiviteit toe aan de agentenlijst van de sensorkaart:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Voeg het parachain-adres van uw Connectiviteit toe aan de sjabloonagentenlijst van de server voor langdurige opslag:",
  "Steps for launching your own map": "Stappen voor het lanceren van je eigen kaart",
  "Deploy web interface": "Implementeer een webinterface",
  "Fork the map repository:": "Fork de kaartrepository:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Bewerk de instellingen om je kaart aan te passen, inclusief het domein, de provider, het startpunt en je connectiviteits-IPFS-ID voor de lijst met agenten.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Implementeer je eigen versie van de webinterface en begin met het ontvangen van realtime gegevens van je sensor.",
  "Full guide here:": "Volledige handleiding hier:",
  "Launch long-term storage": "Start langdurige opslag",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Alleen gegevens verzamelen van sensoren is niet genoeg; het moet verwerkt worden. Pas een server aan voor het verzamelen van sensorgegevens op basis van open-source node.js software",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "en krijg je eigen werkende server voor langdurige opslag van kaartgegevens.",
  "Static IP.": "Statisch IP.",
  "Steps for launching a storage:": "Stappen voor het starten van een opslag:",
  "Fork the RoSeMAN repository:": "Fork de RoSeMAN repository:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Kies Docker of Node.js (vereist MongoDB database) versie.",
  "Add a parachain address of your Connectivity to agents list.": "Voeg een parachain adres van je Connectiviteit toe aan de agentenlijst.",
  "Run the project.": "Voer het project uit.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "De eerste server voor een slim huis die volledig is gebouwd op open-source - van CPU tot gedecentraliseerde cloud.",
  "Processor:": "Processor:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 met RISC-V 4-core CPU, 2 MB L2-cache, tot 1,5 GHz, RV64GC ISA-ondersteuning",
  "GPU:": "GPU:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, tot 600 MHz",
  "Memory:": "Geheugen:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 GB LPDDR4 SDRAM, tot 2800 Mbps",
  "Storage:": "Opslag:",
  "32 GB TF card (minimum)": "32 GB TF-kaart (minimum)",
  "Interfaces:": "Interfaces:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2x Gigabit Ethernet-poorten, 4x USB 3.0 Type-A-poorten, 40-pins GPIO-header, M.2-connector, eMMC-socket, 2-pins ventilatorheader",
  "Power:": "Vermogen:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5V DC via USB-C, tot 30 W (minimum 3 A) of 5V-ingang via 40-pins GPIO",
  "OS:": "OS:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Home Assistant Core Installatie",
  "Robonomics Integration Installation": "Robonomics Integratie Installatie",
  "Zigbee Devices in Zigbee2MQTT": "Zigbee-apparaten in Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Voeg RoSeMAN-domein toe aan externe provider van kaarten.",
  "All hardware": "Alle hardware",
  "Use it": "Gebruik het",
  "Learn": "Leer",
  "Explore website": "Verken de website",
  "Timeline since 2015": "Tijdlijn sinds 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "Het team verwerft nieuwe vaardigheden in het ontwerpen en programmeren van slimme apparaten vanaf de basis. De",
  "sensors.social": "sensoren.social",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "Een netwerk waar testapparaten ontwikkeld door Robonomics ingenieurs opereren, is gecreëerd. Er is ook een lijn van slimme thuisapparaten ontwikkeld op basis van Tasmota Wi-Fi, en sinds de zomer van 2024 ondergaat deze lijn certificering voor de EU-markt. In de herfst van 2024 zal het projectteam een lijn van open-source apparaten introduceren die worden aangedreven door Web3-technologieën, onder de naam \"Hardware for Cryptopunks.\"",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Robonomics blijft groeien binnen het Polkadot-ecosysteem. De Kusama-netwerk parachain draait al meer dan twee jaar, en vanaf de herfst van 2024 zal er ook een parachain worden gelanceerd op het Polkadot-netwerk. Meer dan 5 miljoen transacties van gebruikersapparaten zijn geregistreerd op het netwerk. Het team blijft mogelijkheden verkennen voor het integreren van hun implementaties over zowel Ethereum als Polkadot.",
  "Robo Smart Devices:": "Robo Smart Devices:",
  "Read books": "Lees boeken",
  "Robonomics merch": "Robonomics merchandise",
  "Desktop": "Bureaublad",
  "Smartphone": "Smartphone",
  "our robo art wallpapers": "onze robo-kunst wallpapers",
  "Space monkey devcon 2024 special": "Space monkey devcon 2024 speciaal",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Download deze afbeelding naar uw apparaat en doe mee aan onze speciale Devcon 2024 zoektocht op spannende locaties rond Bangkok!",
  "Free Wallpapers for you from our artists": "Gratis wallpapers voor u van onze artiesten",
  "Hide your folder with secret wallpaper": "Verberg uw map met geheime wallpaper",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "We hebben geheime wallpapers speciaal voor u gemaakt! Download de achtergrond en map pictogrammen, en uw mappen zullen naadloos opgaan in uw startscherm - waardoor alleen prachtige kunst zichtbaar is.",
  "Desktop background": "Bureaublad achtergrond",
  "Mac OS icons": "Mac OS pictogrammen",
  "Windows icons": "Windows pictogrammen",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Een niet-invasief apparaat voor installatie in elektrische panelen met DIN-railmontage. Gebouwd op de Espressif ESP32C6-chip met open RISC-V-architectuur.",
  "Sign up for updates": "Meld je aan voor updates",
  "Hardware for cyberpunks": "Hardware voor cyberpunks",
  "Tech Blog & Updates": "Tech Blog & Updates",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Deel en krijg toegang tot geluids-, stof- en temperatuurgegevens van andere onafhankelijke sensoren in de buurt. Vergeet bedrijfsservers - deze gegevens worden veilig wereldwijd gedistribueerd via innovatieve Web3-technologie.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Ervaar de kracht van ware DePIN (Decentralized Physical Infrastructure Network) - een revolutionaire technologische beweging die tot leven is gebracht en al jaren gedijt op onze",
  "decentralized sensor map": "gedecentraliseerde sensor kaart",
  "3 ways to use it": "3 manieren om het te gebruiken",
  "Check open-source sensor firmware on GitHub": "Controleer open-source sensorfirmware op GitHub",
  "Operate your own Data Server": "Bedien uw eigen dataserver",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "waardoor u de vrijheid heeft om te kiezen welke servers u wilt gebruiken voor verwerking. Geen eigen clouds, geen verborgen code.",
  "Keep in mind, you can join the": "Onthoud, je kunt je aansluiten bij de",
  "global decentralized sensor map": "wereldwijde gedecentraliseerde sensor kaart",
  "even with a sensor connected through your own server!": "zelfs met een sensor aangesloten via je eigen server!",
  "Run your own Interactive Map": "Voer uw eigen interactieve kaart uit",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Hou je van het idee van een gedecentraliseerde kaart maar wil je het aanpassen met extra lay-outs en beheerder worden van nieuwe soevereine sensorinfrastructuur? U kunt uw eigen versie implementeren door onze",
  "your own version by forking": "open-source code op GitHub te forken",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "(zorg ervoor dat u het licentietype controleert). Vergeet niet om open-source bronnen verantwoord te gebruiken.",
  "Device Specifications": "Apparaatspecificaties",
  "Input Voltage:": "Ingangsspanning:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Hz",
  "Wireless protocol:": "Draadloos protocol:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Ondersteunt 2,4 GHz Wi-Fi 6 (802.11 b/g/n) en Bluetooth 5 (LE), Zigbee met ingebouwde antenne",
  "Equipped with a high-performance": "Uitgerust met een krachtige",
  "32-bit RISC-V processor": "32-bits RISC-V processor",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "met een kloksnelheid tot 160 MHz, en een energiezuinige 32-bits RISC-V processor met een kloksnelheid tot 20 MHz",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320KB ROM, 512KB HP SRAM, 16KB LP SRAM en 4MB Flash-geheugen",
  "USB-C": "USB-C",
  "for firmware development and updates": "voor firmware-ontwikkeling en updates",
  "PM sensor:": "PM-sensor:",
  "SDS011 laser PM2.5/PM10 sensor": "SDS011 laser PM2.5/PM10-sensor",
  "Supported sensors:": "Ondersteunde sensoren:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X, BME280, HTU21D; Geluidsniveausensor: I2S INMP441; Geigerteller: Radsens.",
  "Help & support": "Hulp & ondersteuning",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "Met de gedecentraliseerde kaart van Robonomics kunt u Robonomics Connectiviteit gebruiken of uw eigen Connectiviteitsdienst maken.",
  "Your own Connectivity": "Uw eigen Connectiviteit",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Een slimme thuisassistent waar u voor zult zorgen, zelfs als u weg bent. Alleen voor ontwikkelaars.",
  "Robonomics open-source hardware": "Robonomics open-source hardware",
  "Open-source hardware": "Open-source hardware",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Ervaar de kracht van ware DePIN (Decentralized Physical Infrastructure Network) - een revolutionaire technologische beweging tot leven gebracht en bloeiend met Robonomics",
  "Home server with Web3 cloud": "Thuisserver met Web3-cloud",
  "Home server on RISC V": "Thuisserver op RISC V",
  "Supports": "Ondersteunt",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "2.4GHz Wi-Fi 6 (802.11 b/g/n) en Bluetooth 5 (LE), met aan boord antenne",
  "Built in": "Ingebouwd",
  "Onboard": "Aan boord",
  "1.47inch LCD display, 172x320 resolution, 262K color": "1.47inch LCD-display, 172x320 resolutie, 262K kleur",
  "Adapting": "Aanpassen",
  "integrates": "integreert",
  "full-speed USB-С port": "USB-С-poort op volle snelheid",
  "Onboard TF card slot": "Aan boord TF-kaartsleuf",
  "for external TF card storage of pictures or files": "voor externe TF-kaartopslag van afbeeldingen of bestanden",
  "Supports accurate control": "Ondersteunt nauwkeurige controle",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "zoals flexibele klok en meerdere energiemodi om een laag stroomverbruik te realiseren in verschillende scenario's",
  "Built-in RGB LED": "Ingebouwde RGB LED",
  "with clear acrylic sandwich panel for cool lighting effect": "met helder acryl sandwichpaneel voor cool verlichtingseffect",
  "Battery Level Gauge": "Batterijniveaumeter",
  "Low-Power I2C Temperature sensor": "Low-Power I2C-temperatuursensor",
  "RV-3032-C7 Real-Time Clock Module": "RV-3032-C7 Real-Time Clock Module",
  "Battery 180mA": "Batterij 180mA",
  "Measuring Range:": "Meetbereik:",
  "0.1-80A": "0.1-80A",
  "Wireless Protocol:": "Draadloos protocol:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)",
  "CPU:": "CPU:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "ESP32-S3 MCU-gebaseerd systeem op een chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), tot 240 MHz",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 KB ROM, 520 KB SRAM, 8 MB FLASH",
  "for development and updates": "voor ontwikkeling en updates",
  "To configure the device, please visit:": "Om het apparaat te configureren, ga naar:",
  "multiple IO interfaces,": "meerdere IO-interfaces,",
  "Get updates about smart devices": "Ontvang updates over slimme apparaten",
  "Receive regular emails from Robonomics": "Ontvang regelmatig e-mails van Robonomics",
  "Thanks for your submission!": "Bedankt voor uw inzending!",
  "Not submitted": "Niet ingediend",
  "Notify me when available": "Meld mij wanneer beschikbaar",
  "Captcha is not verified. Please, check your internet connection": "Captcha is niet geverifieerd. Controleer alstublieft uw internetverbinding",
  "Thanks for the submition!": "Bedankt voor de inzending!",
  "Submitting": "Indienen",
  "Submit": "Indienen",
  "Follow for latest news and important updates": "Volg voor het laatste nieuws en belangrijke updates",
  "The best way to check open-source project": "De beste manier om open-source projecten te controleren",
  "Useful, serious, cute videos, teasers etc.": "Handige, serieuze, schattige video's, teasers, enz.",
  "Chat for engineers and developers": "Chat voor ingenieurs en ontwikkelaars",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Onofficiële chat voor crypto-vrienden",
  "Rent in California, USA": "Huur in Californië, VS",
  "Available by the Hour, Day, or Week": "Beschikbaar per uur, dag of week",
  "Your name": "Jouw naam",
  "Your comment": "Jouw opmerking",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Door op deze knop te klikken, stemt u in met het ontvangen van een e-mail over de verhuur van de Unitree G1 Humanoid Robot.",
  "We'll get in touch shortly!": "We nemen binnenkort contact met u op!",
  "Contact me": "Neem contact met mij op",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Een slimme sensor die omgevingsgegevens verzamelt en integreert in een gedecentraliseerde sensor kaart.",
  "Smart Tamagotchi “Hikikomori“": "Slimme Tamagotchi 'Hikikomori'",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Een microcontroller-ontwikkelingsbord ontworpen om te integreren met Web3-systemen. Het kan uw slimme huistamagotchi zijn, een gamecontroller, een educatief hulpmiddel - alles wat u ontwerpt!",
  "Energy monitor with USB-C": "Energiemonitor met USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Een niet-invasief apparaat ontworpen voor DIN-railmontage in elektrische panelen, volgt elektriciteitsverbruik en -opwekking.",
  "Smart devices from Robonomics": "Slimme apparaten van Robonomics",
  "Our values": "Onze waarden",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Onze apparaten zijn ontworpen voor totale transparantie. Elk product wordt geleverd met een open RISC-V-processor, open-source code en schakelschema's, en lokale update-instructies - geen cloudverbindingen nodig. U bent in staat om uw technologie vanaf de basis te begrijpen, aan te passen en te vertrouwen",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "De combinatie van P2P-communicatie en Web3-cloud garandeert dat uw apparaten altijd verbonden zullen zijn. Geen internettoegang? U kunt nog steeds rechtstreeks verbinding maken met het apparaat. Verhuizen naar een nieuwe regio of op vakantie gaan? Uw apparaten blijven online en toegankelijk waar u ook bent",
  "Privacy by design": "Privacy by design",
  "Trust the Code": "Vertrouw op de code",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Volledig open-source, geen verborgen algoritmen, geen bedrijfsspionage. Het is transparantie voor de ware decentralist.",
  "Your data, your keys": "Uw gegevens, uw sleutels",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Neem volledige controle over uw gegevens met ons volledig open-source connectiviteitsmodule. Kies tussen Robonomics of veilige Web3-cloudopslag met uw persoonlijke sleutel - geen gesloten clouds, geen ondoorzichtige code.",
  "Always Connected, Always Secure": "Altijd verbonden, altijd veilig",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "Lokale P2P-communicatie en Web3-cloud zorgen ervoor dat uw sensor altijd toegankelijk is, waar u ook bent. Geen gecentraliseerde storingspunten - alleen pure, peer-to-peer verbinding.",
  "Join the Altruist Collective": "Sluit u aan bij het Altruist Collective",
  "Plug the device into the global,": "Sluit het apparaat aan op het wereldwijde,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Deel uw milieugegevens met uw buren, uw gemeenschap of uw gedecentraliseerde netwerk.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Uitgerust met USB-C ondersteunt WiFi en Zigbee. Registreert elektriciteitsverbruik en -opwekkingsgegevens in het Polkadot-netwerk met tussenpozen van 10 minuten.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori draait op een ESP32-C6 microcontroller-ontwikkelingsbord, heeft een LCD-display, Wi-Fi 6 en BLE 5-ondersteuning.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori is geschikt voor de snelle ontwikkeling van Web3-aangedreven IoT-toepassingen. Dit kan uw slimme huistamagotchi zijn, een gamecontroller, een educatief hulpmiddel - alles wat u ontwerpt!",
  "Unitree G1 Humanoid Robot": "Unitree G1 Humanoid Robot",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Huur de geavanceerde humanoïde robot voor uw onderzoeks-, programmeer- en entertainmentprojecten.",
  "Hour": "Uur",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Huur ter plaatse (Oakland, CA)",
  "Suitable for short tasks": "Geschikt voor korte taken",
  "No engineering support included": "Geen technische ondersteuning inbegrepen",
  "Day": "Dag",
  "$900": "$900",
  "Suitable for bigger tasks": "Geschikt voor grotere taken",
  "Basic engineering support included": "Basis technische ondersteuning inbegrepen",
  "Week+": "Week+",
  "On demand": "Op aanvraag",
  "Delivery to your location": "Levering op uw locatie",
  "Customized approach": "Aangepaste aanpak",
  "Engineering support can be included": "Technische ondersteuning kan worden toegevoegd",
  "Enter the new era": "Betreed het nieuwe tijdperk",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "De G1 humanoïde robot met zijn innovatieve functies biedt veelzijdigheid voor onderzoeks-, programmeer- en entertainmentbehoeften. De Unitree G1 bevat een Power Control Dexterous Hand, waardoor het delicate taken kan uitvoeren zoals het hanteren van objecten, knoppen indrukken en andere precieze bewerkingen uitvoeren met verschillende items.",
  "Tech specification": "Technische specificatie",
  "Height, Width and Thickness（Stand）": "Hoogte, breedte en dikte (standaard)",
  "1320x450x200mm": "1320x450x200mm",
  "Height, Width and Thickness（Fold）": "Hoogte, breedte en dikte (opgevouwen)",
  "690x450x300mm": "690x450x300mm",
  "Weight (With Battery)": "Gewicht (met batterij)",
  "About 35kg": "Ongeveer 35kg",
  "Arm Maximum Load": "Maximale belasting arm",
  "About 2Kg": "Ongeveer 2 kg",
  "Cooling System": "Koelsysteem",
  "Local air cooling": "Lokale luchtkoeling",
  "Smart Battery (Quick Release)": "Slimme batterij (snel loskoppelen)",
  "9000mAh": "9000mAh",
  "Charger": "Oplader",
  "54V 5A": "54V 5A",
  "Battery Life": "Batterijduur",
  "About 2h": "Ongeveer 2 uur",
  "Sensing Sensor": "Sensorische sensor",
  "Depth Camera+3D LiDAR": "Dieptecamera+3D LiDAR",
  "5W Speaker": "5W-luidspreker",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6, Bluetooth 5.2",
  "Manual Controller": "Handmatige controller",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Neem controle over uw slimme thuisgegevens met open-source thuisserver op RISC-V-processor en Web3-connectiviteit.",
  "Surveillance-free": "Surveillance-vrij",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Geen verborgen gegevenslogs op bedrijfsservers terwijl nog steeds veilige externe toegang mogelijk is.",
  "No vendor lock-in": "Geen leveranciersvergrendeling",
  "Supports over 3000 integrations with devices from various manufacturers.": "Ondersteunt meer dan 3000 integraties met apparaten van verschillende fabrikanten.",
  "Open hardware": "Open hardware",
  "Open processor architecture and open-source code ensure a trustless system.": "Open processorarchitectuur en open-source code zorgen voor een betrouwbaar systeem.",
  "Open and efficient hardware": "Open en efficiënte hardware",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Onze Home Server wordt aangedreven door een RISC-V processor en beschikt over volledig transparante schakelschema's van printplaten. RISC-V is een open en modulaire processorarchitectuur die wordt geleverd met een BSD-licentie. In tegenstelling tot het eigen ARM, biedt het flexibiliteit voor aanpassing zonder licentiebeperkingen, waardoor het ideaal is voor vertrouwensloze IoT-apparaten en servers.",
  "Vendor agnostic smart home heart": "Leverancier-agnostisch slimme thuisbasis",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "De server wordt geleverd met vooraf geïnstalleerde Home Assistant, een open-source home automation platform, waarmee u volledige controle heeft over uw slimme huis zonder te vertrouwen op cloudservices van derden.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Het modulaire ontwerp stelt u in staat om eenvoudig componenten, automatiseringen en integraties toe te voegen, ondersteuning biedend voor meer dan 3.000 apparaten van verschillende fabrikanten zonder leveranciersvergrendeling. Met ondersteuning voor Zigbee en Wi-Fi protocollen kunt u een breed scala aan apparaten aansluiten, van temperatuursensoren tot energieverbruiksmonitoren, allemaal op een lokale server.",
  "Designed for privacy": "Ontworpen voor privacy",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Onze slimme thuisserver elimineert bedrijfsinmenging, houdt uw gegevens lokaal of versleuteld met uw persoonlijke sleutel in gedecentraliseerde Web3-opslag. Geniet van volledige privacy zonder tracking, geen surveillance—alleen veilige, vertrouwensloze controle over uw slimme huis.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "Met Robonomics Web3 cloud en P2P-afstandsbediening krijgt u cryptografische toegang tot alle functies van het slimme huis:",
  "hour": "uur",
  "hours": "uren",
  "day": "dag",
  "days": "dagen",
  "week": "week",
  "weeks": "weken",
  "on demand": "op verzoek",
  "Special offer": "Speciale aanbieding",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Krijg exclusieve toegang tot een van de eerste commercieel verkrijgbare humanoïde robots. Flexibele verhuuropties voor onderzoek, programmering en entertainment behoeften.",
  "Access current device states remotely": "Toegang tot huidige apparaatstatussen op afstand",
  "Control devices remotely via parachain or LibP2P": "Apparaten op afstand bedienen via parachain of LibP2P",
  "Manage Home Assistant users": "Beheer Home Assistant-gebruikers",
  "Back up and restore Home Assistant configurations": "Maak back-ups en herstel Home Assistant-configuraties",
  "Store your home's digital twin in a secure, decentralized cloud": "Bewaar de digitale tweeling van je huis in een veilige, gedecentraliseerde cloud",
  "Books": "Boeken",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "In 2022 begon het Robonomics-team samen te werken met andere parachain-teams binnen het Polkadot-ecosysteem om gebruik te maken van de unieke krachten van dit gedecentraliseerde netwerk. Deze samenwerking resulteerde in de lancering van een Backup and Data Archiving Service die speciaal is ontworpen voor robotica bedrijven.",
  "Digital markets for robots": "Digitale markten voor robots",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "De ontwikkeling van robotica en geautomatiseerde systemen tijdens de Vierde Industriële Revolutie zal vereisen dat robots de mogelijkheid hebben om diensten te bestellen voor hun eigen onderhoud.",
  "Tokenization of Data of IOT devices": "Tokenisatie van gegevens van IOT-apparaten",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "De tokenisatie van gegevens van IoT (Internet of Things) apparaten vertegenwoordigt een baanbrekende ontwikkeling in de digitale economie.",
  "Industrial zone management with capital": "Industriezonebeheer met kapitaal",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "Deze case onderzoekt de rol van slimme fabrieken bij het reageren op kapitaalverschuivingen in moderne markten. Als onderdeel van de Industry 4.0-transformatie introduceert het een gedecentraliseerd communicatieprotocol met behulp van cyber-fysieke systemen om de economische coördinatie tussen industriële agenten te verbeteren.",
  "Mars colonization, impossible without kusama": "Mars kolonisatie, onmogelijk zonder kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Deze R&D-case onderzoekt de rol van het gedecentraliseerde infrastructuur van het Kusama-netwerk bij het ondersteunen van interplanetaire missies, met name Mars-kolonisatie.",
  "A decentralized system for negotiating road space": "Een gedecentraliseerd systeem voor het onderhandelen over wegruimte",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Ons doel was om een gedecentraliseerd systeem te ontwikkelen voor het onderhandelen over wegruimte waar autonome voertuigen kunnen betalen voor routes en toestemmingen.",
  "Almanac": "Almanak",
  "Robonomics' Approach": "De benadering van Robonomics",
  "Robonomics provides an alternative to centralized corporate-controlled cloud services. Instead of relying on such systems, it leverages public blockchain networks, such as Ethereum and Polkadot, to facilitate secure and autonomous transactions between robots and service providers.": "Robonomics biedt een alternatief voor gecentraliseerde door bedrijven gecontroleerde cloudservices. In plaats van te vertrouwen op dergelijke systemen, maakt het gebruik van openbare blockchainnetwerken, zoals Ethereum en Polkadot, om veilige en autonome transacties tussen robots en dienstverleners te vergemakkelijken.",
  "How Digital Markets for Robots Work": "Hoe digitale markten voor robots werken",
  "Key Benefits": "Belangrijkste voordelen",
  "Digital markets for robots represent a critical step toward supporting the next wave of automation and smart city infrastructure. Robonomics' decentralized approach ensures secure, scalable, and autonomous service management for robots.": "Digitale markten voor robots vormen een kritische stap naar het ondersteunen van de volgende golf van automatisering en slimme stadsinfrastructuur. De gedecentraliseerde aanpak van Robonomics zorgt voor veilig, schaalbaar en autonoom servicemanagement voor robots.",
  "Conclusion": "Conclusie",
  "Why Smart Factories Should Respond to Capital Changes": "Waarom slimme fabrieken moeten reageren op kapitaalveranderingen",
  "A Decentralized Protocol for Economic Coordination": "Een gedecentraliseerd protocol voor economische coördinatie",
  "Balancing Production and Capital": "Balans tussen productie en kapitaal",
  "Technical Foundation": "Technische basis",
  "This R&D case presents how capital flows can act as economic signals for smart factories. By adopting Robonomics' decentralized protocol, industries can better manage production efficiency and stay aligned with the evolving standards of Industry 4.0.": "Deze R&D-case laat zien hoe kapitaalstromen kunnen fungeren als economische signalen voor slimme fabrieken. Door het gedecentraliseerde protocol van Robonomics te adopteren, kunnen industrieën de productie-efficiëntie beter beheren en in lijn blijven met de evoluerende normen van Industry 4.0.",
  "Exploring Kusama's Role in Space Exploration": "Het verkennen van de rol van Kusama in ruimteverkenning",
  "The Mars Rover Experiment": "Het Mars Rover-experiment",
  "Technical Implementation": "Technische implementatie",
  "Use Cases and Potential Impact": "Gebruiksscenario's en potentieel effect",
  "A fun video about the use of KUSAMA on Mars:": "Een leuk video over het gebruik van KUSAMA op Mars:",
  "This R&D case demonstrates how the Kusama network can support scientific exploration, resource management, and data transparency for space missions. The decentralized architecture offers a promising foundation for the future of Mars colonization and beyond.": "Deze R&D-case toont aan hoe het Kusama-netwerk wetenschappelijke verkenning, resourcebeheer en gegevenstransparantie voor ruimtemissies kan ondersteunen. De gedecentraliseerde architectuur biedt een veelbelovende basis voor de toekomst van Mars-kolonisatie en daarbuiten.",
  "The Challenge": "De uitdaging",
  "The Solution": "De oplossing",
  "Here is the project presentation during the MOBI GRAND CHALLENGE": "Hier is de projectpresentatie tijdens de MOBI GRAND CHALLENGE",
  "We want to give special thanks to the Jetbrains Team’s Mobile Robot Algorithms Laboratory for giving us access to Duckietown.": "We willen speciale dank betuigen aan het Mobile Robot Algorithms Laboratory van het Jetbrains Team voor het geven van toegang tot Duckietown.",
  "Special Thanks": "Speciale dank",
  "With robots generating enormous amounts of data—including videos, raw technical data, and logs—storage can become a significant challenge, especially at scale. This new service offers an affordable and secure solution to meet these needs.": "Met robots die enorme hoeveelheden gegevens genereren - waaronder video's, ruwe technische gegevens en logs - kan opslag een aanzienlijke uitdaging worden, vooral op schaal. Deze nieuwe service biedt een betaalbare en veilige oplossing om aan deze behoeften te voldoen.",
  "Addressing the Challenge of Data Storage": "Het aanpakken van de uitdaging van gegevensopslag",
  "Our Solution: A Decentralized Approach": "Onze oplossing: een gedecentraliseerde aanpak",
  "Key Technology Behind the Service": "Belangrijke technologie achter de service",
  "Why This Service Is Essential": "Waarom deze service essentieel is",
  "Looking Ahead": "Vooruitkijken",
  "For additional details about the collaboration between Robonomics and Crust Network and how decentralized storage is reshaping data management for robotics companies, visit the official": "Voor meer details over de samenwerking tussen Robonomics en Crust Network en hoe gedecentraliseerde opslag de gegevensbeheer voor robotica bedrijven hervormt, bezoek de officiële",
  "blog": "blog",
  "Learn More About the Collaboration": "Meer te weten komen over de samenwerking",
  "Send a request message and get the result from the autonomous agent. The resulting file is saved to IPFS and the resultant message requires a signature with a private key.": "Stuur een verzoekbericht en krijg het resultaat van de autonome agent. Het resulterende bestand wordt opgeslagen op IPFS en het resulterende bericht vereist een handtekening met een privésleutel.",
  "Overview": "Overzicht",
  "This case study explores how Robonomics Network facilitates decentralized data access using IoT devices and blockchain technology. By leveraging the Robonomics dApp connected to a weather sensor on Fuji Mountain, users can obtain real-time weather data securely and transparently.": "Deze casestudy onderzoekt hoe het Robonomics Network gedecentraliseerde toegang tot gegevens mogelijk maakt met behulp van IoT-apparaten en blockchaintechnologie. Door gebruik te maken van de Robonomics dApp die is verbonden met een weersensor op de Fuji Mountain, kunnen gebruikers veilig en transparant real-time weergegevens verkrijgen.",
  "How does it work?": "Hoe werkt het?",
  "Technical Insights": "Technische inzichten",
  "Here's a walkthrough video:": "Hier is een stapsgewijze video:",
  "This R&D case highlights the capabilities of decentralized technologies in real-world data collection and access. Robonomics Network empowers secure, verifiable data retrieval from IoT sensors, advancing the reliability of environmental monitoring solutions.": "Deze R&D-case benadrukt de mogelijkheden van gedecentraliseerde technologieën in gegevensverzameling en toegang in de echte wereld. Het Robonomics Network maakt veilige, controleerbare gegevensopvraging van IoT-sensoren mogelijk, waardoor de betrouwbaarheid van oplossingen voor milieumonitoring wordt verbeterd.",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy. By leveraging blockchain technology, IoT devices can generate, verify, and tokenize data as units of value, creating a secure and transparent mechanism for digital asset creation.": "De tokenisatie van gegevens van IoT (Internet of Things) apparaten vertegenwoordigt een baanbrekende ontwikkeling in de digitale economie. Door gebruik te maken van blockchaintechnologie kunnen IoT-apparaten gegevens genereren, verifiëren en tokeniseren als eenheden van waarde, waardoor een veilig en transparant mechanisme voor de creatie van digitale activa ontstaat.",
  "Background": "Achtergrond",
  "The Role of IoT Devices in Tokenization": "De rol van IoT-apparaten in tokenisatie",
  "Key Benefits of Tokenized IoT Data": "Belangrijkste voordelen van getokeniseerde IoT-gegevens",
  "Tokenizing IoT data through blockchain not only enhances data security and transparency but also paves the way for autonomous, machine-driven economies. This transformative approach creates a new generation of tokenized assets, unlocking immense potential for global innovation and economic growth.": "Het tokeniseren van IoT-gegevens via blockchain verbetert niet alleen de gegevensbeveiliging en transparantie, maar legt ook de weg vrij voor autonome, door machines aangestuurde economieën. Deze transformerende aanpak creëert een nieuwe generatie getokeniseerde activa, die een enorm potentieel ontgrendelen voor wereldwijde innovatie en economische groei.",
  "Last updated: February 03, 2025": "Laatst bijgewerkt: 3 februari 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Dit privacybeleid beschrijft onze beleid en procedures met betrekking tot de verzameling, het gebruik en de openbaarmaking van uw informatie wanneer u de service gebruikt en informeert u over uw privacyrechten en hoe de wet u beschermt.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "We gebruiken uw persoonlijke gegevens om de service te leveren en te verbeteren. Door de service te gebruiken, stemt u in met de verzameling en het gebruik van informatie in overeenstemming met dit privacybeleid.",
  "Interpretation and Definitions": "Interpretatie en definities",
  "Interpretation": "Interpretatie",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "De woorden waarvan de eerste letter is hoofdletter hebben betekenissen gedefinieerd onder de volgende voorwaarden. De volgende definities hebben dezelfde betekenis ongeacht of ze in enkelvoud of meervoud voorkomen.",
  "Definitions": "Definities",
  "For the purposes of this Privacy Policy:": "Voor de doeleinden van dit privacybeleid:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(aangeduid als \"de DAO\", \"Wij\", \"Ons\" of \"Onze\" in deze Overeenkomst) verwijst naar gedecentraliseerde autonome organisatie Robonomics Network, een exploitant voor website",
  "(referred to as": "(aangeduid als",
  "Website": "Website",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "in deze Overeenkomst). Voor de doeleinden van de AVG is de DAO de Gegevensbeheerder.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "zijn kleine bestanden die op uw computer, mobiele apparaat of elk ander apparaat worden geplaatst door een website, met daarin de details van uw browsegeschiedenis op die website onder de vele toepassingen. Meer gedetailleerde informatie over cookies en hoe ze werken is te vinden op:",
  "Country": "Land",
  "refers to: Cyprus.": "verwijst naar: Cyprus.",
  "Data Controller": "Gegevensbeheerder",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "voor de doeleinden van de AVG (Algemene Verordening Gegevensbescherming), verwijst naar de DAO als de rechtspersoon die alleen of gezamenlijk met anderen de doeleinden en middelen van de verwerking van persoonsgegevens bepaalt.",
  "Device": "Apparaat",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "betekent elk apparaat dat toegang kan krijgen tot de Service zoals een computer, een mobiele telefoon of een digitale tablet.",
  "GDPR": "AVG",
  "refers to EU General Data Protection Regulation.": "verwijst naar de Algemene Verordening Gegevensbescherming van de EU.",
  "Personal Data": "Persoonsgegevens",
  "is any information that relates to an identified or identifiable individual.": "zijn alle informatie die betrekking heeft op een geïdentificeerde of identificeerbare persoon.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Voor de doeleinden van de AVG betekent Persoonsgegevens alle informatie met betrekking tot u zoals een naam, een identificatienummer, locatiegegevens, online identificator of een of meer factoren specifiek voor de fysieke, fysiologische, genetische, mentale, economische, culturele of sociale identiteit.",
  "Service": "Service",
  "refers to the Website": "verwijst naar de Website",
  "Service Provider": "Dienstverlener",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "betekent elke natuurlijke of rechtspersoon die de gegevens namens de DAO verwerkt. Het verwijst naar derde partijen of individuen die door de DAO zijn ingehuurd om de Service te vergemakkelijken, om namens de DAO de Service te verlenen, om diensten uit te voeren die verband houden met de Service of om de DAO te helpen bij het analyseren van hoe de Service wordt gebruikt. Voor de doeleinden van de AVG worden Dienstverleners beschouwd als Gegevensverwerkers.",
  "Usage Data": "Gebruiksgegevens",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "verwijst naar gegevens die automatisch worden verzameld, gegenereerd door het gebruik van de Service of van de Service-infrastructuur zelf (bijvoorbeeld de duur van een paginabezoek).",
  "You": "U",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(aangeduid als \"Uw\" in deze Overeenkomst) betekent de persoon die toegang heeft tot of gebruik maakt van de Service, of de DAO, of een andere rechtspersoon namens wie een dergelijke persoon toegang heeft tot of gebruik maakt van de Service, indien van toepassing.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Onder de AVG kan naar u worden verwezen als de Betrokkene of als de Gebruiker aangezien u de persoon bent die de Service gebruikt.",
  "Collecting and Using Your Personal Data": "Verzamelen en gebruiken van uw persoonsgegevens",
  "Types of Data Collected": "Soorten verzamelde gegevens",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Tijdens het gebruik van onze Service kunnen wij u vragen ons bepaalde persoonlijk identificeerbare informatie te verstrekken die kan worden gebruikt om contact met u op te nemen of u te identificeren. Persoonlijk identificeerbare informatie kan omvatten, maar is niet beperkt tot:",
  "Email address": "E-mailadres",
  "First name and last name": "Voornaam en achternaam",
  "Usage Data is collected automatically when using the Service.": "Gebruiksgegevens worden automatisch verzameld bij het gebruik van de Service.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Gebruiksgegevens kunnen informatie bevatten zoals het internetprotocoladres van uw apparaat (bijv. IP-adres), browsertype, browserversie, de pagina's van onze Service die u bezoekt, het tijdstip en de datum van uw bezoek, de tijd die u op die pagina's hebt doorgebracht, unieke apparaatidentificatoren en andere diagnostische gegevens.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Wanneer u toegang krijgt tot de Service via een mobiel apparaat, kunnen wij bepaalde informatie automatisch verzamelen, waaronder, maar niet beperkt tot, het type mobiele apparaat dat u gebruikt, uw unieke ID van het mobiele apparaat, het IP-adres van uw mobiele apparaat, uw mobiele besturingssysteem, het type mobiele internetbrowser dat u gebruikt, unieke apparaatidentificatoren en andere diagnostische gegevens.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Wij kunnen ook informatie verzamelen die uw browser automatisch verzendt wanneer u onze Service bezoekt of wanneer u toegang krijgt tot de Service via een mobiel apparaat.",
  "Cookies & Browser Storage": "Cookies & Browseropslag",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "De websites kunnen cookies gebruiken. We gebruiken cookies en browseropslag alleen voor essentiële instellingen om uw ervaring te verbeteren—niet voor het volgen. Deze helpen uw voorkeuren te onthouden, zoals taalinstellingen of toestemmingskeuzes, zodat u ze niet elke keer opnieuw hoeft in te stellen wanneer u de site bezoekt.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "We gebruiken geen cookies voor het volgen of gepersonaliseerde advertenties. U kunt cookies beheren of uitschakelen in uw browserinstellingen, maar sommige functies werken mogelijk niet goed zonder deze.",
  "Matomo Analytics": "Matomo Analytics",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Onze website kan Matomo, een open-source analyseplatform, gebruiken om inzicht te krijgen in het gebruik van de website. Dit omvat geanonimiseerde gegevens zoals:",
  "Pages visited and navigation paths": "Bezochte pagina's en navigatiepaden",
  "Time spent on our website": "Tijd doorgebracht op onze website",
  "Whether you’re a returning or new visitor": "Of u een terugkerende of nieuwe bezoeker bent",
  "Your device type (desktop, mobile, etc.)": "Uw apparaattype (desktop, mobiel, enz.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Om uw privacy te beschermen, wordt uw IP-adres geanonimiseerd voordat het wordt opgeslagen. De gegevens die we verzamelen worden alleen gebruikt om de website te verbeteren en worden niet gebruikt voor persoonlijke identificatie.",
  "Under Art. 6(1)(f) GDPR": "Onder Art. 6(1)(f) AVG",
  "we process this data based on our legitimate interest in enhancing our services.": "verwerken wij deze gegevens op basis van ons gerechtvaardigd belang om onze diensten te verbeteren.",
  "Opt-Out Option": "Opt-Out Optie",
  "You can disable Matomo tracking at any time:": "U kunt op elk moment Matomo-tracking uitschakelen:",
  "Use of Your Personal Data": "Gebruik van Uw Persoonlijke Gegevens",
  "The DAO may use Personal Data for the following purposes:": "De DAO kan Persoonlijke Gegevens gebruiken voor de volgende doeleinden:",
  "To provide and maintain our Service": "Om onze Dienst te leveren en te onderhouden",
  "including to monitor the usage of our Service.": "inclusief het controleren van het gebruik van onze Dienst.",
  "For the performance of a contract": "Voor de uitvoering van een contract",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "de ontwikkeling, naleving en uitvoering van het aankoopcontract voor de producten, items of diensten die U heeft gekocht of van enig ander contract met Ons via de Dienst.",
  "To contact You": "Om contact met U op te nemen",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Om contact met U op te nemen via e-mail, telefoongesprekken, SMS, of andere equivalent vormen van elektronische communicatie, zoals pushmeldingen van een mobiele applicatie met betrekking tot updates of informatieve communicatie gerelateerd aan de functionaliteiten, producten of gecontracteerde diensten, inclusief de beveiligingsupdates, wanneer noodzakelijk of redelijk voor hun implementatie.",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "De DAO zal ook Gebruiksgegevens bewaren voor interne analyse doeleinden. Gebruiksgegevens worden over het algemeen voor een kortere periode bewaard, behalve wanneer deze gegevens worden gebruikt om de beveiliging te versterken of de functionaliteit van Onze Dienst te verbeteren, of wanneer wij wettelijk verplicht zijn om deze gegevens voor langere periodes te bewaren.",
  "Legal obligations:": "Wettelijke verplichtingen:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Het verwerken van persoonsgegevens is noodzakelijk voor naleving van een wettelijke verplichting waaraan de DAO is onderworpen.",
  "Vital interests:": "Vitale belangen:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Het verwerken van persoonsgegevens is noodzakelijk om uw vitale belangen of die van een andere natuurlijke persoon te beschermen.",
  "Public interests:": "Openbaar belang:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Het verwerken van persoonsgegevens is gerelateerd aan een taak die wordt uitgevoerd in het algemeen belang of in de uitoefening van officiële autoriteit die aan de DAO is toegekend.",
  "Legitimate interests:": "Legitieme belangen:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Het verwerken van persoonsgegevens is noodzakelijk voor de doeleinden van de legitieme belangen die worden nagestreefd door de DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "In elk geval zal de DAO graag helpen om de specifieke wettelijke basis te verduidelijken die van toepassing is op de verwerking, en met name of het verstrekken van persoonsgegevens een wettelijke of contractuele verplichting is, of een vereiste die nodig is om een contract aan te gaan.",
  "Your Rights under the GDPR": "Uw rechten onder de AVG",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "De DAO verbindt zich ertoe de vertrouwelijkheid van uw persoonsgegevens te respecteren en u in staat te stellen uw rechten uit te oefenen.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "U heeft het recht onder dit privacybeleid, en volgens de wet als u zich binnen de EU bevindt, om:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Het recht op toegang, bijwerken of verwijderen van de informatie die we over u hebben. Indien mogelijk kunt u toegang krijgen, bijwerken of verzoeken om verwijdering van uw persoonsgegevens rechtstreeks binnen uw accountinstellingen. Als u deze acties niet zelf kunt uitvoeren, neem dan contact met ons op om u te helpen. Dit stelt u ook in staat om een kopie te ontvangen van de persoonsgegevens die we over u bewaren.",
  "Request correction of the Personal Data that We hold about You.": "Verzoek om correctie van de persoonsgegevens die we over u bewaren.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "U heeft het recht om onvolledige of onjuiste informatie die we over u bewaren te laten corrigeren.",
  "Object to processing of Your Personal Data.": "Bezwaar maken tegen de verwerking van uw persoonsgegevens.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Dit recht bestaat wanneer we vertrouwen op een legitiem belang als de wettelijke basis voor onze verwerking en er iets is aan uw specifieke situatie waardoor u bezwaar wilt maken tegen onze verwerking van uw persoonsgegevens op deze grond. U heeft ook het recht om bezwaar te maken wanneer we uw persoonsgegevens verwerken voor direct marketingdoeleinden.",
  "Request erasure of Your Personal Data.": "Verzoek om verwijdering van uw persoonsgegevens.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "U heeft het recht om ons te vragen uw persoonsgegevens te verwijderen of te laten verwijderen wanneer er geen goede reden is voor ons om deze te blijven verwerken.",
  "Request the transfer of Your Personal Data.": "Verzoek om overdracht van uw persoonsgegevens.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Wij zullen u, of een door u gekozen derde, uw persoonsgegevens verstrekken in een gestructureerd, veelgebruikt en machinaal leesbaar formaat. Houd er rekening mee dat dit recht alleen van toepassing is op geautomatiseerde informatie waarvoor u aanvankelijk toestemming heeft gegeven om deze te gebruiken of waar we de informatie hebben gebruikt om een contract met u uit te voeren.",
  "Withdraw Your consent.": "Uw toestemming intrekken.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "U heeft het recht om uw toestemming voor het gebruik van uw persoonsgegevens in te trekken. Als u uw toestemming intrekt, kunnen we u mogelijk geen toegang verlenen tot bepaalde specifieke functionaliteiten van de service.",
  "Exercising of Your GDPR Data Protection Rights": "Uitoefening van uw GDPR-gegevensbeschermingsrechten",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "U kunt uw rechten van toegang, rectificatie, annulering en verzet uitoefenen door contact met ons op te nemen. Houd er rekening mee dat we u kunnen vragen uw identiteit te verifiëren voordat we op dergelijke verzoeken reageren. Als u een verzoek indient, zullen we ons best doen om zo snel mogelijk op uw verzoek te reageren.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "U heeft het recht om een klacht in te dienen bij een gegevensbeschermingsautoriteit over onze verzameling en gebruik van uw persoonsgegevens. Voor meer informatie, als u zich in de Europese Economische Ruimte (EER) bevindt, neem dan contact op met uw lokale gegevensbeschermingsautoriteit in de EER.",
  "Children's Privacy": "Privacy van kinderen",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Onze service is niet gericht op personen jonger dan 13 jaar. We verzamelen niet bewust persoonlijk identificeerbare informatie van personen jonger dan 13 jaar. Als u een ouder of voogd bent en u weet dat uw kind ons persoonsgegevens heeft verstrekt, neem dan contact met ons op. Als we ons ervan bewust worden dat we persoonsgegevens hebben verzameld van personen jonger dan 13 jaar zonder verificatie van ouderlijke toestemming, nemen we stappen om die informatie van onze servers te verwijderen.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Als we moeten vertrouwen op toestemming als wettelijke basis voor de verwerking van uw informatie en uw land toestemming van een ouder vereist, kunnen we de toestemming van uw ouder vereisen voordat we die informatie verzamelen en gebruiken.",
  "Links to Other Websites": "Links naar andere websites",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Onze service kan links bevatten naar andere websites die niet door ons worden beheerd. Als u op een link van een derde partij klikt, wordt u doorgestuurd naar de site van die derde partij. We raden u ten zeerste aan het privacybeleid van elke site die u bezoekt te bekijken.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "We hebben geen controle over en nemen geen verantwoordelijkheid voor de inhoud, privacybeleid of praktijken van sites of diensten van derden.",
  "Changes to this Privacy Policy": "Wijzigingen in dit privacybeleid",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "We kunnen ons privacybeleid van tijd tot tijd bijwerken. We zullen u op de hoogte stellen van eventuele wijzigingen door het nieuwe privacybeleid op deze pagina te plaatsen.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "We zullen u via e-mail en/of een prominente kennisgeving op onze service op de hoogte stellen voordat de wijziging van kracht wordt en de datum van de laatste update bovenaan dit privacybeleid bijwerken.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "U wordt geadviseerd om dit privacybeleid regelmatig te controleren op wijzigingen. Wijzigingen in dit privacybeleid zijn van kracht wanneer ze op deze pagina worden geplaatst.",
  "Contact Us": "Neem contact met ons op",
  "If you have any questions about this Privacy Policy, You can contact us:": "Als u vragen heeft over dit privacybeleid, kunt u contact met ons opnemen:",
  "By visiting this page on our website:": "Door deze pagina op onze website te bezoeken:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Dit akkoord is oorspronkelijk geschreven in het Engels. Deze AI-vertaling is alleen ter referentie.",
  "Performance of a contract:": "Uitvoering van een contract:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Het verstrekken van Persoonsgegevens is noodzakelijk voor de uitvoering van een overeenkomst met U en/of voor eventuele precontractuele verplichtingen daarvan.",
  "To provide You": "Om u te voorzien",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "met nieuws, speciale aanbiedingen en algemene informatie over andere goederen, diensten en evenementen die wij aanbieden en die vergelijkbaar zijn met de goederen, diensten en evenementen die u al hebt gekocht of waarnaar u hebt geïnformeerd, tenzij u hebt aangegeven dat u dergelijke informatie niet wilt ontvangen.",
  "To manage Your requests": "Om uw verzoeken te beheren",
  "To attend and manage Your requests to Us.": "Om uw verzoeken aan ons te behandelen en te beheren.",
  "For other purposes": "Voor andere doeleinden",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Wij kunnen uw gegevens gebruiken voor andere doeleinden, zoals gegevensanalyse, het identificeren van gebruikstrends, het bepalen van de effectiviteit van onze promotiecampagnes en om onze service, producten, diensten, marketing en uw ervaring te evalueren en te verbeteren.:",
  "We may share Your personal information in the following situations:": "Wij kunnen uw persoonlijke gegevens delen in de volgende situaties:",
  "With Service Providers": "Met serviceproviders",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "We kunnen uw persoonlijke informatie delen met serviceproviders om het gebruik van onze service te monitoren en analyseren, om contact met u op te nemen.",
  "With Your consent": "Met uw toestemming",
  "We may disclose Your personal information for any other purpose with Your consent.": "We kunnen uw persoonlijke informatie voor elk ander doel openbaar maken met uw toestemming.",
  "Retention of Your Personal Data": "Bewaring van uw persoonlijke gegevens",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "De DAO zal ook Gebruiksgegevens bewaren voor interne analyse doeleinden. Gebruiksgegevens worden over het algemeen voor een kortere periode bewaard, behalve wanneer deze gegevens worden gebruikt om de beveiliging te versterken of de functionaliteit van onze service te verbeteren, of wanneer we wettelijk verplicht zijn om deze gegevens voor langere periodes te bewaren.",
  "Security of Your Personal Data": "Beveiliging van uw persoonlijke gegevens",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "De beveiliging van uw persoonlijke gegevens is belangrijk voor ons, maar onthoud dat geen enkele methode van verzending via internet of elektronische opslag 100% veilig is. Hoewel we streven naar het gebruik van commercieel aanvaardbare middelen om uw persoonlijke gegevens te beschermen, kunnen we de absolute beveiliging ervan niet garanderen.",
  "Detailed Information on the Processing of Your Personal Data": "Gedetailleerde informatie over de verwerking van uw persoonlijke gegevens",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Uw informatie, inclusief persoonsgegevens, wordt verwerkt op de website van de DAO's serviceprovider(s) en op andere plaatsen waar de betrokken partijen bij de verwerking zich bevinden. Dit betekent dat deze informatie kan worden overgedragen aan — en onderhouden op — computers die zich buiten uw staat, provincie, land of andere overheidsjurisdictie bevinden waar de wetgeving inzake gegevensbescherming kan verschillen van die in uw jurisdictie.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Uw toestemming voor dit privacybeleid gevolgd door uw indiening van dergelijke informatie vertegenwoordigt uw akkoord met die overdracht.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "De DAO zal alle redelijkerwijs noodzakelijke stappen ondernemen om ervoor te zorgen dat uw gegevens veilig worden behandeld en in overeenstemming met dit privacybeleid en er zal geen overdracht van uw persoonlijke gegevens plaatsvinden naar een organisatie of een land tenzij er adequate controles zijn ingesteld, inclusief de beveiliging van uw gegevens en andere persoonlijke informatie.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Houd er rekening mee dat elke gegevensoverdracht via internet (bijv. communicatie via e-mail) over het algemeen niet veilig is en wij aanvaarden geen aansprakelijkheid voor gegevens die via internet aan ons worden verzonden. Helaas is absolute bescherming technisch niet mogelijk. Deze informatie is niet van toepassing op de website van derden en de bijbehorende links die op onze website worden gegeven. De DAO aanvaardt geen verantwoordelijkheid en aansprakelijkheid hiervoor.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "De serviceproviders die we gebruiken kunnen toegang hebben tot uw persoonlijke gegevens. Deze externe leveranciers verzamelen, bewaren, gebruiken, verwerken en overdragen informatie over uw activiteit op onze service in overeenstemming met hun privacybeleid.",
  "Email Marketing": "E-mailmarketing",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "We kunnen uw persoonlijke gegevens gebruiken om contact met u op te nemen met nieuwsbrieven, marketing- of promotiemateriaal en andere informatie die voor u interessant kan zijn. U kunt ervoor kiezen om geen, of alle, van deze communicaties van ons te ontvangen door de afmeldlink of instructies te volgen die in elke e-mail die we sturen worden verstrekt of door contact met ons op te nemen.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "We kunnen e-mailmarketingserviceproviders gebruiken om e-mails naar u te beheren en te verzenden;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Hun privacybeleid kan worden bekeken op",
  "Usage, Performance and Miscellaneous": "Gebruik, prestaties en diversen",
  "We may use third-party Service Providers to maintain and improve our Service.": "We kunnen externe serviceproviders gebruiken om onze service te onderhouden en te verbeteren.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR-privacy",
  "Legal Basis for Processing Personal Data under GDPR": "Juridische basis voor de verwerking van persoonsgegevens onder de GDPR",
  "We may process Personal Data under the following conditions:": "We kunnen persoonsgegevens verwerken onder de volgende voorwaarden:",
  "Consent:": "Toestemming:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "U heeft uw toestemming gegeven voor de verwerking van persoonsgegevens voor een of meer specifieke doeleinden.",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Door op de knop 'Verzenden' te klikken, stemt u ermee in om regelmatig e-mails te ontvangen van Robonomics (niet meer dan 1 per maand) en stemt u in met het aanvragen van toegang tot uw persoonlijke gegevens.",
  "Request access to Your Personal Data.": "Verzoek toegang tot uw persoonlijke gegevens.",
  "Aira is back": "Aira is terug",
  "Transform your screen with our brand new wallpaper—download now!": "Transformeer je scherm met onze gloednieuwe wallpaper - download nu!",
  "Open-Source Hardware & Software": "Open-Source Hardware & Software",
  "Independent Decentralized Network Technologies": "Onafhankelijke gedecentraliseerde netwerktechnologieën",
  "Colorful 3D-Printed Cases of Your Choice": "Kleurrijke 3D-geprinte behuizingen naar keuze",
  "Order Now": "Bestel nu",
  "Altruist": "Altruïst",
  "3 highlights for you": "3 hoogtepunten voor jou",
  "Our special wallpapers to commemorate the launch of the Outdoor sensor “Altruist“": "Onze speciale wallpapers ter herdenking van de lancering van de Outdoor sensor 'Altruist'",
  "Order from the EU": "Bestel uit de EU",
  "In its natural habitat": "In zijn natuurlijke habitat",
  "Tag": "Tag",
  "(Robonomics Hardware) in your post with a photo.": "(Robonomics Hardware) in uw bericht met een foto.",
  "Share Your “Altruist” in Action": "Deel uw 'Altruïst' in actie",
  "Air Quality Sensor “ALTRUIST“": "Luchtkwaliteitssensor 'ALTRUIST'",
  "Europe": "Europa",
  "Japan": "Japan",
  "Order from the Japan": "Bestellen uit Japan",
  "Russia": "Rusland",
  "Order from the Russia": "Bestellen uit Rusland",
  "With the Altruist Air Quality Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data — signed, mapped, and shared across a distributed network.": "Met de Altruist Luchtkwaliteitssensor word je een kracht in gedecentraliseerde milieumonitoring. Leg geluids-, stof- en temperatuurgegevens vast - ondertekend, in kaart gebracht en gedeeld via een gedistribueerd netwerk.",
  "Early bird price": "Vroegboekprijs",
  "Coming in early 2025": "Komt begin 2025",
  "Now Available!": "Nu beschikbaar!",
  "Worldwide Shipping": "Wereldwijde verzending"
}