{
  "What is Robonomics network?": "Qu’est ce que robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics est une plateforme open-source pour les applications IoT. Nous soutenons une nouvelle génération de technologies Internet (Web3) qui met en œuvre l’échange d’informations techniques et économiques sous forme de transactions atomiques entre les applications utilisateurs, les services IoT et la robotique complexe.",
  "Serverless IoT applications for users": "Applications IoT sans serveur pour les utilisateurs",
  "Timeline": "Frise chronologique",
  "User (D)App": "Utilisateur (D)App",
  "Function request": "Demande de fonctio",
  "Report": "Signaler",
  "Control": "Contrôle",
  "Log": "Journal",
  "IoT Device": "Dispositif IoT",
  "Decentralized application": "Application décentralisée",
  "Digital twin": "Jumeau numérique",
  "IoT / Smart device": "Internet des Objets / Appareil intelligentо",
  "Robonomics tokenomics": "Robonomics tokenomique",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "est le jeton utilitaire qui permettra de contrôler les appareils IoT sur le réseau Ethereum et le parachain Robonomics dans l’écosystème Polkadot.",
  "The task": "La tâche",
  "Be aware of scammers": "Soyez conscient des fraudeurs",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "s’il vous plaît utiliser seulement les marchés bien connus pour échanger XRT. N’envoyez pas vos jetons aux comptes qui vous sont donnés dans des messages privés quelle que soit la transaction que vous souhaitez effectuer (acheter ou vendre jeton). Si vous avez reçu des « déclarations bruyantes » au sujet du jeton Robonomics (les fraudeurs utilisent souvent quelque chose comme une annonce de largage), veuillez consulter ce site Web (https://robonomics.network/) ou notre compte",
  "for official updates. Be careful, be safe.": "pour obtenir des mises à jour officielles. Soyez prudent, soyez prudent.",
  "XRT in Ethereum": "XRT dans Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Lors de la mise en œuvre du projet Robonomics en 2015 - 2018, l'équipe du projet devait trouver un lien entre la fourniture d'une fonction utile par Robonomics Network, à savoir le lancement d'appareils IoT selon le modèle robot-as-a-service, et le remboursement de la coûts aux fournisseurs Robonomics pour les frais de gaz dans Ethereum. Nous devions réfléchir au cycle de vie de la responsabilité de chaque appareil intelligent pour effectuer un service. À la suite des premières recherches et développements en Robonomics, l'équipe a mis au point un mécanisme d'extraction de nouveaux jetons pour récompenser chaque contrat intelligent de robot en tant que service créé. Ce modèle reste viable pour l'avenir de Robonomics sur Ethereum, mais seulement avec des améliorations significatives dans Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lisez ceci pour connaître le contexte historique et les plans à long terme de l’équipe pour XRT dans l’écosystème Ethereum.",
  "Etherscan profile": "Profil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Voir le contrat intelligent de jeton et les transactions dans le réseau Ethereum ici.",
  "Coingecko markets": "Marchés Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Vous trouverez ici les marchés CEX et DEX pour le trading XRT.",
  "XRT In Polkadot": "XRT dans Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "En passant d’Ethereum à Polkadot, nous devons « intensifier » la tokénomique. Parachains dans l’écosystème Polkadot ne sont pas l’équivalent d’un contrat intelligent, mais sont une blockchain entièrement programmable qui loue un segment du réseau global.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Le paiement réel de la part de Polkadot et Kusama parachains est un collage à long terme de jetons de chaîne de relais natifs (DOT / KSM) en quantité suffisante pour gagner l’une des enchères. Le XRT dans le parachain Robonomics soutient le renouvellement des emplacements et les récompenses pour les parties prenantes. Le mécanisme de gravure XRT sous-jacent à l’activation des abonnements IoT est conçu pour réduire l’inflation au minimum, et en cas d’intérêt accru à zéro.",
  "Learn more": "En savoir plus",
  "in Twitter thread from our network architect.": "dans le fil Twitter de notre architecte réseau.",
  "Usage:": "Utiliser:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT peut être utilisé à la fois pour payer des frais pour effectuer des transactions sur la parachain ou pour acheter un abonnement IoT qui garantit le traitement prioritaire des transactions IoT de l'appareil ou de l'utilisateur.",
  "Rewards:": "Récompenses:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Tout au long de l’année, le parachain émet une petite quantité de rayons X pour inciter les parachutistes à poser des colliers.",
  "The parameter of the total reward": "Le paramètre de la récompense totale ",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "pour les collators pour l’année est déterminé par le vote en chaîne des détenteurs de jetons, et peut être modifié par la tenue d’un référendum.",
  "Use XRT": "Utiliser XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Achetez l’abonnement IoT dans notre application décentralisée. Contrôlez vos appareils intelligents sur blockchain sans aucune observation centralisée des entreprises.",
  "Subscan profile": "Profil subscan",
  "View token statistics on top of Polkadot ecosystem.": "Afficher les statistiques des jetons en haut de l’écosystème Polkadot",
  "Other questions": "D'autres questions",
  "What is RWS?": "Qu’est-ce que RWS ?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[En cours de développement des fonctionnalités de base] Pour les ingénieurs, l’équipe Core Dev tentera de créer différents modèles d’utilisation de Robonomics et la première étape de cette façon est de lancer jeton d’abonnement à vie - jeton RWS. Chaque jeton RWS vous donnera 1 transaction par seconde (tps) depuis/vers votre appareil IoT via Robonomics Parachain. Activez votre jeton RWS et effectuez des transactions 'gaz libre' avec avant d’exécuter et latence prévisible. Désactivez le jeton RWS et échangez-le sur DEX.",
  "What is AIRA/AIR ID?": "Qu’est-ce que AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Le jeton Pre-RX a été distribué en 2017 en tant que partie autonome de l’infrastructure robotique sur Ethereum. Après le lancement réussi de Robonomics sur Ethereum en 2019 AIRA jetons a été connecté à l’infrastructure créée du projet par",
  "ambix smart contract": "contrat intelligent ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "qui a garanti processus autonome et indépendant d’échange pre-XRT à ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "du jeton Robonomics est d’assurer le fonctionnement d’un réseau décentralisé pour la maintenance des Smart Cities et de l’Industrie 4.0 dans l’infrastructure blockchain. Pour atteindre cet objectif, l’économie symbolique doit refléter les incitations à la mise en œuvre du réseau.",
  "Token distribution": "Distribution de jetons",
  "Try our Dapp": "Essayez notre Dapp",
  "In addition": "De plus",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "vous pouvez utiliser XRT au sein des blockchains en utilisant les outils fournis par différentes équipes indépendantes des communautés Polkadot (Kusama) et Ethereum.",
  "Within the Kusama network, you have the capability use": "Au sein du réseau Kusama, vous avez la possibilité d'utiliser",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "la communication entre le parachain Robonomics et d'autres parachains en utilisant diverses applications décentralisées (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Au sein du réseau Ethereum, vous pouvez utiliser une application décentralisée alimentée par",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "L'application décentralisée (dapp) fonctionne au sein de la blockchain. Elle est open source et ses données sont stockées sur IPFS et Github. Ces technologies permettent à l'application d'être à la fois sécurisée et transparente. Nos développeurs travaillent à la fois sur le développement de l'application Robonomics et sur les bibliothèques que vous pouvez utiliser pour construire votre propre dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin est l’un des instruments fournis par Robonomics Web Services (RWS). Il agit comme une version numérique de l’équipement du monde réel et copie toutes ses caractéristiques techniques. Il permet de rendre une application décentralisée plus sensible aux commandes de l’utilisateur.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Vous pouvez utiliser Robonomics avec une large gamme d’appareils intelligents Zigbee pour automatiser et contrôler différents aspects de votre maison / bureau ou l’utiliser avec la robotique basée sur ROS pour des tâches industrielles plus complexes.",
  "Do Androids Dream of Electric Sheep?": "Les androïdes rêvent-ils de moutons électriques?",
  "Your email": "Votre e-mail",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "L’année a commencé par une réalisation majeure : Robonomics a remporté la 20e vente aux enchères de créneaux de parachain et est",
  "officially became": "officiellement devenu",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "parachain avec ID 2048 sur le réseau Kusama. Le lancement, datalog, DigitalTwin, les fonctions de responsabilité et les abonnements IoT sont devenus disponibles pour tous les utilisateurs de l’écosystème. Pour fournir des détails sur cette phase du projet, l’équipe de base a publié les premiers chapitres du",
  "Robonomics Whitepaper 2.0.": "Livre blanc sur les robonomiques 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 sur Substrate a été publié avec le support des messages XCM, et nous avons commencé à ouvrir des canaux HRMP avec d’autres parachains (comme Crust Shadow et Darwinia), dont la fonctionnalité est extrêmement utile pour nous.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "En même temps, nous avons déverrouillé une stratégie pour introduire le marché de l’IoT à notre protocole. Nos expériences avec les équipements IoT nous ont menés au concept d’une maison intelligente souveraine, indépendante des fournisseurs de services cloud centralisés. Nous avons développé notre",
  "integration": "intégration",
  "with the Home Assistant automation system, and also designed our own": ", avec le système d’automatisation Home Assistant, et également conçu notre propre",
  "IoT gateway": "passerelle IoT",
  "for connecting smart devices.": "pour la connexion d’appareils intelligents.",
  "We have launched two big initiatives in order to increase community engagement —": "Nous avons lancé deux grandes initiatives afin d’accroître l’engagement communautaire: ",
  "Robonomics Academy": "l’Académie des robonomiques",
  "Robonomics Ambassador Program": "et le Programme des ambassadeurs des robonomiques",
  "Additionally,": "De plus,",
  "Robonomics Town Hall": "une séance de discussion ouverte sur les robonomiques",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "a eu lieu à l’automne afin que la communauté des robonomiques puisse essayer nos mécanismes de gouvernance pour la première fois.Récemment, l’équipe Robonomics a aidé le projet IPCI du DAO à obtenir un créneau de parachain pour présenter un service de compensation carbone pour les bâtiments intelligents.",
  "In 2021, our": "En 2021, nous sommes",
  "main focus": "principalement concentrés",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "sur la préparation du projet afin que les applications IoT puissent être utilisées via notre parachain sur le réseau Kusama. Robonomics 1.0 sur Substrate a été publié, et nous avons testé la connexion des capteurs au parachain pour envoyer leurs données de télémétrie, ainsi que le développement de la double fonctionnalité numérique. Au milieu de l’année, nous avons décidé de tester le cycle complet de notre réseau et créé notre propre chaîne de relais appelée",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "à laquelle le parachain Robonomics a été intégré (avant d’être migré vers la chaîne de relais Kusama). Il y a eu beaucoup d’attention à obtenir un créneau de parachain à Kusama, pour lequel nous avons organisé plusieurs campagnes de crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Il y a eu deux grands changements pour la communauté. Tout d’abord, nous avons lancé",
  "Robonomics Grant Program": "le Programme de subventions en robotique",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "qui permet aux projets Web3, robotique et IdO de recevoir du financement pour des tâches de R-D. À la fin de l’année, quatre projets actifs ont participé au programme. Deuxièmement, l’équipe a lancé le",
  "Exodus process": "processus Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "permettant aux détenteurs de jetons Ethereum de déplacer leurs jetons XRT vers le parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Parmi les collaborations, on peut rappeler l’apparition remarquable de Boston Dynamics Spot chez MerkleBot, pour lequel un",
  "rental remote control system": "système de télécommande de location",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "a été développé. Nous aimerions également vous informer sur la société Multi-Agent Systems qui est un projet personnel qui a été formé par une équipe d’ingénieurs Robonomics. Ils ont développé un pâtissier de gaufres robotisé appelé Eisenkoch qui mène des tâches de cuisine pour les propriétaires de café.",
  "There came a time when the existing limitations of Ethereum": "Il est venu un temps où les limites existantes de Ethereum a",
  "began to stand out clearly": "commencé à se démarquer clairement",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(en particulier, mauvaise évolutivité, faible vitesse et très élevé coût des transactions). La mise à niveau vers ETH2.0 était censée corriger la situation, mais cette mise à niveau a été retardée à plusieurs reprises. Alors que nous ne voulions pas quitter le réseau Ethereum, nous avons réalisé que dans la situation actuelle, il était difficile de mettre en œuvre nos cas d’utilisation, et nous avons commencé à chercher un réseau alternatif. L’écosystème de blockchain éclaté Polkadot est devenu cette alternative. Nous avons commencé par expérimenter le framework Substrate pour migrer les principales fonctionnalités robonomiques et déployer notre propre testnet. A la fin de cette étape, nous avions déployé notre parachute sur le testnet Rococo et commencé à nous préparer à obtenir un créneau sur le réseau Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "En poursuivant l’étude des systèmes IoT, nous avons identifié la principale fonctionnalité de Robonomics, qui peut ajouter de la valeur aux utilisateurs - la fonction de nuage décentralisé pour IoT. Cette idée est à la base de",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "L’infrastructure RWS a pris en charge toutes les fonctions d’un nuage centralisé typique, mais sans les problèmes standard de disponibilité globale, de sécurité et de confidentialité. De plus, nous avons eu l’idée de parachain IoT abonnements qui permet aux abonnés d’utiliser le réseau blockchain sans avoir à payer de frais pour chaque transaction. La première expérience avec les abonnements IoT a été l’émission du jeton RWS, qui permet à son propriétaire d’envoyer 1 transaction par bloc. De plus, nous avons commencé à développer notre propre kit matériel pour le contrôle des appareils intelligents (le concept DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Bien sûr, le support pour Robonomics sur Ethereum n’a pas cessé. La pile de communication Robonomics a été finalisée à la version",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Le jeton XRT a commencé à se négocier sur plusieurs bourses (en particulier, le DEX Uniswap), et le programme d’incitation à la liquidité a été lancé.",
  "The team actively developed ways to interact with the community. The first version of our": "L’équipe a activement développé des moyens d’interagir avec la communauté. La première version de notre site",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "et Robonomics Wiki ont été lancés. Pour une gestion de projet plus transparente et pratique, nous avons commencé à utiliser le",
  "Aragon DAO": "DAO Aragon",
  "We hosted": "Nous avons accueilli",
  "Robonomics Winter School": "l’école d’hiver Robonomics",
  "in 2019 for newcomers to the project.": "en 2019 pour les nouveaux arrivants au projet.",
  "Robonomics became the foundation for the": "Robonomics est devenu la base du projet",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "qui développe un système de location intelligente de matériel robotique.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Nous avons compris que les agents autonomes avaient besoin d’un environnement qui assurerait la fiabilité de leurs opérations techniques et économiques. Depuis plusieurs années, nous élaborons un protocole pour créer un réseau décentralisé de fournisseurs qui aident les agents robotisés à fournir leurs services. Des outils de maintenance du réseau et de communication entre Ethereum et ROS ont été développés. En 2018, nous avons publié le",
  "Robonomics Whitepaper": "livre blanc Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "et la version alpha de Robonomics Network a été lancée sur le réseau principal Ethereum. Les préparatifs actifs se sont poursuivis pour l’événement de génération de jetons XRT (qui a finalement eu lieu au printemps 2019 en raison du premier hiver de cryptographie).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "À partir de cette période, Robonomics a commencé à développer dynamiquement des cas d’utilisation liés à l’industrie 4.0 - usines intelligentes, villes intelligentes et maisons intelligentes - et cela a attiré notre attention sur le monde de l’IdO. À la recherche d’innovation, l’équipe a présenté plusieurs grandes démonstrations de R&D uniques: un",
  "sensor network": "réseau de capteurs civils,",
  "a water drone": "un drone à eau",
  "for environmental monitoring (supported by a sensor systems manufacturer": "pour la surveillance environnementale (soutenu par un fabricant de systèmes de capteurs",
  "a smart factory model": "modèle d’usine intelligente",
  "a self-employed": "un",
  "robot artist Gaka-chu": "rtiste robot indépendant Gaka-chu ",
  "and a": "et",
  "drone traffic management system": "un système de gestion du trafic des drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Robonomics a commencé la coopération avec le projet IPCI DAO sur la gestion des actifs environnementaux en utilisant les technologies Web3 et les dispositifs IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Il s’agissait d’une période de R&D active au cours de laquelle nous avons identifié un éventail de tâches, dans lesquelles les technologies P2P ont des capacités qui n’étaient pas disponibles auparavant pour la robotique. En combinant l’ordinateur Ethereum, le stockage de fichiers IPFS et le système d’exploitation robot (ROS), nous avons réalisé que n’importe quel appareil pouvait potentiellement devenir un",
  "autonomous intelligent robot agent": "agent robot intelligent autonome",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Cela nous a ouvert la voie aux concepts de robot-service et d’économie robotique.",
  "Our publications in scientific journals of this period are available in the": "Nos publications dans les revues scientifiques de cette période sont disponibles dans la section",
  "Papers section": "Articles",
  "We have collected all R&D projects over the years in the": "Nous avons rassemblé tous les projets de R&D au fil des ans dans un",
  "a handy book": "livre pratique",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tout a commencé avec une idée qui a commencé sur les fondateurs quand Ethereum avait juste lancé son réseau principal. Que faire si le robot effectue une tâche pour un client de crypto-monnaie, et sa logique est contrôlée par un contrat intelligent?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Pour tester l’idée, nous avons fait une démonstration dans laquelle un drone contrôlé par un ordinateur Ethereum a été lancé pour atteindre les coordonnées GPS spécifiées après que l’utilisateur a terminé une transaction de paiement.",
  "The demo is available on": "La démo est disponible sur",
  "YouTube": "YouTube",
  "Notable events": "grandes manifestations",
  "Robonomics whitepaper 2022 welcome guide": "Livre blanc Robonomics 2022 – Guide de bienvenue",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Nous avons développé un protocole de communication techno-économique fonctionnant sur Ethereum et IPFS, et le complétons avec des éléments d’une plate-forme IoT basée sur le Polkadot. Aujourd’hui, nous disposons déjà d’une plateforme hybride pour créer des applications IoT futuristes. Il fournit l’interaction avec les dispositifs sous le contrôle d’un ordinateur décentralisé global. Avant de commencer à créer des applications IoT sécurisées, sans serveur et futuristes à l’aide de la plateforme Robonomics, plongeons un peu dans la théorie...",
  "Chapter 1.": "Chapitre 1.",
  "At the intersection of cybernetics and economics": "À l’intersection de la cybernétique et de l’économie",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Nous avons présenté un système économique dans lequel les dispositifs robotiques agissent comme des agents indépendants capables de réaliser des activités économiques clés, auparavant réservées aux humains. Dans ce chapitre, nous parlerons de la pertinence de l’économie des robots, qui peut devenir une partie importante de la vie des gens et changer le niveau actuel de l’économie en services entièrement automatisés à l’avenir.",
  "In this chapter you will learn": "Dans ce chapitre, vous apprendrez",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase et la nature de l’entreprise",
  "CPS - cyber-physical system": "SCP - système cyberphysique",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener et la recherche de modèles dans la vie et la machine",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "La quatrième révolution industrielle, l’argent pour les robots et Bitcoin",
  "Ethereum Smart Contracts": "Contrats intelligents Ethereum",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Questions ouvertes sur la téléologie et le travail de Mises",
  "Read chapter 1": "Lire le chapitre 1",
  "Chapter 2.": "Chapitre 2.",
  "Robonomics architecture": "Architecture robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Dans le deuxième chapitre, vous découvrirez l’interaction homme-machine à l’aide de la technologie Internet moderne - des appareils IoT à un réseau décentralisé et globalement accessible de fournisseurs. Nous examinerons les bases de l’Internet des objets afin de mettre en évidence les problèmes et les principaux défis auxquels sont confrontés les créateurs de systèmes IoT et à la solution de laquelle Robonomics est destiné.",
  "Overview of the state of the Internet of Things (IoT)": "Aperçu de l’état de l’Internet des objets (IdO)",
  "Classification of IoT devices": "Classification des dispositifs IoT",
  "Embedded IoT systems": "Systèmes IdO imbriqué",
  "Edge-systems: IoT gateways and controllers": "Edge-systems : passerelles et contrôleurs IoT",
  "Autonomous Systems": "Systèmes Autonomes",
  "Internet of Things providers": "Fournisseurs d'Internet des objets",
  "Digital twins are the heart of the Internet of Things": "Les jumeaux numériques sont  cœur de l'Internet des objets",
  "IoT data flows in cloud service": "Flux de données IoT dans le service cloud",
  "Popular examples of IoT solutions": "Exemples populaires de solutions IoT",
  "Current problems of building IoT solutions": "Problèmes actuels liés à l’élaboration de solutions IoT",
  "Main tasks of Robonomics architecture": "Principales tâches de l’architecture Robonomics",
  "Basic components of Robonomics architecture": "Composants de base de l’architecture Robonomics",
  "A simple representation of Robonomics architecture": "Une simple représentation de l’architecture Robonomics",
  "Read chapter 2": "Lire le chapitre 2",
  "We continue to update the white paper of Robonomics": "Nous continuons à mettre à jour le livre blanc sur les Robonomics",
  "stay tuned for new parts on our website and in Discord": "Restez à l’affût de nouvelles pièces sur notre site Web et dans Discord",
  "Join our discord": "Rejoignez notre discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Ensuite, nous aimerions vous montrer les domaines pratiques de l’interaction homme-machine en utilisant la technologie moderne d’Internet. Nous passerons de l’architecture des dispositifs IoT familiers de l’échange d’informations techniques par les services cloud à l’organisation de l’interaction technico-économique par un réseau décentralisé et globalement accessible de fournisseurs.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Pour commencer, nous devons faire une excursion dans la région qui est le plus clairement liée à la connexion réseau des systèmes automatisés. Après cela, nous examinerons les bases de l’Internet des objets afin de mettre en évidence les problèmes et les principaux défis auxquels sont confrontés les créateurs de systèmes IoT et à la solution de laquelle Robonomics est visé.",
  "Overview of the state of the internet of things (IoT)": "Aperçu de l’état de l’internet des objets",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "La question de l’accessibilité du réseau des dispositifs automatiques a été discutée partout dans la planète depuis les années 60, et déjà à cette époque des tentatives assez sérieuses ont été faites pour le résoudre. Par exemple, le cybernéticien soviétique Viktor Glushkov a proposé et partiellement mis en œuvre la collecte automatisée d’informations sur les volumes de production d’une usine individuelle dans le cadre de la conception de la",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "système d’information national dans les années 60 et 70. Il est bien connu que le distributeur Coca-Cola a été connecté à l’ARPANET dans les années 1980 afin que les machines puissent déclarer la disponibilité des boissons et leur température.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Mais encore, le développement actuel de l’IdO se produit aujourd’hui, en raison de l’utilisation généralisée des technologies habilitantes. Les principaux moteurs de l’évolution rapide des applications de l’Internet des objets sont les résultats du développement de nombreux domaines – des communications sans fil de diverses gammes aux dispositifs embarqués, en passant par l’analyse en nuage et l’apprentissage automatique. Le nombre de dispositifs IoT a augmenté régulièrement au cours des 10 dernières années (avec une prévision de 25 milliards d’unités d’ici 2030), ce qui a incité les chercheurs et les développeurs à créer de nouvelles applications IoT dans divers domaines tels que la santé, la domotique, l’agro-industrie, protection de l’environnement.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Nous nous intéressons davantage au processus de construction de systèmes IoT   et aux tâches qui en découlent. Au fil des années de recherche, de nombreuses   architectures différentes ont été proposées, et en les faisant la moyenne, nous pouvons distinguer trois composants de base d’un système IoT : les appareils, l’infrastructure réseau, les machines analytiques, informatiques et de contrôle.",
  "New challenges": "Nouveaux défis",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Un autre défi récent pour la construction de l’IdO a été le concept du jumeau numérique - une version numérique de l’équipement réel qui copie ses spécifications et ses données historiques. Ce concept est à son meilleur dans les domaines où il est nécessaire d’avoir une spécification précise et complète d’un processus et être en mesure de prédire son développement. L’Internet des objets est le principal intégrateur des jumeaux numériques, mais cette tâche est beaucoup plus profonde que la connectivité habituelle des appareils IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "En ce moment, nous assistons à tout un segment du réseau, conçu et pratique non pas pour les personnes, mais pour les machines. L'Internet des objets n'est plus seulement la mécanique de connexion d'un appareil au réseau, mais davantage de services, créés et disponibles spécifiquement pour les appareils. L'Internet des objets connecte non seulement l'utilisateur et l'appareil, mais aide également les appareils à gérer les tâches de fourniture d'un service à la personne, mais de manière autonome.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Ces systèmes n’ont pas d’interface utilisateur et sont généralement utilisés au niveau le plus bas des écosystèmes IoT pour fournir des fonctionnalités de base. Doivent être économes en énergie et de petite taille. Ont des ressources informatiques et de communication limitées. Les passerelles ou les contrôleurs IoT servent habituellement de récepteurs de signaux.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Ces systèmes servent de lien entre les systèmes intégrés accessibles localement et l’Internet mondial. Ils prennent généralement en charge plusieurs protocoles de communication de systèmes embarqués et transfèrent la télémétrie des appareils au nuage et contrôlent les signaux à l’envers. Souvent, ces appareils sont une version plus sophistiquée du routeur WiFi, équipé d’un ordinateur de carte unique pour effectuer le traitement primaire de l’information à partir des appareils sans quitter le réseau local.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Cette classe comprend des complexes automatisés (tels que Spot de Boston Dynamics), qui ont un composant de contrôle au niveau d'un ordinateur complet avec un processeur haute performance et une grande quantité de mémoire. Dans de tels cas, le robot est connecté à Internet sans solutions intermédiaires supplémentaires (systèmes de bord). Le logiciel nécessaire pour accéder à l'Internet des objets est installé directement sur l'ordinateur du système autonome. Les données sont recueillies et partiellement diffusées sur Internet comme tout dispositif de réseau à part entière.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Le travail principal des fournisseurs IoT est de fournir aux utilisateurs un accès à distance aux données et aux analyses, ainsi que la gestion des appareils intelligents sur Internet. Les principaux critères de qualité du fournisseur sont la sécurité des opérations, la stabilité de la connexion et la disponibilité du fournisseur de partout dans le monde.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Le schéma standard pour travailler avec un fournisseur IoT comprend : l’installation de logiciels compatibles avec le dispositif intelligent cloud, la mise en place de services de gestion côté cloud après la première connexion réussie d’un dispositif, la connexion de divers types de services analytiques.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "En parlant de jumeaux numériques, il convient de noter que leur mise en œuvre architecturale est nécessaire, comme un refus de donner à l’utilisateur un accès direct aux dispositifs de contrôle et de changer leur état. Parmi les raisons les plus évidentes de rejet sont, d’abord, la présence de leurs propres exigences et conditions dans les appareils juste avant le lancement. Deuxièmement, si plusieurs appareils utilisateurs doivent accéder à une seule source de données, il peut être essentiel de donner un contrôle personnalisé à chaque utilisateur. Enfin, il est extrêmement utile de garder le dernier état réel de l’appareil disponible en cas de panne.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "En conséquence, nous avons une séparation de la boucle d’échange d’informations avec l’utilisateur et la production réelle de données par les capteurs. Pour illustrer ce principe, voici le processus de l’utilisateur travaillant avec un dispositif IoT utilisant un jumeau numérique.",
  "IoT data flows in cloud services": "IoT les flux de données dans les services cloud",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Valeurs d’entrée pour les déclencheurs de nuage. Par exemple, le service infonuagique envoie diverses notifications à l’utilisateur en cas de signalement d’une grève par un détecteur d’alarme de voiture.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Données de sortie pour les analyses complexes qui ne peuvent pas être produites au niveau de la périphérie. Par exemple, lors du traitement de la vidéo pour la reconnaissance faciale dans une foule.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "La base pour former un jumeau numérique de l’appareil afin de créer une fonte de son état. Par exemple, à la demande de l’utilisateur dans l’application mobile ou sur le site Web.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Un système de maison intelligente typique fournit un large éventail d’options pour contrôler votre espace de vie. Avec son aide, vous pouvez contrôler à distance les serrures de porte, en installant un accès unique ou régulier à la chambre en tant que famille et amis, et pour le personnel d’entretien ou de livraison. Avec de nombreux capteurs et dispositifs d’enregistrement, le système est en mesure d’inclure un enregistrement vidéo lors du déclenchement des capteurs de mouvement, prendre des décisions de manière autonome pour couper l’alimentation en eau lorsqu’une fuite est détectée dans le système d’eau, démarrer un robot aspirateur programmé, fournir un rapport de nettoyage à l’application utilisateur, changer la température ambiante à la valeur optimale en fonction de votre horaire.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Voitures intelligentes. Fournissant à l''électronique embarquée de la voiture un accès à l''Internet mobile, l''utilisateur accède au contrôle à distance de diverses fonctions de la voiture directement depuis son smartphone : ouverture des portes, mise en marche de la climatisation, commande des phares. Si ces voitures sont utilisées pour l''autopartage, vous pouvez créer une carte interactive de l''emplacement des voitures avec leur statut, le carburant restant, etc. pour les clients de ce service.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Système de location d’équipement intelligent. La société installe des manipulateurs robotiques sur la ligne de convoyeur en vertu d’un contrat avec paiement pour le nombre d’opérations ou pour le temps du robot. Les manipulateurs fournissent régulièrement un registre des opérations effectuées, des erreurs et des avertissements. Les frais de location du robot sont calculés sur cette base, ainsi que la maintenance prédictive des robots par le fournisseur.",
  "Global availability": "Disponibilité mondiale",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "L’architecture client-serveur standard nécessite de spécifier les endpoints lors du routage des messages depuis les périphériques IoT. Ainsi, pendant la durée de vie d’un appareil intelligent, l’absence de connexion se traduira par une limitation de la capacité de contrôler et d’interagir avec l’appareil.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Par exemple, la guerre commerciale entre la Chine et les États-Unis est déjà une épée de Damoclès suspendue au-dessus de milliers de consommateurs d’appareils intelligents chinois aux États-Unis et vice versa. À tout moment, le blocage des serveurs Xiaomi par les autorités américaines pourrait toucher les utilisateurs des appareils qui se connectent aux services infonuagiques du fabricant.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Étant à proximité immédiate d’un appareil IoT, vous ne pouvez pas le contrôler à partir d’une application mobile s’il n’y a pas de connexion aux serveurs, par laquelle l’authentification de l’utilisateur et la collecte de télémétrie à partir des appareils eux-mêmes sont fournis. Autrement dit, l’appareil est en fait contrôlé par le nuage, pas l’utilisateur.",
  "Cybersecurity": "Cybersécurité",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "La raison la plus importante de la faible cybersécurité de la plupart des solutions IoT découle de l'héritage problématique de l'architecture client-serveur cloud. Par exemple, l'architecture de maison intelligente la plus courante à l'heure actuelle est généralement un hub IoT, connecté à un service cloud. Ainsi, un système IoT typique est un élément de contrôle central connecté à plusieurs systèmes externes. Certes, le service cloud est plus sécurisé que les appareils de bas niveau, mais la consolidation du contrôle centralisé sur des centaines de milliers de ces systèmes fait de toute faille de sécurité et fuite un désastre massif.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Les serveurs de service cloud sont soumis à tous les problèmes de cybersécurité typiques : attaques réseau, attaques DoS (conduisant le système à la défaillance), modifications malveillantes, détournement de session utilisateur, etc. Mais les menaces fortes comprennent également des problèmes non intentionnels tels que les erreurs de conception, mauvais usage ou catastrophes naturelles qui causent la défaillance des serveurs. Un autre point certainement important est la nécessité en principe de faire confiance au cloud et aux personnes qui le maintiennent.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Tout cela est exacerbé par l’ampleur des solutions IoT. Le nombre de systèmes IoT. Certes, le service cloud est plus sécurisé que les appareils de bas niveau, mais la consolidation du contrôle centralisé sur des centaines de milliers de tels systèmes fait de toute brèches de sécurité et de fuites un désastre massif.",
  "Data privacy": "Confidentialité des données",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Le point de confidentialité doit être séparé de la cybersécurité, car ce problème est spécifique aux systèmes IoT. En raison du grand nombre et des types d’appareils variés qui sont beaucoup plus intégrés dans le monde physique que seulement les ordinateurs et les smartphones, la gamme de types de données privées est multipliée. Il ne s’agit plus seulement de la localisation GPS, des relevés d’achats, des transactions financières et des photos, mais aussi d’un enregistrement permanent de vidéos et de conversations, d’empreintes vocales, de problèmes de santé et même d’une liste des habitudes d’une personne. Parmi les types de menaces liées à la vie privée sont : identification de l’information, localisation et suivi, profilage, attaque d’inventaire, attaque de couplage de données",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "La partie la plus effrayante est que les utilisateurs ont peu ou pas conscience qu'ils renoncent à leur vie privée, car ils n'ont presque aucune idée des données collectées et de la manière dont elles sont utilisées. La menace pour la vie privée augmente non seulement des intrus, mais aussi des organisations et des agences gouvernementales précisément à cause de cela. Les services cloud IoT nécessitent généralement un transfert de données maximal à partir des appareils, et il n'existe aucun moyen d'interdire ou de restreindre le transfert de données ('Accept the Terms or Piss Off'). De plus, malgré le fait que les données collectées sont un atout et ont une valeur réelle, la personne auprès de laquelle elles sont collectées se voit non seulement refuser le droit de disposer activement de ces données, mais se voit même refuser toute compensation pour la collecte et l'utilisation de ses propres données.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "S’appuyant sur les réalisations et les défis des plateformes cloud, Robonomics vise à offrir au marché de l’IoT des solutions Internet plus sûres et plus avancées à chaque étape de la communication homme-machine. Voici les principales tâches que Robonomics vise à :",
  "Managing an IoT device using a decentralized cloud": "Gestion d'un appareil iot à l'aide d'un cloud décentralisé",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Les réseaux Blockchain ont toutes les capacités pour fournir le plus haut degré de sécurité pour faire fonctionner un appareil et obtenir sa télémétrie. L’interaction avec l’appareil peut effectivement être décrite en changeant l’état du jumeau numérique stocké dans le réseau blockchain et en envoyant des informations sur ces changements. Dans le cas d’une blockchain sans autorisation, nous pouvons parler des garanties de disponibilité mondiale des fournisseurs pour l’IoT, ainsi que d’un niveau élevé de protection des données numériques jumelées contre les changements indésirables.",
  "Performing technical and economic transaction between people and machines": "Effectuer des transactions techniques et économiques entre les personnes et les machines",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Grâce au mécanisme des crypto-monnaies et des contrats intelligents, nous pouvons fournir un accès aux systèmes automatisés directement aux marchés numériques. Par exemple, Ethereum met déjà en œuvre la plupart des outils de base de l'activité économique pouvant être utilisés dans le fonctionnement d'appareils autonomes. Les applications créées pour l'interaction entre l'utilisateur final et l'appareil IoT seront beaucoup plus efficaces si les conditions de service et de paiement sont indissociables des paramètres de lancement de l'appareil.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Les progrès modernes en Web3-technologie peuvent résoudre la question de la vie privée des utilisateurs. Avec Web3, il n’est pas nécessaire de s’authentifier ou de se connecter à des serveurs spécifiques pour accéder à la télémétrie et contrôler l’appareil.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics est un cloud décentralisé pour les jumeaux numériques de dispositifs IoT. Robonomics soutient le format techno-économique pour la communication, ainsi que fournir des applications privées pour les utilisateurs",
  "A human interface to access the system": "Une interface humaine pour accéder au système",
  "A communication protocol": "Un protocole de communication",
  "A machine interface": "Une interface machine",
  "Human interface": "Interface humaine",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Nous proposons l’utilisation d’applications décentralisées (dapps) comme principal moyen de connecter les utilisateurs pour contrôler les appareils intelligents sur Internet. Ainsi, nous serons en mesure de fournir l’interface utilisateur la plus sécurisée (en termes de données) au système, qui sera en mesure de travailler simultanément dans les conditions du réseau de la ville locale, et à travers un réseau mondial commun.",
  "Communication protocol": "Protocole de communication",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Son rôle est joué par le réseau Robonomics, une spécification développée par l’équipe de projet qui met en œuvre un réseau décentralisé de fournisseurs qui fournissent la transmission, le traitement et le stockage de l’information nécessaire pour faire fonctionner les dispositifs IoT. En fait, il s’agit d’une implémentation d’un noeud spécifique à une fonction pour les réseaux IPFS, Ethereum et Polkadot.",
  "Machine interface": "Interface machine",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Voici un diagramme général du cycle de démarrage complet de l’appareil à l’aide de la plateforme Robonomics :",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "L’application décentralisée de l’utilisateur envoie une demande pour une fonction de contrôle de périphérique via le réseau Robonomics.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "Le réseau Robonomics fournit la traduction de requête en utilisant libP2P et capture les événements dans Ethereum blockchain ou Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Le contrôle de l’appareil est assuré par un réseau décentralisé, qui est garanti pour stocker les informations nécessaires au fonctionnement de l’appareil IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "Le dispositif IoT reçoit indépendamment des informations des réseaux Ethereum et Polkadot sur l’état actuel du jumeau numérique. Cela garantit que l’appareil ne peut être démarré en toute sécurité qu’après que les paramètres techniques et économiques de démarrage ont été fixés.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "En conséquence de l’opération, le dispositif IoT publie un journal des opérations terminées, qui peut être utilisé comme preuve du service fourni ou pour les erreurs de débogage.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Le journal est transformé en rapport pour l’utilisateur et devient disponible dans son dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Conception de Dapps et services Web pour l’IdO sur le parachain Robonomics",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, architecte logiciel",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Rappelons-nous que la machine automatique est l'équivalent économique exact du travail servile. Tout travail en concurrence avec le travail esclave doit accepter les conséquences économiques du travail esclave.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "cybernétique",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Les robots sont comme les enfants adultes aujourd’hui – ils peuvent déjà gérer de l’argent, entrer dans des relations juridiques, être indépendants.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "L'avenir de l'humanité elle-même dépend de la manière dont nous apprenons aux robots à gérer leurs capacités.",
  "Robonomics tools": "Outils de Robonomics",
  "Operate with digital twins of IoT devices": "opérer avec des jumeaux numériques d'appareils IoT",
  "The first tools of the robot economy: money for robots, contracts for robots": "Les premiers outils de l’économie robotique : argent pour les robots, contrats pour les robots",
  "Software for connecting devices to a decentralized cloud": "Logiciel pour connecter des appareils à un cloud décentralisé",
  "API library for custom IoT applications": "Bibliothèque d’API pour les applications IoT personnalisées",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics contient un ensemble complet d’outils pour le développement d’applications IoT, tant du côté de la robotique que de l’interface utilisateur. La communication entre l’utilisateur et l’appareil se fait à l’aide des technologies les plus performantes du monde Web3 : IPFS, Ethereum et Polkadot. Ainsi, les développeurs peuvent créer des applications modernes et sécurisées pour les villes intelligentes et l’industrie 4.0.",
  "Robonomics Connectivity": "Connectivité Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Pour la commodité des développeurs, Robonomics contient un ensemble de logiciels pour la connexion d’appareils IoT utilisant le protocole HTTP/MQTT, des systèmes robotiques complexes utilisant le Robot Operating System (ROS).",
  "Connect a sensor": "Connecter un capteur",
  "to the Robonomics network": "au réseau Robonomics",
  "Try": "Essayer",
  "a simple prototyping tool": "un outil de prototypage simple",
  "Start building your own cyber physical system with": "Commencez à construire votre propre système physique cybernétique avec",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics prend en charge des centaines de robots prêts à l'emploi",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Les utilisateurs de la plateforme peuvent connecter des robots compatibles ROS à l’économie numérique en quelques minutes. Pour une liste complète des robots pris en charge, veuillez suivre le lien",
  "Decentralized Cloud infrastructure for IoT": "Infrastructure infonuagique décentralisée pour l’IdO",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) est le service d'infrastructure de base pour la robotique et l'IoT en plus de Robonomics Parachain et IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "Économie des robots",
  "Core RWS features available for IoT today": "Fonctionnalités RWS de base disponibles pour l’IoT aujourd’hui",
  "RWS PubSub Message Broker": "Courtier de messages RWS PubSub",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Utiliser la messagerie illimitée sur un réseau P2P basé sur le protocole IPFS",
  "RWS Data Blockchainization Service": "Service de blockchain de données RWS",
  "RWS Robot Actions": "RWS vente aux enchères du robot",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Allumer/éteindre ; lancer ou arrêter vos appareils IoT sous le contrôle d’un ordinateur décentralisé",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Le cœur de votre application IoT - Digital Twin sur Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Dans l’architecture technique, les jumeaux numériques IoT fournissent la visibilité et la surveillance des choses et des événements connexes (p. ex., utiliser des dispositifs IoT pour saisir automatiquement l’origine d’un produit), et blockchain permet la version unique partagée de la vérité quant à l’état de ces choses à travers leurs cycles de vie et les événements d’affaires connexes",
  "from Gartner research": "de la recherche Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachain offre la possibilité de créer un modèle de jumeau numérique et de mettre à jour son état toutes les 6 secondes.",
  "Secure": "Sécurisé ",
  "Serverless": "sans serveur",
  "Futuristic": "Futuriste",
  "IoT applications": "Applications IdO",
  "Robonomics network vision": "Vision du réseau Robonomics",
  "At the frontier of cybernetics and economics": "À la frontière de la cybernétique et de l’économie",
  "Build your IoT services on Robonomics platform": "Développez vos services iot sur la plateforme robonomics",
  "taking full advantage of decentralized architecture": "profiter pleinement de l’architecture décentralisée",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics permet aux utilisateurs de se connecter à des appareils intelligentsà l’aide d’applications décentralisées (dapp) qui ne nécessitent pas le transfertde données utilisateur pour l’authentification. La communication se fait via unréseau décentralisé de fournisseurs sans un seul point de défaillance, et l’appareilobtient indépendamment des informations du réseau blockchain pour exécuter outransmettre des données à distance. Ainsi, Robonomics fournit un niveau élevéde cybersécurité des appareils et de confidentialité des données des utilisateursà toutes les étapes de la communication de l’application utilisateur au lancementde l’appareil intelligent.",
  "From smart contracts to cross chain IoT platform": "Des smart contracts à la plateforme cross chain",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Le projet Robonomics a plus de 6 ans. Nous avons commencé à préparer la premièreexpérience de démonstration de la communication homme-machine utilisant un réseaude fournisseurs décentralisés indépendants en 2015, dès les premiers jours duréseau Ethereum. Début 2021, l’équipe du projet a réussi à créer un protocolede communication techno-économique sur Ethereum et IPFS, et à le compléter pardes éléments d’une plateforme IoT basée sur le Parachain Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "En conséquence, aujourd’hui, nous avons déjà une plate-forme hybride pour créerdes applications IoT futuristes qui permettent l’interaction avec les appareilssous le contrôle d’un ordinateur décentralisé mondial.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Les créateurs de Robonomics sont des expérimentateurs, des ingénieurs et desscientifiques qui prennent soin de comprendre la validité scientifique de l’approcheet d’obtenir la clarté dans la présentation des principes qui devraient formerla base de toute l’architecture de la solution logicielle.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "Dans nos articles entre 2017 et 2020, nous avons présenté à la communauté scientifiquede nombreux concepts et solutions unis autour de l’idée de l’économie robotique,un système économique dans lequel les dispositifs robotiques agissent comme desagents indépendants capables d’effectuer des activités économiques clés, auparavantréservé aux humains. Vous pouvez lire les articles scientifiques",
  "this link": "à ce lien",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Nous voudrions justifier l’émergence de l’économie robotique et expliquer entermes généraux pourquoi nous croyons que ce concept est la réponse inévitableet évidente au fonctionnement des systèmes robotiques à grande échelle de la nouvellerévolution industrielle.",
  "Move towards the factory of the future": "Marche vers l’usine du futur",
  "Inspired by Ronald Coase": "Inspiré par Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Le prix Nobel d’économie Ronald Coase, dans son ouvrage de 1937 intitulé « TheNature of the Firm », démontrait le mieux la dichotomie « hiérarchie contre libremarché » et expliquait les raisons de l’existence des organisations, en particulierdes entreprises. Coase discute de l’impact des coûts de transaction (le coût decollecte et de traitement de l’information) pour prendre des décisions sur laconclusion d’un contrat et surveiller sa mise en œuvre. L’entreprise, avec toutesa structure hiérarchique hors marché, est le moyen le plus efficace de fournirau consommateur le produit cible avec les coûts de transaction les plus bas àl’heure actuelle, lorsque l’effort transactionnel pour créer le même produit parle biais de multiples échanges sur le marché entre les individus devient beaucoupplus élevé. Pour mieux visualiser ce processus, regardez l’exemple illustratifde l’achat d’une voiture. Essayez d’acheter une voiture par les pièces et de calculercombien d’argent et de temps vous allez dépenser juste pour assembler tous lescomposants dans votre garage. Les risques et les coûts de négociation liés à l’achatde pièces sont trop élevés par rapport au modèle X standard de Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Néanmoins, cela ne conduit pas à l’émergence de la seule entreprise au mondepour la production de tout. Le fait est que les mêmes coûts de transaction imposentégalement des restrictions à la taille des entreprises. Coase écrit: ",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...une entreprise aura tendance à prendre de l’expansion jusqu’à ce que lescoûts d’organisation d’une transaction supplémentaire au sein de l’entreprisedeviennent égaux aux coûts de réalisation de la même transaction au moyen d’unéchange sur le marché libre ...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "En d’autres termes, plus la hiérarchie au sein de l’entreprise est complexe,plus les coûts internes sont élevés et, à un moment donné, ils s’avèrent excessifspar rapport aux coûts de retour sur le marché. Par conséquent, pour assurer leurcroissance en tant que l’un des moteurs, les entrepreneurs cherchent des moyensde réduire ces coûts.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "L’idée de réduire les coûts de transaction grâce à la capacité de tous les participantsau processus commercial (production, logistique, consommation) de s’unir à unniveau plus étroit est",
  "clearly correlates": "clairement en corrélation",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "avec les problèmes et les défis auxquels sont confrontés les fabricants de solutionsd’automatisation. Au cours des 50 dernières années, les opérations standard/régulièresde la plupart des processus d’affaires des grandes entreprises ont été presqueentièrement automatisées. Les fabricants doivent essentiellement établir une communicationsécurisée entre les parties entièrement automatisées de la chaîne d’approvisionnement,ce qui freine la réduction des coûts de transaction par l’automatisation. Le désirde commercialiser des produits ou des services plus concurrentiels que les entreprisespartiellement automatisées",
  "firms spurs the search for solutions to": "stimule la recherche de solutions",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "à ces défis. Il semble que tout se dirige vers l’émergence des robofirms - desorganisations dans lesquelles tout le cycle du processus économique est entièrementautomatisé et ne nécessite pas la participation humaine, sauf en tant que bénéficiaireset consommateurs.",
  "Get rid of transaction costs": "Se débarrasser des coûts de transaction",
  "Our future in smart cities": "Notre avenir dans les villes intelligentes",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "La tâche à laquelle les fabricants d’automatismes sont confrontés aujourd’huiporte un nom particulier : la construction de systèmes cyberphysiques (abrégésen CPS). Par",
  "definition,": "définition,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "un CPS est une forte unification et intégration mutuelle de multiples processus informatiques, réseaux et physiques.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Les tâches de construction de CPS sont centrales à toute idée décrite dansla nouvelle (quatrième) révolution industrielle. Par conséquent, CPS est la pierreangulaire de notre vie future dans les Smart Cities, se manifestant partout. Exemplesde systèmes cyber-physiques de l’avenir : Uber pilote automatique, selfies dedrones, réseau d’imprimantes 3D dans les stations de métro.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "CPS est une structure complexe de nombreux éléments connectés : de l’applicationsur le téléphone, il s’étend au contrôle du drone en vol au-dessus de la ville,puis procède à la publication des photos qui en résultent sur Instagram, maisseulement après le traitement par l’IA cloud.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "La chose la plus importante dans le processus de conception de CPS est de trouverla ligne fine entre le nombre suffisant et excessif d’éléments automatisés dansla chaîne d’approvisionnement des utilisateurs de services. En d’autres termes,où est la limite de taille de la CPS? Pour répondre à cette question, nous devrionsnous tourner vers le célèbre mathématicien Norbert Wiener.",
  "Self-regulating systems": "Systèmes d'auto-régulation",
  "Inspired by Norbert Wiener": "Inspiré par Norbert Wiener",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener parle de la viabilité de l’approche scientifique interdisciplinaire.Par exemple, il a établi des parallèles entre les systèmes de contrôle automatiséset les défis de l’échelle et de la complexité croissante de la société humaine.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "En d’autres termes, l’approche cybernétique peut être appliquée également àla psychothérapie, à la biologie et à la navigation automatisée. Il est basé surla fonction du système, comment les actions individuelles sont contrôlées et commentles nœuds individuels interagissent les uns avec les autres.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "En prenant en compte les publications de Ronald Coase et Norbert Wiener, suiteau développement de l’Industrie 4.0, nous pouvons envisager d’utiliser CPS commeagent économique, tout en concevant des services robotisés. Pour réguler la taillede la CPS et s’adapter aux besoins changeants des individus, nous pouvons utiliserle mécanisme du marché.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Les entreprises de robotique sont une représentation idéale pour les systèmescyberphysiques. Il s’agit d’une unité assez autonome capable de fournir des servicesaux humains et à d’autres robots contre de l’argent. Par conséquent, l’économiedes robots nous semble être un ensemble général de CPS qui fournissent des serviceset des biens directement sur le marché.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Argent pour les robots",
  "Industry 1.0": "Industrie 1,0",
  "Mechanization:": "Mécanisation",
  "replacement of muscle power with steam energy.": "remplacement de la puissance musculaire par l'énergie de la vapeur.",
  "1784 y.": "1784 ",
  "Industry 2.0": "Industrie 2,0",
  "Electrification:": "Électrification",
  "introduction of assembly-line production.": "introduction de la production en chaîne.",
  "1870 y.": "1870",
  "Industry 3.0": "industrie 3.0",
  "Automation:": "Automatisation",
  "introduction of automated systems with CNC.": "introduction de systèmes automatisés avec CNC.",
  "1969 y.": "1969",
  "Industry 4.0": "l'industrie 4.0",
  "Smart production:": "Production intelligente :",
  "development of cyber physical systems.": "développement de systèmes cyberphysiques.",
  "Now": "Maintenant",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "Dans le monde des industries robotiques, il s’avère naturel de fournir aux robotsl’accès à des institutions sociales qui n’étaient auparavant nécessaires qu’auxhumains.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Les institutions sociales ne naissent pas parce que les gens ne peuvent pas vivre sans banques, sans contrats et sans autres instruments de société. Ils surviennent uniquement parce qu'une personne à un moment donné s'est engagée sur la voie de relations plus complexes dans la société et a franchi une étape importante vers l'accélération des processus environnants.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "L’argent et les contrats devraient devenir disponibles pour les robots, nonpas parce que c’est une fantaisie malade de fans de robots qui ont oublié ce qu’estSkynet. Mais seulement parce que la nouvelle révolution industrielle se chargede construire des chaînes automatisées complexes, dont les processus affecterontl’échange d’informations techniques et économiques, et se dérouleront égalementà une vitesse inaccessible aux humains.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Les robots ont besoin d’argent qui leur sera directement disponible afin d’êtreen mesure d’effectuer des opérations sans une personne à la vitesse avec laquelleseules les machines peuvent prendre des décisions. Et tout cela est uniquementpour une personne de profiter de la vie dans la Smart City!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "Et ici, nous venons en douceur à la première trésorerie électronique - Bitcoin.Le fait que Bitcoin peut être stocké dans votre compte sur le principe de ne pasune banque, mais l’argent dans votre portefeuille en fait le premier argent quele robot peut gérer indépendamment, plus précisément de façon autonome. En mêmetemps, aujourd’hui, nous pouvons déjà dire que Bitcoin n’est pas seulement del’argent électronique, mais une institution financière vraiment mondiale.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "En conséquence : un événement que nous n''avons pas inventé, mais qui tombeclairement dans notre vision, fait du Bitcoin le premier argent pour les robots,ou, si nous regardons encore plus profondément, c''est précisément cette institutionsociale qui aidera à la formation d''entreprises robotiques.",
  "Smart contracts": "Contrats intelligents",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin est devenu le premier argent disponible pour les robots. En attendant,nous ne pouvons pas parler de Bitcoin dans sa forme actuelle comme un outil pourl’échange technique et économique à part entière.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Maintenant, nous avons déjà des contrats intelligents, des marchés DeFi et uneinfrastructure décentralisée pour échanger des messages entre les robots qui ouvrentla possibilité pour l’humanité de créer une partie entièrement automatisée del’économie humaine - l’économie des robots.",
  "One of the great opportunity to build the economy of robots is": "L’une des grandes opportunités pour construire l’économie des robots est la technologie",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Avec la fonctionnalité Ethereum, les robots peuvent non seulement échanger de l’argent, mais aussi conclure des contrats avec les humains et entre eux.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Mais à quoi sert la communication contractuelle machine à machine (m2m)? C’estune excellente question! Revenons à CPS. Lorsque nous parlons de communicationsdirectes entre les capteurs, les machines ou tout autre élément, nous parlonstoujours de collaboration au sein d’un système réglementé. Mais si nous voulonsque les services des villes intelligentes soient vivants (ou même des maisonsintelligentes dans certains cas), nous devons établir une communication avec diverséléments tiers.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Imaginons un service de livraison par drone. Si un drone, par exemple, est lapropriété de DHL comment il peut accéder aux entrepôts d’Amazon ou l’accès à toutl’espace aérien de la ville? Est-ce un monopole ? C’est un défi majeur pour denombreuses initiatives de la 4ème révolution industrielle!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "La plupart des entreprises disent qu’elles ont besoin de droits presque completssur leur environnement parce qu’elles ne savent pas comment mettre en place demanière sécurisée l’échange d’informations techniques entre les systèmes automatisésen dehors de leur propre structure interne. En même temps, si vous regardez lesprocessus dans lesquels une personne travaille, alors nous voyons que la coopérationde différentes sociétés a été longue et a réussi. Vous pouvez facilement commanderla livraison porte-à-porte des marchandises achetées sur le site Web d’Amazon,et le messager sera en mesure de conduire une voiture le long des routes de laville, recevoir une commande à l’entrepôt et l’apporter à vous.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Quelle est la différence ? Dans le premier cas, il n’y a pas moyen de construireune relation contractuelle entre les machines, et dans le second cas, dans lemonde des personnes, les relations contractuelles existent déjà.",
  "Parachains": "Parachains",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "La principale difficulté à laquelle Robonomics fait face aujourd’hui est leprix élevé pour lancer un appareil IoT en utilisant Ethereum. Dans Ethereum, vousdevez payer une commission sur chaque transaction en dollars américains de l’ordrede 10 $ à 100 $. Il est assez cher pour la plupart des cas de l’économie réelle,que ce soit un voyage de partage de voiture, la location d’un appartement intelligent,la livraison par drone ou l’impression 3D de votre héros animé préféré à la commande.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Par souci d’équité, nous tenons à souligner qu’il existe des scénarios rentablesmême avec des frais de transaction dans le réseau Ethereum de 2018 - 2019. Parexemple, les transactions de compensation automatisées de l’empreinte carboneou le transfert de la commande du site Web directement à la production. Mais encore,pour l’application de masse des technologies Web3 dans le domaine de l’IoT, uneréduction du prix que les frais de nuage de l’appareil connecté est nécessaire.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "À la recherche d’une occasion de réduire le coût de l’interaction avec un dispositifIoT, les développeurs de Robonomics ont étudié des développements alternatifsà Ethereum. Notre choix s’est porté sur",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "l’architecture Polkadot, qui nous permettrait de gérer notre propre blockchain,au sein d’un réseau commun, dans lequel la sécurité est assurée par des validateursindépendants de notre projet.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Réseau blockchain homogène",
  "Homogeneous Shard Network": "Réseau Tesson homogène",
  "On-chain protocol control": "Contrôle des protocoles en chaîne",
  "Protection against the tyranny of the crowd": "Protection contre la tyrannie de la foule",
  "Auction of bandwidth in the common network": "Vente aux enchères de bande passante dans le réseau commun",
  "Payment for gas by users": "Paiement des frais de transaction par les utilisateurs",
  "Have you read this?": "Avez-vous lu ceci?",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Je, Robot",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "L’homme du bicentenaire",
  "Neuromancer": "Nécromancien",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Questions ouvertes de téléologie",
  "and a treatise by L. von Mises": "et un traité de L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "En conclusion, nous aimerions mentionner des questions qui restent ouvertes d’un point de vue global. Quel est le but des robots?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "La praxéologie nous inspire avec des idées intéressantes sur le comportementhumain sans dépendance directe sur les buts. Cela nous donne l’occasion de travaillersur les processus de l’économie des robots conditionnellement comme avec une boîtenoire sans plonger dans les objectifs ultimes. En même temps, la téléologie poseun défi pour expliquer les causes.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Nous espérons que quelque part à la jonction des œuvres de Mises et Wiener,un point pour le développement de l’économie des robots peut être trouvé, passeulement comme un protocole d’interaction entre les gens et les machines de naturepraxéologique, mais en tenant compte des éléments téléologiques de la communicationinterspécifique.",
  "or": "ou",
  "Github": "Github",
  "Important news &amp; announcements": "Actualités importantes et annonces",
  "All posts": "Tous les articles",
  "R&D cases": "Cas de R&D",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Collaboration avec un promoteur immobilier à Chypre pour suivre la distribution quotidienne, la consommation et compenser toute empreinte carbone excessive.",
  "This page is out of your space": "Cette page est en dehors de votre espace",
  "Check url once more or create an": "Vérifiez à nouveau l'URL ou créez un",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "nous indiquant que vous avez une erreur 404 (n'oubliez pas de mentionner l'URL actuelle)",
  "Embedded iot systems": "Systèmes IoT intégrés",
  "Autonomous systems": "Systèmes autonomes",
  "Digital twins are the heart of the internet of things": "Les jumeaux numériques sont le cœur de l'internet des objets",
  "\"Main tasks of robonomics architecture": "\"Principales tâches de l'architecture Robonomics",
  "No posts yet": "Aucun message pour l'instant",
  "If you want to help us with translation": "Si vous souhaitez nous aider à traduire",
  "contact us at": "contactez-nous à",
  "send": "envoyer",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics est une plateforme IoT 100% open-source, sécurisée, rentable et futuriste pour connecter les robots sous le contrôle de Polkadot et Ethereum. Tout le monde peut créer des services avec Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Voici une liste de nos applications éprouvées des technologies robotiques modernes.",
  "By interest:": "Par intérêt:",
  "Sort by progress:": "Trier par progrès:",
  "Any progress": "Tout progrès",
  "Complete": "Complet",
  "Proceeding": "En cours",
  "Sort by time:": "Trier par heure:",
  "Recent": "Récent",
  "Earliest": "Le plus ancien",
  "Show more": "Afficher plus",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Mettez des données dans IPFS et stockez les hachages dans une Blockchain publique",
  "Robonomics nfts": "Robonomics NFT",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Ici, nous avons rassemblé une collection de NFT créés au cours de notre longue aventure crypto, à la fois indépendamment et avec de grandes équipes. Ces jetons uniques offrent une propriété vérifiable sur la blockchain et constituent un excellent swag pour embellir votre compte blockchain. Vous pouvez enchérir sur certains d'entre eux aux enchères ou même créer votre propre pièce unique.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Lors de notre campagne initiale de crowdloan Kusama, nous avons décidé de récompenser les contributeurs de nos pionniers de la crypto avec plus que des jetons - nous leur avons également offert un NFT coloré. Cette carte a une grande signification pour nous, et si quelqu'un la possède, nous savons qu'il est un fantastique partisan des valeurs de Robonomics : la liberté et la décentralisation.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Nous sommes ravis de vous présenter notre série spéciale d'actifs numériques - Robonomics Crypto Girls, créée par l'équipe Robonomics Art&Science. Chaque NFT de cette collection est une représentation graphique unique de la technologie utilisée dans Robonomics ou construite sur la base des cas d'utilisation de Robonomics. Nos artistes talentueux ont dessiné à la main chaque fille dans le style Robonomics caractéristique. Vous pouvez choisir celle qui vous correspond ou collectionner l'ensemble de la série ! En achetant ces NFT, vous ajoutez non seulement un ajout élégant à votre collection, mais vous nous soutenez également dans notre volonté de continuer à innover et à mettre en œuvre une connectivité décentralisée pour les robots. Restez à l'écoute pour de nouveaux ajouts à la collection !",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. COLLECTIONS NFT SPOT SAISONNIÈRES",
  "On demand minting": "Minting à la demande",
  "SEASONAL SPOT NFT COLLECTIONS": "COLLECTIONS NFT SPOT SAISONNIÈRES",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Ces collections saisonnières de NFT représentent un actif numérique unique qui capture l'interaction unique entre l'utilisateur et Spot au sein de la parachain Robonomics. Les utilisateurs peuvent dessiner n'importe quoi sur le navigateur, et le robot reproduira leurs mouvements pour créer une image dessinée à la main. Une fois l'interaction terminée, le NFT est minté sur le marché Singular pour le compte Polkadot de l'utilisateur. Maintenant, n'importe qui peut interagir avec un robot réel situé dans un laboratoire en Californie pour créer des actifs numériques personnalisés et uniques qui peuvent être possédés, achetés et vendus comme n'importe quel autre actif numérique.",
  "Create your NFT": "Créez votre NFT",
  "4. automated telescope collection": "4. collection de télescopes automatisés",
  "automated telescope collection": "collection de télescopes automatisés",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Situé dans le désert d'Atacama, au Chili, un télescope physique peut être accessible via une application décentralisée pour capturer des images en temps réel d'objets astronomiques dans l'espace lointain. Chaque utilisateur disposant d'une connexion Internet peut y accéder avec des jetons $STRGZN, disponibles à l'achat dans l'application avec une carte de crédit. Sélectionnez un objet astronomique, envoyez une commande au télescope pour prendre une photo et attendez le NFT minté sur la plateforme Singular. Veuillez noter que l'application est uniquement disponible de 23h à 6h GMT-3 en raison des heures de fonctionnement du télescope.",
  "Try yourself": "Essayez vous-même",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "En collaboration avec Polkapets",
  "and": "et",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "En tant que fier membre de l'écosystème Polkadot, Robonomics a participé à Polka Pets World. Avec l'équipe Polka Pets, nous avons minté 1200 NFT présentant un concept de design unique qui met en valeur notre idée centrale de connectivité. Pour donner vie à cette idée, nous avons créé une personnalité : un androïde spécialisé dans l'aide aux humains pour se connecter à n'importe quelle entité robotique.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "En 2021, Robonomics a commencé à soutenir l'ajout des palettes RMRK dans leur runtime, ce qui entraînerait une intégration native avec la logique NFT la plus avancée au monde. Pour célébrer cette étape remarquable, nous avons lancé un objet spécial compatible avec Kanaria - un NFT enfant qui peut être équipé sur l'oiseau Kanaria de quelqu'un et peut offrir des avantages dans le métaverse RMRK.",
  "RMRK Partnerships": "Partenariats RMRK",
  "This page has moved to a": "Cette page a été déplacée vers une",
  "Automatic redirecting": "Redirection automatique",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "En 1948, un professeur de mathématiques du MIT, Norbert Wiener, a publié l'une des œuvres les plus fondamentales \"Cybernétique : Ou le contrôle et la communication dans l'animal et la machine\". Il a utilisé le terme \"cybernétique\" pour la première fois pour désigner des mécanismes d'autorégulation, et donc, cette publication est considérée comme l'anniversaire de la cybernétique reconnu.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Les grands livres conduisent à de grandes idées. Si vous recherchez plus d'inspiration sur la communication homme-machine, essayez de lire des livres de science-fiction. Marquez les livres que vous avez déjà lus et voyez ce que nous pouvons vous offrir d'autre pour une réflexion plus approfondie.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "En fait, l'économie des personnes est souvent associée à la conscience de l'exécution des tâches dans le cadre du contrat, au désir des parties d'atteindre un résultat, au comportement opportuniste et altruiste de l'individu dans la société. Tous ces principes sont difficiles à appliquer à l'économie des robots. Quels sont les motifs de l'économie des robots ? C'est une question ouverte que nous devons étudier et discuter dans la société pour mieux comprendre et appliquer les robots.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Pour commencer, nous vous suggérons de consulter l'œuvre de Mises \"L'action humaine : Traité d'économie\" (approche praxéologique) et l'article précoce de Norbert Wiener \"Comportement, but et téléologie\" (vision téléologique).",
  "This page may need translation": "Cette page peut nécessiter une traduction",
  "Establishing democracy with smart contracts": "Établir la démocratie avec des contrats intelligents",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Imaginons un petit bureau avec une équipe de 10 à 15 personnes. Alors que tout le monde est concentré sur ses propres délais pour ses principales tâches professionnelles, personne ne semble se soucier de l'entretien de l'espace de bureau. La solution la plus courante pour éviter de sombrer dans le chaos est d'embaucher des individus extérieurs pour apporter leur soutien. Une autre approche consiste à prendre l'initiative et à imposer des pénalités à ceux qui créent le désordre ou épuisent les fournitures sans les renouveler. Cependant, est-il éthique de vivre sous la tyrannie dans notre futur monde crypto-anarchiste, où chacun est censé être responsable et profiter de la liberté ? Efforçons-nous de créer une société plus démocratique en utilisant des contrats intelligents et la nouvelle génération de technologies Internet (souvent appelée Web3). Nous avons besoin d'outils qui peuvent nous aider à prendre des décisions ensemble, puis nous assurer qu'elles fonctionnent correctement sans que les humains aient à s'impliquer directement.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Qui a bu tout le café ?!' ou la tragédie des biens communs",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Il existe un concept largement discuté en économie, en écologie et dans d'autres sciences connu sous le nom de 'tragédie des biens communs'. Cela concerne un scénario dans lequel les individus qui ont accès à une ressource partagée privilégient leurs propres intérts, épuisant ainsi la ressource. Le café ressemble de près à une telle ressource, car il se détériore en raison d'une consommation non contrôlée au bureau. Cependant, en même temps, généralement aucun des membres de l'équipe n'est enclin à investir son temps et son argent pour obtenir un paquet supplémentaire de grains de café. Ainsi, ils continuent de boire du café sans obtenir de nouvelles fournitures.",
  "How to formulate the task in numbers.": "Comment formuler la tâche en chiffres.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "En supposant un budget mensuel de 100 $ pour le café, ce qui équivaut approximativement à 150 tasses pour notre équipe de 10 personnes, cela laisse à chaque personne une tasse tous les 2 jours. Maintenant, plongeons dans les détails techniques. La question est : comment pouvons-nous donner vie à une machine à café autonome dans le bureau ?",
  "Step 1: automated coffee bean ordering": "Étape 1 : commande automatisée de grains de café",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Nous avons conclu un accord avec le barista, Nikita, qui se trouve près du bureau. Il nous fournira des grains de café dès réception d'une alerte du bot. Le bot envoie un message lorsque le café est presque épuisé, précisant la quantité de café (en kilogrammes) nécessaire pour la commande et le montant correspondant du paiement déterminé par l'équipe. Avec ces détails, Nikita peut sélectionner le café selon ses préférences.",
  "Step 2: automatic access to smart office.": "Étape 2 : accès automatique au bureau intelligent.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Simultanément avec la commande, la machine à café génère un code QR. Nikita présente ensuite ce code QR à la caméra pour accéder au bureau.",
  "Step 3: distribution of coffee tokens to the team.": "Étape 3 : distribution de jetons de café à l'équipe.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Une fois que la caméra locale scanne le code QR, le système de gestion de la maison intelligente lance un paiement à Nikita et distribue de nouveaux jetons de café parmi les membres de l'équipe.",
  "Step 4: drink coffee!": "Étape 4 : buvez du café !",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Pour recevoir une tasse de café fraîche, un membre de l'équipe doit envoyer un jeton de café à l'adresse de la machine à café.",
  "Coffee beans delivery process:": "Processus de livraison des grains de café :",
  "Unlock new possibilities with this concept": "Débloquez de nouvelles possibilités avec ce concept",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "De plus, une telle machine à café automatisée introduit diverses dimensions économiques et sociales. Jetons-y un coup d'œil :",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Les développeurs peuvent déposer des jetons de café supplémentaires lorsque la consommation est inférieure à la limite. Cela crée un système transparent pour une utilisation variée du café dans la limite.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "La machine à café pourrait gérer un compte partagé, permettant aux membres du bureau de contribuer des fonds depuis leurs comptes personnels pour une expérience de café de meilleure qualité la prochaine fois.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "L'équipe décide collectivement de la quantité de café que la machine commandera à chaque fois par le biais d'un vote DAO. Cela offre la liberté de relever le défi avec des ressources limitées.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Les processus programmables réduisent l'influence des facteurs humains et offrent également une plus grande flexibilité pour adapter les paramètres aux équipes spécifiques.",
  "How we smarten up our coffee machine in real life": "Comment nous rendons notre machine à café plus intelligente dans la vie réelle",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Pour avoir un contrôle pratique de la machine à café, nous avons intégré un ordinateur à carte unique, plus précisément le Raspberry Pi 4, avec une machine à café grand public couramment disponible qui prend en charge la connexion GPIO. Notre préférence s'est portée sur le",
  "selected for its affordability and the convenience of its easily removable front panel.": "sélectionné pour son prix abordable et la commodité de son panneau avant facilement amovible.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Ensuite, nous avons élaboré les détails opérationnels, notamment les jetons que les utilisateurs peuvent envoyer et l'algorithme sous-jacent. Voici le résultat :",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Pour savourer une délicieuse tasse de café, les utilisateurs doivent envoyer une certaine somme d'argent (dans notre cas, 1 jeton ACT de Statemine, id=3077) à l'adresse de la machine à café depuis une parachain (Statemine). Ensuite, le processus de versement du café commence et un journal d'actions est ensuite publié sur",
  "via the Datalog function": "via la fonction Datalog",
  "When the concept extends beyond the office": "Lorsque le concept s'étend au-delà du bureau",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Ce concept offre de nombreuses possibilités d'expansion de l'idée. Il a été mis en œuvre avec succès au Polkadot Web3 Hub lors du Forum économique mondial de Davos 2022. Les participants ont pu passer des commandes de café et spécifier leur type de café souhaité (par exemple, espresso, americano, cappuccino) en envoyant une certaine quantité de jetons. Partageons des photos et des vidéos de cet événement :",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Notre machine à café blockchain fabrique du café au Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "DIY ou comment construire votre propre machine à café blockchain intelligente",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Vous pouvez trouver un tutoriel détaillé et des spécifications techniques dans le référentiel GitHub open-source. Gardez à l'esprit que vous pouvez utiliser n'importe quelle machine à café de votre choix et presque n'importe quel jeton de votre choix pour donner vie à ce projet dans votre propre espace.",
  "In a nutshell": "En résumé",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "De nos jours, il devient de plus en plus clair que la consommation d'énergie est un facteur majeur de l'empreinte carbone, ce qui rend de plus en plus important de trouver des moyens de réduire notre impact environnemental. Les bureaux et les bâtiments commerciaux jouent un rôle important dans cette consommation d'énergie. Les ingénieurs de Robonomics ont installé un système dans les bureaux de BBF, un promoteur immobilier basé à Chypre, pour suivre et collecter les mesures d'électricité. Ce système offre également un moyen pratique de compenser l'empreinte carbone.",
  "1. Monitoring surplus energy generation": "1. Surveillance de la production d'énergie excédentaire",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "Dans le bâtiment de bureau de l'entreprise BBF, plusieurs panneaux solaires ont été installés et intégrés au système Solarweb, permettant une collecte facile des analyses. Le système fournit des données sur la consommation d'électricité globale du bâtiment et l'électricité générée par les panneaux solaires. Cependant, une fonctionnalité cruciale manquante est la capacité de compenser l'empreinte carbone résultant de la consommation d'électricité au-delà de ce qui est généré par les panneaux solaires.",
  "2. Converting excess energy power to CO2 offset": "2. Conversion de l'excédent d'énergie en compensation de CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Avoir des données sur la consommation totale d'électricité et la production d'électricité des panneaux solaires permet un calcul simple de l'empreinte carbone. On suppose que l'électricité des panneaux solaires a une empreinte carbone de 0, ce qui signifie que la compensation est nécessaire uniquement pour l'électricité consommée en excès par rapport à ce que les panneaux solaires ont généré.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "Il est à noter que les émissions de CO2 diffèrent d'un pays à l'autre. À Chypre, la pollution moyenne s'élève à 587 g/kWh, selon Hannah Ritchie, Max Roser et Pablo Rosado (2022) - \"Énergie\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Pour compenser l'empreinte carbone, des crédits carbone sont utilisés, chaque crédit représentant 1 tonne de CO2. Ces crédits jouent un rôle vital dans la compensation de l'impact environnemental causé par la consommation d'électricité au-delà de la contribution des panneaux solaires.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Ainsi, armés de données sur la consommation d'énergie, la production des panneaux solaires et le coefficient de Chypre, il devient facile de déterminer le nombre de jetons nécessaires pour compenser l'empreinte carbone.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Pour cela, nous avons intégré un Raspberry Pi, configuré Home Assistant pour collecter des données analytiques et développé une intégration pour compenser l'empreinte. Le tableau de bord énergétique de Home Assistant présente les détails suivants :",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "De plus, notre intégration améliore le système en offrant un panneau de contrôle pratique pour visualiser les statistiques et déclencher la compensation :",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Voici un exemple illustratif de la manière dont la compensation de l'empreinte carbone se produit grâce à notre intégration. À la fin réussie de la",
  "transaction": "transaction",
  "unfolds as follows:": ", cela se déroule comme suit :",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Réduire la consommation d'énergie au bureau est tout aussi important que compenser les émissions de carbone. Nous pouvons y parvenir en apportant de petits changements comme l'utilisation d'un éclairage et d'appareils économes en énergie et en maintenant bien l'équipement de bureau.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "La consommation d'énergie est une grande partie de notre empreinte carbone, et les entreprises doivent faire leur part pour être plus respectueuses de l'environnement. Avoir un système qui suit la consommation d'énergie et aide à compenser les émissions de carbone peut considérablement réduire l'impact d'un bâtiment de bureau sur l'environnement. En adoptant la bonne approche, les entreprises peuvent contribuer à un avenir plus vert.",
  "The way forward": "La voie à suivre",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Stratégie pour transformer la machine à café en un dispositif robotique autonome",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "On the Way to Sovereign Home Automation": "En route vers l'automatisation domestique souveraine",
  "World Economic Forum Annual Meeting 2022": "Réunion annuelle du Forum économique mondial 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Devenir une parachaine pour les applications IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (sponsorisé par Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (organisée par Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transition vers le multinetwork - Along Came Polkadot",
  "The Rise of Robonomics Network": "L'essor du réseau Robonomics",
  "Crypto Valley Conference 2018": "Conférence Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Atelier du Parlement européen 'L'économie des robots'",
  "Consensus 2018 conference": "Conférence Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Symposium sur la blockchain pour les systèmes robotiques au MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "École d'été Robonomics-2018 organisée par Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Intégration de Fronius Solar.web avec Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Un de nos objectifs dans le développement de ce cas est de transformer Robonomics en middleware ROS 2. Cela nous permettra d'utiliser Robonomics sur Substrate pour créer une application décentralisée qui peut exécuter ROS 2 directement depuis le navigateur!",
  "Eisenkoch, the robot chef": "Eisenkoch, le chef robot",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Cas réel pour le robot équipé de deux gaufriers et cuisant 6 gaufres en même temps en 5-7 minutes.",
  "Blockchain-powered smart coffee machine": "Machine à café intelligente alimentée par blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics coffee - est une machine à café intelligente intégrée au réseau Robonomics. Ce projet vise à montrer le potentiel de Robonomics dans le domaine de l'IoT par un exemple concret.",
  "Water environmental inspector": "Inspecteur de l'environnement aquatique",
  "Air monitoring network": "Réseau de surveillance de l'air",
  "Production quality control platform “Feecc”": "Plateforme de contrôle de la qualité de production 'Feecc'",
  "Backup and archiving service for robotics companies": "Service de sauvegarde et d'archivage pour les entreprises de robotique",
  "Public lab with Boston Dynamics Spot": "Laboratoire public avec Boston Dynamics Spot",
  "Autonomous telescope service": "Service de télescope autonome",
  "Smart home secure remote control and backup service": "Service de contrôle à distance et de sauvegarde sécurisée pour la maison intelligente",
  "Blockchain as quality control system for chemistry": "Blockchain en tant que système de contrôle de la qualité pour la chimie",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Réduction réelle des émissions de CO2 avec des certificats prouvés par blockchain",
  "Robot-artist Gaka-Chu": "Robot-artiste Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Démo 'Obtenez la météo du mont Fuji'",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "L'idée principale que les auteurs de Robonomics ont essayé de transmettre auparavant est l'évolution naturelle, logique et apparemment inévitable du niveau actuel de l'économie vers des services entièrement automatisés. Les services automatisés devront avoir à la fois la capacité de parler la langue de l'économie humaine et aussi l'économie propre aux machines pour effectuer diverses opérations dans le monde qui les entoure à une vitesse non disponible pour les humains.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Le développement et l'application de l'Internet des objets ont montré que résoudre des problèmes typiques ne suffit pas. De nouveaux concepts et principes complètement nouveaux, basés sur les erreurs antérieures et les lacunes identifiées, ont émergé à ce jour. Cette approche certainement pratique de l'utilisation des services cloud s'est avérée avoir un certain nombre de lacunes critiques liées à la scalabilité, à la confidentialité et à la sécurité. Dans le but de résoudre ces problèmes, il a été proposé de rapprocher le traitement des données, la logique et le calcul du lieu immédiat où ils sont utilisés. Ainsi, les concepts de calcul en brouillard (fog) et de calcul en périphérie (edge) ont émergé, avec des systèmes intermédiaires entre le cloud et les appareils prenant en charge certaines des fonctions du cloud. Par conséquent, la création de systèmes en périphérie est devenue l'un des nouveaux défis de la construction de l'Internet des objets.",
  "the Robonomics Parachain portal": "le portail Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Gestion de la compensation de l'empreinte carbone vérifiée par blockchain",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Les collaborations avec des projets sympathiques ont également continué. Robonomics et DAO IPCI ont introduit un service de collecte et d'analyse de données sensorielles -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "Et ce qui est si scientifiquement intéressant, en prenant comme base l'idée des restrictions imposées par le marché sur la taille de l'entreprise, nous pouvons dire que la limite de l'augmentation de CPS sera toujours déterminée par le marché et rien d'autre n'est nécessaire pour cela.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "L'un des exemples de nos expériences : négocier l'espace routier et les paiements du droit de passage pour les véhicules autonomes afin de réduire la congestion. Ce que une personne ne ferait absolument pas dans la circulation, la voiture le fera pour vous sans difficultés : vous voulez changer de voie, votre voiture et la voiture de votre voisin échangent des offres sur le coût d'une telle opération à une vitesse de centaines de messages par seconde, elles révéleront un prix d'équilibre, et ainsi vous êtes déjà dans la voie suivante plus rapide. Cela signifie que maintenant il sera possible de \"recharger\" votre trajet avec Uber et de le rendre plus rapide.",
  "Robonomics White Paper": "Robonomics Livre Blanc",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Ici, vous pouvez trouver et télécharger (complètement gratuitement, bien sûr) le tout premier livre blanc de Robonomics, qui a été présenté en mai 2018. Bien que beaucoup de choses aient évolué depuis lors, les fondements de Robonomics sont toujours exposés dans ce document.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu : Un robot artiste autonome à son compte",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Localisation et suivi coopératifs sans gradient des limites environnementales en mouvement par des équipes de robots non holonomes",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robot en tant que service : Des technologies de cloud aux technologies de pair à pair",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Surveillance environnementale fiable au moyen de réseaux de capteurs sur des navires marins autonomes en essaim et de la technologie des registres distribués",
  "Digital Passport for Unmanned Vehicles": "Passeport numérique pour les véhicules sans pilote",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics en tant que plateforme basée sur la blockchain pour la gestion du trafic sans pilote des véhicules mobiles",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Vers des systèmes robotiques multi-agents basés sur la blockchain : Analyse, classification et applications",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Services robotiques pour les villes intelligentes du nouveau paradigme basées sur des technologies décentralisées",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protocole pour l'organisation d'un réseau d'agents autonomes décentralisés dans les usines en utilisant des mécanismes de marché",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Vers une Robonomics basée sur la blockchain : Validation du comportement des agents autonomes",
  "Transforming Climate Finance and Green Investment with Blockchains": "Transformation de la finance climatique et de l'investissement vert avec des blockchains",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics : plateforme d'intégration des systèmes cyber-physiques dans l'économie humaine",
  "Blockchain based protocol for economical communication in industry 4.0": "Protocole basé sur la blockchain pour la communication économique dans l'industrie 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics basé sur la blockchain comme principe de création de smart factories",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Écosystème blockchain pour les marchés du carbone, les actifs environnementaux, les droits et les responsabilités : Conception conceptuelle et mise en œuvre",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Protocole basé sur la blockchain d'activité commerciale autonome pour les systèmes multi-agents composés de UAV",
  "English": "Anglais",
  "Russian": "Russe",
  "Chinese": "Chinois",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics est une plateforme open-source qui facilite à la fois les services IoT simples et les robots complexes, permettant une communication efficace entre les agents, qu'ils soient humains ou robotiques. Pour intégrer des robots dans ce système, nous utilisons ROS. Dans cet article, nous visons à fournir un aperçu de notre processus d'intégration de Robonomics dans ROS 2.",
  "Why ROS 2 in Robonomics?": "Pourquoi ROS 2 dans Robonomics ?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, le système d'exploitation robotique, est l'un des plus anciens frameworks open-source pour la robotique. C'est une collection de bibliothèques logicielles et d'outils pour faire fonctionner les robots. Il dispose de tout, des bases aux fonctionnalités avancées, et est livré avec des outils pratiques pour les programmeurs. Il est largement utilisé par les universités du monde entier pour l'enseignement et la recherche en robotique, il est donc bien établi, fonctionne avec de nombreux types de robots et dispose d'une grande communauté de développeurs.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Depuis le lancement de ROS en 2007, d'importants changements ont eu lieu dans le domaine de la robotique et au sein de la communauté ROS. En réponse à ces évolutions, ROS 2 a été introduit dans le but de s'adapter à ces changements. Il s'appuie sur les points forts de ROS 1 tout en remédiant à ses limitations. Nous utilisons ROS dans Robonomics depuis le tout début, et maintenant il est temps pour nous de migrer vers ROS 2.",
  "You might find this interesting": "Vous pourriez trouver cela intéressant",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Il existe de nombreux robots open-source et plates-formes robotiques complexes qui prennent en charge ROS. Cela signifie que vous pouvez créer un système multi-robot impressionnant pour atteindre vos objectifs spécifiques. Pour, ",
  "the most current list of supported robots": "la liste la plus à jour des robots pris en charge,",
  "please visit the ROS website.": "veuillez visiter le site web de ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Voyons comment ROS est utilisé dans le cadre de Robonomics en représentant tout le système avec Robonomics agissant comme différentes couches:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "À la couche 'Interface machine', nous avons besoin d'outils pour connecter de manière transparente les robots avec les logiciels. ROS 2 offre un ensemble robuste d'outils de développement parfaitement adaptés à cette tâche.",
  "Robonomics packages for ROS and ROS 2": "Packages Robonomics pour ROS et ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "La construction d'un système multi-robotique implique souvent le défi de connecter des appareils de différents fournisseurs, voire des appareils d'un seul fournisseur, utilisant chacun des protocoles différents. Que ce soit pour une configuration de maison intelligente ou une fabrication automatisée, une communication efficace entre vos machines est cruciale. ROS (et bien sûr ROS 2) propose différents modes pour y remédier. Et si vous pouviez personnaliser les tâches pendant que ROS gère la communication entre les nœuds?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "L'équipe Robonomics a créé différents packages pour ROS afin de rendre les robots plus intelligents et de gérer des tâches spécifiques selon les besoins. Pour voir les tâches que nous avons accomplies avec ROS, consultez notre page des cas de R&D. Presque chaque interaction avec un robot repose sur ROS. Vous pouvez trouver nos packages Robonomics open-source pour ROS sur GitHub, et voici quelques-uns d'entre eux:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "La pile de communication Robonomics contient un ensemble de packages ROS à des fins de communication économique.",
  "Robonomics' contribution in the ROS 2 community": "La contribution de Robonomics à la communauté ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics combine la robotique avec les technologies Web3, et nous visons à croître dans ces domaines. Depuis l'introduction de ROS 2, nous avons identifié trois principaux défis qui impliquent de soutenir la communauté ROS 2 et d'améliorer les capacités de Robonomics:",
  "Creating ROS 2 tools for Rust:": "Création d'outils ROS 2 pour Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Ces outils permettent aux développeurs d'écrire des applications ROS 2 en utilisant Rust. Pour en savoir plus sur les raisons pour lesquelles nous avons choisi Rust et l'importance de ce projet pour nous, vous pouvez trouver",
  "additional details": "plus de détails",
  "Developing Robonomics Middleware for ROS 2:": "Développement du Middleware Robonomics pour ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Cela joue un rôle important pour assurer une intégration transparente de Robonomics dans différents systèmes robotiques multi-agents utilisant ROS 2. Il peut faciliter l'intégration des robots dans les technologies de la blockchain Web 3 tout en réduisant les erreurs lors du processus d'intégration, ce qui permet de gagner du temps et des coûts.",
  "Creating a robotics lab with ROS 2:": "Création d'un laboratoire de robotique avec ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "À mesure que ROS 2 gagne en popularité dans la communauté robotique, nous sommes impatients de voir plus de robots et de matériels fonctionner avec ROS 2. Notre objectif est de les connecter à l'écosystème Web3 en utilisant Robonomics.",
  "Research papers": "Articles de recherche",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Sans recherche universitaire, l'avancement de systèmes complexes pouvant être intégrés dans notre vie quotidienne peut perdre son objectif ou même présenter des risques. Nous devons réfléchir attentivement à notre direction, à nos objectifs et aux conséquences potentielles. Les domaines dans lesquels Robonomics opère, notamment la robotique, les relations économiques et les technologies Web3, méritent d'être étudiés individuellement, en explorant comment ils peuvent être intégrés les uns aux autres et en évaluant leur impact potentiel sur notre vie.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Ce cas est actuellement en mouvement; ne manquez pas les nouvelles - abonnez-vous aux mises à jour dans la boîte ci-dessous",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "Le 'Robonomics Coffee' est une machine à café intelligente intégrée au réseau Robonomics. Ce projet vise à illustrer le potentiel de Robonomics dans la sphère de l'IoT à travers un exemple concret.",
  "logos and assets": "logos et actifs",
  "Download the Robonomics logos here. We've got two options for your": "Téléchargez les logos Robonomics ici. Nous avons deux options pour vos",
  "basic needs": "besoins de base",
  "and one designed for": "et un conçu pour",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "jeton. De plus, découvrez la palette de couleurs optimale",
  "color palette": "pour la marque distinguée Robonomics",
  "for the distinguished Robonomics brand": "Logos Robonomics",
  "Robonomics logos": "Tout télécharger",
  "Download all": "Logos XRT",
  "XRT logos": "Palette de couleurs recommandée",
  "Recommended color palette": "Palette de couleurs recommandée",
  "RWS logos": "Logos RWS",
  "You are currently opted out. Click here to opt in.": "Vous êtes actuellement désinscrit. Cliquez ici pour vous inscrire.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Désinscription terminée ; vos visites sur ce site web ne seront pas enregistrées par l'outil d'analyse Web. Notez que si vous supprimez vos cookies, effacez le cookie de désinscription, ou si vous changez d'ordinateur ou de navigateur Web, vous devrez effectuer à nouveau la procédure de désinscription.",
  "Please click below to opt in:": "Veuillez cliquer ci-dessous pour vous inscrire :",
  "You are currently opted in. Click here to opt out.": "Vous êtes actuellement inscrit. Cliquez ici pour vous désinscrire.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Vous pouvez choisir de ne pas avoir de numéro d'identification de cookie d'analyse Web unique attribué à votre ordinateur afin d'éviter l'agrégation et l'analyse des données collectées sur ce site web.",
  "To make that choice, please click below to receive an opt-out cookie": "Pour faire ce choix, veuillez cliquer ci-dessous pour recevoir un cookie de désinscription.",
  "Privacy Policy": "Politique de confidentialité",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Cette politique décrit les informations que nous collectons auprès de vous, comment nous utilisons ces informations et notre base juridique pour le faire. Elle couvre également si et comment ces informations peuvent être partagées, ainsi que vos droits et choix concernant les informations que vous nous fournissez.",
  "Tracking cookies are not used": "Les cookies de suivi ne sont pas utilisés",
  "The data is not used for any other purpose than analytics": "Les données ne sont pas utilisées à d'autres fins que l'analyse",
  "A user cannot be tracked across days within the same website": "Un utilisateur ne peut pas être suivi d'un jour à l'autre sur le même site",
  "What We Collect and Receive": "Ce que nous collectons et recevons",
  "Visitors aren't tracked across websites": "Les visiteurs ne sont pas suivis d'un site à l'autre",
  "Where are those annoying cookie consent pop-ups": "Où sont ces pop-ups de consentement aux cookies ennuyeux",
  "We don't need cookie consent is needed because": "Nous n'avons pas besoin de consentement aux cookies car",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include": "Pour que nous puissions vous offrir la meilleure expérience possible sur nos sites web, nous devons collecter et traiter certaines informations. Selon votre utilisation des Services, cela peut inclure",
  "Contact us via email": "Contactez-nous par email",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "par exemple, lorsque vous soumettez nos formulaires, nous envoyez des questions ou des commentaires, ou signalez un problème, nous collecterons votre nom, adresse email, message, etc. Nous utilisons ces données uniquement pour répondre aux demandes que nous recevons.",
  "Usage data": "Données d'utilisation",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "lorsque vous visitez notre site web, nous stockons : l'URL à partir de laquelle vous nous avez visité, les pages web de notre site que vous visitez, la date et la durée de votre visite, votre adresse IP anonymisée, les spécifications de l'appareil (type d'appareil, système d'exploitation, résolution d'écran, langue, pays dans lequel vous vous trouvez et type de navigateur web) que vous avez utilisées pendant votre visite, et",
  "other": "autres",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "données non personnelles. Nous traitons ces données d'utilisation uniquement sur notre serveur, sans les transmettre à des tiers avec",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "plateforme d'analyse web qui nous donne une propriété à 100% des données. Cette analyse nous aide à améliorer l'expérience utilisateur sur notre site web et à reconnaître et arrêter toute utilisation abusive.",
  "Non-personalized cookies": "Cookies non personnalisés",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "nous utilisons des cookies non traçables (petits fichiers de données transférés sur les ordinateurs ou les appareils par les sites) à des fins d'enregistrement et pour améliorer les fonctionnalités de notre site web. Vous pouvez désactiver ou restreindre la transmission de ces cookies en modifiant les paramètres de votre navigateur web ou en vous désinscrivant sur cette page dans le formulaire ci-dessous. Les cookies déjà stockés peuvent être supprimés à tout moment.",
  "Opt-out of website tracking": "Désactiver le suivi sur le site web",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Vous pouvez choisir de ne pas être suivi par notre instance Matomo Analytics ci-dessous:",
  "Your Rights": "Vos droits",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Vous avez le droit d'être informé des données personnelles traitées par Matomo, le droit de rectification/correction, d'effacement et de limitation du traitement. Vous avez également le droit de nous demander un format structuré, commun et lisible par machine des données personnelles que vous nous avez fournies.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Nous ne pouvons vous identifier que par votre adresse e-mail et nous ne pouvons respecter votre demande et fournir des informations que si nous avons des données personnelles vous concernant, que vous nous avez contactés directement et/ou que vous avez utilisé notre site et/ou service. Nous ne pouvons pas fournir, rectifier ou supprimer les données que nous stockons pour le compte de nos utilisateurs ou clients.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Pour exercer l'un des droits mentionnés dans cette politique de confidentialité et/ou en cas de questions ou de commentaires concernant l'utilisation de données personnelles, vous pouvez nous contacter.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "De plus, vous avez le droit de déposer une plainte auprès de l'autorité de protection des données de votre juridiction.",
  "Retention of data": "Conservation des données",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Network legal rights.": "Nous conserverons vos informations aussi longtemps que nécessaire pour vous fournir les services ou comme indiqué dans cette politique. Nous conserverons également et utiliserons ces informations dans la mesure nécessaire pour atteindre les objectifs énoncés dans cette politique et pour respecter nos obligations légales, résoudre les litiges, faire respecter nos accords et protéger les droits légaux du réseau Robonomics.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations": "Nous collectons également et conservons des informations agrégées, anonymisées ou pseudonymisées que nous pouvons conserver indéfiniment pour protéger la sécurité de notre site, améliorer nos services ou respecter les obligations légales.",
  "Robonomics Middleware Framework for ROS 2": "Robonomics Middleware Framework pour ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Réunir les technologies Web3 et les frameworks robotiques",
  "Playing with Human-Machine Interaction through Ethereum": "Jouer avec l'interaction homme-machine grâce à Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Ces informations d'étude ont expiré. Pour des leçons et des ateliers à jour, visitez notre",
  "academy": "académie",
  "Home assistant themes": "Thèmes Home Assistant",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Personnalisez votre Home Assistant avec nos thèmes gratuits à utiliser. Suivez les instructions d'installation sur",
  "Do you want": "Voulez-vous",
  "to dive even deeper?": "plonger encore plus profondément?",
  "Our": "Notre",
  "White Paper": "Livre blanc",
  "Science": "Science",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Nous pensons que la lecture de livres peut vraiment ouvrir votre esprit. Que ce soient des idées simples mais intelligentes ou des idées plus complexes, les livres sont le meilleur moyen pour votre cerveau d'absorber tout cela. Vous pouvez obtenir nos livres gratuitement et consulter notre liste de lectures recommandées pour plonger dans le monde passionnant de la robotique!",
  "Download books about Robonomics": "Téléchargez des livres sur la Robonomie",
  "Open your mind [list of recommendations]": "Ouvrez votre esprit [liste de recommandations]",
  "Robonomics R&D": "Robonomics R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Économie des robots",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Obtenez votre marchandise avec des œuvres d'art uniques de Robonomics peintes par nos magnifiques filles. Nous avons créé des boutiques sur les plus grands marchés en ligne pour les artistes, jetez un coup d'œil et trouvez des t-shirts, des manches longues, des sweats à capuche, des rideaux de douche, des oreillers, des couvertures et d'autres articles utiles.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Nous avons choisi le cadre de robotique le plus connu appelé Robot Operating System (ROS) comme interface standard pour intégrer tout système cyber-physique compatible. Robonomics prend en charge plusieurs utilisations pour ROS. L'implémentation de Robonomics pour le réseau Ethereum se présente sous la forme du package ROS robonomics_comm. Pour l'architecture ROS 2, nous implémentons le support de Robonomics en tant que couche intermédiaire (voir «Robonomics en tant que middleware ROS 2» pour plus de détails). Lorsque l'utilisation de ROS est redondante (par exemple, lors de travailler avec des appareils IoT), un module d'interface Python robonomics a été développé. Il permet d'accéder aux fonctions de Robonomics de manière native et fonctionne avec des nœuds locaux et privés ainsi que des nœuds publics et distants.",
  "read our almanac": "lisez notre almanach",
  "Begin your adventure in the world of cyberpunks": "Commencez votre aventure dans le monde des cyberpunks",
  "Pure open source": "Pure open source",
  "Local and Global Availability": "Disponibilité locale et mondiale",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "En utilisant l'open source, le P2P et le Web3, il n'y a pas de place pour les astuces des entreprises, garantissant la protection de vos données personnelles. Toutes les informations sont stockées localement ou chiffrées avec votre clé personnelle dans le cloud Web3.",
  "Interested in how the team reached this stage?": "Intéressé par la façon dont l'équipe en est arrivée là ?",
  "The Robonomics Timeline": "La chronologie de Robonomics",
  "can guide you through our journey": "peut vous guider à travers notre parcours",
  "Device Design and Development": "Conception et développement de l'appareil",
  "Smart devices": "Appareils intelligents",
  "Wearable merch": "Marchandises portables",
  "Academy": "Académie",
  "Wiki": "Wiki",
  "Science & White paper": "Science & Livre blanc",
  "Tokenomics": "Tokenomics",
  "Cases": "Cas",
  "Brand assets": "Ressources de marque",
  "Wallpapers": "Fonds d'écran",
  "NFT": "NFT",
  "Books & reading inspiration": "Livres & inspiration à la lecture",
  "Blog": "Blog",
  "Contacts": "Contacts",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Devenez un fournisseur de données environnementales pour vos amis et voisins de la région. Accédez à des mesures vraiment décentralisées de la qualité de l'air, du bruit, de la température et d'autres conditions environnementales sur la carte des capteurs.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "Le serveur domotique le plus open source, alimenté par RISC-V, avec un cloud Web3 remplaçant les serveurs Google sous le capot.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Appareils WI-FI MQTT intelligents avec micrologiciel open source Tasmota sur la carte entièrement compatible avec Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Connectez votre maison intelligente et vos vêtements intelligents au Hikikomori pour surveiller les données des capteurs - littéralement à portée de main.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Rencontrez des appareils intelligents et du matériel futuriste d'une équipe autonome possédant une expertise approfondie en robotique, blockchain et IoT",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "Le traitement des données est toujours une question sensible. C'est pourquoi nous offrons un module de connectivité entièrement open-source",
  "connectivity module": "vous donnant la liberté de choisir les serveurs à utiliser pour le traitement. Pas de clouds fermés, pas de code opaque.",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Robonomics a établi trois hubs de Connectivité pour assurer une connexion stable. Cette option est activée par défaut sur la station.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Vous pouvez lancer votre propre hub pour recevoir des données de la Station Civile Altruiste et les traiter ultérieurement.",
  "Steps to set up your Connectivity": "Étapes pour configurer votre Connectivité",
  "Deploy Connectivity": "Déployer la Connectivité",
  "Technical requirements:": "Exigences techniques:",
  "2 CPU cores;": "2 cœurs de CPU;",
  "4 GB RAM;": "4 Go de RAM;",
  "40 GB storage;": "40 Go de stockage;",
  "Static IP": "IP statique",
  "Than set up": "Ensuite, configurer",
  "and follow": "et suivre",
  "the instructions": "les instructions",
  "Connect a station to your connectivity": "Connectez une station à votre connectivité",
  "Open your sensor settings by its IP.": "Ouvrez les paramètres de votre capteur par son adresse IP.",
  "Go to APIs settings": "Allez dans les paramètres des API",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Cochez la case pour envoyer des données à une API personnalisée et remplissez les champs correspondants (adresse IP du serveur, ports, etc.).",
  "Join with your setup to global map (optional)": "Rejoignez votre configuration à la carte mondiale (facultatif)",
  "If you want to publish data to": "Si vous souhaitez publier des données sur",
  "the global map": "la carte mondiale",
  "you need to make two pull requests:": "vous devez effectuer deux demandes de tirage:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Ajoutez l'identifiant IPFS de votre connectivité à la liste des agents de la carte des capteurs:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Ajoutez l'adresse de parachain de votre connectivité à la liste des agents du serveur de stockage à long terme:",
  "Steps for launching your own map": "Étapes pour lancer votre propre carte",
  "Deploy web interface": "Déployer l'interface web",
  "Fork the map repository:": "Fork le dépôt de la carte:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Modifier les paramètres pour personnaliser votre carte, y compris le domaine, le fournisseur, le point de vue de départ et votre identifiant IPFS de connectivité pour la liste des agents.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Déployer votre propre version de l'interface web et commencer à recevoir des données en temps réel de votre capteur.",
  "Full guide here:": "Guide complet ici:",
  "Launch long-term storage": "Lancer le stockage à long terme",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Il ne suffit pas de simplement collecter des données des capteurs; elles doivent être traitées. Ajustez un serveur pour collecter les données des capteurs en utilisant un logiciel open-source node.js",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "et obtenez votre propre serveur fonctionnel pour le stockage à long terme des données cartographiques.",
  "Static IP.": "IP statique.",
  "Steps for launching a storage:": "Étapes pour lancer un stockage:",
  "Fork the RoSeMAN repository:": "Faites un fork du dépôt RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Choisissez la version Docker ou Node.js (nécessite une base de données MongoDB).",
  "Add a parachain address of your Connectivity to agents list.": "Ajoutez une adresse de parachain de votre Connectivité à la liste des agents.",
  "Run the project.": "Exécutez le projet.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "Le premier serveur pour une maison connectée entièrement construit sur open-source - du CPU au cloud décentralisé.",
  "Processor:": "Processeur:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 avec CPU RISC-V 4 cœurs, 2 Mo de cache L2, jusqu'à 1,5 GHz, support ISA RV64GC",
  "GPU:": "GPU:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, jusqu'à 600 MHz",
  "Memory:": "Mémoire:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 Go de SDRAM LPDDR4, jusqu'à 2800 Mbps",
  "Storage:": "Stockage:",
  "32 GB TF card (minimum)": "Carte TF de 32 Go (minimum)",
  "Interfaces:": "Interfaces:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2 ports Ethernet Gigabit, 4 ports USB 3.0 de type A, en-tête GPIO à 40 broches, connecteur M.2, socket eMMC, en-tête de ventilateur à 2 broches",
  "Power:": "Alimentation:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5V DC via USB-C, jusqu'à 30 W (minimum 3 A) ou entrée 5V via GPIO à 40 broches",
  "OS:": "Système d'exploitation:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Installation de base de Home Assistant",
  "Robonomics Integration Installation": "Installation de l'Intégration Robonomics",
  "Zigbee Devices in Zigbee2MQTT": "Appareils Zigbee dans Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Ajouter le domaine RoSeMAN au fournisseur distant de cartes.",
  "Meanwhile, you can check available translations": "Pendant ce temps, vous pouvez vérifier les traductions disponibles",
  "All hardware": "Tout le matériel",
  "Use it": "Utilisez-le",
  "Learn": "Apprendre",
  "Explore website": "Explorer le site Web",
  "Timeline since 2015": "Chronologie depuis 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "L'équipe acquiert de nouvelles compétences dans la conception et la programmation d'appareils intelligents à partir de zéro.",
  "sensors.social": "capteurs.sociaux",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "Un réseau, où les appareils de test développés par les ingénieurs de Robonomics opèrent, a été créé. Une ligne d'appareils domotiques basés sur le Wi-Fi Tasmota a également été développée, et depuis l'été 2024, cette ligne est en cours de certification pour le marché de l'UE. À l'automne 2024, l'équipe du projet présentera une ligne d'appareils open-source alimentés par les technologies Web3, sous le nom de \"Hardware for Cryptopunks.\"",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Robonomics continue de croître au sein de l'écosystème Polkadot. La parachain du réseau Kusama fonctionne depuis plus de deux ans, et à partir de l'automne 2024, une parachain sera également lancée sur le réseau Polkadot. Plus de 5 millions de transactions provenant d'appareils d'utilisateurs ont été enregistrées sur le réseau. L'équipe continue d'explorer les possibilités d'intégrer leurs implémentations à la fois sur Ethereum et Polkadot.",
  "Robo Smart Devices:": "Robo Smart Devices:",
  "Read books": "Lire des livres",
  "Robonomics merch": "Marchandises Robonomics",
  "Desktop": "Bureau",
  "Smartphone": "Smartphone",
  "our robo art wallpapers": "nos fonds d'écran robo art",
  "Space monkey devcon 2024 special": "Space monkey devcon 2024 spécial",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Téléchargez cette image sur votre appareil et participez à notre quête spéciale Devcon 2024 dans des lieux palpitants autour de Bangkok!",
  "Free Wallpapers for you from our artists": "Fonds d'écran gratuits pour vous de nos artistes",
  "Hide your folder with secret wallpaper": "Cachez votre dossier avec un fond d'écran secret",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "Nous avons créé des fonds d'écran secrets juste pour vous! Téléchargez le fond d'écran et les icônes de dossier, et vos dossiers se fondront parfaitement dans votre écran d'accueil, ne laissant visible que de magnifiques œuvres d'art.",
  "Desktop background": "Fond d'écran de bureau",
  "Mac OS icons": "Icônes Mac OS",
  "Windows icons": "Icônes Windows",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "Outdoor sensor “Altruist“": "Capteur extérieur “Altruist“",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Un dispositif non invasif à installer dans les tableaux électriques avec un montage sur rail DIN. Basé sur la puce Espressif ESP32C6 avec une architecture RISC-V ouverte.",
  "Sign up for updates": "Inscrivez-vous pour les mises à jour",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics.": "En cliquant sur le bouton “Soumettre”, vous acceptez de recevoir régulièrement des e-mails de Robonomics.",
  "Hardware for cyberpunks": "Matériel pour les cyberpunks",
  "Tech Blog & Updates": "Blog technologique et mises à jour",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Partagez et accédez aux données de bruit, de poussière et de température d'autres capteurs indépendants à proximité. Oubliez les serveurs d'entreprise, ces données sont distribuées de manière sécurisée dans le monde entier grâce à la technologie Web3 innovante.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Découvrez la puissance du véritable DePIN (Réseau d'Infrastructure Physique Décentralisée) — un mouvement technologique révolutionnaire qui a vu le jour et prospère depuis des années sur notre",
  "decentralized sensor map": "carte de capteurs décentralisée",
  "3 ways to use it": "3 façons de l'utiliser",
  "Access": "Accéder aux données de",
  "noise, dust, and temperature data": "bruit, de poussière et de température",
  "from other independent sensors on our": "d'autres capteurs indépendants sur notre",
  "Connect your device as simple as other smart devices and share your environmental outdoor data with community.": "Connectez votre appareil aussi simplement que d'autres appareils intelligents et partagez vos données environnementales extérieures avec la communauté.",
  "Check open-source sensor firmware on GitHub": "Consultez le micrologiciel du capteur open-source sur GitHub",
  "Operate your own Data Server": "Faites fonctionner votre propre serveur de données",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "vous donnant la liberté de choisir les serveurs à utiliser pour le traitement. Pas de clouds propriétaires, pas de code caché.",
  "Keep in mind, you can join the": "N'oubliez pas, vous pouvez rejoindre la",
  "global decentralized sensor map": "carte mondiale de capteurs décentralisés",
  "even with a sensor connected through your own server!": "même avec un capteur connecté via votre propre serveur!",
  "Run your own Interactive Map": "Faites fonctionner votre propre carte interactive",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Vous aimez l'idée d'une carte décentralisée mais vous voulez la personnaliser avec des mises en page supplémentaires et devenir administrateur d'une nouvelle infrastructure de capteurs souverains? Vous pouvez déployer",
  "your own version by forking": "votre propre version en bifurquant",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "notre code open-source sur GitHub (assurez-vous de vérifier le type de licence). N'oubliez pas d'utiliser les ressources open-source de manière responsable.",
  "Device Specifications": "Spécifications de l'appareil",
  "Input Voltage:": "Tension d'entrée :",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Hz",
  "Wireless protocol:": "Protocole sans fil :",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Prend en charge le Wi-Fi 6 (802.11 b/g/n) 2,4 GHz et le Bluetooth 5 (LE), Zigbee avec antenne intégrée",
  "Equipped with a high-performance": "Équipé d'un processeur RISC-V",
  "32-bit RISC-V processor": "32 bits performant",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "avec une vitesse d'horloge allant jusqu'à 160 MHz, et un processeur RISC-V basse consommation de 32 bits avec une vitesse d'horloge allant jusqu'à 20 MHz",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320 Ko de ROM, 512 Ko de SRAM HP, 16 Ko de SRAM LP et 4 Mo de mémoire Flash",
  "USB-C": "USB-C",
  "for firmware development and updates": "pour le développement et les mises à jour du micrologiciel",
  "PM sensor:": "Capteur PM :",
  "SDS011 laser PM2.5/PM10 sensor": "Capteur laser PM2.5/PM10 SDS011",
  "Supported sensors:": "Capteurs pris en charge :",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H : SHT3X, BME280, HTU21D; Capteur de niveau sonore : I2S INMP441; Compteur Geiger : Radsens.",
  "Help & support": "Aide & support",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "Avec la carte décentralisée de Robonomics, vous pouvez utiliser Robonomics Connectivity ou créer votre propre service de connectivité.",
  "Your own Connectivity": "Votre propre connectivité",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Un assistant domestique intelligent que vous apprécierez de prendre soin, même lorsque vous êtes absent. Réservé aux développeurs.",
  "Robonomics open-source hardware": "Matériel open-source de Robonomics",
  "Open-source hardware": "Matériel open-source",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Découvrez la puissance du véritable DePIN (Réseau d'Infrastructure Physique Décentralisée) — un mouvement technologique révolutionnaire qui a vu le jour et prospère avec Robonomics",
  "Home server with Web3 cloud": "Serveur domestique avec cloud Web3",
  "Home server on RISC V": "Serveur domestique sur RISC V",
  "Supports": "Prend en charge",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "Wi-Fi 6 à 2,4 GHz (802.11 b/g/n) et Bluetooth 5 (LE), avec antenne embarquée",
  "Built in": "Intégré",
  "Onboard": "Embarqué",
  "1.47inch LCD display, 172x320 resolution, 262K color": "Écran LCD de 1,47 pouce, résolution de 172x320, couleur 262K",
  "Adapting": "Adaptation",
  "integrates": "intègre",
  "full-speed USB-С port": "port USB-С à pleine vitesse",
  "Onboard TF card slot": "Emplacement de carte TF embarqué",
  "for external TF card storage of pictures or files": "pour le stockage externe de cartes TF de photos ou de fichiers",
  "Supports accurate control": "Prend en charge un contrôle précis",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "tel que l'horloge flexible et les modes d'alimentation multiples pour réaliser une faible consommation d'énergie dans différents scénarios",
  "Built-in RGB LED": "LED RGB intégrée",
  "with clear acrylic sandwich panel for cool lighting effect": "avec panneau sandwich en acrylique transparent pour un effet d'éclairage cool",
  "Battery Level Gauge": "Indicateur de niveau de batterie",
  "Low-Power I2C Temperature sensor": "Capteur de température I2C basse consommation",
  "RV-3032-C7 Real-Time Clock Module": "Module d'horloge en temps réel RV-3032-C7",
  "Battery 180mA": "Batterie 180mA",
  "Measuring Range:": "Plage de mesure:",
  "0.1-80A": "0,1-80A",
  "Wireless Protocol:": "Protocole sans fil:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (Wi-Fi 2,4 GHz)",
  "CPU:": "CPU:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "ESP32-S3 MCU basé sur un système sur puce (SoC) à microprocesseur double cœur (Xtensa 32 bits LX7), jusqu'à 240 MHz",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 Ko de ROM, 520 Ko de SRAM, 8 Mo de FLASH",
  "for development and updates": "pour le développement et les mises à jour",
  "To configure the device, please visit:": "Pour configurer le dispositif, veuillez visiter:",
  "multiple IO interfaces,": "interfaces IO multiples,",
  "Early bird price": "Prix lève-tôt",
  "Get updates about smart devices": "Recevez des mises à jour sur les appareils intelligents",
  "Receive regular emails from Robonomics": "Recevez régulièrement des e-mails de Robonomics",
  "Thanks for your submission!": "Merci pour votre soumission!",
  "Not submitted": "Non soumis",
  "Notify me when available": "Notifier moi quand disponible",
  "Captcha is not verified. Please, check your internet connection": "Captcha n'est pas vérifié. Veuillez vérifier votre connexion Internet",
  "Thanks for the submition!": "Merci pour la soumission!",
  "Submitting": "Soumission",
  "Submit": "Soumettre",
  "Follow for latest news and important updates": "Suivez pour les dernières nouvelles et mises à jour importantes",
  "The best way to check open-source project": "La meilleure façon de vérifier un projet open-source",
  "Useful, serious, cute videos, teasers etc.": "Vidéos utiles, sérieuses, mignonnes, teasers, etc.",
  "Chat for engineers and developers": "Discutez avec des ingénieurs et des développeurs",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Chat non officiel pour les passionnés de crypto",
  "Use cases": "Cas d'utilisation",
  "Coming in early 2025": "Arrivée début 2025",
  "Rent in California, USA": "Location en Californie, USA",
  "Available by the Hour, Day, or Week": "Disponible à l'heure, au jour ou à la semaine",
  "Your name": "Votre nom",
  "Your comment": "Votre commentaire",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "En cliquant sur ce bouton, vous acceptez de recevoir un e-mail concernant la location du robot humanoïde Unitree G1.",
  "We'll get in touch shortly!": "Nous vous contacterons bientôt !",
  "Contact me": "Me contacter",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Un capteur intelligent qui collecte des données environnementales et les intègre dans une carte de capteurs décentralisée.",
  "Smart Tamagotchi “Hikikomori“": "Smart Tamagotchi “Hikikomori“",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Une carte de développement de microcontrôleur conçue pour s'intégrer avec les systèmes Web3. Il peut être votre tamagotchi de maison intelligente, un contrôleur de jeu, un outil éducatif - tout ce que vous concevez !",
  "Energy monitor with USB-C": "Moniteur d'énergie avec USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Un dispositif non invasif conçu pour le montage sur rail DIN dans les tableaux électriques, suit la consommation et la génération d'électricité.",
  "Smart devices from Robonomics": "Appareils intelligents de Robonomics",
  "Our values": "Nos valeurs",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Nos appareils sont conçus pour une transparence totale. Chaque produit est livré avec un processeur RISC-V ouvert, un code source ouvert et des schémas de circuit, et des instructions de mise à jour locales - pas besoin de connexions cloud. Vous êtes habilité à comprendre, personnaliser et faire confiance à votre technologie dès le départ",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "La combinaison de la communication P2P et du cloud Web3 garantit que vos appareils seront toujours connectés. Pas d'accès à Internet ? Vous pouvez toujours vous connecter directement à l'appareil. Vous déménagez dans une nouvelle région ou partez en vacances ? Vos appareils resteront en ligne et accessibles où que vous soyez",
  "Privacy by design": "Confidentialité par conception",
  "Trust the Code": "Faites confiance au code",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Entièrement open-source, pas d'algorithmes cachés, pas de surveillance d'entreprise. C'est la transparence pour le vrai décentraliste.",
  "Your data, your keys": "Vos données, vos clés",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Prenez le contrôle total de vos données avec notre module de connectivité entièrement open-source. Choisissez entre Robonomics ou un stockage cloud Web3 sécurisé avec votre clé personnelle - pas de clouds fermés, pas de code opaque.",
  "Always Connected, Always Secure": "Toujours connecté, toujours sécurisé",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "La communication P2P locale et le cloud Web3 garantissent que votre capteur est toujours accessible, peu importe où vous vous trouvez. Pas de points de défaillance centralisés - juste une connexion pure et peer-to-peer.",
  "Join the Altruist Collective": "Rejoignez le Collectif Altruiste",
  "Plug the device into the global,": "Branchez l'appareil sur le réseau mondial,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Partagez vos informations environnementales avec vos voisins, votre communauté ou votre réseau décentralisé.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Équipé de USB-C prend en charge le WiFi et Zigbee. Enregistre les données de consommation et de génération d'électricité dans le réseau Polkadot à des intervalles de 10 minutes.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori fonctionne sur une carte de développement de microcontrôleur ESP32-C6, dispose d'un écran LCD, prend en charge le Wi-Fi 6 et le BLE 5.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori est adapté au développement rapide d'applications IoT alimentées par Web3. Cela peut être votre tamagotchi de maison intelligente, un contrôleur de jeu, un outil éducatif - tout ce que vous concevez !",
  "Unitree G1 Humanoid Robot": "Robot humanoïde Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Louez le robot humanoïde de pointe pour vos projets de recherche, de programmation et de divertissement.",
  "Hour": "Heure",
  "$200": "200 $",
  "Rent on site (Oakland, CA)": "Location sur place (Oakland, CA)",
  "Suitable for short tasks": "Adapté pour de courtes tâches",
  "No engineering support included": "Aucun support technique inclus",
  "Day": "Jour",
  "$900": "900 $",
  "Suitable for bigger tasks": "Adapté pour des tâches plus importantes",
  "Basic engineering support included": "Support technique de base inclus",
  "Week+": "Semaine+",
  "On demand": "Sur demande",
  "Delivery to your location": "Livraison à votre emplacement",
  "Customized approach": "Approche personnalisée",
  "Engineering support can be included": "Le G1 robot humanoïde avec ses fonctionnalités innovantes offre une polyvalence pour les besoins de recherche, de programmation et de divertissement. Le Unitree G1 comprend une main dextre de contrôle de puissance, lui permettant d'effectuer des tâches délicates telles que la manipulation d'objets, l'appui sur des boutons et l'exécution d'autres opérations précises avec divers objets.",
  "Enter the new era": "Spécifications techniques",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "Hauteur, largeur et épaisseur (support)",
  "Tech specification": "1320x450x200mm",
  "Height, Width and Thickness（Stand）": "Hauteur, largeur et épaisseur (plié)",
  "1320x450x200mm": "690x450x300mm",
  "Height, Width and Thickness（Fold）": "Poids (avec batterie)",
  "690x450x300mm": "Environ 35kg",
  "Weight (With Battery)": "Charge maximale du bras",
  "About 35kg": "Environ 2 kg",
  "Arm Maximum Load": "Système de refroidissement",
  "About 2Kg": "Refroidissement local par air",
  "Cooling System": "Batterie intelligente (détachage rapide)",
  "Local air cooling": "9000mAh",
  "Smart Battery (Quick Release)": "Chargeur",
  "9000mAh": "54V 5A",
  "Charger": "Durée de vie de la batterie",
  "54V 5A": "Environ 2h",
  "Battery Life": "Capteur de détection",
  "About 2h": "Caméra de profondeur + LiDAR 3D",
  "Sensing Sensor": "Haut-parleur 5W",
  "Depth Camera+3D LiDAR": "WiFi 6, Bluetooth 5.2",
  "5W Speaker": "Contrôleur manuel",
  "WiFi 6 , Bluetooth 5.2": "Prenez le contrôle de vos données de maison intelligente avec un serveur domestique open-source sur processeur RISC-V et connectivité Web3.",
  "Manual Controller": "Sans surveillance",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Pas de journaux de données cachés sur des serveurs d'entreprise tout en permettant un accès distant sécurisé.",
  "Surveillance-free": "Pas de verrouillage du fournisseur",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Prend en charge plus de 3000 intégrations avec des appareils de différents fabricants.",
  "No vendor lock-in": "Matériel ouvert",
  "Supports over 3000 integrations with devices from various manufacturers.": "L'architecture de processeur ouvert et le code source ouvert garantissent un système sans confiance.",
  "Open hardware": "Matériel ouvert et efficace",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Notre serveur domestique est alimenté par un processeur RISC-V et dispose de schémas de circuit imprimé entièrement transparents. RISC-V est une architecture de processeur ouverte et modulaire qui est livrée avec une licence BSD. Contrairement à ARM propriétaire, il offre une flexibilité pour la personnalisation sans restrictions de licence, ce qui le rend idéal pour les appareils IoT et les serveurs sans confiance.",
  "Vendor agnostic smart home heart": "Cœur de maison intelligente indépendant du fournisseur",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "Le serveur est pré-installé avec Home Assistant, une plateforme d'automatisation domestique open-source, vous donnant un contrôle total de votre maison intelligente sans dépendre des services cloud tiers.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Sa conception modulaire vous permet d'ajouter facilement des composants, des automatisations et des intégrations, prenant en charge plus de 3 000 appareils de différents fabricants sans verrouillage du fournisseur. Avec le support des protocoles Zigbee et Wi-Fi, vous pouvez connecter une large gamme d'appareils, des capteurs de température aux moniteurs de consommation d'énergie, le tout à un serveur local.",
  "Designed for privacy": "Conçu pour la confidentialité",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Notre serveur domestique intelligent élimine l'ingérence des entreprises, en gardant vos données locales ou chiffrées avec votre clé personnelle dans un stockage Web3 décentralisé. Profitez d'une confidentialité totale sans suivi, sans surveillance, juste un contrôle sécurisé et sans confiance sur votre maison intelligente.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "Avec Robonomics Web3 cloud et le contrôle à distance P2P, vous obtenez un accès cryptographique à toutes les fonctions de la maison intelligente:",
  "Open processor architecture and open-source code ensure a trustless system.": "Architecture de processeur ouverte et code source ouvert garantissent un système sans confiance.",
  "Open and efficient hardware": "Matériel ouvert et efficace",
  "hour": "heure",
  "hours": "heures",
  "day": "jour",
  "days": "jours",
  "week": "semaine",
  "weeks": "semaines",
  "on demand": "sur demande",
  "Special offer": "Offre spéciale",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Obtenez un accès exclusif à l'un des premiers robots humanoïdes commercialement disponibles. Options de location flexibles pour les besoins de recherche, de programmation et de divertissement.",
  "With the Altruist Outdoor Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data—encrypted, mapped, and shared across a distributed network.": "Avec le capteur extérieur Altruist, vous devenez une force dans la surveillance environnementale décentralisée. Capturez des données de bruit, de poussière et de température - cryptées, cartographiées et partagées à travers un réseau distribué.",
  "Access current device states remotely": "Accédez aux états actuels des appareils à distance",
  "Control devices remotely via parachain or LibP2P": "Contrôlez les appareils à distance via parachain ou LibP2P",
  "Manage Home Assistant users": "Gérez les utilisateurs de Home Assistant",
  "Back up and restore Home Assistant configurations": "Sauvegardez et restaurez les configurations de Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Stockez le jumeau numérique de votre maison dans un cloud sécurisé et décentralisé"
}