{
  "What is Robonomics network?": "Qu’est ce que robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics est une plateforme open-source pour les applications IoT. Nous soutenons une nouvelle génération de technologies Internet (web3) qui met en œuvre l’échange d’informations techniques et économiques sous forme de transactions atomiques entre les applications utilisateurs, les services IoT et la robotique complexe.",
  "Get started": "Débuter",
  "Explore Robonomics": "Explorez  Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics est une technologie open source pour le marché de l'IoT accessible à tous. Lire un résumé pour en savoir plus",
  "Get XRT": "Obtenez XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT est le jeton utilitaire qui permet de contrôler les appareils IoT sur le réseau Ethereum et le parachain Robonomics",
  "Use a Dapp": "Utiliser une Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Jetez un œil à la version bêta de l'application décentralisée pour la gestion des appareils IoT",
  "Start building": "Commencer à construire",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Apprendre les robonomiques à travers des tutoriels et des expériences pratiquement utiles dans Robonomics WIKI",
  "Robonomics objectives": "Objectifs robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Basé sur les réalisations des plateformes cloud, Robonomics vise à offrir au marché de l’IoT des solutions Internet plus sûres et plus avancées à chaque étape de la communication homme-machine. Il y a les tâches principales pour lesquelles Robonomics est développé",
  "IoT device management with a decentralized cloud": "Gestion des appareils IoT avec un cloud décentralisé",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Les réseaux Blockchain ont tous les paramètres pour assurer le plus haut niveau de sécurité pour le lancement et la réception de dispositifs de télémétrie. L’interaction avec un appareil peut en fait être décrite en changeant l’état du jumeau numérique stocké dans le réseau blockchain et en fournissant des informations sur ces changements à l’appareil physique. Dans le cas de l’utilisation d’une blockchain sans autorisation,nous pouvons être sûrs de la disponibilité globale des fournisseurs, ainsi que d’un niveau élevé de protection des données du jumeau numérique contre les changements indésirables.",
  "Techno-economic transactions between humans and machines": "Transactions techno-économiques entre humains et machines",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Nous pouvons parler des réalisations institutionnelles en termes d’accès des systèmes automatisés directement aux marchés numériques grâce aux cryptomonnaies et aux contrats intelligents. Par exemple, Ethereum met déjà en œuvre la plupart des outils de base de l’activité économique. Les applications créées aujourd’hui pour connecter l’utilisateur final et les appareils IoT seront beaucoup plus efficaces si le paiement et les conditions de service sont indissociables des paramètres de lancement de l’appareil.",
  "Serverless IoT applications for users": "Applications IoT sans serveur pour les utilisateurs",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "La question de la vie privée des utilisateurs des applications modernes ne devrait pas être coincé dans l’incapacité des entreprises à utiliser les avancées modernes dans le domaine du web3. Il n’est pas nécessaire de s’authentifier ou de se connecter à des serveurs spécifiques pour accéder à la télémétrie et contrôler l’appareil.",
  "Learn with Robonomics": "Apprenez avec la robonomique",
  "Introduction course": "Cours d'introduction",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Plongez dans les problèmes qui se posent autour de la construction d’applications modernes de l’Internet des objets et des solutions possibles avec les technologies Web3 et les outils Robonomics pour les développeurs et les utilisateurs IoT.",
  "Boston dynamics spot software developing": "Développement du logiciel de Boston Dynamics - Spot",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Nous sommes ravis de vous présenter le programme éducatif Spot SDK ! Notre objectif est de vous familiariser avec Spot DSK et de vous permettre de tester vos compétences à distance en utilisant le robot Spot de Boston Dynamics situé dans notre laboratoire.",
  "Sovereign smart home with robonomics and home assistant": "Maison intelligente Souvraine avec Robonomics et assistance domestique",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Dans ce cours, vous passerez en revue toutes les étapes nécessaires pour construire votre propre maison intelligente Souvraine. Le principal avantage est la sécurité et la confidentialité des données des utilisateurs.",
  "Shop": "Boutique",
  "Science papers": "Papier science",
  "Books": "Livres",
  "Logo and assets": "Logo et atouts",
  "Blog": "Blogue",
  "Ambassador program": "Programme ambassadeur",
  "Contacts": "Contacts",
  "White Paper 2022": "Livre blanc 2022",
  "Timeline": "Frise chronologique",
  "Tokenomics": "Tokénomique",
  "Parachain": "Parachain",
  "User (D)App": "Utilisateur (D)App",
  "Function request": "Demande de fonctio",
  "Report": "Signaler",
  "Control": "Contrôle",
  "Log": "Journal",
  "IoT Device": "Dispositif IoT",
  "Decentralized application": "Application décentralisée",
  "Digital twin": "Jumeau numérique",
  "IoT / Smart device": "Internet des Objets / Appareil intelligentо",
  "Robonomics tokenomics": "Robonomics tokenomique",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "est le jeton utilitaire qui permettra de contrôler les appareils IoT sur le réseau Ethereum et le parachain Robonomics dans l’écosystème Polkadot.",
  "The task": "La tâche",
  "Be aware of scammers": "Soyez conscient des fraudeurs",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "s’il vous plaît utiliser seulement les marchés bien connus pour échanger XRT. N’envoyez pas vos jetons aux comptes qui vous sont donnés dans des messages privés quelle que soit la transaction que vous souhaitez effectuer (acheter ou vendre jeton). Si vous avez reçu des « déclarations bruyantes » au sujet du jeton Robonomics (les fraudeurs utilisent souvent quelque chose comme une annonce de largage), veuillez consulter ce site Web (https://robonomics.network/) ou notre compte",
  "for official updates. Be careful, be safe.": "pour obtenir des mises à jour officielles. Soyez prudent, soyez prudent.",
  "XRT in Ethereum": "XRT dans Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Lors de la mise en œuvre du projet Robonomics en 2015 - 2018, l'équipe du projet devait trouver un lien entre la fourniture d'une fonction utile par Robonomics Network, à savoir le lancement d'appareils IoT selon le modèle robot-as-a-service, et le remboursement de la coûts aux fournisseurs Robonomics pour les frais de gaz dans Ethereum. Nous devions réfléchir au cycle de vie de la responsabilité de chaque appareil intelligent pour effectuer un service. À la suite des premières recherches et développements en Robonomics, l'équipe a mis au point un mécanisme d'extraction de nouveaux jetons pour récompenser chaque contrat intelligent de robot en tant que service créé. Ce modèle reste viable pour l'avenir de Robonomics sur Ethereum, mais seulement avec des améliorations significatives dans Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lisez ceci pour connaître le contexte historique et les plans à long terme de l’équipe pour XRT dans l’écosystème Ethereum.",
  "Etherscan profile": "Profil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Voir le contrat intelligent de jeton et les transactions dans le réseau Ethereum ici.",
  "Coingecko markets": "Marchés Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Vous trouverez ici les marchés CEX et DEX pour le trading XRT.",
  "XRT In Polkadot": "XRT dans Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "En passant d’Ethereum à Polkadot, nous devons « intensifier » la tokénomique. Parachains dans l’écosystème Polkadot ne sont pas l’équivalent d’un contrat intelligent, mais sont une blockchain entièrement programmable qui loue un segment du réseau global.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Le paiement réel de la part de Polkadot et Kusama parachains est un collage à long terme de jetons de chaîne de relais natifs (DOT / KSM) en quantité suffisante pour gagner l’une des enchères. Le XRT dans le parachain Robonomics soutient le renouvellement des emplacements et les récompenses pour les parties prenantes. Le mécanisme de gravure XRT sous-jacent à l’activation des abonnements IoT est conçu pour réduire l’inflation au minimum, et en cas d’intérêt accru à zéro.",
  "Learn more": "En savoir plus",
  "in Twitter thread from our network architect.": "dans le fil Twitter de notre architecte réseau.",
  "Usage:": "Utiliser:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT peut être utilisé à la fois pour payer des frais pour effectuer des transactions sur la parachain ou pour acheter un abonnement IoT qui garantit le traitement prioritaire des transactions IoT de l'appareil ou de l'utilisateur.",
  "Rewards:": "Récompenses:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Tout au long de l’année, le parachain émet une petite quantité de rayons X pour inciter les parachutistes à poser des colliers.",
  "The parameter of the total reward": "Le paramètre de la récompense totale ",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "pour les collators pour l’année est déterminé par le vote en chaîne des détenteurs de jetons, et peut être modifié par la tenue d’un référendum.",
  "Use XRT": "Utiliser XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Achetez l’abonnement IoT dans notre application décentralisée. Contrôlez vos appareils intelligents sur blockchain sans aucune observation centralisée des entreprises.",
  "Subscan profile": "Profil subscan",
  "View token statistics on top of Polkadot ecosystem.": "Afficher les statistiques des jetons en haut de l’écosystème Polkadot",
  "Other questions": "D'autres questions",
  "What is RWS?": "Qu’est-ce que RWS ?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[En cours de développement des fonctionnalités de base] Pour les ingénieurs, l’équipe Core Dev tentera de créer différents modèles d’utilisation de Robonomics et la première étape de cette façon est de lancer jeton d’abonnement à vie - jeton RWS. Chaque jeton RWS vous donnera 1 transaction par seconde (tps) depuis/vers votre appareil IoT via Robonomics Parachain. Activez votre jeton RWS et effectuez des transactions 'gaz libre' avec avant d’exécuter et latence prévisible. Désactivez le jeton RWS et échangez-le sur DEX.",
  "What is AIRA/AIR ID?": "Qu’est-ce que AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Le jeton Pre-RX a été distribué en 2017 en tant que partie autonome de l’infrastructure robotique sur Ethereum. Après le lancement réussi de Robonomics sur Ethereum en 2019 AIRA jetons a été connecté à l’infrastructure créée du projet par",
  "ambix smart contract": "contrat intelligent ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "qui a garanti processus autonome et indépendant d’échange pre-XRT à ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "du jeton Robonomics est d’assurer le fonctionnement d’un réseau décentralisé pour la maintenance des Smart Cities et de l’Industrie 4.0 dans l’infrastructure blockchain. Pour atteindre cet objectif, l’économie symbolique doit refléter les incitations à la mise en œuvre du réseau.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "L'application décentralisée (dapp) fonctionne au sein de la blockchain. Elle est open source et ses données sont stockées sur IPFS et Github. Ces technologies permettent à l'application d'être à la fois sécurisée et transparente. Nos développeurs travaillent à la fois sur le développement de l'application Robonomics et sur les bibliothèques que vous pouvez utiliser pour construire votre propre dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin est l’un des instruments fournis par Robonomics Web Services (RWS). Il agit comme une version numérique de l’équipement du monde réel et copie toutes ses caractéristiques techniques. Il permet de rendre une application décentralisée plus sensible aux commandes de l’utilisateur.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Vous pouvez utiliser Robonomics avec une large gamme d’appareils intelligents Zigbee pour automatiser et contrôler différents aspects de votre maison / bureau ou l’utiliser avec la robotique basée sur ROS pour des tâches industrielles plus complexes.",
  "Do Androids Dream of Electric Sheep?": "Les androïdes rêvent-ils de moutons électriques?",
  "Sleeping Mew Space": "Espace Mew endormi",
  "Are you ready for Mars?": "Êtes-vous prêt pour Mars ?",
  "Shiva Robot": "Robot Shiva",
  "Space Travelers": "Voyageurs de l'espace",
  "Retro Astronaut": "Astronaute rétro",
  "New Newton": "Nouveau Newton",
  "Your email": "Votre e-mail",
  "Want emails from robonomics": "Vous voulez des e-mails de robonomics",
  "Adding you to our special list...": "Vous ajouter à notre liste spéciale...",
  "Nice, you are in the list": "Nice, vous êtes dans la liste",
  "Something went  wrong. Try again later": "Quelque chose a mal tourné. Réessayez plus tard",
  "Robonomics art shop": "Boutique d'art Robonomics",
  "Welcome to our brand new online shop on": "Bienvenue dans notre toute nouvelle boutique en ligne sur",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Notre boutique propose des vêtements, accessoires, décoration et autres articles qui montrent notre amour pour la robotique, la technologie et l’art. Vous pouvez trouver des t-shirts, manches longues, sweat à capuche, rideaux de douche, oreillers, couvertures et autres produits utiles avec nos conceptions uniques faites par des artistes robonomiques et produits transformés et expédition par les boursiers de Threadless. Amusez-vous!",
  "Shop now on threadless": "Achetez maintenant sur sans fil",
  "alternative shop": "boutique alternative",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "L’année a commencé par une réalisation majeure : Robonomics a remporté la 20e vente aux enchères de créneaux de parachain et est",
  "officially became": "officiellement devenu",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "parachain avec ID 2048 sur le réseau Kusama. Le lancement, datalog, DigitalTwin, les fonctions de responsabilité et les abonnements IoT sont devenus disponibles pour tous les utilisateurs de l’écosystème. Pour fournir des détails sur cette phase du projet, l’équipe de base a publié les premiers chapitres du",
  "Robonomics Whitepaper 2.0.": "Livre blanc sur les robonomiques 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 sur Substrate a été publié avec le support des messages XCM, et nous avons commencé à ouvrir des canaux HRMP avec d’autres parachains (comme Crust Shadow et Darwinia), dont la fonctionnalité est extrêmement utile pour nous.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "En même temps, nous avons déverrouillé une stratégie pour introduire le marché de l’IoT à notre protocole. Nos expériences avec les équipements IoT nous ont menés au concept d’une maison intelligente souveraine, indépendante des fournisseurs de services cloud centralisés. Nous avons développé notre",
  "integration": "intégration",
  "with the Home Assistant automation system, and also designed our own": ", avec le système d’automatisation Home Assistant, et également conçu notre propre",
  "IoT gateway": "passerelle IoT",
  "for connecting smart devices.": "pour la connexion d’appareils intelligents.",
  "We have launched two big initiatives in order to increase community engagement —": "Nous avons lancé deux grandes initiatives afin d’accroître l’engagement communautaire: ",
  "Robonomics Academy": "l’Académie des robonomiques",
  "Robonomics Ambassador Program": "et le Programme des ambassadeurs des robonomiques",
  "Additionally,": "De plus,",
  "Robonomics Town Hall": "une séance de discussion ouverte sur les robonomiques",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "a eu lieu à l’automne afin que la communauté des robonomiques puisse essayer nos mécanismes de gouvernance pour la première fois.Récemment, l’équipe Robonomics a aidé le projet IPCI du DAO à obtenir un créneau de parachain pour présenter un service de compensation carbone pour les bâtiments intelligents.",
  "In 2021, our": "En 2021, nous sommes",
  "main focus": "principalement concentrés",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "sur la préparation du projet afin que les applications IoT puissent être utilisées via notre parachain sur le réseau Kusama. Robonomics 1.0 sur Substrate a été publié, et nous avons testé la connexion des capteurs au parachain pour envoyer leurs données de télémétrie, ainsi que le développement de la double fonctionnalité numérique. Au milieu de l’année, nous avons décidé de tester le cycle complet de notre réseau et créé notre propre chaîne de relais appelée",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "à laquelle le parachain Robonomics a été intégré (avant d’être migré vers la chaîne de relais Kusama). Il y a eu beaucoup d’attention à obtenir un créneau de parachain à Kusama, pour lequel nous avons organisé plusieurs campagnes de crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Il y a eu deux grands changements pour la communauté. Tout d’abord, nous avons lancé",
  "Robonomics Grant Program": "le Programme de subventions en robotique",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "qui permet aux projets web3, robotique et IdO de recevoir du financement pour des tâches de R-D. À la fin de l’année, quatre projets actifs ont participé au programme. Deuxièmement, l’équipe a lancé le",
  "Exodus process": "processus Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "permettant aux détenteurs de jetons Ethereum de déplacer leurs jetons XRT vers le parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Parmi les collaborations, on peut rappeler l’apparition remarquable de Boston Dynamics Spot chez MerkleBot, pour lequel un",
  "rental remote control system": "système de télécommande de location",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "a été développé. Nous aimerions également vous informer sur la société Multi-Agent Systems qui est un projet personnel qui a été formé par une équipe d’ingénieurs Robonomics. Ils ont développé un pâtissier de gaufres robotisé appelé Eisenkoch qui mène des tâches de cuisine pour les propriétaires de café.",
  "There came a time when the existing limitations of Ethereum": "Il est venu un temps où les limites existantes de Ethereum a",
  "began to stand out clearly": "commencé à se démarquer clairement",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(en particulier, mauvaise évolutivité, faible vitesse et très élevé coût des transactions). La mise à niveau vers ETH2.0 était censée corriger la situation, mais cette mise à niveau a été retardée à plusieurs reprises. Alors que nous ne voulions pas quitter le réseau Ethereum, nous avons réalisé que dans la situation actuelle, il était difficile de mettre en œuvre nos cas d’utilisation, et nous avons commencé à chercher un réseau alternatif. L’écosystème de blockchain éclaté Polkadot est devenu cette alternative. Nous avons commencé par expérimenter le framework Substrate pour migrer les principales fonctionnalités robonomiques et déployer notre propre testnet. A la fin de cette étape, nous avions déployé notre parachute sur le testnet Rococo et commencé à nous préparer à obtenir un créneau sur le réseau Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "En poursuivant l’étude des systèmes IoT, nous avons identifié la principale fonctionnalité de Robonomics, qui peut ajouter de la valeur aux utilisateurs - la fonction de nuage décentralisé pour IoT. Cette idée est à la base de",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "L’infrastructure RWS a pris en charge toutes les fonctions d’un nuage centralisé typique, mais sans les problèmes standard de disponibilité globale, de sécurité et de confidentialité. De plus, nous avons eu l’idée de parachain IoT abonnements qui permet aux abonnés d’utiliser le réseau blockchain sans avoir à payer de frais pour chaque transaction. La première expérience avec les abonnements IoT a été l’émission du jeton RWS, qui permet à son propriétaire d’envoyer 1 transaction par bloc. De plus, nous avons commencé à développer notre propre kit matériel pour le contrôle des appareils intelligents (le concept DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Bien sûr, le support pour Robonomics sur Ethereum n’a pas cessé. La pile de communication Robonomics a été finalisée à la version",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Le jeton XRT a commencé à se négocier sur plusieurs bourses (en particulier, le DEX Uniswap), et le programme d’incitation à la liquidité a été lancé.",
  "The team actively developed ways to interact with the community. The first version of our": "L’équipe a activement développé des moyens d’interagir avec la communauté. La première version de notre site",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "et Robonomics Wiki ont été lancés. Pour une gestion de projet plus transparente et pratique, nous avons commencé à utiliser le",
  "Aragon DAO": "DAO Aragon",
  "We hosted": "Nous avons accueilli",
  "Robonomics Winter School": "l’école d’hiver Robonomics",
  "in 2019 for newcomers to the project.": "en 2019 pour les nouveaux arrivants au projet.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Les collaborations avec les projets sympathiques ont également continué. Robonomics et DAO IPCI a introduit un service de collecte et d’analyse de données sensorielles: ",
  "Robonomics became the foundation for the": "Robonomics est devenu la base du projet",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "qui développe un système de location intelligente de matériel robotique.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Nous avons compris que les agents autonomes avaient besoin d’un environnement qui assurerait la fiabilité de leurs opérations techniques et économiques. Depuis plusieurs années, nous élaborons un protocole pour créer un réseau décentralisé de fournisseurs qui aident les agents robotisés à fournir leurs services. Des outils de maintenance du réseau et de communication entre Ethereum et ROS ont été développés. En 2018, nous avons publié le",
  "Robonomics Whitepaper": "livre blanc Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "et la version alpha de Robonomics Network a été lancée sur le réseau principal Ethereum. Les préparatifs actifs se sont poursuivis pour l’événement de génération de jetons XRT (qui a finalement eu lieu au printemps 2019 en raison du premier hiver de cryptographie).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "À partir de cette période, Robonomics a commencé à développer dynamiquement des cas d’utilisation liés à l’industrie 4.0 - usines intelligentes, villes intelligentes et maisons intelligentes - et cela a attiré notre attention sur le monde de l’IdO. À la recherche d’innovation, l’équipe a présenté plusieurs grandes démonstrations de R&D uniques: un",
  "sensor network": "réseau de capteurs civils,",
  "a water drone": "un drone à eau",
  "for environmental monitoring (supported by a sensor systems manufacturer": "pour la surveillance environnementale (soutenu par un fabricant de systèmes de capteurs",
  "a smart factory model": "modèle d’usine intelligente",
  "a self-employed": "un",
  "robot artist Gaka-chu": "rtiste robot indépendant Gaka-chu ",
  "and a": "et",
  "drone traffic management system": "un système de gestion du trafic des drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics a commencé la coopération avec le projet IPCI DAO sur la gestion des actifs environnementaux en utilisant les technologies web3 et les dispositifs IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Il s’agissait d’une période de R&D active au cours de laquelle nous avons identifié un éventail de tâches, dans lesquelles les technologies p2p ont des capacités qui n’étaient pas disponibles auparavant pour la robotique. En combinant l’ordinateur Ethereum, le stockage de fichiers IPFS et le système d’exploitation robot (ROS), nous avons réalisé que n’importe quel appareil pouvait potentiellement devenir un",
  "autonomous intelligent robot agent": "agent robot intelligent autonome",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Cela nous a ouvert la voie aux concepts de robot-service et d’économie robotique.",
  "Our publications in scientific journals of this period are available in the": "Nos publications dans les revues scientifiques de cette période sont disponibles dans la section",
  "Papers section": "Articles",
  "We have collected all R&D projects over the years in the": "Nous avons rassemblé tous les projets de R&D au fil des ans dans un",
  "a handy book": "livre pratique",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tout a commencé avec une idée qui a commencé sur les fondateurs quand Ethereum avait juste lancé son réseau principal. Que faire si le robot effectue une tâche pour un client de crypto-monnaie, et sa logique est contrôlée par un contrat intelligent?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Pour tester l’idée, nous avons fait une démonstration dans laquelle un drone contrôlé par un ordinateur Ethereum a été lancé pour atteindre les coordonnées GPS spécifiées après que l’utilisateur a terminé une transaction de paiement.",
  "The demo is available on": "La démo est disponible sur",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Calendrier de développement de l’infrastructure et de la technologie",
  "Notable events": "grandes manifestations",
  "World Economic Forum Annual Meeting 2022": "Assemblée annuelle 2022 du Forum économique mondial",
  "Polkadot Decoded 2022": "Polkadot décodé 2022",
  "On the Way to Sovereign Home Automation": "En route vers la domotique souveraine",
  "Becoming a Parachain for IoT Applications": "Devenir parachain pour les applications IoT",
  "Polkadot Decoded 2021": "Polkadot décodé 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (commandité par Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "École d’hiver Robonomics 2021 (organisée par Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transition vers le multiréseau — Long Came Polkadot",
  "The Rise of Robonomics Network": "L'essor du réseau Robonomics",
  "Crypto Valley Conference 2018": "Conférence Crypto Valley 2018",
  "European Parliament workshop 'The Economy of Robots'": "Atelier du Parlement européen 'L’économie des robots'",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Symposium sur la chaîne de blocs pour les systèmes robotiques au MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "École d'été Robonomics-2018 organisée par l'équipe Robonomics.",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Réunir les techniciens Web3 et les cadres robotiques",
  "Playing with Human-Machine Interaction through Ethereum": "Jouer avec l’interaction homme-machine par Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Livre blanc Robonomics 2022 – Guide de bienvenue",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Nous avons développé un protocole de communication techno-économique fonctionnant sur Ethereum et IPFS, et le complétons avec des éléments d’une plate-forme IoT basée sur le Polkadot. Aujourd’hui, nous disposons déjà d’une plateforme hybride pour créer des applications IoT futuristes. Il fournit l’interaction avec les dispositifs sous le contrôle d’un ordinateur décentralisé global. Avant de commencer à créer des applications IoT sécurisées, sans serveur et futuristes à l’aide de la plateforme Robonomics, plongeons un peu dans la théorie...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Les deux premiers chapitres du livre blanc Robonomics sont déjà disponibles pour les utilisateurs..",
  "Chapter 1.": "Chapitre 1.",
  "At the intersection of cybernetics and economics": "À l’intersection de la cybernétique et de l’économie",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Nous avons présenté un système économique dans lequel les dispositifs robotiques agissent comme des agents indépendants capables de réaliser des activités économiques clés, auparavant réservées aux humains. Dans ce chapitre, nous parlerons de la pertinence de l’économie des robots, qui peut devenir une partie importante de la vie des gens et changer le niveau actuel de l’économie en services entièrement automatisés à l’avenir.",
  "In this chapter you will learn": "Dans ce chapitre, vous apprendrez",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase et la nature de l’entreprise",
  "CPS - cyber-physical system": "SCP - système cyberphysique",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener et la recherche de modèles dans la vie et la machine",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "La quatrième révolution industrielle, l’argent pour les robots et Bitcoin",
  "Ethereum Smart Contracts": "Contrats intelligents Ethereum",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Questions ouvertes sur la téléologie et le travail de Mises",
  "Read chapter 1": "Lire le chapitre 1",
  "Chapter 2.": "Chapitre 2.",
  "Robonomics architecture": "Architecture robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Dans le deuxième chapitre, vous découvrirez l’interaction homme-machine à l’aide de la technologie Internet moderne - des appareils IoT à un réseau décentralisé et globalement accessible de fournisseurs. Nous examinerons les bases de l’Internet des objets afin de mettre en évidence les problèmes et les principaux défis auxquels sont confrontés les créateurs de systèmes IoT et à la solution de laquelle Robonomics est destiné.",
  "Overview of the state of the Internet of Things (IoT)": "Aperçu de l’état de l’Internet des objets (IdO)",
  "Classification of IoT devices": "Classification des dispositifs IoT",
  "Embedded IoT systems": "Systèmes IdO imbriqué",
  "Edge-systems: IoT gateways and controllers": "Edge-systems : passerelles et contrôleurs IoT",
  "Autonomous Systems": "Systèmes Autonomes",
  "Internet of Things providers": "Fournisseurs d'Internet des objets",
  "Digital twins are the heart of the Internet of Things": "Les jumeaux numériques sont  cœur de l'Internet des objets",
  "IoT data flows in cloud service": "Flux de données IoT dans le service cloud",
  "Popular examples of IoT solutions": "Exemples populaires de solutions IoT",
  "Current problems of building IoT solutions": "Problèmes actuels liés à l’élaboration de solutions IoT",
  "Main tasks of Robonomics architecture": "Principales tâches de l’architecture Robonomics",
  "Basic components of Robonomics architecture": "Composants de base de l’architecture Robonomics",
  "A simple representation of Robonomics architecture": "Une simple représentation de l’architecture Robonomics",
  "Read chapter 2": "Lire le chapitre 2",
  "We continue to update the white paper of Robonomics": "Nous continuons à mettre à jour le livre blanc sur les Robonomics",
  "stay tuned for new parts on our website and in Discord": "Restez à l’affût de nouvelles pièces sur notre site Web et dans Discord",
  "Join our discord": "Rejoignez notre discord",
  "Robonomics logos and usage": "Logos robonomics et utilisation",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Nous avons rassemblé des logos, des couleurs, des ressources et des directives pour montrer comment vous pouvez les utiliser.",
  "Download Robonomics logo": "Télécharger le logo Robonomics",
  "Download RWS logo": "Télécharger le logo de RWS",
  "Download wiki logo": "Télécharger le logo wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Utilisez ces logos autorisés pour créer un lien vers Robonomics, RWS ou Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Utilisez le logo Robonomics autorisé pour informer les autres que vous êtes intégré avec Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Utiliser les logos autorisés dans les articles de blog, les articles et les diapositives sur la technologie Robonomics et les projets intégrés",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Ne modifiez pas les logos Robonomics autorisés, y compris en changeant la couleur, les dimensions ou en les combinant avec d’autres mots ou éléments de conception",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "N’utilisez pas le logo et le nom de Robonomics d’une manière qui suggère que vous êtes Robonomics, que votre offre ou projet est par Robonomics, ou que Robonomics vous endosse ou votre offre ou projet s’il n’a pas été approuvé par Robonomics DAO",
  "Robonomics Color pallet": "Palette de couleurs robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Ces couleurs que nous utilisons dans nos interfaces, impressions et autres visuels. </br> Utilisez-le pour vos diapositives, bannières pour les messages, etc. sur les robonomiques."
}