{
  "What is Robonomics network?": "Was ist robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics ist eine Open-Source-Plattform für IoT-Anwendungen. Wir unterstützen eine neue Generation von Internet-Technologien (web3), die den Austausch von technischen und wirtschaftlichen Informationen in Form von atomaren Transaktionen zwischen Benutzeranwendungen, IoT-Diensten und komplexer Robotik realisiert.",
  "Get started": "Legen Sie los",
  "Explore Robonomics": "Entdecken Sie Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics ist eine Open-Source-Technologie für den IoT-Markt, die für jeden zugänglich ist. Lesen Sie eine Zusammenfassung, um mehr zu erfahren",
  "Get XRT": "Holen Sie sich XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT ist der Utility Token, der die Kontrolle von IoT-Geräten auf der Basis der Parachain von Ethereum und Robonomics ermöglicht",
  "Use a Dapp": "Verwenden Sie eine Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Werfen Sie einen Blick auf die Beta-Version der dezentralen Anwendung zur Verwaltung von IoT-Geräten",
  "Start building": "Mit dem Aufbau beginnen",
  "Robonomics objectives": "Robonomics-Ziele",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Basierend auf den Leistungen von Cloud-Plattformen zielt Robonomics darauf ab, dem IoT-Markt in jeder Phase der Mensch-Maschine-Kommunikation sicherere und fortschrittlichere Internetlösungen anzubieten. Dies sind die wichtigsten Aufgaben, für die Robonomics entwickelt wird",
  "IoT device management with a decentralized cloud": "IoT-Geräteverwaltung mit einer dezentralen Cloud",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Blockchain-Netzwerke verfügen über alle Parameter, um ein Höchstmaß an Sicherheit für den Gerätestart und den Empfang von Telemetriedaten zu gewährleisten. Die Interaktion mit einem Gerät kann durch die Änderung des Zustands des im Blockchain-Netzwerk gespeicherten digitalen Zwillings und die Übermittlung von Informationen über diese Änderungen an das physische Gerät beschrieben werden. Bei der Verwendung einer erlaubnisfreien Blockchain können wir uns der globalen Verfügbarkeit von Anbietern sowie eines hohen Datenschutzes des digitalen Zwillings vor unerwünschten Änderungen sicher sein.",
  "Techno-economic transactions between humans and machines": "Techno-ökonomische Transaktionen zwischen Mensch und Maschine",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Wir können über institutionelle Errungenschaften im Hinblick auf den direkten Zugang automatisierter Systeme zu digitalen Märkten durch Kryptowährungen und intelligente Verträge sprechen. Ethereum beispielsweise implementiert bereits die meisten der grundlegenden Tools der Wirtschaftstätigkeit. Die Anwendungen, die heute zur Verbindung von Endnutzern und IoT-Geräten entwickelt werden, werden viel effektiver sein, wenn die Bezahlung und die Nutzungsbedingungen untrennbar mit den Startparametern des Geräts verbunden sind.",
  "Serverless IoT applications for users": "Serverlose IoT-Anwendungen für Benutzer",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Das Thema des Schutzes der Privatsphäre von Nutzern moderner Anwendungen sollte nicht an der Unfähigkeit der Unternehmen scheitern, moderne Fortschritte im Bereich des Web3 zu nutzen. Für den Zugriff auf Telemetriedaten und die Steuerung des Geräts ist keine Authentifizierung oder Verbindung zu bestimmten Servern erforderlich.",
  "Learn with Robonomics": "Mit robonomics lernen",
  "Introduction course": "Einführungskurs",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Checke die Probleme die beim Aufbau moderner IoT-Anwendungen auftreten und mögliche Lösungen mit web3-Technologien und Robonomics-Tools für IoT-Entwickler und -Benutzer.",
  "Boston dynamics spot software developing": "Boston Dynamics Spot Softwareentwicklung",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Wir freuen uns dir das Spot SDK-Bildungsprogramm vorstellen zu dürfen! Unser Ziel ist es, dich mit dem Spot SDK vertraut zu machen und dir die Möglichkeit zu geben deine Fähigkeiten mit einem Boston Dynamics Spot Roboter in unserem Labor zu testen.",
  "Sovereign smart home with robonomics and home assistant": "Souveränes Smart Home mit Robonomics und Heimassistent",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "In diesem Kurs wirst du alle Schritte durchlaufen die erforderlich sind um dein eigenes souveränes Smart Home zu bauen, dessen Hauptvorteil die Sicherheit und der Schutz der Nutzerdaten ist.",
  "Shop": "Shop",
  "Science papers": "Science papers",
  "Books": "Bücher",
  "Logo and assets": "Logo und Anlagen",
  "Blog": "Blog",
  "Ambassador program": "Ambassador Programm",
  "Contacts": "Kontakte",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Zeitschiene",
  "Tokenomics": "Tokenomics",
  "Parachain": "Parachain",
  "User (D)App": "Anwender(D)app",
  "Function request": "Funktionsanforderung",
  "Report": "Bericht",
  "Control": "Kontrolle",
  "Log": "Protokoll",
  "IoT Device": "IoT Anwendung",
  "Decentralized application": "Dezentralisierte anwendung",
  "Digital twin": "Digital Twin",
  "IoT / Smart device": "IoT / Smarte Gerät",
  "Robonomics tokenomics": "Robonomics tokenomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "ist der Utility-Token, der die Steuerung von IoT-Geräten über das Ethereum-Netzwerk und die Robonomics-Parachain im Polkadot-Ökosystem erst ermöglicht.",
  "Token distribution": "Token-Verteilung",
  "Be aware of scammers": "Sicherheit vor Betrügern",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "Bitte benutzen Sie nur bekannte Märkte, um XRT zu tauschen. Senden Sie Ihre Token nicht an Konten, die Ihnen in privaten Nachrichten mitgeteilt werden, egal welche Transaktion Sie durchführen möchten (Token kaufen oder verkaufen). Wenn Sie irgendwelche 'Ankündigungen' über Robonomics-Token erhalten haben (Betrüger verwenden oft so etwas wie eine Airdrop-Ankündigung), überprüfen Sie bitte diese Website (https://robonomics.network/) oder unseren",
  "for official updates. Be careful, be safe.": "für offizielle Updates. Seien Sie vorsichtig, bleiben Sie sicher.",
  "XRT in Ethereum": "XRT in Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Bei der Impementierung des Robonomics-Projekts in den Jahren 2015 bis 2018 musste das Projektteam eine Verbindung zwischen der Bereitstellung einer nützlichen Funktion durch das Robonomics-Netzwerk, nämlich der Inbetriebnahme von IoT-Geräten nach dem Robot-as-a-Service-Modell und der Rückerstattung der Kosten an Robonomics-Anbieter in Ethereum finden. Wir mussten über den Lebenszyklus jedes einzelnen smarten Geräts nachdenken, das für die Erbringung einer Dienstleistung haftet. Als Ergebnis der frühen Forschung und Entwicklung von Robonomics entwickelte das Team einen Mechanismus zum Schürfen neuer Token, um jeden erstellten Robot-as-a-Service-Smart-Contract zu belohnen. Dieses Modell bleibt für die Zukunft von Robonomics auf Ethereum realisierbar, allerdings nur mit einer deutlichen Verbesserung von Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lesen Sie dies, um die Hintergründe und die langfristigen Pläne des XRT-Teams im Ethereum-Ecosystem zu erfahren.",
  "Etherscan profile": "Etherscan-Profil",
  "View token smart contract and transactions in Ethereum network here.": "Übersicht Token Smart Contract und die Transaktionen im Ethereum-Netzwerk.",
  "Coingecko markets": "Coingecko-markets",
  "Here you can find CEX and DEX markets for trading XRT.": "Zugang CEX und DEX markets für den Handel mit XRT.",
  "XRT In Polkadot": "XRT im Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Wenn wir von Ethereum zu Polkadot übergehen, müssen wir in der Tokenomik ein 'Scaling up' vornehmen. Parachains im Polkadot-Ecosystem sind nicht das Äquivalent eines Smart Contracts, sondern eine vollständig programmierbare Blockchain die ein Segment des gesamten Netzwerks mietet.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Die eigentliche Bezahlung seitens der Polkadot- und Kusama-Parachains ist die langfristige Bindung von nativen Relay-Chain-Token (DOT / KSM) in ausreichender Menge um eine der Auktionen zu gewinnen. Der XRT in der Robonomics-Parachain unterstützt die Slot-Erneuerung und Verlängerung für die Stakeholders. Der XRT-mechanismus, der der Aktivierung von IoT-Abonnements zugrunde liegt, ist so konzipiert, dass die Inflation auf ein Minimum und im Falle eines erhöhten Interesses auf Null reduziert wird. ",
  "Learn more": "Erfahren Sie mehr ",
  "in Twitter thread from our network architect.": "im Twitter-Thread von unserem Netzwerkarchitekten.",
  "Usage:": "Verwendung:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT kann sowohl verwendet werden, um Gebühren für Transaktionen auf der Parachain zu zahlen, als auch um ein IoT-Abonnement zu erwerben, das eine Priorität bei der Verarbeitung von Geräte- oder Benutzer-IoT-Transaktionen garantiert.",
  "Rewards:": "Bonus:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Im Laufe des Jahres gibt die Parachain eine kleine Menge an XRT aus, um Anreize für Parachain-Sammler zu schaffen. ",
  "The parameter of the total reward": "Der Parameter der Gesamtbelohnung",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "für Kollatoren für das Jahr wird durch On-Chain-Abstimmung der Token-Inhaber bestimmt und kann durch ein Referendum geändert werden.",
  "Use XRT": "Verwendung XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Kaufen Sie ein IoT-Abonnement in unserer dezentralen Anwendung. Steuern Sie Ihre smarten Geräte über die Blockchain ohne das ein zentrales Unternehmen sie beobachtet.",
  "Subscan profile": "Profil scannen",
  "View token statistics on top of Polkadot ecosystem.": "Sehen Sie sich die Token-Statistiken oben im Polkadot-Ecosystem an.",
  "Other questions": "weitere Erläuterungen",
  "What is RWS?": "Was is RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Für Ingenieure wird das Kernentwicklungsteam versuchen], verschiedene Robonomics-Nutzungsmodelle zu entwickeln, und der erste Schritt auf diesem Weg ist die Einführung eines lebenslangen Abonnement-Tokens - RWS-Token. Jeder RWS-Token ermöglicht Ihnen 1 Transaktion pro Sekunde (tps) von/zu Ihrem IoT-Gerät über Robonomics Parachain. Aktivieren Sie Ihren RWS-Token und führen Sie 'freie Gas'-Transaktionen mit vorheriger Ausführung und vorhersehbarer Latenzzeit durch. Deaktivieren Sie den RWS-Token und handeln Sie ihn auf DEX.",
  "What is AIRA/AIR ID?": "Was ist AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT-Token wurden 2017 als autonomer Teil der weiteren Robonomics-Infrastruktur auf Ethereum verteilt. Nach dem erfolgreichen Start von Robonomics über Ethereum im Jahr 2019 wurden AIRA-Token mit der geschaffenen Infrastruktur des Projekts durch den",
  "ambix smart contract": "Ambix-Smart-Contract",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "erbunden, der einen autonomen und unabhängigen Prozess des Swaps von Pre-XRT in ERC-20 XRT garantierte.",
  "The task": "Die Aufgabe",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "des Robonomics-Tokens ist es, den Betrieb eines dezentralen Netzwerks für die Wartung von Smart Cities und Industrie 4.0 in der Blockchain-Infrastruktur zu gewährleisten. Um dieses Ziel zu erreichen, muss die Token-Wirtschaft die Anreize für die Implementierung des Netzwerks widerspiegeln.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Dezentrale Anwendung (dapp) arbeitet innerhalb der Blockchain. Sie ist quelloffen und ihre Daten werden auf IPFS und Github bereitgestellt. Diese Technologien ermöglichen eine sichere und transparente Anwendung zur gleichen Zeit. Unsere Entwickler arbeiten sowohl an der Entwicklung der Robonomics-Anwendung als auch an den Bibliotheken, die Sie beim Aufbau Ihrer eigenen Dapp verwenden können.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Der digital Twin ist eines der Instrumente, die von Robonomics Web Services (RWS) bereitgestellt werden. Er fungiert als digitale Version des physischen Geräts und kopiert alle seine technischen Merkmale. Er ermöglicht es, eine dezentralisierte App besser auf die Befehle des Benutzers reagieren zu lassen.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Du kannst Robonomics mit einer breiten Palette von intelligenten Zigbee-Geräten verwenden, um verschiedene Aspekte deines Zuhauses/Büros zu automatisieren und zu steuern oder es mit ROS basierter Robotik für komplexere industrielle Aufgaben einsetzen.",
  "Want emails from robonomics": "Möchte Emails von Robonomics erhalten",
  "Adding you to our special list...": " Wir setzen dich auf eine besondere Liste...",
  "Nice, you are in the list": "Perfekt, du bist auf der Liste",
  "Something went  wrong. Try again later": "Es ist ein Fehler aufgetreten. Bitte versuche es später noch einmal",
  "Your email": "Deine Email",
  "Robonomics Whitepaper 2022 Leitfaden": "Гайд по Robonomics White Paper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Wir haben ein technisch, ökonomisches Maschinenkommunikationsprotokoll entwickelt, das auf Ethereum und IPFS aufbaut. Dieses ergänzt es mit Elementen einer cloudbasierten IoT-Plattform, die auf dem Parachain Polkadot basiert. Heute verfügen wir bereits über eine hybride Plattform für die Entwicklung futuristischer IoT-Anwendungen. Sie ermöglicht die Interaktion mit Geräten unter der Kontrolle eines globalen dezentralen Computers. Bevor wir damit beginnen sichere, serverlose und futuristische IoT-Anwendungen mit der Robonomics-Plattform zu erstellen, wollen wir ein wenig in die Theorie eintauchen...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Die ersten beiden Kapitel des Robonomics-Whitepapers stehen den Nutzern bereits zur Verfügung.",
  "Chapter 1.": "Kapitel 1.",
  "At the intersection of cybernetics and economics": "Am Schnittpunkt von Kybernetik und Wirtschaft",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Wir haben ein Wirtschaftssystem vorgestellt in dem Roboter als unabhängige Agenten fungieren welche in der Lage sind, wichtige wirtschaftliche Tätigkeiten auszuführen die bisher dem Menschen vorbehalten waren. In diesem Kapitel informieren wir über die Relevanz der Roboterwirtschaft die ein wichtiger Teil des Lebens der Menschen werden und das derzeitige Niveau der Wirtschaft in Zukunft in vollautomatische Dienstleistungen umwandeln kann.",
  "In this chapter you will learn": "In diesem Kapitel erfährst du",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase und das Wesen des Unternehmens",
  "CPS - cyber-physical system": "CPS - Cyber-Physikalisches System",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener und die Suche nach Mustern in Leben und Maschine",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Die 4.0 industrielle Revolution, Geld für Roboter und Bitcoin",
  "Ethereum Smart Contracts": "Ethereum Smart Contracts",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Offene Fragen der Teleologie und Mises' Werk",
  "Read chapter 1": "Lesen Sie Kapitel 1",
  "Chapter 2.": "Kapitel 2. ",
  "Robonomics architecture": "Robonomics-Architektur",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Im zweiten Kapitel lesen Sie über die Interaktion zwischen Mensch und Maschine mit Hilfe moderner Internettechnologie - von IoT-Geräten bis hin zu einem dezentralen und weltweit zugänglichen Netz von Anbietern. Wir werden uns mit den Grundlagen des IoT´s befassen um die Probleme und größten Herausforderungen zu beleuchten mit denen die Entwickler von IoT-Systemen konfrontiert sind und auf deren Lösung Robonomics abzielt.",
  "Overview of the state of the Internet of Things (IoT)": "Überblick über den Stand 'Internet of Things' (IoT)",
  "Classification of IoT devices": "Klassifizierung der IoT-Geräte",
  "Embedded IoT systems": "Eingebettete IoT Systeme",
  "Edge-systems: IoT gateways and controllers": "Edge-Systeme: IoT-Gateways und -Steuerungen",
  "Autonomous Systems": "Autonome Systeme",
  "Internet of Things providers": "Internet of Things providers",
  "Digital twins are the heart of the Internet of Things": "Digital Twins sind das Herzstück von IoT (Internet of Things)",
  "IoT data flows in cloud service": "IoT-Datenströme in einem Cloud-Service",
  "Popular examples of IoT solutions": "Beliebte Beispiele für IoT-Lösungen",
  "Current problems of building IoT solutions": "Aktuelle Probleme beim Aufbau von IoT-Lösungen",
  "Main tasks of Robonomics architecture": "Hauptaufgaben der Robonomics-Architektur",
  "Basic components of Robonomics architecture": "Grundlegende Komponenten der Robonomics-Architektur",
  "A simple representation of Robonomics architecture": "Eine einfache Darstellung der Robonomics-Architektur",
  "Read chapter 2": "Lesen Sie Kapitel 2",
  "We continue to update the white paper of Robonomics": "Wir aktualisieren weiterhin das White Paper von Robonomics",
  "stay tuned for new parts on our website and in Discord": "Bleibt dran für aktuelle Informationen auf unserer Website und in Discord",
  "Join our discord": "Unserem Discord beitreten",
  "Robonomics logos and usage": "Robonomics Logos und Verwendung",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Wir haben Robonomics Logos, -Farben, -Assets und -Richtlinien zusammengestellt, um zu zeigen wie du diese verwenden kannst.",
  "Download Robonomics logo": " Robonomics Logo herunterladen",
  "Download RWS logo": "RWS Logo herunterladen",
  "Download wiki logo": "Wiki Logo herunterladen",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Verwende die Logos um auf Robonomics, RWS oder Robonomics Wiki zu verlinken",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Verwende das Robonomics-Logo um anderen mitzuteilen, dass du in Robonomics integriert bist",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Verwendung zugelassener Logos in Blogbeiträgen, Artikeln und Folien über Robonomics-Technologie und integrierte Projekte",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Die Robonomics-Logos dürfen nicht verändert werden, auch nicht durch Änderung der Farbe, der Abmessungen oder durch Kombination mit anderen Wörtern oder Designelementen",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Verwende das Logo und den Namen von Robonomics nicht um den Eindruck zu erwecken, dass du von Robonomics bist, dass dein Angebot oder Projekt von Robonomics stammt oder das Robonomics dich oder dein Angebot bzw. Projekt unterstützt, wenn es nicht von Robonomics DAO genehmigt wurde",
  "Robonomics Color pallet": "Farbpalette von Robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Diese Farben verwenden wir für unsere Schnittstellen, Drucke und andere visuelle Elemente. </br> Du kannst es für deine Folien, Banner für Beiträge usw., die über Robonomics berichten verwenden"
}