{
  "What is Robonomics network?": "Was ist robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics ist eine Open-Source-Plattform für IoT-Anwendungen. Wir unterstützen eine neue Generation von Internet-Technologien (web3), die den Austausch von technischen und wirtschaftlichen Informationen in Form von atomaren Transaktionen zwischen Benutzeranwendungen, IoT-Diensten und komplexer Robotik realisiert.",
  "Get started": "Legen Sie los",
  "Explore Robonomics": "Entdecken Sie Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics ist eine Open-Source-Technologie für den IoT-Markt, die für jeden zugänglich ist. Lesen Sie eine Zusammenfassung, um mehr zu erfahren",
  "Get XRT": "Holen Sie sich XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT ist der Utility Token, der die Kontrolle von IoT-Geräten auf der Basis der Parachain von Ethereum und Robonomics ermöglicht",
  "Use a Dapp": "Verwenden Sie eine Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Werfen Sie einen Blick auf die Beta-Version der dezentralen Anwendung zur Verwaltung von IoT-Geräten",
  "Start building": "Mit dem Aufbau beginnen",
  "Robonomics objectives": "Robonomics-Ziele",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Basierend auf den Leistungen von Cloud-Plattformen zielt Robonomics darauf ab, dem IoT-Markt in jeder Phase der Mensch-Maschine-Kommunikation sicherere und fortschrittlichere Internetlösungen anzubieten. Dies sind die wichtigsten Aufgaben, für die Robonomics entwickelt wird",
  "IoT device management with a decentralized cloud": "IoT-Geräteverwaltung mit einer dezentralen Cloud",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Blockchain-Netzwerke verfügen über alle Parameter, um ein Höchstmaß an Sicherheit für den Gerätestart und den Empfang von Telemetriedaten zu gewährleisten. Die Interaktion mit einem Gerät kann durch die Änderung des Zustands des im Blockchain-Netzwerk gespeicherten digitalen Zwillings und die Übermittlung von Informationen über diese Änderungen an das physische Gerät beschrieben werden. Bei der Verwendung einer erlaubnisfreien Blockchain können wir uns der globalen Verfügbarkeit von Anbietern sowie eines hohen Datenschutzes des digitalen Zwillings vor unerwünschten Änderungen sicher sein.",
  "Techno-economic transactions between humans and machines": "Techno-ökonomische Transaktionen zwischen Mensch und Maschine",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Wir können über institutionelle Errungenschaften im Hinblick auf den direkten Zugang automatisierter Systeme zu digitalen Märkten durch Kryptowährungen und intelligente Verträge sprechen. Ethereum beispielsweise implementiert bereits die meisten der grundlegenden Tools der Wirtschaftstätigkeit. Die Anwendungen, die heute zur Verbindung von Endnutzern und IoT-Geräten entwickelt werden, werden viel effektiver sein, wenn die Bezahlung und die Nutzungsbedingungen untrennbar mit den Startparametern des Geräts verbunden sind.",
  "Serverless IoT applications for users": "Serverlose IoT-Anwendungen für Benutzer",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Das Thema des Schutzes der Privatsphäre von Nutzern moderner Anwendungen sollte nicht an der Unfähigkeit der Unternehmen scheitern, moderne Fortschritte im Bereich des Web3 zu nutzen. Für den Zugriff auf Telemetriedaten und die Steuerung des Geräts ist keine Authentifizierung oder Verbindung zu bestimmten Servern erforderlich.",
  "Learn with Robonomics": "Mit robonomics lernen",
  "Introduction course": "Einführungskurs",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Checke die Probleme die beim Aufbau moderner IoT-Anwendungen auftreten und mögliche Lösungen mit web3-Technologien und Robonomics-Tools für IoT-Entwickler und -Benutzer.",
  "Boston dynamics spot software developing": "Boston Dynamics Spot Softwareentwicklung",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Wir freuen uns dir das Spot SDK-Bildungsprogramm vorstellen zu dürfen! Unser Ziel ist es, dich mit dem Spot SDK vertraut zu machen und dir die Möglichkeit zu geben deine Fähigkeiten mit einem Boston Dynamics Spot Roboter in unserem Labor zu testen.",
  "Sovereign smart home with robonomics and home assistant": "Souveränes Smart Home mit Robonomics und Heimassistent",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "In diesem Kurs wirst du alle Schritte durchlaufen die erforderlich sind um dein eigenes souveränes Smart Home zu bauen, dessen Hauptvorteil die Sicherheit und der Schutz der Nutzerdaten ist.",
  "Shop": "Shop",
  "Science papers": "Science papers",
  "Books": "Bücher",
  "Logo and assets": "Logo und Anlagen",
  "Blog": "Blog",
  "Ambassador program": "Ambassador Programm",
  "Contacts": "Kontakte",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Zeitschiene",
  "Tokenomics": "Tokenomics",
  "Parachain": "Parachain",
  "User (D)App": "Anwender(D)app",
  "Function request": "Funktionsanforderung",
  "Report": "Bericht",
  "Control": "Kontrolle",
  "Log": "Protokoll",
  "IoT Device": "IoT Anwendung",
  "Decentralized application": "Dezentralisierte anwendung",
  "Digital twin": "Digital Twin",
  "IoT / Smart device": "IoT / Smarte Gerät",
  "Robonomics tokenomics": "Robonomics tokenomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "ist der Utility-Token, der die Steuerung von IoT-Geräten über das Ethereum-Netzwerk und die Robonomics-Parachain im Polkadot-Ökosystem erst ermöglicht.",
  "Token distribution": "Token-Verteilung",
  "Be aware of scammers": "Sicherheit vor Betrügern",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "Bitte benutzen Sie nur bekannte Märkte, um XRT zu tauschen. Senden Sie Ihre Token nicht an Konten, die Ihnen in privaten Nachrichten mitgeteilt werden, egal welche Transaktion Sie durchführen möchten (Token kaufen oder verkaufen). Wenn Sie irgendwelche 'Ankündigungen' über Robonomics-Token erhalten haben (Betrüger verwenden oft so etwas wie eine Airdrop-Ankündigung), überprüfen Sie bitte diese Website (https://robonomics.network/) oder unseren",
  "for official updates. Be careful, be safe.": "für offizielle Updates. Seien Sie vorsichtig, bleiben Sie sicher.",
  "XRT in Ethereum": "XRT in Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Bei der Impementierung des Robonomics-Projekts in den Jahren 2015 bis 2018 musste das Projektteam eine Verbindung zwischen der Bereitstellung einer nützlichen Funktion durch das Robonomics-Netzwerk, nämlich der Inbetriebnahme von IoT-Geräten nach dem Robot-as-a-Service-Modell und der Rückerstattung der Kosten an Robonomics-Anbieter in Ethereum finden. Wir mussten über den Lebenszyklus jedes einzelnen smarten Geräts nachdenken, das für die Erbringung einer Dienstleistung haftet. Als Ergebnis der frühen Forschung und Entwicklung von Robonomics entwickelte das Team einen Mechanismus zum Schürfen neuer Token, um jeden erstellten Robot-as-a-Service-Smart-Contract zu belohnen. Dieses Modell bleibt für die Zukunft von Robonomics auf Ethereum realisierbar, allerdings nur mit einer deutlichen Verbesserung von Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lesen Sie dies, um die Hintergründe und die langfristigen Pläne des XRT-Teams im Ethereum-Ecosystem zu erfahren.",
  "Etherscan profile": "Etherscan-Profil",
  "View token smart contract and transactions in Ethereum network here.": "Übersicht Token Smart Contract und die Transaktionen im Ethereum-Netzwerk.",
  "Coingecko markets": "Coingecko-markets",
  "Here you can find CEX and DEX markets for trading XRT.": "Zugang CEX und DEX markets für den Handel mit XRT.",
  "XRT In Polkadot": "XRT im Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Wenn wir von Ethereum zu Polkadot übergehen, müssen wir in der Tokenomik ein 'Scaling up' vornehmen. Parachains im Polkadot-Ecosystem sind nicht das Äquivalent eines Smart Contracts, sondern eine vollständig programmierbare Blockchain die ein Segment des gesamten Netzwerks mietet.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Die eigentliche Bezahlung seitens der Polkadot- und Kusama-Parachains ist die langfristige Bindung von nativen Relay-Chain-Token (DOT / KSM) in ausreichender Menge um eine der Auktionen zu gewinnen. Der XRT in der Robonomics-Parachain unterstützt die Slot-Erneuerung und Verlängerung für die Stakeholders. Der XRT-mechanismus, der der Aktivierung von IoT-Abonnements zugrunde liegt, ist so konzipiert, dass die Inflation auf ein Minimum und im Falle eines erhöhten Interesses auf Null reduziert wird. ",
  "Learn more": "Erfahren Sie mehr ",
  "in Twitter thread from our network architect.": "im Twitter-Thread von unserem Netzwerkarchitekten.",
  "Usage:": "Verwendung:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT kann sowohl verwendet werden, um Gebühren für Transaktionen auf der Parachain zu zahlen, als auch um ein IoT-Abonnement zu erwerben, das eine Priorität bei der Verarbeitung von Geräte- oder Benutzer-IoT-Transaktionen garantiert.",
  "Rewards:": "Bonus:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Im Laufe des Jahres gibt die Parachain eine kleine Menge an XRT aus, um Anreize für Parachain-Sammler zu schaffen. ",
  "The parameter of the total reward": "Der Parameter der Gesamtbelohnung",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "für Kollatoren für das Jahr wird durch On-Chain-Abstimmung der Token-Inhaber bestimmt und kann durch ein Referendum geändert werden.",
  "Use XRT": "Verwendung XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Kaufen Sie ein IoT-Abonnement in unserer dezentralen Anwendung. Steuern Sie Ihre smarten Geräte über die Blockchain ohne das ein zentrales Unternehmen sie beobachtet.",
  "Subscan profile": "Profil scannen",
  "View token statistics on top of Polkadot ecosystem.": "Sehen Sie sich die Token-Statistiken oben im Polkadot-Ecosystem an.",
  "Other questions": "weitere Erläuterungen",
  "What is RWS?": "Was is RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Für Ingenieure wird das Kernentwicklungsteam versuchen], verschiedene Robonomics-Nutzungsmodelle zu entwickeln, und der erste Schritt auf diesem Weg ist die Einführung eines lebenslangen Abonnement-Tokens - RWS-Token. Jeder RWS-Token ermöglicht Ihnen 1 Transaktion pro Sekunde (tps) von/zu Ihrem IoT-Gerät über Robonomics Parachain. Aktivieren Sie Ihren RWS-Token und führen Sie 'freie Gas'-Transaktionen mit vorheriger Ausführung und vorhersehbarer Latenzzeit durch. Deaktivieren Sie den RWS-Token und handeln Sie ihn auf DEX.",
  "What is AIRA/AIR ID?": "Was ist AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT-Token wurden 2017 als autonomer Teil der weiteren Robonomics-Infrastruktur auf Ethereum verteilt. Nach dem erfolgreichen Start von Robonomics über Ethereum im Jahr 2019 wurden AIRA-Token mit der geschaffenen Infrastruktur des Projekts durch den",
  "ambix smart contract": "Ambix-Smart-Contract",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "erbunden, der einen autonomen und unabhängigen Prozess des Swaps von Pre-XRT in ERC-20 XRT garantierte.",
  "The task": "Die Aufgabe",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "des Robonomics-Tokens ist es, den Betrieb eines dezentralen Netzwerks für die Wartung von Smart Cities und Industrie 4.0 in der Blockchain-Infrastruktur zu gewährleisten. Um dieses Ziel zu erreichen, muss die Token-Wirtschaft die Anreize für die Implementierung des Netzwerks widerspiegeln.",
  "Try our Dapp": "Probieren Sie unsere Dapp aus",
  "In addition": "Darüber hinaus",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "können Sie XRT innerhalb von Blockchains mit den von verschiedenen unabhängigen Teams in den Polkadot (Kusama) und Ethereum-Communities bereitgestellten Tools betreiben.",
  "Within the Kusama network, you have the capability use": "Innerhalb des Kusama-Netzwerks haben Sie die Möglichkeit, die Kommunikation zwischen der Robonomics-Parachain und anderen Parachains mithilfe verschiedener dezentralisierter Anwendungen (dApps) zu nutzen:",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "Innerhalb des Ethereum-Netzwerks können Sie dezentrale Anwendungen nutzen, die von der",
  "Within the Ethereum network you can use decentralized application powered by the": "Bitte beachten Sie",
  "Attention please": "Wenn Sie den Multichain-Service für Brückentransaktionen genutzt haben, bitten wir Sie, dies vorerst zu unterlassen, da es",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "auf dem offiziellen Twitter von The Multichain angekündigt wurde.",
  "announced": "angekündigt",
  "on the official Twitter of The Multichain.": "auf dem offiziellen Twitter von The Multichain.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Dezentrale Anwendung (dapp) arbeitet innerhalb der Blockchain. Sie ist quelloffen und ihre Daten werden auf IPFS und Github bereitgestellt. Diese Technologien ermöglichen eine sichere und transparente Anwendung zur gleichen Zeit. Unsere Entwickler arbeiten sowohl an der Entwicklung der Robonomics-Anwendung als auch an den Bibliotheken, die Sie beim Aufbau Ihrer eigenen Dapp verwenden können.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Der digital Twin ist eines der Instrumente, die von Robonomics Web Services (RWS) bereitgestellt werden. Er fungiert als digitale Version des physischen Geräts und kopiert alle seine technischen Merkmale. Er ermöglicht es, eine dezentralisierte App besser auf die Befehle des Benutzers reagieren zu lassen.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Du kannst Robonomics mit einer breiten Palette von intelligenten Zigbee-Geräten verwenden, um verschiedene Aspekte deines Zuhauses/Büros zu automatisieren und zu steuern oder es mit ROS basierter Robotik für komplexere industrielle Aufgaben einsetzen.",
  "Want emails from robonomics": "Möchte Emails von Robonomics erhalten",
  "Adding you to our special list...": " Wir setzen dich auf eine besondere Liste...",
  "Nice, you are in the list": "Perfekt, du bist auf der Liste",
  "Something went  wrong. Try again later": "Es ist ein Fehler aufgetreten. Bitte versuche es später noch einmal",
  "Your email": "Deine Email",
  "Community & Contacts": "Gemeinschaft & Kontakte",
  "Get latest updates": "Erhalten Sie die neuesten Updates",
  "Tell us something if you want": "Sagen Sie uns etwas, wenn Sie möchten",
  "Submit": "Einreichen",
  "Something went  wrong :( Try again later": "Etwas ist schiefgelaufen :( Versuchen Sie es später erneut",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Wir haben ein technisch, ökonomisches Maschinenkommunikationsprotokoll entwickelt, das auf Ethereum und IPFS aufbaut. Dieses ergänzt es mit Elementen einer cloudbasierten IoT-Plattform, die auf dem Parachain Polkadot basiert. Heute verfügen wir bereits über eine hybride Plattform für die Entwicklung futuristischer IoT-Anwendungen. Sie ermöglicht die Interaktion mit Geräten unter der Kontrolle eines globalen dezentralen Computers. Bevor wir damit beginnen sichere, serverlose und futuristische IoT-Anwendungen mit der Robonomics-Plattform zu erstellen, wollen wir ein wenig in die Theorie eintauchen...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Die ersten beiden Kapitel des Robonomics-Whitepapers stehen den Nutzern bereits zur Verfügung.",
  "Chapter 1.": "Kapitel 1.",
  "At the intersection of cybernetics and economics": "Am Schnittpunkt von Kybernetik und Wirtschaft",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Wir haben ein Wirtschaftssystem vorgestellt in dem Roboter als unabhängige Agenten fungieren welche in der Lage sind, wichtige wirtschaftliche Tätigkeiten auszuführen die bisher dem Menschen vorbehalten waren. In diesem Kapitel informieren wir über die Relevanz der Roboterwirtschaft die ein wichtiger Teil des Lebens der Menschen werden und das derzeitige Niveau der Wirtschaft in Zukunft in vollautomatische Dienstleistungen umwandeln kann.",
  "In this chapter you will learn": "In diesem Kapitel erfährst du",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase und das Wesen des Unternehmens",
  "CPS - cyber-physical system": "CPS - Cyber-Physikalisches System",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener und die Suche nach Mustern in Leben und Maschine",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Die 4.0 industrielle Revolution, Geld für Roboter und Bitcoin",
  "Ethereum Smart Contracts": "Ethereum Smart Contracts",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Offene Fragen der Teleologie und Mises' Werk",
  "Read chapter 1": "Lesen Sie Kapitel 1",
  "Chapter 2.": "Kapitel 2. ",
  "Robonomics architecture": "Robonomics-Architektur",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Im zweiten Kapitel lesen Sie über die Interaktion zwischen Mensch und Maschine mit Hilfe moderner Internettechnologie - von IoT-Geräten bis hin zu einem dezentralen und weltweit zugänglichen Netz von Anbietern. Wir werden uns mit den Grundlagen des IoT´s befassen um die Probleme und größten Herausforderungen zu beleuchten mit denen die Entwickler von IoT-Systemen konfrontiert sind und auf deren Lösung Robonomics abzielt.",
  "Overview of the state of the Internet of Things (IoT)": "Überblick über den Stand 'Internet of Things' (IoT)",
  "Classification of IoT devices": "Klassifizierung der IoT-Geräte",
  "Embedded IoT systems": "Eingebettete IoT Systeme",
  "Edge-systems: IoT gateways and controllers": "Edge-Systeme: IoT-Gateways und -Steuerungen",
  "Autonomous Systems": "Autonome Systeme",
  "Internet of Things providers": "Internet of Things providers",
  "Digital twins are the heart of the Internet of Things": "Digital Twins sind das Herzstück von IoT (Internet of Things)",
  "IoT data flows in cloud service": "IoT-Datenströme in einem Cloud-Service",
  "Popular examples of IoT solutions": "Beliebte Beispiele für IoT-Lösungen",
  "Current problems of building IoT solutions": "Aktuelle Probleme beim Aufbau von IoT-Lösungen",
  "Main tasks of Robonomics architecture": "Hauptaufgaben der Robonomics-Architektur",
  "Basic components of Robonomics architecture": "Grundlegende Komponenten der Robonomics-Architektur",
  "A simple representation of Robonomics architecture": "Eine einfache Darstellung der Robonomics-Architektur",
  "Read chapter 2": "Lesen Sie Kapitel 2",
  "We continue to update the white paper of Robonomics": "Wir aktualisieren weiterhin das White Paper von Robonomics",
  "stay tuned for new parts on our website and in Discord": "Bleibt dran für aktuelle Informationen auf unserer Website und in Discord",
  "Join our discord": "Unserem Discord beitreten",
  "Robonomics art shop": "Robonomics Kunstladen",
  "Welcome to our brand new online shop on": "Willkommen in unserem brandneuen Online-Shop auf",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Unser Geschäft bietet Kleidung, Accessoires, Wohnkultur und andere Artikel, die unsere Liebe zur Robotik, Technologie und Kunst zeigen. Sie finden T-Shirts, Langarmshirts, Hoodies, Duschvorhänge, Kissen, Decken und andere nützliche Produkte mit unseren einzigartigen Designs, die von Robonomics-Künstlern erstellt und von Mitarbeitern von Threadless produziert und versendet werden. Viel Spaß!",
  "Shop now on threadless": "Jetzt auf Threadless einkaufen",
  "alternative shop": "Alternativer Laden",
  "Do Androids Dream of Electric Sheep?": "Träumen Androiden von elektrischen Schafen?",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Als Nächstes möchten wir Ihnen die praktischen Bereiche der Mensch-Maschine-Interaktion mit moderner Internettechnologie vorstellen. Dabei bewegen wir uns von der bekannten IoT-Gerätearchitektur des technischen Informationsaustauschs über Cloud-Dienste hin zur Organisation der technisch, wirtschaftlichen Interaktion über ein dezentrales global zugängliches Netzwerk von Anbietern.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Zunächst betrachten wir den Bereich der am deutlichsten mit der Vernetzung von automatisierten Systemen zusammenhängt. Danach schauen wir auf die wichtigsten Herausforderungen mit denen die Entwickler von IoT-Systemen konfrontiert sind und auf deren Lösung Robonomics abzielt.",
  "Overview of the state of the internet of things (IoT)": "Überblick über den stand internet of things (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Das Thema der Vernetzung automatischer Geräte wird seit den 60er Jahren auf der ganzen Welt diskutiert und schon damals wurden ernsthafte Versuche unternommen diese zu lösen. So hat beispielsweise der sowjetische Kybernetiker Viktor Glushkov in den 60er und 70er Jahren im Rahmen der Konzeption des nationalen Informationssystems",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "die automatische Erfassung von Informationen über die Produktionsmengen eines einzelnen Werks vorgeschlagen und teilweise umgesetzt. Es ist allgemein bekannt wie Coca-Cola-Automaten in den 80er Jahren an das ARPANET angeschlossen wurden, dass die Verfügbarkeit von Getränken und deren Temperatur melden konnten.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Dennoch findet die eigentliche Entwicklung des IoT schon heute statt und zwar dank der weit verbreiteten Nutzung von Basistechnologien. Die wichtigsten Triebkräfte für die rasante Entwicklung der Anwendungen von 'Internet of Things' ist das Ergebnis der Entwicklung in vielen Bereichen - von der drahtlosen Kommunikation mit verschiedenen Reichweiten und eingebetteten Geräten bis hin zu Cloud-Analysen und maschinellem Lernen. Die Zahl der IoT-Geräte ist in den letzten 10 Jahren stetig gewachsen (mit einer Prognose von 25 Milliarden Geräten bis 2030) was Forscher und Entwickler dazu veranlasst hat neue IoT-Anwendungen in verschiedenen Bereichen wie Gesundheitswesen, Heimautomatisierung, Agrarindustrie und Umweltschutz zu entwickeln.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Wir interessieren uns mehr für den Prozess von IoT-Systemen und die Aufgaben die dabei anfallen. Im Laufe der Jahre der Forschung wurden viele verschiedene Architekturen vorgeschlagen und wenn man diese zusammenfasst kann man drei grundlegende Komponenten eines IoT-Systems unterscheiden: Geräte, Netzwerkinfrastruktur, Analyse- Rechen- und Kontrollmaschinen.",
  "New challenges": "Herausforderungen",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Eine weitere aktuelle Herausforderung für das IoT ist das Konzept des 'digital twins' - eine digitale Version einer realen Anlage die deren Spezifikationen und historische Daten kopiert. Dieses Konzept kommt am besten in Bereichen zur Geltung in denen eine genaue und vollständige Spezifikation eines Prozesses erforderlich ist um dessen Entwicklung vorhersagen zu können. Das IoT fungiert als Hauptintegrator der 'digital twins', aber diese Aufgabe ist viel tiefgreifender als die übliche Konnektivität von IoT-Geräten.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Wir erleben gerade ein ganzes Segment des Netzes das nicht für Menschen, sondern für Maschinen konzipiert und geeignet ist. Das IoT besteht nicht mehr nur aus dem Anschluss eines Geräts an das Netz, sondern aus mehr Diensten die speziell für Geräte geschaffen und verfügbar sind. Das IoT verbindet nicht nur den Nutzer und das Gerät sondern hilft den Geräten auch, die Aufgaben der Bereitstellung eines Dienstes für den Menschen zu übernehmen, allerdings autonom",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Solche Systeme haben keine Benutzerschnittstellen und werden in der Regel auf dem untersten Level des IoT-Ökosystems eingesetzt um um die Basis Funktionen bereitzustellen. Sie müssen energieeffizient und klein sein. Sie verfügen über begrenzte Rechen- und Kommunikationsressourcen. IoT-Gateways oder -Steuerungen fungieren in der Regel als Signalempfänger.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Diese Systeme sind Bindeglieder zwischen lokal zugänglichen eingebetteten Systemen und dem globalen Internet. Sie unterstützen in der Regel mehrere Kommunikationsprotokolle von eingebetteten Systemen und übertragen Telemetriedaten von Geräten in die Cloud und Steuersignale zurück. Oft handelt es sich bei diesen Geräten um eine weiterentwickelte Version des WiFi-Routers die mit einem Einplatinencomputer ausgestattet ist um primäre Verarbeitung von Informationen von Geräten durchzuführen ohne das lokale Netzwerk zu verlassen.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Zu dieser Klasse gehören komplexe Automaten (wie z. B. Spot of Boston Dynamics), die eine Steuerungskomponente auf dem Niveau eines vollwertigen Computers mit einem Hochleistungsprozessor und einem großen Speicher haben. In solchen Fällen ist der Roboter ohne zusätzliche Zwischenlösungen (Edge-Systeme) mit dem Internet verbunden. Die notwendige Software für den Zugriff auf das IoT wird direkt auf dem Rechner des autonomen Systems installiert. Die Daten werden lokal gesammelt und teilweise verarbeitet und dann ins Internet übertragen, ähnlich wie bei einem vollwertigen Netzwerkgerät.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Die Hauptaufgabe von IoT-Anbietern besteht darin, den Nutzern den Fernzugriff auf Daten und Analysen sowie die Verwaltung von intelligenten Geräten über das Internet zu ermöglichen. Die wichtigsten Kriterien für die Qualität des Anbieters sind die Sicherheit des Betriebs, die Stabilität der Verbindung und die Erreichbarkeit des Anbieters von jedem Ort der Welt aus.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Das Standardschema eines IoT-Anbieters umfasst: Installation von Software, die mit dem intelligenten Cloud-Gerät kompatibel ist. Einrichtung von Cloud-seitigen Verwaltungsdiensten nach der ersten erfolgreichen Verbindung eines Geräts. Verbindung verschiedener Arten von Analysediensten.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Apropos 'Digital Twins' sollte angemerkt werden, dass architektonisch ihre Umsetzung erforderlich ist. Als Verwehrung dem Benutzer direkten Zugang zur Steuerung von Geräten zu geben und ihren Zustand zu ändern. Zu den offensichtlichsten Gründen für die Ablehnung gehören erstens das Vorhandensein eigener Anforderungen und Bedingungen in den Geräten kurz vor der Einführung. Zweitens, wenn mehrere Benutzergeräte auf eine einzige Datenquelle zugreifen müssen kann es kritisch sein jedem Benutzer eine personalisierte Kontrolle zu geben. Und schließlich ist es äußerst nützlich den letzten Ist-Zustand des Geräts für den Fall bereitzuhalten das es außer Betrieb geht.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Das Ergebnis ist eine Trennung der Schleife des Informationsaustauschs mit dem Nutzer und der tatsächlichen Erzeugung von Daten durch die Sensoren. Zur Veranschaulichung dieses Prinzips wird im Folgenden der Prozess der Arbeit des Benutzers mit einem IoT-Gerät unter Verwendung eines 'digital Twins' dargestellt.",
  "IoT data flows in cloud services": "IoT-datenflüsse in Cloud-diensten",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Eingabewerte für Cloud-Auslöser. Zum Beispiel sendet der Cloud-Dienst verschiedene Benachrichtigungen an den Benutzer wenn ein Autoalarmsensor einen Ausfall meldet.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Ausgabedaten für komplexe Analysen die nicht auf der Randebene erstellt werden können. Zum Beispiel bei der Verarbeitung von Videos zur Gesichtserkennung in einer Menschenmenge.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Die Grundlage zur Erstellung eines ;digital Twins' des Geräts um einen Abdruck seines Zustands zu erstellen. Zum Beispiel auf Anforderung des Nutzers in der mobilen App oder auf der Website.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Ein typisches Smart-Home-System bietet eine breite Palette von Möglichkeiten zur Steuerung Ihres Wohnraums. Mit seiner Hilfe können Sie die Türschlösser aus der Ferne steuern und einmaligen oder regelmäßigen Zugang zu den Räumen für Familie und Freunde sowie für Wartungs- oder Lieferpersonal einrichten. Mit zahlreichen Sensoren und Aufzeichnungsgeräten ist das System in der Lage, Videoaufnahmen zu machen wenn Bewegungssensoren ausgelöst werden. Weiteres selbstständige Entscheidungen zu treffen um die Wasserversorgung abzuschalten z.B.: wenn ein Leck im Wassersystem entdeckt wird. Einen Staubsaugerroboter nach Zeitplan zu starten der einen Reinigungsbericht an die Benutzer-App sendet.  Die Raumtemperatur nach Ihrem Zeitplan auf den optimalen Wert zu ändern.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Intelligente Fahrzeuge. Wenn die Bordelektronik des Fahrzeugs Zugang zum mobilen Internet hat, kann der Nutzer verschiedene Funktionen des Fahrzeugs direkt von seinem Smartphone aus fernsteuern: z.B.: Türen öffnen, die Klimaanlage einschalten, die Scheinwerfer regulieren. Wenn solche Autos für Carsharing genutzt werden, können Sie für die Kunden dieses Dienstes eine interaktive Karte mit dem Standort der Autos, ihrem Status, dem verbleibenden Kraftstoff usw. erstellen",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Leasing-Systeme für smarte Geräte. Ein Unternehmen installiert Industrieroboter an der Förderlinie im Rahmen eines Vertrags gegen Bezahlung für die Anzahl der Operationen oder für die geleistete Zeit des Roboters. Die Roboter erstellen regelmäßig ein Protokoll über die durchgeführten Vorgänge, Fehler und Warnungen. Die Leasinggebühr für den Roboter wird auf der Grundlage dieser Daten sowie der künftig erforderlichen Services durch den Verkäufer berechnet.",
  "Global availability": "Globale verfügbarkeit",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Die Standard-Client-Server-Architektur erfordert die Angabe von Endpunkten bei der Weiterleitung von Nachrichten von IoT-Geräten. Daher bedeutet das Fehlen einer Verbindung während der Lebensdauer eines intelligenten Geräts eine Einschränkung der Möglichkeiten zur Steuerung und Interaktion mit dem Gerät.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "So ist beispielsweise der Handelskrieg zwischen China und den Vereinigten Staaten bereits ein Damoklesschwert, dass über Tausenden von Verbrauchern chinesischer smarter Geräte in den Vereinigten Staaten hängt und umgekehrt. Jeden Moment könnte die Sperrung der Xiaomi-Server durch die US-Behörden die Nutzer dieser Geräten betreffen die sich mit den Cloud-Diensten des Herstellers verbinden.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Wenn man sich in unmittelbarer Nähe eines IoT-Geräts befindet kann man es nicht von einer mobilen App aus steuern wenn keine Verbindung zu den Servern besteht. Das bedeutet, das das Gerät tatsächlich von der Cloud gesteuert wird und nicht vom Nutzer.",
  "Cybersecurity": "Cybersicherheit",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Der Grund für die geringe Cybersicherheit der meisten IoT-Lösungen ist die problematische Cloud-Client-Server-Architektur. So besteht die derzeit gängigste Smart-Home-Architektur in der Regel aus einem IoT-Hub der mit einem Cloud-Dienst verbunden ist. Ein typisches IoT-System ist also ein zentrales Steuerungselement, dass mit mehreren externen Systemen verbunden ist. Sicherlich ist der Cloud-Dienst sicherer als Low-Level-Geräte, aber die Konsolidierung der zentralen Kontrolle über Hunderttausende solcher Systeme macht jede Sicherheitsverletzung und jedes Leck zu einer großen Katastrophe.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Die Server der Cloud-Dienste sind allen typischen Cyber-Sicherheitsproblemen ausgesetzt: Netzangriffe, DoS-Angriffe (die das System zum Ausfall bringen), böswillige Änderungen, usw. Zu den starken Bedrohungen gehören aber auch unbeabsichtigte Probleme wie Konstruktionsfehler, Missbrauch oder Naturkatastrophen die zu Serverausfällen führen. Ein weiterer wichtiger Punkt ist das grundsätzliche Vertrauen in die Cloud und der Personen die sie betreuen.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "All dies wird durch der hohen Anzahl der IoT-Systeme noch verschärft. Sicherlich ist der Cloud-Dienst sicherer als Geräte auf niedriger Ebene, aber die Konsolidierung der zentralen Kontrolle über Hunderttausende solcher Systeme macht jede Sicherheitsverletzung und jedes Leck zu einer großen Katastrophe.",
  "Data privacy": "Datenschutz",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Der Datenschutz muss von der Cybersicherheit getrennt werden da dieses Problem spezifisch für IoT-Systeme ist. Aufgrund der großen Anzahl und der unterschiedlichen Gerätetypen die viel mehr in die physische Welt integriert sind als nur Computer und Smartphones vervielfachen sich die Arten von privaten Daten. Es handelt sich nicht mehr nur um GPS-Standortdaten, Einkaufsdaten, Finanztransaktionen und Fotos, sondern auch um eine permanente Aufzeichnung von Videos, Gesprächen, Sprachaufzeichnungen, Gesundheitszustand und sogar eine Liste von Gewohnheiten einer Person. Zu den Bedrohungen für die Privatsphäre gehören: Identifizierung von Informationen, Lokalisierung, Verfolgung, Profiling, Angriffe auf das Inventar, Angriffe auf die Datenverknüpfung.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": " Das Unheimliche daran ist das sich die Nutzer kaum oder gar nicht bewusst sind, dass sie ihre Privatsphäre aufgeben, weil sie fast keine Ahnung haben welche Daten gesammelt und wie diese verwendet werden. Die Bedrohung der Privatsphäre wächst nicht nur durch Hacker, sondern auch durch Organisationen und sogar Behörden. Die Cloud-IoT-Dienste erfordern in der Regel eine maximale Datenübertragung von den Geräten und es gibt keine Möglichkeiten die Datenübertragung zu verbieten oder einzuschränken ('Akzeptieren Sie die Bedingungen oder verpissen Sie sich'). Und obwohl die gesammelten Daten ein Vermögenswert sind und einen realen Wert haben, wird der Person von der sie gesammelt werden nicht nur das Recht verweigert aktiv über diese Daten zu verfügen, sondern es wird ihr sogar jegliche Entschädigung für die Sammlung und Nutzung ihrer eigenen Daten verweigert",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Aufbauend auf den Errungenschaften und Herausforderungen von Cloud-Plattformen zielt Robonomics darauf ab, dem IoT-Markt in jeder Phase der Mensch-Maschine-Kommunikation sicherere und fortschrittlichere Internetlösungen anzubieten. Nachstehend sind die wichtigsten Aufgaben aufgeführt, auf die sich Robonomics focosiert",
  "Managing an IoT device using a decentralized cloud": "Verwaltung eines iot-geräts mit einer dezentralen cloud",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Blockchain-Netzwerke verfügen über alle Fähigkeiten um ein Höchstmaß an Sicherheit für den Betrieb eines Geräts und den Erhalt seiner Telemetrie zu bieten. Die Interaktion mit dem Gerät kann tatsächlich durch die Änderung des Zustands des im Blockchain-Netzwerk gespeicherten 'digital Twin' und die Übermittlung von Informationen über diese Änderungen beschrieben werden. Im Falle einer genehmigungsfreien Blockchain können wir über Garantien der globalen Verfügbarkeit von Anbietern für das IoT sowie ein hohes Maß an Schutz der Daten des 'digital Twins' vor unerwünschten Änderungen sprechen.",
  "Performing technical and economic transaction between people and machines": "Durchführung technischer und wirtschaftlicher transaktionen zwischen menschen und maschinen",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Dank der Mechanismen von Kryptowährungen und intelligenten Verträgen können wir den Zugang zu automatisierten Systemen direkt auf digitalen Märkten ermöglichen. Ethereum beispielsweise implementiert bereits die meisten der grundlegenden Instrumente der Wirtschaftstätigkeit die für den Betrieb autonomer Geräte genutzt werden können. Die Anwendungen die für die Interaktion zwischen dem Endnutzer und dem IoT-Gerät geschaffen werden, werden viel effektiver sein wenn die Bedingungen für den Service und die Bezahlung dafür untrennbar mit den Einführungsparametern des Geräts verbunden sind.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Moderne Fortschritte in der web3-Technologie können das Problem des Datenschutzes für den Nutzer lösen. Mit web3 besteht keine Notwendigkeit sich zu authentifizieren oder eine Verbindung zu bestimmten Servern herzustellen um auf die Telemetrie zuzugreifen und das Gerät zu steuern.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics ist eine dezentralisierte Cloud für 'digital Twin' von IoT-Geräten. Robonomics unterstützt das techno-ökonomische Format für die Kommunikation und bietet private Anwendungen für die Nutzer",
  "A human interface to access the system": "Eine menschliche Schnittstelle für den Zugang zum System",
  "A communication protocol": "Ein Kommunikationsprotokoll",
  "A machine interface": "Eine Maschinenschnittstelle",
  "Human interface": "Menschliche schnittstelle",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Wir schlagen die Verwendung dezentraler Anwendungen (dapps) als Hauptweg vor um die Anwender mit der Steuerung intelligenter Geräte über das Internet zu verbinden. Auf diese Weise werden wir in der Lage sein die sicherste Benutzerschnittstelle (in Bezug auf Daten) für das System bereitzustellen, das gleichzeitig unter den Bedingungen des lokalen Stadtnetzes und über ein gemeinsames globales Netz arbeiten kann.",
  "Communication protocol": "Kommunikationsprotokoll",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Diese Rolle übernimmt das Robonomics-Netzwerk, eine vom Projektteam entwickelte Spezifikation die ein dezentrales Netzwerk von Anbietern implementiert die die Übertragung, Verarbeitung und Speicherung von Informationen bereitstellen die für den Betrieb von IoT-Geräten erforderlich sind. Tatsächlich handelt es sich um eine Implementierung eines funktionsspezifischen Knotens für IPFS-, Ethereum- und Polkadot-Netzwerke.",
  "Machine interface": "Maschinenschnittstelle",
  "We have chosen the most well-known robotics framework called Robot Operating System Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Wir haben das bekannteste Robotik-Framework 'Robot Operating System' (ROS) als Standardschnittstelle für die Integration jedes kompatiblen cyber-physischen Systems gewählt. Robonomics unterstützt mehrere Anwendungen für ROS. Die Implementierung von Robonomics für das Ethereum-Netzwerk erfolgt in Form des ROS-Pakets robonomics_comm. Für die ROS-2-Architektur implementieren wir die Unterstützung für Robonomics als Middleware-Schicht (siehe 'Robonomics als ROS-2-Middleware' für Details). Für den Fall, dass der Einsatz von ROS überflüssig ist (z.B. bei der Arbeit mit IoT-Geräten) wurde ein Python-Modul robonomics-interface entwickelt. Es ermöglicht den nativen Zugriff auf die Funktionen von Robonomics und funktioniert sowohl mit lokalen und privaten als auch mit entfernten und öffentlichen Knoten.",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Im Folgenden finden Sie ein allgemeines Diagramm des gesamten Zyklus der Geräteinbetriebnahme mit der Robonomics-Plattform:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "Die dezentrale Anwendung des Benutzers sendet eine Anfrage für eine Gerätesteuerungsfunktion über das Robonomics-Netzwerk.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "Das Robonomics-Netzwerk sorgt für die Übersetzung von Anfragen mithilfe von libp2p und erfasst Ereignisse in der Ethereum-Blockchain oder Robonomics-Parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Die Steuerung des Geräts erfolgt über ein dezentrales Netzwerk, das garantiert die notwendigen Informationen zum Betrieb des IoT-Geräts speichert.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "Das IoT-Gerät erhält selbstständig Informationen aus den Ethereum- und Polkadot-Netzwerken über den aktuellen Zustand des 'digital Twins'. Dadurch wird sichergestellt, dass das Gerät erst dann sicher gestartet werden kann wenn die technischen und wirtschaftlichen Startparameter geklärt sind.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Als Ergebnis der Operation veröffentlicht das IoT-Gerät ein Protokoll der abgeschlossenen Operationen, das als Nachweis für den erbrachten Dienst oder zur Fehlersuche verwendet werden kann.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Das Protokoll wird in einen Bericht für den Benutzer umgewandelt und steht in seiner Dapp zur Verfügung.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Aufbau von Dapps und Webservices für IoT auf Robonomics Parachain",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, Softwarearchitekt",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Erinnern wir uns daran, dass die automatische Maschine das genaue wirtschaftliche Äquivalent zur Sklavenarbeit ist. Jede Arbeit, die mit der Sklavenarbeit konkurriert, muss die wirtschaftlichen Folgen der Sklavenarbeit in Kauf nehmen.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "Kybernetik",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Roboter sind heute wie erwachsene Kinder – sie können bereits Geld verwalten, Rechtsbeziehungen eingehen, unabhängig sein.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Die Zukunft der Menschheit selbst hängt davon ab, wie wir Robotern beibringen, mit ihren Fähigkeiten umzugehen.",
  "Robonomics tools": "Robononmics Werkzeuge",
  "Operate with digital twins of IoT devices": "Arbeiten Sie mit digitalen Zwillingen von IoT-Geräten",
  "The first tools of the robot economy: money for robots, contracts for robots": "Die ersten Werkzeuge der Roboterwirtschaft: Geld für Roboter, Verträge für Roboter",
  "Software for connecting devices to a decentralized cloud": "Software zur Anbindung von Geräten an eine dezentrale Cloud",
  "API library for custom IoT applications": "API-Bibliothek für benutzerdefinierte IoT-Anwendungen",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics enthält ein komplettes Werkzeugset für die Entwicklung von IoT-Anwendungen, sowohl auf der Robotics-, als auch auf der Benutzeroberflächenseite. Die Kommunikation zwischen Benutzer und Gerät erfolgt mit den erfolgreichsten Technologien aus der Web3-Welt – IPFS, Ethereum und Polkadot. So können Entwickler moderne und sichere Anwendungen für Smart Cities und Industrie 4.0 erstellen.",
  "Robonomics Connectivity": "Robonomics-Konnektivität",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Für den Komfort der Entwickler enthält Robonomics eine Reihe von Software zum Verbinden: (1) IoT-Geräte, die das HTTP/MQTT-Protokoll verwenden, (2) komplexe Robotersysteme, die das Robot Operating System (ROS) verwenden.",
  "Connect a sensor": "Verbinden Sie einen Sensor",
  "to the Robonomics network": "mit dem Robonomics-Netzwerk",
  "Try": "Probieren Sie",
  "a simple prototyping tool": "einmal aus. Ein einfaches Prototyping-Tool.",
  "Start building your own cyber physical system with": "Beginnen Sie mit dem Aufbau Ihres eigenen Cyber-Physical-Systems mit",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics unterstützt Hunderte von Robotern Out of the Box",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Plattformnutzer können ROS-kompatible Roboter in wenigen Minuten mit der digitalen Wirtschaft verbinden. Für eine vollständige Liste der unterstützten Roboter folgen Sie bitte dem Link",
  "Decentralized Cloud infrastructure for IoT": "Dezentrale Cloud-Infrastruktur für IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) ist der grundlegende Infrastrukturdienst für Robotics und IoT zusätzlich zu Robonomics Parachain und IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "Roboterwirtschaft",
  "Core RWS features available for IoT today": "Die wichtigsten RWS-Funktionen, die heute für IoT verfügbar sind",
  "RWS PubSub Message Broker": "PubSub-Nachrichtenbroker",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "Verwenden Sie unbegrenztes Messaging über ein P2P-Netzwerk basierend auf dem IPFS-Protokoll",
  "RWS Data Blockchainization Service": "Daten-Blockchain-Dienst",
  "RWS Robot Actions": "Roboteraktionen",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Ein-/ Ausschalten; Starten oder stoppen Sie Ihre IoT-Geräte unter der Kontrolle eines dezentralen Computers.",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Herzstück Ihrer IoT-Anwendung – Digitaler Zwilling auf Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "In der technischen Architektur bieten digitale IoT-Zwillinge die Sichtbarkeit und Überwachung von Dingen und verwandten Ereignissen (z.B. die Verwendung von IoT-Geräten, um die Herkunft eines Produkts automatisch zu erfassen), und Blockchain ermöglicht die gemeinsame einzige Version der Wahrheit über den Zustand dieser Dinge über ihren Lebenszyklus und die damit verbundenen Geschäftsereignisse hinweg.",
  "from Gartner research": "aus der Gartner-Forschung",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachain bietet die Möglichkeit, ein Modell eines digitalen Zwillings zu erstellen und seinen Zustand alle 6 Sekunden zu aktualisieren.",
  "App Store for Robotics - Robonomics Marketplace": "App Store für Robotics – Robonomics Marketplace",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "Unternehmen, die IoT-verbundene Produkte und Geräte entwickeln und herstellen, sollten ein flexibles Modell zur Bereitstellung digitaler Zwillinge einführen, um Hindernisse für die Einführung zu verringern, z.B. das Angebot digitaler Zwillinge über Marktplätze, anstatt nur digitale Zwillinge über ein eigenes, proprietäres Bereitstellungsmodell anzubieten",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "Sie haben eine Idee für Ihren Service für Roboter oder Anwender? Fahren Sie dann mit der Schritt-für-Schritt-Anleitung zum Erstellen Ihrer IoT-Anwendung auf der Robonomics-Plattform fort.",
  "Secure": "Sichere",
  "Serverless": "Serverlose",
  "Futuristic": "Futuristische",
  "IoT applications": "IoT-Anwendungen",
  "Robonomics network vision": "Robonomics Netzvision",
  "At the frontier of cybernetics and economics": "An der grenze von kybernetik und wirtschaft",
  "Build your IoT services on Robonomics platform": "Erstelle deine iot-dienste auf der robonomics-plattform",
  "taking full advantage of decentralized architecture": "die Vorteile der dezentralen Architektur voll ausschöpfen",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics ermöglicht es Nutzern sich über dezentrale Anwendungen (dapp), die keine Übertragung von Nutzerdaten zur Authentifizierung erfordern, mit intelligenten Geräten zu verbinden. Die Kommunikation erfolgt über ein dezentralisiertes Netzwerk von Anbietern ohne einen einzigen Ausfallpunkt und das Gerät erhält unabhängig Informationen aus dem Blockchain-Netzwerk zur Ausführung oder Daten aus der Ferne zu übertragen. Robonomics bietet somit ein hohes Maß an Cybersicherheit für das Gerät und einen hohen Schutz der Nutzerdaten in allen Phasen der Kommunikation von der Nutzeranwendung bis zum Start des intelligenten Geräts.",
  "From smart contracts to cross chain IoT platform": "Von intelligenten verträgen zur kettenübergreifenden iot-plattform",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Das Robonomics-Projekt ist über 6 Jahre alt. Wir begannen 2015 mit den Vorbereitungen für das erste Experiment zur Demonstration der Mensch-Maschine-Kommunikation über ein unabhängiges dezentrales Providernetzwerk. Also in den frühen Tagen des Ethereum-Netzwerks. Bis Anfang 2021 gelang es dem Projektteam, ein technisch wirtschaftliches Maschinen Kommunikationsprotokoll zu entwickeln, das auf Ethereum und IPFS aufbaut und durch Elemente einer cloudbasierten IoT-Plattform basierend der Parachain Polkadot ergänzt wird.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Damit verfügen wir bereits heute über eine hybride Plattform für die Entwicklung futuristischer IoT-Anwendungen, die eine Interaktion mit Geräten unter der Kontrolle eines globalen dezentralen Computers ermöglichen.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Die Gründer von Robonomics sind Experimentatoren, Ingenieure und Wissenschaftler, die sich der wissenschaftliche Aspekte bemühen und die Prinzipien die der gesamten Architektur der Softwarelösung zugrunde liegen sollen, klar darstellen.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": " In unseren Artikeln zwischen 2017 und 2020 haben wir viele Konzepte und Lösungen der Roboterwirtschaft vorgestellt. Ein Wirtschaftssystem in dem Roboter unabhängig agieren und in der Lage sind wichtige wirtschaftliche Tätigkeiten auszuführen, die bisher dem Menschen vorbehalten waren. Sie können den wissenschaftlichen Artikel lesen unter",
  "this link": "diesem Link",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Wir möchten die Entstehung der Roboterwirtschaft begründen und allgemein erklären, weshalb wir glauben, dass dieses Konzept die unvermeidliche und offensichtliche Antwort auf das Funktionieren der großen Robotersysteme der neuen industriellen Revolution ist.",
  "Move towards the factory of the future": "Auf dem weg zur fabrik der zukunft",
  "Inspired by Ronald Coase": "Inspiriert von Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Der Nobelpreisträger für Wirtschaftswissenschaften Ronald Coase hat in seinem 1937 erschienenen Werk 'The Nature of the Firm' die Dichotomie 'Hierarchie vs. freier Markt' am besten veranschaulicht und eine Erklärung für die Gründe der Existenz von Organisationen, insbesondere von Unternehmen, gegeben. Coase erörtert die Auswirkungen der Transaktionskosten (die Kosten für das Sammeln und Verarbeiten von Informationen) um Entscheidungen über den Abschluss eines Vertrags zu treffen und seine Umsetzung zu überwachen. Das Unternehmen mit seiner hierarchischen Struktur außerhalb des Marktes wird als die effizienteste Art und Weise gegründet um dem Verbraucher das Zielprodukt mit den geringsten Transaktionskosten zu dem Zeitpunkt zu liefern, zu dem der Transaktionsaufwand für die Herstellung desselben Produkts durch mehrfachen Austausch auf dem Markt zwischen Einzelpersonen viel höher wird. Am besten lässt sich dieser Prozess anhand des Beispiels eines Autokaufs veranschaulichen. Versuchen Sie ein Auto in Einzelteilen zu kaufen und berechnen Sie wie viel Geld und Zeit Sie aufwenden müssen um alle Teile in Ihrer Garage zusammenzubauen. Die Risiken und Verhandlungskosten beim Kauf von Teilen sind zu hoch im Vergleich zu Teslas 'Model X' von der Serienproduktion.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Dies führt jedoch nicht dazu, dass das einzige Unternehmen der Welt entsteht das alles produziert. Der Punkt ist, dass dieselben Transaktionskosten auch die Größe der Unternehmen einschränken. Coase schreibt:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...ein Unternehmen wird dazu neigen so lange zu expandieren bis die Organisationskosten eines zusätzlichen Geschäfts innerhalb des Unternehmens den Kosten der Durchführung desselben Geschäfts durch einen Tausch auf dem freien Markt entsprechen...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Mit anderen Worten: Je komplexer die Hierarchie innerhalb des Unternehmens ist desto höher sind die internen Kosten und irgendwann erweisen sie sich als zu hoch im Vergleich zu den Kosten am Markt. Um ihr Wachstum als eine der treibenden Kräfte zu sichern suchen die Unternehmer daher nach Möglichkeiten diese Kosten zu senken.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Transaktionskosten senken indem alle am Prozess Beteiligten (Produktion, Logistik, Verbraucher) auf einer engeren Ebene zusammenarbeiten",
  "clearly correlates": "eindeutig korreliert",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "mit den Problemen und Herausforderungen denen sich die Hersteller von Automatisierungslösungen gegenübersehen. In den letzten 50 Jahren wurden die Standard-/Regelabläufe der meisten Geschäftsprozesse von Großunternehmen fast vollständig automatisiert. Den Herstellern bleibt im Wesentlichen die Aufgabe eine sichere Kommunikation zwischen den vollautomatisierten Lieferketten aufzubauen und diese Aufgabe ist ein Faktor der einer weiteren Senkung der Transaktionskosten durch Automatisierung entgegensteht. Der Wunsch, wettbewerbsfähigere Produkte oder Dienstleistungen im Vergleich zu teilautomatisierten zu vermarkten.",
  "firms spurs the search for solutions to": "Unternehmen auf Suche nach Lösungen für",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "diese Herausforderungen. Es scheint, dass alles auf das Aufkommen von Robo-Firmen zusteuert - Organisationen, in denen der gesamte Geschäftsprozesszyklus vollständig automatisiert ist und keine menschliche Beteiligung erfordert, außer jener als Nutznießer und Verbraucher.",
  "Get rid of transaction costs": "Transaktionskosten senken",
  "Our future in smart cities": "Unsere zukunft in den smart cities",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Die Aufgabe vor der die Hersteller von Automatisierungssystemen heute stehen hat einen besonderen Namen: die Konstruktion von cyber-physischen Systemen (abgekürzt CPS). Unter",
  "definition,": "Definition",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "Ein CPS ist eine starke Vereinheitlichung und gegenseitige Integration mehrerer Rechen-, Netzwerk- und physikalischer Prozesse.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Die Aufgaben des Aufbaus von CPS sind von zentraler Bedeutung die in der neuen (vierten) industriellen Revolution beschrieben wird. Daher sind CPS der Grundstein für unser zukünftiges Leben in smart Cities die sich überall manifestieren. Beispiele für cyber-physische Systeme der Zukunft sind: Uber-Autopilot, Drohnen-Selfies, Netzwerk von 3D-Druckern in U-Bahn-Stationen.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "CPS ist eine komplexe Struktur aus vielen miteinander verbundenen Elementen: von der App auf dem Telefon über die Steuerung der Drohne beim Flug über die Stadt bis hin zur Veröffentlichung der Fotos auf Instagram, allerdings erst nach der Verarbeitung durch die Cloud-KI.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Das Wichtigste bei der Gestaltung von CPS ist es, den schmalen Grat zwischen einer ausreichenden und einer übermäßigen Anzahl von automatisierten Elementen in der Versorgungskette der Dienstleistungsnutzer zu finden. Mit anderen Worten: Wo liegt die Größengrenze des CPS? Um diese Frage zu beantworten sollten wir uns den berühmten Mathematiker Norbert Wiener betrachten.",
  "Self-regulating systems": "Selbstregulierende systeme",
  "Inspired by Norbert Wiener": "Inspiriert von Norbert Wiener",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener spricht über die Realisierbarkeit eines interdisziplinären wissenschaftlichen Ansatzes. So zog er beispielsweise Parallelen zwischen automatisierten Kontrollsystemen und den Herausforderungen der Skalierung und Komplexitätssteigerung der menschlichen Gesellschaft.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Mit anderen Worten: Der kybernetische Ansatz lässt sich gleichermaßen auf die Psychotherapie, die Biologie und die automatische Navigation anwenden. Er basiert auf der Funktion des Systems wie die einzelnen Aktionen gesteuert werden und wie die einzelnen Knoten miteinander interagieren.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Unter Berücksichtigung der Veröffentlichungen von Ronald Coase und Norbert Wiener und in Anlehnung an die Entwicklung von Industrie 4.0 können wir bei der Entwicklung robotisierter Dienstleistungen die CPS als Wirtschaftsfaktor betrachten. Um die Größe der CPS zu regulieren und an die sich ändernden Bedürfnisse der Menschen anzupassen, können wir Marktmechanismen nutzen.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Robofirmen sind ein ideales Beispiel für cyber-physische Systeme. Sie sind eine ziemlich autonome Einheit die sowohl für Menschen als auch für andere Roboter gegen Geld Dienstleistungen erbringen kann. Folglich erscheint uns die Roboterwirtschaft als eine allgemeine Gruppe von CPS, die Dienstleistungen und Waren direkt auf dem Markt anbieten.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Geld für roboter",
  "Industry 1.0": "Industrie 1.0",
  "Mechanization:": "Technisierung:",
  "replacement of muscle power with steam energy.": "Ersatz von Muskelkraft durch Dampfenergie.",
  "1784 y.": "1784",
  "Industry 2.0": "Industrie 2.0",
  "Electrification:": "Elektrifizierung:",
  "introduction of assembly-line production.": "Einführung der Fließbandproduktion",
  "1870 y.": "1870",
  "Industry 3.0": "Industrie 3.0",
  "Automation:": "Automatisierung",
  "introduction of automated systems with CNC.": "Einführung automatisierter Systeme mit CNC.",
  "1969 y.": "1969",
  "Industry 4.0": "Industrie 4.0",
  "Smart production:": "Intelligente Produktion:",
  "development of cyber physical systems.": "Entwicklung cyber-physischer Systeme.",
  "Now": "Jetzt",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "In der Welt der Robo-Firmen liegt es nahe, Robotern Zugang zu sozialen Einrichtungen zu verschaffen, die bisher nur von Menschen genutzt wurden.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Soziale Institutionen entstehen nicht, weil die Menschen ohne Banken, Verträge und andere Instrumente der Gesellschaft nicht leben können. Sie entstehen nur, weil ein Mensch zu einem bestimmten Zeitpunkt den Weg zu komplexeren gesellschaftlichen Beziehungen eingeschlagen und einen wichtigen Schritt zur Beschleunigung der damit verbundenen Prozesse getan hat.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Geld und Verträge sollten für Roboter verfügbar werden, nicht weil dies eine kranke Fantasie von Roboterfans ist die vergessen haben was Skynet ist. Sondern weil sich die neue industrielle Revolution die Aufgabe stellt, komplexe automatisierte Ketten aufzubauen deren Prozesse sowohl den Austausch technischer als auch wirtschaftlicher Informationen betreffen und zudem mit einer für den Menschen unzugänglichen Geschwindigkeit ablaufen werden.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Roboter brauchen Geld das ihnen direkt zur Verfügung steht um ohne den Menschen mit der Geschwindigkeit zu arbeiten mit der nur Maschinen Entscheidungen treffen können. Und das alles nur, damit der Mensch das Leben in der Smart City genießen kann!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "Und hier kommen wir schon zum ersten elektronischen Geld - den Bitcoin. Die Tatsache, dass Bitcoin auf Ihrem Konto gespeichert werden kann und zwar nicht nach dem Prinzip einer Bank sondern als Bargeld in Ihrer Brieftasche, macht es zum ersten Geld das der Roboter autonom verwalten kann. Gleichzeitig können wir jetzt schon sagen, dass der Bitcoin nicht nur elektronisches Bargeld ist, sondern ein wirklich globales Finanzinstitut.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Das Ergebnis: Ein Ereignis, dass nicht von uns erfunden wurde aber eindeutig in unsere Vision fällt, macht den Bitcoin zum ersten Geld für Roboter. Und wenn wir noch tiefer blicken, ist es genau diese soziale Institution die die Gründung von Roboterfirmen unterstützen wird.",
  "Smart contracts": "Smarte verträge",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin wurde das erste Geld, das für Roboter verfügbar war. In der Zwischenzeit können wir nicht über Bitcoin in seiner aktuellen Form als ein Werkzeug für einen vollwertigen technischen und wirtschaftlichen Austausch sprechen.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Jetzt haben wir bereits intelligente Verträge, DeFi-Märkte und eine dezentrale Infrastruktur für den Austausch von Nachrichten zwischen Robotern, die der Menschheit die Möglichkeit eröffnen, einen vollständig automatisierten Teil der menschlichen Wirtschaft zu schaffen - die Roboterwirtschaft.",
  "One of the great opportunity to build the economy of robots is": "Eine der großen Chancen für den Aufbau der Roboterwirtschaft ist",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Mit der Ethereum-Funktionalität sind Roboter nicht nur in der Lage Geld zu tauschen, sondern auch Verträge mit Menschen und untereinander zu schließen.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Aber wozu dient die vertragsbasierte Kommunikation von Maschine zu Maschine (m2m)? Das ist eine gute Frage! Kehren wir zu CPS zurück. Wenn wir über die direkte Kommunikation zwischen Sensoren, Maschinenausrüstung oder anderen Elementen sprechen, sprechen wir immer noch über die Zusammenarbeit innerhalb eines geregelten Systems. Aber wenn wir wollen, dass Smart-Cities-Dienste lebendig sind (oder in manchen Fällen sogar Smart Home) müssen wir die Kommunikation mit verschiedenen Elementen von Drittanbietern herstellen.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Stellen wir uns einen Drohnenlieferdienst vor. Wenn eine Drohne beispielsweise Eigentum von DHL ist, wie kann sie dann Zugang zu den Lagern von Amazon oder zum gesamten Luftraum der Stadt haben? Handelt es sich um ein Monopol? Dies ist eine große Herausforderung für viele Initiativen der vierten industriellen Revolution!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Die meisten Unternehmen sagen, dass sie nahezu vollständige Rechte an ihrer Umgebung benötigen weil sie nicht wissen, wie sie den Austausch technischer Informationen zwischen automatisierten Systemen außerhalb ihrer eigenen Unternehmensstruktur sicher gestalten können. Betrachtet man jedoch die Prozesse in denen ein Mensch arbeitet, so stellt man fest, dass die Zusammenarbeit zwischen verschiedenen Unternehmen schon lange und erfolgreich besteht. Sie können auf der Amazon-Website ganz einfach eine Tür-zu-Tür-Lieferung der gekauften Waren bestellen und der Kurier wird in der Lage sein, die Bestellung im Lager in Empfang zu nehmen und sie Ihnen zu bringen.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Worin besteht nun der Unterschied? Im ersten Fall gibt es keine Möglichkeit eine vertragliche Beziehung zwischen Maschinen aufzubauen und im zweiten Fall, in der Welt der Menschen, gibt es bereits vertragliche Beziehungen.",
  "Parachains": "Parachains",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Das Hauptproblem mit dem Robonomics heute konfrontiert ist, ist der hohe Preis für die Einführung eines IoT-Geräts mit Ethereum. In Ethereum muss man für jede Transaktion eine Provision bezahlen die zwischen 10 und 100 US-Dollar liegt. Das ist für die meisten Fälle aus der realen Wirtschaft ziemlich teuer, sei es eine Carsharing-Fahrt, die Anmietung einer intelligenten Wohnung, die Lieferung per Drohne oder der 3D-Druck Ihres Lieblings-Anime-Helden auf Bestellung.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Der Fairness halber möchten wir anmerken, dass es auch mit Transaktionsgebühren im Ethereum-Netzwerk von 2018 - 2019 profitable Szenarien gibt. Zum Beispiel automatisierte Transaktionen zum Ausgleich des CO2-Fußabdrucks oder die Übermittlung der Bestellung von der Website direkt an die Produktion. Dennoch ist für die Massenanwendung der web3-Technologien im Bereich des IoT eine Senkung des Preises erforderlich, den die Cloud vom angeschlossenen Gerät verlangt.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Auf der Suche nach einer Möglichkeit die Kosten für die Interaktion mit einem IoT-Gerät zu senken, haben die Robonomics-Entwickler alternative Entwicklungen zu Ethereum untersucht. Unsere Wahl fiel auf das",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "Architektur, die es uns ermöglichen würde, unsere eigene Blockchain innerhalb eines gemeinsamen Netzwerks zu betreiben, in dem die Sicherheit durch von unserem Projekt unabhängige Validierer gewährleistet wird.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Heterogenes Blockchain Netzwerk",
  "Homogeneous Shard Network": "Homogenes Shard-Netzwerk",
  "On-chain protocol control": "On-Chain-Protokollkontrolle",
  "Protection against the tyranny of the crowd": "Schutz vor der Tyrannei der Masse",
  "Auction of bandwidth in the common network": "Auktion der Bandbreite im gemeinsamen Netz",
  "Payment for gas by users": "Zahlung von Transaktionsgebühren durch Nutzer",
  "Have you read this?": "Hast du das gelesen?",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "I, Robot",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "The Bicentennial Man",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Offene Fragen zur Teleologie",
  "and a treatise by L. von Mises": "und eine Abhandlung von L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Abschließend möchten wir auf Fragen eingehen, die aus globaler Sicht noch offen sind. Was ist das Ziel von Robotern?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Die Praxeologie inspiriert uns mit interessanten Ideen über menschliches Verhalten ohne direkte Abhängigkeit von den Zielen. Dies gibt uns die Möglichkeit die Prozesse der Wirtschaft von Robotern bedingt wie bei einer Blackbox zu bearbeiten, ohne in die endgültigen Ziele einzutauchen. Gleichzeitig stellt die Teleologie eine Herausforderung dar die Ursachen zu erklären.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Wir hoffen, dass irgendwo an der Schnittstelle der Werke von Mises und Wiener ein Punkt für die weitere Entwicklung der Roboterökonomie gefunden werden kann, nicht nur als ein Protokoll der Interaktion zwischen Menschen und Maschinen praxeologischer Natur, sondern unter Berücksichtigung der teleologischen Elemente des Aufbaus der Kommunikation zwischen den Arten.",
  "or": "oder",
  "Wallpapers": "Hintergrundbilder",
  "Cases": "Hüllen",
  "Wiki": "Wiki",
  "Academy": "Akademie",
  "Github": "Github",
  "Dapp": "Dapp",
  "Robonomics is 100% open-source.": "Robonomics ist zu 100% Open Source.",
  "Anyone can contribute to": "Jeder kann dazu beitragen,",
  "the code base": "den Code-Basis",
  "build services with Robonomics": "Dienste mit Robonomics aufbauen",
  "Translation was executed by AI so there may be some inaccuracies": "Die Übersetzung wurde von KI durchgeführt, daher können einige Ungenauigkeiten auftreten.",
  "Inform us": "Informieren Sie uns",
  "please": "bitte",
  "if you find any": "wenn Sie welche finden",
  "Notable events": "Bemerkenswerte Ereignisse",
  "Additional icons for the wallpaper:": "Zusätzliche Symbole für den Hintergrund:",
  "Important news &amp; announcements": "Wichtige Neuigkeiten & Ankündigungen",
  "All posts": "Alle Beiträge",
  "I agree to receive emails": "Ich stimme zu, E-Mails zu erhalten",
  "Send": "Senden",
  "Thanks, your application has been sent!": "Vielen Dank, Ihre Bewerbung wurde gesendet!",
  "R&D cases": "F&E-Fälle",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Zusammenarbeit mit einem Immobilienentwickler auf Zypern zur Verfolgung der täglichen Verteilung, Verbrauch und Kompensation des CO2-Fußabdrucks.",
  "I agree to receive email communications from Robonomics": "Ich stimme zu, E-Mail-Kommunikationen von Robonomics zu erhalten",
  "This page is out of your space": "Diese Seite ist nicht in Ihrem Bereich",
  "Check url once more or create an": "Überprüfen Sie die URL noch einmal oder erstellen Sie eine",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "Benachrichtigen Sie uns, dass Sie einen 404-Fehler erhalten haben (vergessen Sie nicht, die aktuelle URL anzugeben)",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Erlernen Sie Robonomics durch Tutorials und praktisch nützliche Experimente im Robonomics-WIKI",
  "Robonomics Ambassador Program": "Robonomics Botschafterprogramm",
  "Latest update": "Neueste Aktualisierung",
  "For all passionate about Robonomics and inspired by web3.": "Für alle, die sich für Robonomics begeistern und von Web3 inspiriert sind.",
  "We invite you to contribute to the development and promotion of Robonomics in the international arena for cooperation.": "Wir laden Sie ein, zur Entwicklung und Förderung von Robonomics in der internationalen Zusammenarbeit beizutragen.",
  "Learn": "Erlernen",
  "Theory & practice from Robonomics": "Theorie & Praxis von Robonomics",
  "Make content": "Inhalte erstellen",
  "Documentation, instructions, tutorials, Localization, scientific papers": "Dokumentation, Anleitungen, Tutorials, Lokalisierung, wissenschaftliche Arbeiten",
  "Communicate": "Kommunizieren",
  "Online and offline (meetups, conferences, social networks, collaborations)": "Online und offline (Treffen, Konferenzen, soziale Netzwerke, Zusammenarbeit)",
  "Get rewards": "Belohnungen erhalten",
  "XRT reward every month, extra bonuses and gifts for top 5 ambassadors": "XRT-Belohnung jeden Monat, zusätzliche Boni und Geschenke für die Top 5 Botschafter",
  "Get your role, ambassador": "Erhalten Sie Ihre Rolle, Botschafter",
  "How to become an ambassador?": "Wie werde ich Botschafter?",
  "Tell us more about you": "Erzählen Sie uns mehr über sich",
  "Fill out the questionnaire": "Füllen Sie den Fragebogen aus",
  "Start": "Starten",
  "Wait for your invitation to the special Discord chat for ambassadors": "Warten Sie auf Ihre Einladung zum speziellen Discord-Chat für Botschafter",
  "The number of participants in the program is limited": "Die Anzahl der Teilnehmer am Programm ist begrenzt",
  "For content makers": "Für Content-Ersteller",
  "What you may do:": "Was Sie tun können:",
  "1) work with technical documentation, instructions and tutorials;": "1) Arbeiten Sie mit technischer Dokumentation, Anleitungen und Tutorials;",
  "2) translate content into your native language;": "2) Übersetzen Sie Inhalte in Ihre Muttersprache;",
  "3) make scientific papers based on Robonomics technologies;": "3) Erstellen Sie wissenschaftliche Arbeiten auf Basis von Robonomics-Technologien;",
  "4) popularize ideas of Robonomics.": "4) Popularisieren Sie die Ideen von Robonomics.",
  "How:": "Wie:",
  "1) make pull requests on GitHub for": "1) Machen Sie Pull Requests auf GitHub für",
  "website": "Website",
  "wiki": "Wiki",
  "2) discuss what we need to translate in ambassador chat;": "2) Diskutieren Sie im Botschafter-Chat, was übersetzt werden muss;",
  "3) create video and text content, try to make it unique for your followers;": "3) Erstellen Sie Video- und Textinhalte und versuchen Sie, sie einzigartig für Ihre Follower zu gestalten;",
  "4) share progress with other ambassadors and team.": "4) Teilen Sie den Fortschritt mit anderen Botschaftern und dem Team.",
  "For community helpers": "Für Community-Helfer",
  "1) organize local offline meetups and hackathons based on Robonomics technologies;": "1) Organisieren Sie lokale Offline-Treffen und Hackathons auf Basis von Robonomics-Technologien;",
  "2) participate in thematic conferences on behalf of Robonomics;": "2) Nehmen Sie an thematischen Konferenzen im Namen von Robonomics teil;",
  "3) work online with community: online meetups and hackathons, chat administration, forum moderation, various social networks;": "3) Arbeiten Sie online mit der Community zusammen: Online-Treffen und Hackathons, Chat-Verwaltung, Forenmoderation, verschiedene soziale Netzwerke;",
  "4) communicate with other projects for collaboration.": "4) Kommunizieren Sie mit anderen Projekten für Zusammenarbeit.",
  "1) make your suggestion in ambassador’s chat;": "1) Machen Sie Ihren Vorschlag im Botschafter-Chat;",
  "2) get merchandise if needed for offline events;": "2) Erhalten Sie Merchandise, wenn Sie es für Offline-Veranstaltungen benötigen;",
  "3) share progress with other ambassadors and team.": "3) Teilen Sie den Fortschritt mit anderen Botschaftern und dem Team.",
  "Get all our support and visual materials in ambassador’s chat": "Erhalten Sie in Botschafter-Chat all unsere Unterstützung und visuelles Material",
  "Embedded iot systems": "Eingebettete IoT-Systeme",
  "Autonomous systems": "Autonome Systeme",
  "Digital twins are the heart of the internet of things": "Digitale Zwillinge sind das Herzstück des Internets der Dinge",
  "\"Main tasks of robonomics architecture": "\"Hauptaufgaben der Robonomics-Architektur",
  "No posts yet": "Noch keine Beiträge",
  "If you want to help us with translation": "Wenn Sie uns bei der Übersetzung helfen möchten",
  "contact us at": "kontaktieren Sie uns unter",
  "send": "senden",
  "Our library": "Unsere Bibliothek",
  "Free E-Books": "Kostenlose E-Books",
  "Our recommendations": "Unsere Empfehlungen",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "Wir empfehlen diese Bücher, wenn Sie sich mehr mit Robotik beschäftigen, sich inspirieren lassen und sich selbst weiterbilden möchten, um das Feld voranzubringen und die dahinterliegende Wirtschaft zu verstehen. Sie können diese Bücher von anderen Quellen herunterladen oder kaufen.",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics ist eine zu 100% Open-Source-, sichere, kostengünstige und futuristische IoT-Plattform zur Verbindung von Robotik unter der Kontrolle von Polkadot und Ethereum. Jeder kann Dienste mit Robonomics erstellen.",
  "Below a list of our  proven applications of modern robotics technologies.": "Unten finden Sie eine Liste unserer bewährten Anwendungen moderner Robotertechnologien.",
  "By interest:": "Nach Interesse:",
  "Sort by progress:": "Nach Fortschritt sortieren:",
  "Any progress": "Jeder Fortschritt",
  "Complete": "Vollständig",
  "Proceeding": "Laufend",
  "Sort by time:": "Nach Zeit sortieren:",
  "Recent": "Neueste",
  "Earliest": "Früheste",
  "Show more": "Mehr anzeigen",
  "Robonomics token": "Robonomics-Token",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Daten in IPFS speichern und Hashes in einer öffentlichen Blockchain speichern",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry.": "Das entwickelte digitale Zwillingmodell kann direkt mit zusätzlichen Diensten verknüpft werden, die Ihr Unternehmen für die IoT-Branche bereitstellt.",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service.": "Um den Lieferprozess für Hunderte von Kunden bequem und einfach zu gestalten, haben wir einen Abschnitt für den Marktplatz der Roboterdienste hinzugefügt. Werfen Sie einen Blick auf die ersten Beispiele der implementierten Bündel aus digitalem Zwillingmodell + automatisiertem Unternehmensservice.",
  "Robonomics nfts": "Robonomics NFTs",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Hier haben wir eine Sammlung von NFTs zusammengestellt, die während unserer umfangreichen Kryptoreise, sowohl unabhängig als auch mit großartigen Teams, geprägt wurden. Diese einzigartigen Token bieten nachweisliches Eigentum auf der Blockchain und sind eine großartige Ergänzung für Ihr Blockchain-Konto. Sie können auf einige von ihnen bieten oder sogar Ihr eigenes einzigartiges Stück prägen.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Während unserer ersten Kusama-Crowdloan-Kampagne haben wir beschlossen, unsere Krypto-Pioniere nicht nur mit Token zu belohnen, sondern ihnen auch ein farbenfrohes NFT zu schenken. Diese Karte hat für uns eine große Bedeutung, und wenn jemand sie besitzt, wissen wir, dass er ein fantastischer Unterstützer der Werte von Robonomics ist: Freiheit und Dezentralisierung.",
  "Robonomics crypto girls": "Robonomics Crypto Girls",
  "2. Robonomics crypto girls": "2. Robonomics Crypto Girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Wir freuen uns, unsere spezielle Serie von digitalen Assets vorzustellen - Robonomics Crypto Girls, erstellt vom Robonomics Art&Science-Team. Jedes NFT in dieser Sammlung ist eine einzigartige grafische Darstellung der in Robonomics verwendeten Technologie oder der auf Robonomics aufbauenden Anwendungsfälle. Unsere talentierten Künstler haben jedes Mädchen im charakteristischen Robonomics-Stil von Hand gezeichnet. Sie können dasjenige auswählen, das Ihnen am besten gefällt, oder die gesamte Serie sammeln! Durch den Kauf dieser NFTs fügen Sie nicht nur eine stilvolle Ergänzung zu Ihrer Sammlung hinzu, sondern unterstützen uns auch dabei, die dezentrale Konnektivität für Roboter weiter zu innovieren und umzusetzen. Bleiben Sie gespannt auf neue Ergänzungen zur Sammlung!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. SEASONAL SPOT NFT COLLECTIONS",
  "On demand minting": "On-Demand-Prägung",
  "SEASONAL SPOT NFT COLLECTIONS": "SEASONAL SPOT NFT COLLECTIONS",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Diese saisonalen NFT-Sammlungen repräsentieren ein einzigartiges digitales Asset, das die einzigartige Interaktion zwischen dem Benutzer und Spot innerhalb der Robonomics-Parachain einfängt. Benutzer können beliebig auf dem Browser zeichnen, und der Roboter repliziert ihre Bewegungen, um ein handgezeichnetes Bild zu erstellen. Sobald die Interaktion abgeschlossen ist, wird das NFT auf dem Singular-Marktplatz für das Polkadot-Konto des Benutzers geprägt. Jetzt kann jeder mit einem in einem Labor in Kalifornien befindlichen echten Roboter interagieren, um personalisierte und einzigartige digitale Assets zu erstellen, die wie jedes andere digitale Asset besessen, gekauft und verkauft werden können.",
  "Create your NFT": "Erstellen Sie Ihr NFT",
  "4. automated telescope collection": "4. automatisierte Teleskopsammlung",
  "automated telescope collection": "automatisierte Teleskopsammlung",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "In der Atacama-Wüste in Chile kann über eine dezentrale App auf ein physisches Teleskop zugegriffen werden, um Echtzeitbilder astronomischer Objekte im Weltraum aufzunehmen. Jeder Benutzer mit einer Internetverbindung kann es mit $STRGZN-Token nutzen, die in der App mit einer Kreditkarte gekauft werden können. Wählen Sie ein astronomisches Objekt aus, senden Sie einen Befehl an das Teleskop, um ein Bild aufzunehmen, und warten Sie auf das geprägte NFT auf der Singular-Plattform. Bitte beachten Sie, dass die App nur von 23 bis 6 Uhr GMT-3 aufgrund der Betriebszeiten des Teleskops verfügbar ist.",
  "Try yourself": "Probieren Sie es selbst aus",
  "5. Robonomics Polka pet": "5. Robonomics Polka Pet",
  "In collaboration with Polkapets": "In Zusammenarbeit mit Polkapets",
  "and": "und",
  "Robonomics Polka pet": "Robonomics Polka Pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Als stolzes Mitglied des Polkadot-Ökosystems hat Robonomics an Polka Pets World teilgenommen. Zusammen mit dem Polka Pets-Team haben wir 1200 NFTs mit einem einzigartigen Designkonzept geprägt, das unsere Kernidee der Konnektivität zeigt. Um diese Idee zum Leben zu erwecken, haben wir eine Persönlichkeit geschaffen: einen Androiden, der sich darauf spezialisiert hat, Menschen mit jeder robotischen Entität zu verbinden.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "Im Jahr 2021 begann Robonomics das Engagement zur Unterstützung der Integration von RMRK-Paletten in ihre Laufzeitumgebung, was zu einer nativen Integration mit der fortschrittlichsten NFT-Logik der Welt führen würde. Zur Feier dieses bemerkenswerten Meilensteins haben wir einen speziellen Kanaria-kompatiblen Gegenstand eingeführt - ein Kind-NFT, das auf einen Kanaria-Vogel ausgerüstet werden kann und möglicherweise Vorteile in RMRK's Metaverse bietet.",
  "RMRK Partnerships": "RMRK-Partnerschaften",
  "This page has moved to a": "Diese Seite wurde verschoben nach",
  "Automatic redirecting": "Automatische Weiterleitung",
  "Infrastructure && tech development timeline": "Infrastruktur- und Technologieentwicklungszeitplan",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Die RWS-Infrastruktur übernahm alle Funktionen einer typischen zentralisierten Cloud, jedoch ohne die üblichen Probleme der globalen Verfügbarkeit, Sicherheit und Privatsphäre. Zusätzlich kamen wir auf die Idee von Parachain-IoT-Abonnements, die es Abonnenten ermöglichen, das Blockchain-Netzwerk zu nutzen, ohne für jede Transaktion eine Gebühr zahlen zu müssen. Das erste Experiment mit IoT-Abonnements war die Emission des RWS-Tokens, der es seinem Besitzer ermöglicht, 1 Transaktion pro Block zu senden. Darüber hinaus begannen wir, die ersten Schritte zur Entwicklung unseres eigenen Hardware-Kits zur Steuerung intelligenter Geräte (das DAOS-Konzept) zu unternehmen.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Für den Anfang empfehlen wir, sich mit Mises' Werk \"Human Action: A Treatise on Economics\" (praxeologischer Ansatz) und mit dem frühen Artikel von Norbert Wiener \"Verhalten, Zweck und Teleologie\" (teleologische Vision) zu befassen.",
  "Robonomics wallpapers": "Robonomics Hintergrundbilder",
  "Regular wallpapers": "Reguläre Hintergrundbilder",
  "Wallpapers for phones": "Hintergrundbilder für Handys",
  "Hidden wallpapers": "Versteckte Hintergrundbilder",
  "Robonomics whitepaper 2022 welcome guide": "Robonomics Whitepaper 2022 Willkommensführer",
  "This page may need translation": "Diese Seite muss möglicherweise übersetzt werden",
  "for connecting smart devices.": "für die Verbindung intelligenter Geräte.",
  "We have launched two big initiatives in order to increase community engagement —": "Wir haben zwei große Initiativen gestartet, um die Community-Beteiligung zu erhöhen —",
  "Robonomics Academy": "Robonomics Academy",
  "Additionally,": "Zusätzlich wurde",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "im Herbst abgehalten, damit die Robonomics-Community unsere Governance-Mechanismen zum ersten Mal ausprobieren konnte. Kürzlich hat das Robonomics-Team dem Projekt DAO IPCI geholfen, einen Parachain-Slot zu erhalten, um einen CO2-Ausgleichsdienst für intelligente Gebäude vorzustellen.",
  "In 2021, our": "Im Jahr 2021 lag unser",
  "main focus": "Hauptaugenmerk",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "darauf, das Projekt so vorzubereiten, dass IoT-Anwendungen über unsere Parachain im Kusama-Netzwerk genutzt werden können. Robonomics 1.0 auf Substrate wurde veröffentlicht, und wir haben das Verbinden von Sensoren mit der Parachain getestet, um ihre Telemetriedaten zu senden, sowie die Entwicklung der Digital Twin-Funktionalität. In der Mitte des Jahres beschlossen wir, den vollständigen Zyklus unseres Netzwerks zu testen, und haben unsere eigene Relay Chain namens",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "erstellt, in die die Robonomics Parachain integriert wurde (bevor sie zur Kusama Relay Chain migriert wurde). Es wurde viel Wert darauf gelegt, einen Parachain-Slot in Kusama zu erhalten, für den wir mehrere Crowdloan-Kampagnen organisiert haben.",
  "There have been two big changes for the community. First, we launched the": "Es gab zwei große Veränderungen für die Community. Erstens haben wir das",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "gestartet, das Web3-Robotik- und IoT-Projekten ermöglicht, Finanzierung für F&E-Aufgaben zu erhalten. Bis zum Ende des Jahres nahmen vier aktive Projekte am Programm teil. Zweitens startete das Team den",
  "Exodus process": "Exodus-Prozess",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "und ermöglichte Ethereum-Token-Inhabern, ihre XRT-Token zur Parachain zu übertragen.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Unter den Zusammenarbeiten können wir das bemerkenswerte Auftreten des Boston Dynamics Spot bei MerkleBot erwähnen, für das ein",
  "rental remote control system": "Miet-Fernsteuersystem",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "entwickelt wurde. Wir möchten Sie auch über das Unternehmen Multi-Agent Systems informieren, das ein persönliches Projekt ist, das von einem Team von Robonomics-Ingenieuren gegründet wurde. Sie haben einen robotischen Waffelbäcker namens Eisenkoch entwickelt, der Kochaufgaben für Kaffeehausbesitzer übernimmt.",
  "There came a time when the existing limitations of Ethereum": "Es kam der Zeitpunkt, an dem die bestehenden Einschränkungen von Ethereum",
  "began to stand out clearly": "deutlich sichtbar wurden",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(insbesondere schlechte Skalierbarkeit, geringe Geschwindigkeit und sehr hohe Transaktionskosten). Das Upgrade auf ETH2.0 sollte die Situation beheben, aber dieses Upgrade wurde mehrfach verzögert. Obwohl wir das Ethereum-Netzwerk nicht verlassen wollten, erkannten wir, dass es in der aktuellen Situation schwierig war, unsere Anwendungsfälle umzusetzen, und begannen nach einem alternativen Netzwerk zu suchen. Das geschärfte Blockchain-Ökosystem Polkadot wurde zu dieser Alternative. Wir begannen mit Experimenten mit dem Substrate-Framework, um die wichtigsten Robonomics-Funktionen zu migrieren und unser eigenes Testnetz bereitzustellen. Am Ende dieser Phase hatten wir unsere Parachain auf dem Rococo-Testnetz bereitgestellt und begannen mit den Vorbereitungen, um einen Slot im Kusama-Netzwerk zu erhalten.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Bei der weiteren Erforschung von IoT-Systemen haben wir die Hauptfunktionalität von Robonomics identifiziert, die den Benutzern einen Mehrwert bieten kann — die Funktion einer dezentralen Cloud für IoT. Diese Idee bildete die Grundlage für",
  "Robonomics Web Services": "Robonomics Web Services",
  "Robonomics became the foundation for the": "Robonomics wurde zur Grundlage für das",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "Projekt, das ein System für die intelligente Vermietung von Roboterausrüstung entwickelt.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Wir haben erkannt, dass autonome Agenten eine Umgebung benötigen, die ihren zuverlässigen technischen und wirtschaftlichen Betrieb gewährleistet. Über mehrere Jahre hinweg haben wir ein Protokoll zur Schaffung eines dezentralen Netzwerks von Anbietern entwickelt, die robotischen Agenten bei der Erbringung ihrer Dienstleistungen helfen. Werkzeuge für die Netzwerkpflege und für den Kommunikationsstack zwischen Ethereum und ROS wurden entwickelt. Im Jahr 2018 haben wir das",
  "Robonomics Whitepaper": "Robonomics-Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "veröffentlicht und die Alpha-Version des Robonomics-Netzwerks wurde auf dem Ethereum-Mainnet gestartet. Die aktiven Vorbereitungen für das XRT-Token-Generierungsereignis wurden fortgesetzt (das schließlich im Frühjahr 2019 aufgrund des ersten Krypto-Winters stattfand).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Ab diesem Zeitraum begann Robonomics, sich dynamisch entwickelnde Anwendungsfälle im Zusammenhang mit Industrie 4.0 — intelligente Fabriken, Smart Cities und Smart Homes — zu entwickeln, was unsere Aufmerksamkeit auf die IoT-Welt lenkte. Auf der Suche nach Innovationen hat das Team mehrere große und einzigartige R&D-Demos präsentiert: ein ziviles",
  "sensor network": "Sensornetzwerk",
  "a water drone": "eine Wasserdrohne",
  "for environmental monitoring (supported by a sensor systems manufacturer": "für die Umweltüberwachung (unterstützt von einem Hersteller von Sensorsystemen",
  "Libelium": "Libelium",
  "a smart factory model": "ein Modell für eine intelligente Fabrik",
  "a self-employed": "ein selbstständiger",
  "robot artist Gaka-chu": "Roboter-Künstler Gaka-chu",
  "and a": "und ein",
  "drone traffic management system": "Drohnen-Verkehrsmanagementsystem",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics hat mit dem Projekt DAO IPCI zur Verwaltung von Umweltgütern mithilfe von Web3-Technologien und IoT-Geräten zusammengearbeitet.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Dies war eine Zeit intensiver F&E-Arbeit, während der wir eine Reihe von Aufgaben identifizierten, bei denen P2P-Technologien Fähigkeiten haben, die zuvor für die Robotik nicht verfügbar waren. Durch die Kombination von Ethereum-Computern, IPFS-Dateispeicherung und Robot Operating System erkannten wir, dass jedes Gerät potenziell zu einem",
  "autonomous intelligent robot agent": "autonomen intelligenten Roboteragenten",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "werden kann. Dies eröffnete uns den Weg zu den Konzepten Robot-as-a-Service und der Roboterwirtschaft.",
  "Our publications in scientific journals of this period are available in the": "Unsere Veröffentlichungen in wissenschaftlichen Zeitschriften aus dieser Zeit sind im",
  "Papers section": "Papers-Bereich",
  "We have collected all R&D projects over the years in the": "Wir haben im Laufe der Jahre alle F&E-Projekte gesammelt",
  "a handy book": "in einem praktischen Buch",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Alles begann mit einer Idee, die den Gründern kam, als Ethereum gerade erst sein Hauptnetz gestartet hatte. Was ist, wenn der Roboter eine Aufgabe für einen Kunden gegen Kryptowährung ausführt und seine Logik von einem Smart Contract gesteuert wird?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Um die Idee zu testen, haben wir eine Demo erstellt, bei der eine von einem Ethereum-Computer gesteuerte Drohne gestartet wurde, um die angegebenen GPS-Koordinaten zu erreichen, nachdem der Benutzer eine Zahlungstransaktion abgeschlossen hatte.",
  "The demo is available on": "Die Demo ist auf",
  "YouTube": "YouTube",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "Im Jahr 1948 veröffentlichte der Mathematikprofessor Norbert Wiener am MIT eines der wegweisendsten Werke \"Cybernetics: Or Control and Communication in the Animal and the Machine\". Er verwendete den Begriff \"Kybernetik\" zum ersten Mal als selbstregulierende Mechanismen und diese Veröffentlichung gilt daher als anerkannter kybernetischer Geburtstag.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Große Bücher führen zu großen Ideen. Wenn Sie nach mehr Inspiration zur Kommunikation zwischen Mensch und Maschine suchen, sollten Sie Science-Fiction-Bücher lesen. Markieren Sie die Bücher, die Sie bereits gelesen haben, und sehen Sie, was wir Ihnen noch für weitere Reflexion anbieten können.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Tatsächlich wird die Wirtschaft der Menschen oft mit der Gewissenhaftigkeit bei der Erfüllung von Aufgaben im Rahmen des Vertrags, dem Wunsch der Parteien, ein Ergebnis zu erzielen, dem opportunistischen und altruistischen Verhalten des Einzelnen in der Gesellschaft in Verbindung gebracht. All diese Prinzipien sind schwer auf die Roboterwirtschaft anwendbar. Was sind die Motive der Roboterwirtschaft? Das ist eine offene Frage, die wir in der Gesellschaft erforschen und diskutieren müssen, um Roboter besser zu verstehen und anzuwenden.",
  "Establishing democracy with smart contracts": "Demokratie mit Smart Contracts etablieren",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Stellen Sie sich ein kleines Büro mit einem Team von 10-15 Personen vor. Während jeder auf seine eigenen Fristen für seine Hauptaufgaben konzentriert ist, scheint sich niemand um die Instandhaltung des Büroplatzes zu kümmern. Die häufigste Lösung, um dem Chaos zu entgehen, besteht darin, Dritte für Unterstützung einzustellen. Ein anderer Ansatz besteht darin, die Initiative zu ergreifen und Strafen für diejenigen zu verhängen, die Unordnung verursachen oder Vorräte aufbrauchen, ohne sie aufzufüllen. Ist es jedoch ethisch, unter Tyrannei zu leben in unserer zukünftigen krypto-anarchistischen Welt, in der von jedem erwartet wird, verantwortlich zu sein und Freiheit zu genießen? Lassen Sie uns danach streben, eine demokratischere Gesellschaft mit Hilfe von Smart Contracts und der neuen Generation von Internet-Technologien (oft als Web3 bezeichnet) zu schaffen. Wir benötigen Werkzeuge, die uns helfen, gemeinsam Entscheidungen zu treffen, und dann sicherstellen, dass sie ordnungsgemäß funktionieren, ohne dass Menschen direkt eingreifen müssen.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Wer hat den ganzen Kaffee getrunken?!' oder das Tragödie der Allmende",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Es gibt ein Konzept, das in Wirtschaft, Ökologie und anderen Wissenschaften weit diskutiert wird und als 'Tragödie der Allmende' bekannt ist. Dies bezieht sich auf ein Szenario, in dem Personen, die Zugang zu einer gemeinsamen Ressource haben, ihre eigenen Interessen priorisieren und letztendlich die Ressource erschöpfen. Kaffee ähnelt einer solchen Ressource, da er aufgrund unkontrollierten Konsums im Büro verfällt. Gleichzeitig sind in der Regel keine der Teammitglieder geneigt, ihre Zeit und ihr Geld für den Kauf eines zusätzlichen Pakets Kaffeebohnen zu investieren. Also trinken sie weiterhin Kaffee, ohne neue Vorräte zu besorgen.",
  "How to formulate the task in numbers.": "Wie man die Aufgabe in Zahlen formuliert.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Angenommen, das monatliche Kaffeebudget beträgt 100 US-Dollar, was etwa 150 Tassen für unser 10-köpfiges Team entspricht. Dies bedeutet, dass jeder Person alle 2 Tage eine Tasse Kaffee zur Verfügung steht. Nun wollen wir uns mit den technischen Details befassen. Die Frage ist: Wie können wir eine autonome Kaffeemaschine im Büro zum Leben erwecken?",
  "Step 1: automated coffee bean ordering": "Schritt 1: Automatische Bestellung von Kaffeebohnen",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Wir haben eine Vereinbarung mit dem Barista Nikita getroffen, der sich in der Nähe des Büros befindet. Er wird uns mit Kaffeebohnen versorgen, sobald er eine Benachrichtigung vom Bot erhält. Der Bot sendet eine Nachricht, wenn der Kaffee zur Neige geht, und gibt die Menge an Kaffee (in Kilogramm) an, die für die Bestellung benötigt wird, sowie den entsprechenden Zahlungsbetrag, der vom Team festgelegt wird. Mit diesen Informationen kann Nikita den Kaffee nach seinen Vorlieben auswählen.",
  "Step 2: automatic access to smart office.": "Schritt 2: Automatischer Zugang zum intelligenten Büro.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Gleichzeitig mit der Bestellung generiert die Kaffeemaschine einen QR-Code. Nikita präsentiert dann diesen QR-Code der Kamera, um Zugang zum Büro zu erhalten.",
  "Step 3: distribution of coffee tokens to the team.": "Schritt 3: Verteilung von Kaffee-Token an das Team.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Sobald die lokale Kamera den QR-Code erfasst hat, initiiert das intelligente Hausverwaltungssystem eine Zahlung an Nikita und verteilt neue Kaffee-Token an die Teammitglieder.",
  "Step 4: drink coffee!": "Schritt 4: Kaffee trinken!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Um eine frische Tasse Kaffee zu erhalten, muss ein Teammitglied ein Kaffee-Token an die Adresse der Kaffeemaschine senden.",
  "Coffee beans delivery process:": "Lieferprozess für Kaffeebohnen:",
  "Unlock new possibilities with this concept": "Entdecken Sie neue Möglichkeiten mit diesem Konzept",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Darüber hinaus führt eine solche automatisierte Kaffeemaschine verschiedene wirtschaftliche und soziale Dimensionen ein. Werfen wir einen Blick darauf:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Entwickler können zusätzliche Kaffee-Token einzahlen, wenn der Verbrauch unterhalb des Limits liegt. Dies schafft ein transparentes System für unterschiedlichen Kaffeekonsum innerhalb des Limits.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "Die Kaffeemaschine könnte ein gemeinsames Konto führen, das es Büromitgliedern ermöglicht, Gelder von ihren persönlichen Konten beizusteuern, um beim nächsten Mal ein hochwertigeres Kaffeeerlebnis zu ermöglichen.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Das Team entscheidet gemeinsam über die Kaffeemenge, die die Maschine bei jeder Bestellung bestellen wird, durch eine DAO-Abstimmung. Dies bietet die Freiheit, die Herausforderung mit begrenzten Ressourcen anzugehen.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Programmierbare Prozesse reduzieren den Einfluss menschlicher Faktoren und bieten auch eine größere Flexibilität bei der Anpassung von Einstellungen für spezifische Teams.",
  "How we smarten up our coffee machine in real life": "Wie wir unsere Kaffeemaschine im echten Leben verbessern",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Um die Kontrolle über die Kaffeemaschine zu haben, haben wir einen Einplatinencomputer integriert, speziell den Raspberry Pi 4, zusammen mit einer allgemein erhältlichen Massenmarkt-Kaffeemaschine, die eine GPIO-Verbindung unterstützt. Unsere Wahl fiel auf die",
  "selected for its affordability and the convenience of its easily removable front panel.": "aufgrund ihrer Erschwinglichkeit und der Bequemlichkeit ihres leicht abnehmbaren Frontpanels.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Als nächstes haben wir die betrieblichen Details ausgearbeitet, insbesondere welche Token Benutzer senden können und der zugrunde liegende Algorithmus. Hier ist das Ergebnis:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Um eine Tasse köstlichen Kaffee zu genießen, müssen Benutzer einen bestimmten Betrag an Geldern (in unserem Fall 1 Statemine-Token ACT, id=3077) an die Adresse der Kaffeemaschine von einer Parachain (Statemine) senden. Danach beginnt der Kaffee-Gießprozess und ein Aktionsprotokoll wird anschließend auf",
  "via the Datalog function": "über die Datalog-Funktion veröffentlicht.",
  "When the concept extends beyond the office": "Wenn das Konzept über das Büro hinaus erweitert wird",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Dieses Konzept bietet zahlreiche Möglichkeiten zur Erweiterung der Idee. Es wurde erfolgreich im Polkadot Web3 Hub während des Weltwirtschaftsforums 2022 in Davos umgesetzt. Die Teilnehmer konnten Kaffee bestellen und ihren gewünschten Kaffeetyp (z.B. Espresso, Americano, Cappuccino) angeben, indem sie eine bestimmte Anzahl von Token sendeten. Lassen Sie uns Fotos und Videos von dieser Veranstaltung teilen:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Unser Blockchain-Kaffeemaschine macht Kaffee im Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "DIY oder wie man seine eigene intelligente Blockchain-Kaffeemaschine baut",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Eine ausführliche Anleitung und technische Spezifikationen finden Sie im Open-Source-GitHub-Repository. Beachten Sie, dass Sie jede Kaffeemaschine Ihrer Wahl und nahezu jeden Token Ihrer Wahl verwenden können, um dieses Projekt in Ihrem eigenen Raum zum Leben zu erwecken.",
  "In a nutshell": "Kurz gesagt",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Heutzutage wird immer deutlicher, dass der Energieverbrauch einen erheblichen Beitrag zum CO2-Fußabdruck leistet und es daher immer wichtiger wird, Wege zu finden, unseren Umwelt-Einfluss zu reduzieren. Büros und Gewerbegebäude spielen eine bedeutende Rolle bei diesem Energieverbrauch. Die Ingenieure von Robonomics haben ein System im Büro von BBF, einem in Zypern ansässigen Immobilienentwickler, installiert, um den Stromverbrauch zu verfolgen und Messungen zu sammeln. Dieses System bietet auch eine praktische Möglichkeit, den CO2-Fußabdruck auszugleichen.",
  "1. Monitoring surplus energy generation": "1. Überwachung der überschüssigen Energieerzeugung",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "Im Bürogebäude des Unternehmens BBF wurden mehrere Solarpaneele installiert und in das Solarweb-System integriert, um eine einfache Datensammlung zu ermöglichen. Das System liefert Daten zum Gesamtstromverbrauch des Gebäudes und zum von den Solarpanelen erzeugten Strom. Eine entscheidende fehlende Funktion besteht jedoch darin, die Möglichkeit zu haben, den CO2-Fußabdruck auszugleichen, der durch den über den Solarpanelen erzeugten Strom hinaus verbraucht wird.",
  "2. Converting excess energy power to CO2 offset": "2. Umwandlung von überschüssiger Energie in CO2-Ausgleich",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Durch die Daten zum Gesamtstromverbrauch und zur Stromproduktion der Solarpaneele lässt sich der CO2-Fußabdruck einfach berechnen. Es wird angenommen, dass Strom aus Solarpanelen einen CO2-Fußabdruck von 0 hat, was bedeutet, dass nur für den über den Solarpanelen erzeugten Strom hinaus verbrauchten Strom eine Kompensation erforderlich ist.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "Es ist zu beachten, dass die CO2-Emissionen je nach Land unterschiedlich sind. In Zypern liegt die durchschnittliche Verschmutzung bei 587 g/kWh, laut Hannah Ritchie, Max Roser und Pablo Rosado (2022) - \"Energie\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Zur Kompensation des CO2-Fußabdrucks werden Kohlenstoffgutschriften verwendet, wobei jede Gutschrift 1 Tonne CO2 repräsentiert. Diese Gutschriften spielen eine wichtige Rolle bei der Kompensation der Umweltauswirkungen, die durch den Stromverbrauch über den Beitrag der Solarpaneele verursacht werden.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Daher ist es mit den Daten zum Energieverbrauch, zur Solarpanelproduktion und zum Zypern-Koeffizienten mühelos möglich, die Anzahl der für den CO2-Fußabdruckausgleich erforderlichen Token zu bestimmen.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Um dies zu erreichen, haben wir einen Raspberry Pi integriert, Home Assistant konfiguriert, um analytische Daten zu sammeln, und eine Integration entwickelt, um den CO2-Fußabdruck auszugleichen. Das Home Assistant-Energie-Dashboard zeigt folgende Details an:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Darüber hinaus verbessert unsere Integration das System, indem sie ein praktisches Bedienfeld bietet, um Statistiken anzuzeigen und den Ausgleich auszulösen:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Im Folgenden finden Sie ein anschauliches Beispiel, wie der Ausgleich des CO2-Fußabdrucks durch unsere Integration erfolgt. Nach erfolgreichem Abschluss entfaltet sich die",
  "transaction": "Transaktion",
  "unfolds as follows:": "wie folgt:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Die Reduzierung des Energieverbrauchs im Büro ist genauso wichtig wie die Kompensation von CO2-Emissionen. Dies kann durch kleine Änderungen wie die Verwendung energieeffizienter Beleuchtung und Geräte sowie die ordnungsgemäße Wartung von Büroausstattung erreicht werden.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Der Energieverbrauch ist ein großer Teil unseres CO2-Fußabdrucks, und Unternehmen müssen ihren Beitrag leisten, um umweltfreundlicher zu sein. Ein System, das den Energieverbrauch verfolgt und hilft, CO2-Emissionen auszugleichen, kann den Einfluss eines Bürogebäudes auf die Umwelt erheblich reduzieren. Durch die richtige Herangehensweise können Unternehmen zu einer grüneren Zukunft beitragen.",
  "The way forward": "Der Weg nach vorne",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Strategie zur Transformation der Kaffeemaschine in ein autonomes robotisches Gerät",
  "Robot and electrics sheep artboard": "Roboter und elektrische Schafskunstplatte",
  "Robot and apple artboard": "Roboter und Apfel-Kunstplatte",
  "Robot and cosmonaut artboard": "Roboter und Kosmonaut-Kunstplatte",
  "Robot and cat artboard": "Roboter und Katzen-Kunstplatte",
  "Space travelers artboard": "Weltraumreisende Kunstplatte",
  "Coloured astronaut artboard": "Farbiger Astronaut-Kunstplatte",
  "Black and white astronaut artboard": "Schwarz-weißer Astronaut-Kunstplatte",
  "icons for macos": "Symbole für macOS",
  "icons for windows": "Symbole für Windows",
  "Sleeping Mew Space": "Schlafender Mew Space",
  "Are you ready for Mars?": "Bist du bereit für den Mars?",
  "Shiva Robot": "Shiva-Roboter",
  "Space Travelers": "Weltraumreisende",
  "Retro Astronaut": "Retro-Astronaut",
  "New Newton": "Neuer Newton",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "The latest Robonomics news here.": "Die neuesten Robonomics-Nachrichten hier.",
  "Follow us": "Folgen Sie uns",
  "Video tutorials, screencasts, interviews, events.": "Video-Tutorials, Screencasts, Interviews, Veranstaltungen.",
  "Watch videos": "Videos ansehen",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "Chatten Sie mit uns und unserer Community. Stellen Sie gerne Fragen und diskutieren Sie Ihre Vorschläge.",
  "Join chat": "Chat beitreten",
  "Medium Blog": "Medium-Blog",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "Unsere Vision von der Vergangenheit, der Gegenwart und der Zukunft von Robonomics, Ethereum, Polkadot-Netzwerken, grünen Märkten, Robotik und allem, was mit Robonomics verbunden ist.",
  "Read": "Lesen",
  "Telegram chat": "Telegramm-Chat",
  "Local communities & news. You are welcome!": "Lokale Gemeinschaften und Nachrichten. Sie sind herzlich willkommen!",
  "Updated use cases for connected robots within web3 technologies.": "Aktualisierte Anwendungsfälle für vernetzte Roboter innerhalb von Web3-Technologien.",
  "17 use cases for connected robots within Polkadot and Ethereum.": "17 Anwendungsfälle für vernetzte Roboter innerhalb von Polkadot und Ethereum.",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "Hier erklären wir die Idee eines cyber-physischen Systems, wie es bei der Skalierung der Fertigung helfen kann und was mit den Haftungsfragen von Robotern zu tun ist.",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "Die Grundlage hier ist, dass freie wirtschaftliche Prinzipien ausreichen, um in einer automatisierten Welt zu leben. Roboter können unsere Freunde sein, und wir brauchen keine Zentralisierung, um es bequem und zuverlässig zu machen.",
  "On the Way to Sovereign Home Automation": "Auf dem Weg zur souveränen Hausautomation",
  "World Economic Forum Annual Meeting 2022": "Weltwirtschaftsforum Jahrestagung 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Ein Parachain für IoT-Anwendungen werden",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (gesponsert von Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (veranstaltet von Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Übergang zu Multinetzwerk - Da kam Polkadot",
  "The Rise of Robonomics Network": "Der Aufstieg des Robonomics-Netzwerks",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Workshop des Europäischen Parlaments 'Die Wirtschaft der Roboter'",
  "Consensus 2018 conference": "Consensus 2018 Konferenz",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Symposium über Blockchain für Robotersysteme am MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Robonomics-2018 Sommerkurs veranstaltet von Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Integration von Fronius Solar.web mit Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Eines unserer Ziele bei der Entwicklung dieses Falls ist es, Robonomics in ein ROS 2 Middleware umzuwandeln. Dadurch können wir Robonomics auf Substrate verwenden, um eine dapp zu erstellen, die ROS 2 direkt aus dem Browser ausführen kann!",
  "Eisenkoch, the robot chef": "Eisenkoch, der Roboter-Koch",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Echter Fall für den Roboter mit zwei Waffeleisen, der gleichzeitig 6 Waffeln in 5-7 Minuten backt.",
  "Blockchain-powered smart coffee machine": "Blockchain-betriebene intelligente Kaffeemaschine",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics Coffee - ist eine intelligente Kaffeemaschine, die in das Robonomics-Netzwerk integriert ist. Dieses Projekt zielt darauf ab, das Potenzial von Robonomics in der IoT-Sphäre anhand eines realen Beispiels zu zeigen.",
  "Water environmental inspector": "Wasserumweltinspektor",
  "Air monitoring network": "Luftüberwachungsnetzwerk",
  "Production quality control platform “Feecc”": "Produktionsqualitätskontrollplattform 'Feecc'",
  "Backup and archiving service for robotics companies": "Backup- und Archivierungsdienst für Robotikunternehmen",
  "Public lab with Boston Dynamics Spot": "Öffentliches Labor mit Boston Dynamics Spot",
  "Autonomous telescope service": "Autonomer Teleskopdienst",
  "Smart home secure remote control and backup service": "Sicherer Fernsteuerungs- und Backup-Dienst für Smart Homes",
  "Blockchain as quality control system for chemistry": "Blockchain als Qualitätskontrollsystem für Chemie",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Echte CO2-Emissionsreduktion mit blockchain-bewiesenen Zertifikaten",
  "Robot-artist Gaka-Chu": "Roboter-Künstler Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Demo 'Holen Sie sich das Wetter des Fuji-Berges'",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Die Hauptidee, die die Autoren von Robonomics vermitteln wollten, ist die natürliche, logische und scheinbar unvermeidliche Entwicklung vom aktuellen Stand der Wirtschaft hin zu vollautomatisierten Dienstleistungen. Automatisierte Dienstleistungen müssen sowohl die Sprache der menschlichen Wirtschaft als auch die eigene Wirtschaft der Maschinen beherrschen, um verschiedene Operationen in der Welt um sie herum mit einer Geschwindigkeit durchzuführen, die für Menschen nicht verfügbar ist.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Die Entwicklung und Anwendung des Internets der Dinge hat gezeigt, dass die Lösung typischer Probleme nicht ausreicht. Völlig neue Konzepte und Prinzipien, basierend auf früheren Fehlern und identifizierten Mängeln, sind bis zum heutigen Tag entstanden. Dieser bequeme Ansatz der Nutzung von Cloud-Diensten stellte sich als mit einer Reihe von kritischen Mängeln in Bezug auf Skalierbarkeit, Privatsphäre und Sicherheit verbunden heraus. In dem Bemühen, diese Probleme zu lösen, wurde vorgeschlagen, die Datenverarbeitung, Logik und Berechnung näher an den unmittelbaren Ort zu bringen, an dem sie verwendet werden. So entstanden die Konzepte des Nebels und des Edge Computing, wobei Zwischensysteme zwischen der Cloud und den Geräten einige Funktionen der Cloud übernehmen. Daher ist die Schaffung von Edge-Systemen zu einer der neuen Herausforderungen beim Aufbau des Internets der Dinge geworden.",
  "the Robonomics Parachain portal": "das Robonomics Parachain-Portal",
  "3. Managing blockchain-verified carbon footprint offset": "3. Verwaltung der blockchain-verifizierten Kompensation des CO2-Fußabdrucks",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Die Zusammenarbeit mit ähnlich gesinnten Projekten wurde ebenfalls fortgesetzt. Robonomics und DAO IPCI haben einen Service zur Erfassung und Analyse von Sensordaten eingeführt -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "Und was wissenschaftlich interessant ist, basierend auf der Idee der durch den Markt auferlegten Beschränkungen für die Größe des Unternehmens, können wir sagen, dass die Grenze für die Erhöhung der CPS immer durch den Markt bestimmt wird und dafür nichts weiter erforderlich ist.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Ein Beispiel für unsere Experimente: Verhandlungen über den Straßenraum und Zahlungen für das Vorfahrtsrecht für autonome Fahrzeuge zur Reduzierung von Staus. Was eine Person im Verkehr absolut nicht tun würde, wird das Auto für Sie ohne Schwierigkeiten tun: Sie möchten die Spur wechseln, Ihr Auto und das Auto Ihres Nachbarn tauschen Angebote über die Kosten einer solchen Operation im Sekundentakt aus, sie werden einen Gleichgewichtspreis ermitteln, und schon sind Sie in der nächsten schnelleren Fahrspur. Das bedeutet, dass es jetzt möglich sein wird, Ihre Fahrt mit Uber zu \"aufladen\" und schneller zu machen.",
  "Important news and announcements": "Wichtige Neuigkeiten und Ankündigungen",
  "Robonomics White Paper": "Robonomics White Paper",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Hier finden Sie und können (natürlich völlig kostenlos) das allererste Robonomics-Whitepaper herunterladen, das im Mai 2018 vorgestellt wurde. Obwohl sich seitdem viel entwickelt hat, werden die Grundlagen von Robonomics immer noch in diesem Papier erläutert.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Ein selbstständiger autonomer Roboter-Künstler",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Kooperative gradientenfreie Lokalisierung und Verfolgung beweglicher Umgebungsgrenzen durch Teams von nicht-holonomen Robotern",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robot-as-a-Service: Von Cloud- zu Peering-Technologien",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Vertrauenswürdiges Umweltmonitoring mittels Sensornetzwerken auf schwärmenden autonomen Meerfahrzeugen und Distributed-Ledger-Technologie",
  "Digital Passport for Unmanned Vehicles": "Digitaler Pass für unbemannte Fahrzeuge",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics als Blockchain-basierte Plattform für das Verkehrsmanagement unbemannter mobiler Fahrzeuge",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Auf Blockchain basierende Multi-Agenten-Robotersysteme: Analyse, Klassifikation und Anwendungen",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Roboter-Services für Smart Cities der neuen Paradigmen basierend auf dezentralen Technologien",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protokoll zur Organisation eines dezentralen autonomen Agentennetzwerks in Fabriken unter Verwendung von Marktinstrumenten",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Auf Blockchain basierendes Robonomics: Validierung des Verhaltens autonomer Agenten",
  "Transforming Climate Finance and Green Investment with Blockchains": "Transformation des Klimafinanzwesens und der grünen Investitionen mit Blockchains",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: Plattform zur Integration von Cyber-Physischen Systemen in die menschliche Wirtschaft",
  "Blockchain based protocol for economical communication in industry 4.0": "Blockchain-basiertes Protokoll für die wirtschaftliche Kommunikation in der Industrie 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics basierend auf Blockchain als Prinzip zur Schaffung intelligenter Fabriken",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Blockchain-Ökosystem für Kohlemärkte, Umweltgüter, Rechte und Verbindlichkeiten: Konzeptdesign und Implementierung",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Blockchain-basiertes Protokoll für autonome Geschäftstätigkeit in Multi-Agenten-Systemen bestehend aus UAVs",
  "English": "Englisch",
  "Russian": "Russisch",
  "Chinese": "Chinesisch",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics ist eine Open-Source-Plattform, die sowohl einfache IoT-Dienste als auch komplexe Robotik ermöglicht und eine effektive Kommunikation zwischen Agenten, ob menschlich oder robotisch, ermöglicht. Zur Integration von Robotern in dieses System nutzen wir ROS. In diesem Artikel möchten wir einen Überblick über unseren Prozess zur Integration von Robonomics in ROS 2 geben.",
  "Why ROS 2 in Robonomics?": "Warum ROS 2 in Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, das Robot Operating System, ist eines der ältesten Open-Source-Frameworks für Robotik. Es ist eine Sammlung von Softwarebibliotheken und -werkzeugen, um Roboter zum Laufen zu bringen. Es bietet alles von den Grundlagen bis zu fortgeschrittenen Funktionen und wird mit praktischen Tools für Programmierer geliefert. Es wird weltweit von Universitäten für Lehre und Forschung in der Robotik eingesetzt, ist also etabliert, funktioniert mit vielen Arten von Robotern und hat eine große Entwicklergemeinschaft.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Seit dem Start von ROS im Jahr 2007 haben sich im Bereich der Robotik und innerhalb der ROS-Community bedeutende Veränderungen ergeben. Als Reaktion auf diese Entwicklungen wurde ROS 2 eingeführt, um sich an diese Veränderungen anzupassen. Es baut auf den Stärken von ROS 1 auf und behebt seine Einschränkungen. Wir nutzen ROS von Anfang an in Robonomics und jetzt ist es an der Zeit, auf ROS 2 umzusteigen.",
  "You might find this interesting": "Das könnte Sie interessieren",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Es gibt zahlreiche Open-Source-Roboter und komplexe Roboterplattformen, die ROS unterstützen. Dies bedeutet, dass Sie ein beeindruckendes Multi-Roboter-System erstellen können, um Ihre spezifischen Ziele zu erreichen. Für ",
  "the most current list of supported robots": "die aktuellste Liste unterstützter Roboter",
  "please visit the ROS website.": "besuchen Sie bitte die ROS-Website.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Schauen wir uns an, wie ROS im Robonomics-Framework verwendet wird, indem wir das gesamte System mit Robonomics als verschiedenen Schichten darstellen:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "Auf der Ebene der 'Maschinenschnittstelle' benötigen wir Tools, um Roboter nahtlos mit Software zu verbinden. ROS 2 bietet eine robuste Sammlung von Entwicklertools, die perfekt für diese Aufgabe geeignet sind.",
  "Robonomics packages for ROS and ROS 2": "Robonomics-Pakete für ROS und ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "Beim Aufbau eines multi-robotischen Systems besteht oft die Herausforderung, Geräte von verschiedenen Anbietern oder sogar Geräte innerhalb eines einzigen Anbieters zu verbinden, die jeweils unterschiedliche Protokolle verwenden. Ob für ein Smart-Home-Setup oder automatisierte Fertigung, eine effektive Kommunikation zwischen Ihren Maschinen ist entscheidend. ROS (und natürlich ROS 2) bietet verschiedene Modi, um dies zu bewältigen. Was wäre, wenn Sie Aufgaben anpassen könnten, während ROS die Kommunikation zwischen den Knoten verwaltet?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Das Robonomics-Team hat verschiedene Pakete für ROS erstellt, um Roboter intelligenter zu machen und spezifische Aufgaben nach Bedarf zu erledigen. Um die Aufgaben zu sehen, die wir mit ROS erreicht haben, besuchen Sie unsere Seite mit Forschung und Entwicklung. Fast jede Interaktion mit einem Roboter basiert auf ROS. Unsere Open-Source-Robonomics-Pakete für ROS finden Sie auf GitHub, und hier sind einige davon:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Der Robonomics-Kommunikationsstapel enthält eine Reihe von ROS-Paketen für wirtschaftliche Kommunikationszwecke.",
  "Robonomics' contribution in the ROS 2 community": "Der Beitrag von Robonomics in der ROS 2-Community",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics kombiniert Robotik mit Web3-Technologien, und wir streben danach, in diesen Bereichen zu wachsen. Seit der Einführung von ROS 2 haben wir drei Hauptherausforderungen identifiziert, die die Unterstützung der ROS 2-Community und die Verbesserung der Fähigkeiten von Robonomics umfassen:",
  "Creating ROS 2 tools for Rust:": "Erstellung von ROS 2-Tools für Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Diese Tools ermöglichen es Entwicklern, ROS 2-Anwendungen mit Rust zu schreiben. Um mehr darüber zu erfahren, warum wir uns für Rust entschieden haben und welche Bedeutung dieses Projekt für uns hat, finden Sie",
  "additional details": "weitere Details",
  "Developing Robonomics Middleware for ROS 2:": "Entwicklung von Robonomics Middleware für ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Dies spielt eine wichtige Rolle bei der nahtlosen Integration von Robonomics in verschiedene Multi-Agenten-Robotiksysteme mit ROS 2. Es kann die Integration von Robotern in Web 3-Blockchain-Technologien erleichtern und gleichzeitig Fehler während des Integrationsprozesses reduzieren, was sowohl Zeit als auch Kosten spart.",
  "Creating a robotics lab with ROS 2:": "Erstellung eines Robotiklabors mit ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Da ROS 2 in der Robotikgemeinschaft immer beliebter wird, möchten wir mehr Roboter und Hardware sehen, die mit ROS 2 arbeiten. Unser Ziel ist es, sie mit dem Web3-Ökosystem über Robonomics zu verbinden.",
  "Research papers": "Forschungspapiere",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Ohne akademische Forschung kann der Fortschritt komplexer Systeme, die in unseren Alltag integriert werden können, seinen Zweck verlieren oder sogar Risiken darstellen. Wir müssen sorgfältig über unsere Richtung, Ziele und potenziellen Konsequenzen nachdenken. Die Bereiche, in denen Robonomics tätig ist, insbesondere Robotik, Wirtschaftsbeziehungen und Web3-Technologien, sind es wert, einzeln untersucht zu werden, um zu erkunden, wie sie miteinander integriert werden können, und um ihre potenzielle Auswirkung auf unser Leben zu bewerten.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Dieser Fall ist derzeit in Bewegung; verpassen Sie keine Neuigkeiten - abonnieren Sie Updates im untenstehenden Feld",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "Die 'Robonomics Coffee' ist eine intelligente Kaffeemaschine, die in das Robonomics-Netzwerk integriert ist. Dieses Projekt zielt darauf ab, das Potenzial von Robonomics in der IoT-Sphäre anhand eines realen Beispiels zu veranschaulichen.",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Das Jahr begann mit einem großen Erfolg - Robonomics gewann die 20. Parachain-Slot-Auktion und",
  "officially became": "wurde offiziell",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "eine Parachain mit der ID 2048 im Kusama-Netzwerk. Der Start, das Datalog, DigitalTwin, Haftungsfunktionen und IoT-Abonnements stehen allen Benutzern des Ökosystems zur Verfügung. Um Details für diese Phase des Projekts bereitzustellen, hat das Kernteam die ersten Kapitel des",
  "Robonomics Whitepaper 2.0.": "Robonomics-Whitepapers 2.0",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "veröffentlicht. Robonomics 2.0 auf Substrate wurde mit Unterstützung für XCM-Nachrichten veröffentlicht, und wir haben begonnen, HRMP-Kanäle mit anderen Parachains (wie Crust Shadow und Darwinia) zu öffnen, deren Funktionalität für uns äußerst nützlich ist. ",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Gleichzeitig haben wir eine Strategie entwickelt, um den IoT-Markt in unser Protokoll einzuführen. Unsere Experimente mit IoT-Geräten führten uns zum Konzept eines souveränen Smart Homes, das unabhängig von zentralisierten Cloud-Service-Providern ist. Wir haben unsere ",
  "integration": "Integration",
  "with the Home Assistant automation system, and also designed our own": "mit dem Home Assistant-Automatisierungssystem entwickelt und auch unser eigenes",
  "IoT gateway": "IoT-Gateway",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Natürlich hat die Unterstützung für Robonomics auf Ethereum nicht aufgehört. Der Robonomics-Kommunikationsstapel wurde auf Version ",
  "LTS 1.0.": "LTS 1.0",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "abgeschlossen. Der XRT-Token wird auf mehreren Börsen gehandelt (insbesondere auf der Uniswap DEX), und das Liquiditätsanreizprogramm wurde gestartet. ",
  "The team actively developed ways to interact with the community. The first version of our": "Das Team hat aktiv Möglichkeiten entwickelt, mit der Community zu interagieren. Die erste Version unserer",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": " Website und Robonomics Wiki wurden gestartet. Für eine transparentere und bequemere Projektverwaltung haben wir begonnen, zu verwenden",
  "We hosted": " Wir haben die",
  "Robonomics Winter School": "2019 für Neueinsteiger in das Projekt veranstaltet.",
  "logos and assets": "Logos und Assets",
  "Download the Robonomics logos here. We've got two options for your": "Laden Sie hier die Robonomics-Logos herunter. Wir haben zwei Optionen für Ihre",
  "basic needs": "Grundbedürfnisse",
  "and one designed for": "und eine speziell für",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "Token. Entdecken Sie außerdem die optimale",
  "color palette": "Farbpalette",
  "for the distinguished Robonomics brand": "für die renommierte Robonomics-Marke",
  "Robonomics logos": "Robonomics-Logos",
  "Download all": "Alle",
  "XRT logos": "XRT-Logos herunterladen",
  "Recommended color palette": "Empfohlene Farbpalette",
  "Aragon DAO": "Aragon DAO",
  "in 2019 for newcomers to the project.": "im Jahr 2019 für Neueinsteiger in das Projekt.",
  "RoSeMAN": "RoSeMAN",
  "RWS logos": "RWS-Logos",
  "Buy in Telegram bot": "Im Telegramm-Bot kaufen",
  "Key Features": "Hauptmerkmale",
  "Smart Devices": "Intelligente Geräte",
  "Control your home": "Steuerung Ihres Zuhauses",
  "Be smart": "Sei schlau",
  "Be independent": "Sei unabhängig",
  "Support it on hackster.io": "Unterstützen Sie es auf hackster.io",
  "Product 1: Universal IR Remote Control": "Produkt 1: Universal-IR-Fernbedienung",
  "Build smart climate control with any ANY A-N-Y air conditioner, setup open/close operations for any ANY A-N-Y gates in your home. We’ve built universal IR remote control with an open-source Tasmota firmware onboard. We installed USB-C port for your better experience - upgrade the firmware for the remote control just with a simple wired connection!": "Erstellen Sie eine intelligente Klimasteuerung für jeden beliebigen Klimaanlagenhersteller, richten Sie Öffnungs- und Schließvorgänge für jedes beliebige Tor in Ihrem Zuhause ein. Wir haben eine universelle IR-Fernbedienung mit einer Open-Source-Tasmota-Firmware entwickelt. Wir haben einen USB-C-Anschluss für ein besseres Erlebnis installiert - aktualisieren Sie die Firmware für die Fernbedienung einfach mit einer einfachen Kabelverbindung!",
  "Supports wide range of devices": "Unterstützt eine Vielzahl von Geräten",
  "Home Assistant Friendly": "Home Assistant-freundlich",
  "Product 2: Smart Energy Power Consumption Monitoring": "Produkt 2: Smarte Energieverbrauchsüberwachung",
  "Efficient energy monitoring consumption": "Effiziente Energieverbrauchsüberwachung",
  "Doesn’t need any cloud service": "Benötigt keinen Cloud-Service",
  "You are currently opted out. Click here to opt in.": "Sie haben derzeit die Opt-out-Option aktiviert. Klicken Sie hier, um sich anzumelden.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out abgeschlossen; Ihre Besuche auf dieser Website werden nicht vom Web-Analyse-Tool erfasst. Beachten Sie, dass Sie bei Löschen Ihrer Cookies, Löschen des Opt-out-Cookies oder bei Wechseln des Computers oder des Webbrowsers den Opt-out-Vorgang erneut durchführen müssen.",
  "Please click below to opt in:": "Bitte klicken Sie unten, um sich anzumelden:",
  "You are currently opted in. Click here to opt out.": "Sie haben derzeit die Opt-in-Option aktiviert. Klicken Sie hier, um sich abzumelden.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Sie können wählen, dass Ihrem Computer keine eindeutige Web-Analyse-Cookie-Identifikationsnummer zugewiesen wird, um die Aggregation und Analyse der auf dieser Website gesammelten Daten zu vermeiden.",
  "To make that choice, please click below to receive an opt-out cookie": "Um diese Wahl zu treffen, klicken Sie bitte unten, um ein Opt-out-Cookie zu erhalten",
  "Privacy Policy": "Datenschutzrichtlinie",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Diese Richtlinie beschreibt die Informationen, die wir von Ihnen sammeln, wie wir diese Informationen verwenden und unsere rechtliche Grundlage dafür. Sie umfasst auch, ob und wie diese Informationen geteilt werden können und Ihre Rechte und Optionen in Bezug auf die von Ihnen bereitgestellten Informationen.",
  "Tracking cookies are not used": "Tracking-Cookies nicht verwendet werden",
  "The data is not used for any other purpose than analytics": "Die Daten werden ausschließlich für Analysezwecke verwendet",
  "A user cannot be tracked across days within the same website": "Ein Benutzer kann nicht über Tage hinweg auf derselben Website verfolgt werden",
  "What We Collect and Receive": "Was wir sammeln und erhalten",
  "Visitors aren't tracked across websites": "Besucher werden nicht über Websites hinweg verfolgt",
  "Where are those annoying cookie consent pop-ups": "Wo sind diese nervigen Cookie-Einwilligungs-Pop-ups",
  "We don't need cookie consent is needed because": "Wir brauchen keine Cookie-Einwilligung, weil",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include": "Um Ihnen das bestmögliche Erlebnis auf unseren Websites bieten zu können, müssen wir bestimmte Informationen sammeln und verarbeiten. Je nach Ihrer Nutzung der Dienste kann das Folgendes umfassen",
  "Contact us via email": "Kontaktieren Sie uns per E-Mail",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "zum Beispiel, wenn Sie unsere Formulare absenden, uns Fragen oder Kommentare senden oder ein Problem melden, werden wir Ihren Namen, Ihre E-Mail-Adresse, Ihre Nachricht usw. erfassen. Wir verwenden diese Daten ausschließlich im Zusammenhang mit der Beantwortung der Anfragen, die wir erhalten.",
  "Usage data": "Nutzungsdaten",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "wenn Sie unsere Website besuchen, speichern wir: die URL, von der aus Sie uns besucht haben, die von Ihnen besuchten Webseiten unserer Website, das Datum und die Dauer Ihres Besuchs, Ihre anonymisierte IP-Adresse, die Gerätespezifikationen (Gerätetyp, Betriebssystem, Bildschirmauflösung, Sprache, Land, in dem Sie sich befinden, und Webbrowser-Typ), die Sie während Ihres Besuchs verwendet haben, und",
  "other": "andere",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "nicht personenbezogene Daten. Wir verarbeiten diese Nutzungsdaten nur auf unserem Server und geben sie nicht an Dritte weiter",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "Web-Analyseplattform, die uns eine 100%ige Datenhoheit gibt. Diese Analyse hilft uns, die Benutzererfahrung mit unserer Website zu verbessern und Missbrauch zu erkennen und zu stoppen.",
  "Non-personalized cookies": "Nicht personalisierte Cookies",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "wir verwenden nicht verfolgende Cookies (kleine Datendateien, die von Websites auf Computer oder Geräte übertragen werden) zu Aufzeichnungszwecken und zur Verbesserung der Funktionalität auf unserer Website. Sie können die Übertragung dieser Cookies deaktivieren oder einschränken, indem Sie die Einstellungen Ihres Webbrowsers ändern oder sich auf dieser Seite im untenstehenden Formular abmelden. Bereits gespeicherte Cookies können jederzeit gelöscht werden.",
  "Opt-out of website tracking": "Opt-out des Website-Trackings",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Sie können sich unten von der Verfolgung durch unsere Matomo Analytics-Instanz abmelden:",
  "Your Rights": "Ihre Rechte",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Sie haben das Recht, über die von Matomo verarbeiteten personenbezogenen Daten informiert zu werden, das Recht auf Berichtigung/Korrektur, Löschung und Einschränkung der Verarbeitung. Sie haben auch das Recht, von uns ein strukturiertes, gängiges und maschinenlesbares Format der von Ihnen bereitgestellten personenbezogenen Daten anzufordern.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Wir können Sie nur anhand Ihrer E-Mail-Adresse identifizieren und wir können Ihrer Anfrage nur nachkommen und Informationen bereitstellen, wenn wir personenbezogene Daten über Sie haben, indem Sie direkt Kontakt mit uns aufgenommen und/oder unsere Website und/oder unseren Service genutzt haben. Wir können keine Daten bereitstellen, berichtigen oder löschen, die wir im Auftrag unserer Benutzer oder Kunden speichern.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Um eines der in dieser Datenschutzrichtlinie genannten Rechte auszuüben und/oder bei Fragen oder Kommentaren zur Verwendung personenbezogener Daten können Sie sich an uns wenden.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Darüber hinaus haben Sie das Recht, eine Beschwerde bei der Datenschutzbehörde in Ihrer Gerichtsbarkeit einzureichen.",
  "Retention of data": "Speicherung von Daten",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Network legal rights.": "Wir werden Ihre Informationen so lange aufbewahren, wie es zur Bereitstellung der Dienste erforderlich ist oder wie in dieser Richtlinie anderweitig festgelegt ist. Wir werden diese Informationen auch aufbewahren und verwenden, soweit dies für die in dieser Richtlinie festgelegten Zwecke und zur Erfüllung unserer rechtlichen Verpflichtungen, zur Beilegung von Streitigkeiten, zur Durchsetzung unserer Vereinbarungen und zum Schutz der rechtlichen Rechte des Robonomics-Netzwerks erforderlich ist.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations": "Wir sammeln und speichern auch aggregierte, anonymisierte oder pseudonymisierte Informationen, die wir unbegrenzt aufbewahren können, um die Sicherheit und den Schutz unserer Website zu gewährleisten, unsere Dienste zu verbessern oder rechtlichen Verpflichtungen nachzukommen.",
  "Devices": "Geräte",
  "type-c for OSS firmware upgrading": "Typ-C für OSS-Firmware-Upgrade",
  "WI-FI": "WI-FI",
  "MQTT": "MQTT",
  "Product 3, 4: 1,2 gang wi-fi Smart Switch": "Produkt 3, 4: 1,2-Gang-WLAN-Smart-Schalter",
  "Why should you install any corporate app for switching on/off your smart light?  Our wi-fi smart switches doesn’t require any cloud connection. We tried out many other switches from various manufactureres all over the world and know some important details to make comfortable device. As other smart devices from Robonomics it is fully compatible with Home Assistant, uses open-source upgradable firmware Tasmota.": "Warum sollten Sie eine Unternehmens-App installieren, um Ihre intelligente Beleuchtung ein- und auszuschalten? Unsere WLAN-Smart-Schalter erfordern keine Cloud-Verbindung. Wir haben viele andere Schalter von verschiedenen Herstellern auf der ganzen Welt ausprobiert und kennen einige wichtige Details, um ein komfortables Gerät herzustellen. Wie andere intelligente Geräte von Robonomics ist es vollständig kompatibel mit Home Assistant und verwendet die Open-Source-fähige Firmware Tasmota.",
  "large touchable  buttons": "Große berührungsempfindliche Tasten",
  "Product 5: Air Quality Sensor": "Produkt 5: Luftqualitätssensor",
  "Join with this air quality sensor to the decentralized opensource sensors map which operates with the sole intent of serving the free will of individuals. This sensor is ready to install, you will need wi-fi and a power socket, it can be installed both indoor and outdoor. Includes PM2.5/PM10 sensor and temperature/humidity sensor, can be expanded with several types of additional sensors (VOC, CO2, atmospheric pressure).": "Schließen Sie sich diesem Luftqualitätssensor an die dezentralisierte Open-Source-Sensorkarte an, die ausschließlich dazu dient, den freien Willen der Einzelpersonen zu erfüllen. Dieser Sensor ist einsatzbereit und erfordert WLAN und eine Steckdose. Er kann sowohl drinnen als auch draußen installiert werden. Enthält PM2.5/PM10-Sensor und Temperatur-/Feuchtigkeitssensor, kann mit verschiedenen Arten von zusätzlichen Sensoren (VOC, CO2, atmosphärischer Druck) erweitert werden.",
  "Measures PM2.5/PM10": "Misst PM2.5/PM10",
  "Can be added as a part of global sensor map or your own fork": "Kann als Teil der globalen Sensorkarte oder Ihrer eigenen Abspaltung hinzugefügt werden",
  "Compatible with luftdaten": "Kompatibel mit Luftdaten",
  "View specification": "Spezifikation anzeigen",
  "Buy devices": "Geräte kaufen",
  "R&D, 2022": "F&E, 2022",
  "R&D, 2021": "F&E, 2021",
  "Book «Robot economics», 2018": "Buch «Robotikökonomie», 2018",
  "Book «Robot economics», 2017": "Buch «Robotikökonomie», 2017",
  "Robonomics Middleware Framework for ROS 2": "Robonomics Middleware Framework für ROS 2",
  "Twitter": "Twitter",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Have you ever wondered what consumes the most electricity in your home? Our smart energy power meter is designed to help you identify the major sources of electricity usage and prevent unwanted energy leaks. This energy meter works both, with an individual asset or an entire building, doesn’t need any cloud, MQTT protocol onboard, can be used with Home Assistant and it’s useful energy management dashboard.": "Haben Sie sich jemals gefragt, was in Ihrem Zuhause am meisten Strom verbraucht? Unser intelligenter Energiezähler ist darauf ausgelegt, Ihnen dabei zu helfen, die Hauptquellen des Stromverbrauchs zu identifizieren und unerwünschte Energielecks zu verhindern. Dieser Energiezähler funktioniert sowohl mit einzelnen Geräten als auch mit einem gesamten Gebäude, benötigt keine Cloud, hat das MQTT-Protokoll an Bord, kann mit Home Assistant verwendet werden und verfügt über ein nützliches Energiemanagement-Dashboard.",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Zusammenführen von Web3-Technologien und Roboterrahmen",
  "Playing with Human-Machine Interaction through Ethereum": "Spielen mit der Mensch-Maschine-Interaktion über Ethereum",
  "We are an autonomous team with extensive expertise in robotics, blockchain, and IoT. Having a deep understanding of the challenges faced by advanced smart home users, we've chosen to venture into manufacturing our own devices. Take control of your home, save energy, and liberate yourself from corporate clouds and device limitations with us!": "Wir sind ein autonomes Team mit umfangreicher Expertise in Robotik, Blockchain und IoT. Da wir ein tiefes Verständnis für die Herausforderungen haben, mit denen fortgeschrittene Smart-Home-Benutzer konfrontiert sind, haben wir uns entschieden, unsere eigenen Geräte herzustellen. Übernehmen Sie die Kontrolle über Ihr Zuhause, sparen Sie Energie und befreien Sie sich mit uns von Unternehmens-Clouds und Gerätebeschränkungen!",
  "Free worldwide shipping starts from January 2024": "Der kostenlose weltweite Versand beginnt ab Januar 2024.",
  "Following the Multichain crash, we are awaiting the implementation of native bridges within Polkadot to connect Polkadot XRT with Ethereum.": "Nach dem Multichain-Crash warten wir auf die Implementierung von nativen Brücken innerhalb von Polkadot, um Polkadot XRT mit Ethereum zu verbinden."
}