{
  "Serverless IoT applications for users": "Εφαρμογές IoT χωρίς διακομιστές για τους χρήστες",
  "Your email": "Το email σας",
  "Do Androids Dream of Electric Sheep?": "Οι ανθρώποι των ρομπότ ονειρεύονται ηλεκτρικά πρόβατα;",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Αλεξάνδρ Καπιτόνοβ, Σεργκέι Λόνσακοβ, Βιτάλι Μπουλάτοβ, Μπαμπάκ Κια Μονταζάμ, Τζέιμς Ουάιτ",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ιβάν Μπέρμαν, Ένρικα Ζερέικ, Αλεξάνδρ Καπιτόνοβ, Φάμπιο Μπονσινιόριο, Αλίσερ Χασάνοβ, Αζίζα Οριπόβα, Σεργκέι Λόνσακοβ, Βιτάλι Μπουλάτοβ",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Βαντίμ Μαναένκο, Αλεξάνδρ Καπιτόνοβ, Ιβάν Μπέρμαν",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Αλεξάνδρ Καπιτόνοβ, Ιβάν Μπέρμαν, Βαντίμ Μαναένκο, Βιατσέσλαβ Ρζεβσκί, Βιτάλι Μπουλάτοβ, Αρτέμι Ζένκιν",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ιλιά Αφανασιέβ, Αλεξάντερ Κολοτόβ, Ρούσλαν Ρεζίν, Κωνσταντίνος Ντανίλοβ, Μανουέλ Μαζάρα, Σούμπαμ Τσακραμπόρτι, Αλεξέι Κασέβνικ, Αντρέι Τσετσούλιν, Αλεξάντερ Καπιτόνοβ, Βλαντίμιρ Γιότσοφ, Άντον Τοπάλοβ, Νικόλα Σακέβ, Σεβίλ Αχμέντ",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Αλεξάντρ Καπιτόνοβ, Σεργκέι Λόνσακοβ, Ιβάν Μπέρμαν, Εντουάρντο Καστεγιό Φερέρ, Φάμπιο Π. Μπονσινιόριο, Βιτάλι Μπουλάτοβ, Αλεξάντρ Σβίστοβ",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Αλεξάντρ Καπιτόνοβ, Ιβάν Μπέρμαν, Σεργκέι Λόνσακοβ, Αλεξάντρ Κρουπένκιν, Βιτάλι Μπουλάτοβ",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Κωνσταντίνος Ντανίλοβ, Ρούσλαν Ρεζίν, Ιλιά Αφανασιέβ, Αλεξάντερ Κολοτόβ",
  "Alastair Marke": "Άλαστερ Μάρκε",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Σεργκέι Λόνσακοβ, Αλεξάντρ Κρουπένκιν, Αλεξάντρ Καπιτόνοβ, Ευγένι Ραντσένκο, Αλίσερ Χασάνοβ, Αλεξάντρ Σταρόστιν",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Αλεξάντρ Καπιτόνοβ, Ιβάν Μπέρμαν, Σεργκέι Λόνσακοβ, Αλεξάντρ Κρουπένκιν",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Αλεξάντρ Καπιτόνοβ, Ιβάν Μπέρμαν, Βιτάλι Μπουλάτοβ, Σεργκέι Λόνσακοβ, Αλεξάντρ Κρουπένκιν",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Άντον Γκαλένοβιτς, Σεργκέι Λόνσακοβ, Αλεξέι Σάντριν",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Αλεξάντρ Καπιτόνοβ, Σεργκέι Λόνσακοβ, Αλεξάντρ Κρουπένκιν, Ιβάν Μπέρμαν",
  "On the Way to Sovereign Home Automation": "Στον Δρόμο για την Κυριαρχική Αυτοματισμένη Κατοικία",
  "World Economic Forum Annual Meeting 2022": "Ετήσια Συνάντηση Παγκόσμιου Οικονομικού Φόρουμ 2022",
  "Polkadot Decoded 2022": "Polkadot Αποκωδικοποιημένο 2022",
  "Becoming a Parachain for IoT Applications": "Γίνετε Ένας Παρασχολικός για Εφαρμογές IoT",
  "Polkadot Decoded 2021": "Polkadot Αποκωδικοποιημένο 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (υποστηριζόμενο από το Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Χειμερινό Σχολείο 2021 (φιλοξενούμενο από το Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Μετάβαση σε Πολυδίκτυο - Ήρθε ο Polkadot",
  "The Rise of Robonomics Network": "Η Άνοδος του Δικτύου Robonomics",
  "Crypto Valley Conference 2018": "Διάσκεψη Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Εργαστήριο του Ευρωπαϊκού Κοινοβουλίου 'Η Οικονομία των Ρομπότ'",
  "Consensus 2018 conference": "Διάσκεψη Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Συμπόσιο για την Αλυσίδα Μπλοκ για Ρομποτικά Συστήματα στο MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Θερινό Σχολείο Robonomics-2018 φιλοξενούμενο από το Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Ενσωμάτωση Fronius Solar.web με το Home Assistant",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Συνεργασία με αναπτυσσόμενο ακίνητο στην Κύπρο για την παρακολούθηση της καθημερινής διανομής, κατανάλωσης και αντιστάθμισης οποιασδήποτε υπερβολικής ανθρακικής αποτύπωσης.",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Ένας από τους στόχους μας στην ανάπτυξη αυτής της περίπτωσης είναι να μετατρέψουμε το Robonomics σε ROS 2 Middleware. Αυτό θα μας επιτρέψει να χρησιμοποιήσουμε το Robonomics στο Substrate για να δημιουργήσουμε μια εφαρμογή που μπορεί να εκτελεί το ROS 2 απευθείας από τον περιηγητή!",
  "Eisenkoch, the robot chef": "Ο ρομποτικός σεφ Eisenkoch",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Πραγματική περίπτωση για το ρομπότ που είναι εξοπλισμένο με δύο σίδερα βάφλας και ψήνει 6 βάφλες ταυτόχρονα σε 5-7 λεπτά.",
  "Blockchain-powered smart coffee machine": "Έξυπνη καφετιέρα με τεχνολογία blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Ο καφές Robonomics - είναι μια έξυπνη καφετιέρα που ενσωματώνεται στο δίκτυο Robonomics. Αυτό το έργο στοχεύει στο να δείξει τη δυνατότητα του Robonomics στον τομέα του Διαδικτύου των Πραγμάτων μέσω ενός πραγματικού παραδείγματος.",
  "Water environmental inspector": "Επιθεωρητής περιβαλλοντικού νερού",
  "Air monitoring network": "Δίκτυο παρακολούθησης αέρα",
  "Production quality control platform “Feecc”": "Πλατφόρμα ελέγχου ποιότητας παραγωγής “Feecc”",
  "Backup and archiving service for robotics companies": "Υπηρεσία αντιγράφων ασφαλείας και αρχειοθέτησης για εταιρείες ρομποτικής",
  "Public lab with Boston Dynamics Spot": "Δημόσιο εργαστήριο με το Boston Dynamics Spot",
  "Autonomous telescope service": "Αυτόνομη υπηρεσία τηλεσκόπιο",
  "Smart home secure remote control and backup service": "Έξυπνος έλεγχος και υπηρεσία αντιγράφων ασφαλείας για έξυπνο σπίτι",
  "Blockchain as quality control system for chemistry": "Τεχνολογία blockchain ως σύστημα ελέγχου ποιότητας για τη χημεία",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Πραγματική μείωση των εκπομπών CO2 με πιστοποιητικά που επιβεβαιώνονται από την τεχνολογία blockchain",
  "Robot-artist Gaka-Chu": "Ρομπότ-καλλιτέχνης Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Επίδειξη “Πάρτε τον καιρό του βουνού Fuji”",
  "Timeline": "Χρονολόγιο",
  "Github": "Github",
  "All posts": "Όλες οι αναρτήσεις",
  "R&D cases": "Περιπτώσεις έρευνας και ανάπτυξης",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Το Robonomics είναι μια 100% ανοικτού κώδικα, ασφαλής, οικονομικά αποδοτική και μελλοντική πλατφόρμα IoT για τη σύνδεση ρομποτικής υπό τον έλεγχο του Polkadot και του Ethereum. Οποιοσδήποτε μπορεί ν δημιουργήσει υπηρεσίες με το Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Παρακάτω υπάρχει μια λίστα από τις αποδεδειγμένες εφαρμογές των σύγχρονων τεχνολογιών ρομποτικής.",
  "By interest:": "Ανά ενδιαφέρον:",
  "Sort by progress:": "Ταξινόμηση κατά πρόοδο:",
  "Any progress": "Οποιαδήποτε πρόοδος",
  "Complete": "Ολοκληρωμένο",
  "Proceeding": "Σε εξέλιξη",
  "Sort by time:": "Ταξινόμηση κατά χρόνο:",
  "Recent": "Πρόσφατο",
  "Earliest": "Παλαιότερο",
  "Show more": "Εμφάνιση περισσότερων",
  "In a nutshell": "Συνολκά",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Σήμερα, γίνεται όλο και πιο σαφές ότι η κατανάλωση ενέργειας συμβάλλει σημαντικά στον ανθρακικό αποτύπωμα, καθιστώντας ακόμα πιο σημαντικό να βρούμε τρόπους για να μειώσουμε το περιβαλλοντικό μας αποτύπωμα. Τα γραφεία και τα εμπορικά κτίρια παίζουν σημαντικό ρόλο σε αυτήν την κατανάλωση ενέργειας. Οι μηχανικοί της Robonomics έχουν εγκαταστήσει ένα σύστημα στο γραφείο της BBF, μιας εταιρείας ανάπτυξης ακινήτων στην Κύπρο, για να παρακολουθούν και να συλλέγουν μετρήσεις ηλεκτρικού ρεύματος. Αυτό το σύστημα παρέχει επίσης έναν πρακτικό τρόπο για την αντιστάθμιση του ανθρακικού αποτυπώματος.",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "Στο κτίριο γραφείων της εταιρείας BBF έχουν εγκατασταθεί αρκετά ηλιακά πάνελ και έχουν ενσωματωθεί στο σύστημα Solarweb, επιτρέποντας την εύκολη συλλογή αναλυτικών δεδομένων. Το σύστημα παρέχει δεδομένα για τη συνολική κατανάλωση ηλεκτρικού ρεύματος του κτιρίου και την ηλεκτρική ενέργεια που παράγεται από τα ηλιακά πάνελ. Ωστόσο, μια κρίσιμη λειτουργία που λείπει είναι η δυνατότητα αντιστάθμισης του ανθρακικού αποτυπώματος που προκύπτει από την κατανάλωση ηλεκτρικού ρεύματος πέρα ​​από αυτό που παράγεται από τα ηλιακά πάνελ.",
  "1. Monitoring surplus energy generation": "1. Παρακολούθηση υπερπαραγωγής ενέργειας",
  "2. Converting excess energy power to CO2 offset": "2. Μετατροπή υπερβολικής ενέργειας σε αντιστάθμιση CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Έχοντας δεδομένα για τη συνολική κατανάλωση ηλεκτρικής ενέργειας και την παραγωγ ηλεκτρικής ενέργειας από τα ηλιακά πάνελ, είναι δυνατό να γίνει μια απλή υπολογιστική διαδικασία για το οικολογικό αποτύπωμα. Υποθέτεται ότι η ηλεκτρική ενέργεια από τα ηλιακά πάνελ έχει οικολογικό αποτύπωμα 0, πράγμα που σημαίνει ότι απαιτείται αντιστάθμιση μόνο για την υπερβολική ηλεκτρική ενέργεια που καταναλώνεται πέρα από αυτήν που παράγουν τα ηλιακά πάνελ.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "Είναι σημαντικό να σημειωθεί ότι οι εκπομπές CO2 διαφέρουν ανάμεσα στις χώρες. Στην Κύπρο, η μέση ρύπανση ανέρχεται σε 587 γραμμάρια/κιλοβατώρα, σύμφωνα με τους Hannah Ritchie, Max Roser και Pablo Rosado (2022) - \"Ενέργεια\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Για να αντισταθμιστεί το οικολογικό αποτύπωμα, χρησιμοποιούνται πιστώσεις άνθρακα, με κάθε πιστώση να αντιπροσωπεύει 1 τόνο CO2. Αυτές οι πιστώσεις παίζουν ζωτικό ρόλο στην ατιστάθμιση των περιβαλλοντικών επιπτώσεων που προκαλεί η κατανάλωση ηλεκτρικής ενέργειας πέρα από τη συνεισφορά των ηλιακών πάνελ.",
  "3. Managing blockchain-verified carbon footprint offset": "3. Διαχείριση αντιστάθμισης οικολογικού αποτυπώματος με επαληθευμένο blockchain",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Έτσι, με τα δεδομένα για την κατανάλωση ενέργειας, την παραγωγή ηλιακών πάνελ και τον συντελεστή της Κύπρου, γίνεται εύκολο να προσδιοριστεί ο αριθμός των τεκμηρίων που απαιτούνται για την αντιστάθμιση του οικολογικού αποτυπώματος.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Για να επιτευχθεί αυτό, ενσωματώσαμε ένα Raspberry Pi, διαμορφώσαμε το Home Assistant για τη συλλογή αναλυτικών δεδομένων και αναπτύξαμε μια ενσωμάτωση για την αντιστάθμιση του αποτυπώματος. Το πίνακας ενέργειας του Home Assistant παρουσιάζει τις ακόλουθες λεπτομέρειες:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Επιπλέον, η ενσωμάτωσή μας ενισχύει το σύτημα προσφέροντας ένα βολικό πίνακα ελέγχου για την προβολή στατιστικών και την ενεργοποίηση της αντιστάθμισης:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Παρακάτω παρουσιάζεται ένα επεξηγηματικό παράδειγμα για το πώς γίνεται η αντιστάθμιση του οικολογικού αποτυπώματος μέσω της ενσωμάτωσής μας. Μετά την επιτυχή ολοκλήρωση, η",
  "transaction": "συναλλαγή",
  "unfolds as follows:": "εξελίσσεται ως εξής:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Η μείωση της κατανάλωσης ενέργειας στο γραφείο είναι εξίσου σημαντική με την αντιστάθμιση των εκπομπών άνθρακα. Μπορούμε να το επιτύχουμε κάνοντας μικρές αλλαγές όπως η χρήση ενεργειακά αποδοτικού φωτισμού και ηλεκτρικών συσκευών και η σωστή συντήρηση του εξοπλισμού του γραφείου.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Η κατανάλωση ενέργειας αποτελεί μεγάλο μέρος του οικολογικού αποτυπώματός μας και οι επιχειρήσεις πρέπει να κάνουν το μέρος τους γι να είναι πιο φιλικές προς το περιβάλλον. Έχοντας ένα σύστημα που καταγράφει την κατανάλωση ενέργειας και βοηθά στην αντιστάθμιση των εκπομπών άνθρακα μπορεί να μειώσει σημαντικά την επίδραση ενός γραφειακού κτιρίου στο περιβάλλον. Με την κατάλληλη προσέγγιση, οι επιχειρήσεις μπορούν να συμβάλουν σε ένα πιο πράσινο μέλλον.",
  "The way forward": "Ο δρόμος προς τα εμπρός",
  "Establishing democracy with smart contracts": "Δημιουργία δημοκρατίας με έξυπνα συμβόλαια",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Ας φανταστούμε ένα μικρό γραφείο με μια ομάδα 10-15 ατόμων. Ενώ όλοι είναι επικεντρωμένοι στις δικές τους προθεσμίες για τα κύρια επαγγελματικά τους καθήκοντα, κανείς δεν φαίνεται να ενδιαφέρεται για τη συντήρηση του χώρου του γραφείου. Η πιο συνηθισμένη λύση για να αποφευχθεί η παρακμή είναι η πρόσληψη ατόμων από τρίτους για υποστήριξη. Μια άλλη προσέγγιση είναι να πάρουμε την πρωτοβουλία και να επιβάλουμε ποινές σε όσους δημιουργούν ακαταστασία ή εξαντλούν τα αποθέματα χωρίς να τα αναπληρώνουν. Ωστόσο, είναι ηθικό να ζούμε υπό την τυραννία στο μέλλοντος κρυπτο-αναρχικού μας κόσμου, όπου αναμένεται από όλους να είναι υπεύθυνοι και να απολαμβάνουν ελεθερία; Ας προσπαθήσουμε να δημιουργήσουμε μια πιο δημοκρατική κοινωνία χρησιμοποιώντας έξυπνα συμβόλαια και τη νέα γενιά τεχνολογιών Διαδικτύου (συχνά αναφερόμενων ως Web3). Χρειαζόμαστε εργαλεία που μπορούν να μας βοηθήσουν να πάρουμε αποφάσεις μαζί και να εξασφαλίσουν ότι λειτουργούν σωστά χωρίς να χρειάζεται η ανθρώπινη παρέμβαση.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Ποιος ήπιε όλο τον καφέ;! ή η τραγωδία των κοινών",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Υπάρχει ένα έννοια που συζητείται ευρέως στην οικονομία, την οικολογία και άλλες επιστήμες γνωστή ως 'η τραγωδία των κοινών'. Αυτό αφορά ένα σενάριο στο οποίο άτομα που έχουν πρόσβαση σε ένα κοινό πόρο δίνουν προτεραιότητα στα δικά τους συμφέροντα, εξαντλώντας τελικά τον πόρο. Ο καφές μοιάζει στενά με έναν τέτοιο πόρο, καθώς επιδεινώνεται λόγω της μη ελεγχόμενης κατανάλωσης στο γραφείο. Ωστόσο, ταυτόχρονα, συνήθως κανένα από τα μέλη της ομάδας δεν είναι πρόθυμο να επενδύσει τον χρόνο και τα χρήματά του για να αποκτήσει ένα επιπλέον πακέτο κόκκους καφέ. Έτσι, συνεχίζουν να πίνουν καφέ χωρίς να αποκτούν νέες προμήθειες.",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Στρατηγική για τη μετατροπή της μηχανής καφέ σε αυτόνομη ρομποτική συσκευή",
  "How to formulate the task in numbers.": "Πώς να διατυπώσουμε την εργασία σε αριθμούς.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Υποθέτοντας έναν μηνιαίο προϋπολογισμό για καφέ ύψους 100 δολαρίων, που αντιστοιχεί περίπου σε 150 φλιτζάνια για την ομάδα μας από 10 άτομα, αυτό αφήνει σε κάθε άτομο 1 φλιτζάνι κάθε 2 ημέρες. Τώρα, ας εμβαθύνουμε στις τεχνικές λεπτομέρειες. Η ερώτηση είναι: πώς μπορούμε να φέρουμε στη ζωή μια αυτόνομη μηχανή καφέ στο γραφείο;",
  "Step 1: automated coffee bean ordering": "Βήμα 1: αυτοματοποιημένη παραγγελία κόκκων καφέ",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Έχουμε κάνει μια συμφωνία με τον barista, Νικήτα, που βρίσκεται κοντά στο γραφείο. Θα μας παρέχει κόκκους καφέ μετά από ειδοποίηση από το bot. Το bot στέλνει ένα μήνυμα όταν ο καφές είναι σε χαμηλή ποσότητα, καθορίζοντας την ποσότητα του καφέ (σε κιλά) που χρειάζεται για την παραγγελία και το αντίστοιχο ποσό πληρωμής που καθορίζεται από την ομάδα. Με αυτές τις λεπτομέρειες, ο Νικήτας μπορεί να επιλέξει τον καφέ ανάλογα με τις προτιμήσεις του.",
  "Step 2: automatic access to smart office.": "Βήμα 2: αυτόματη πρόσβαση στο έξυπνο γραφείο.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Ταυτόχρονα με την παραγγελία, η μηχανή καφέ δημιουργεί έναν κωδικό QR. Στη συνέχεια, ο Νικήτας παρουσιάζει αυτόν τον κωδικό QR στην κάμερα για την είσοδο στο γραφείο.",
  "Step 3: distribution of coffee tokens to the team.": "Βήμα 3: διανομή καφέ tokens στην ομάδα.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Μόλις η τοπική κάμερα σαρώσε τον κωδικό QR, το έξυπνο σύστημα διαχείρισης του σπιτιού προβαίνει σε πληρωμή προς τον Νικήτα και διανέμει νέα καφέ tokens στα μέλη της ομάδας.",
  "Step 4: drink coffee!": "Βήμα 4: πίνουμε καφέ!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Για να λάβει ένα φρέσκο φλιτζάνι καφέ, ένα μέλος της ομάδας πρέπει να στείλει ένα καφέ token στη διεύθυνση της μηχανής καφέ.",
  "Coffee beans delivery process:": "Διαδικασία παράδοσης κόκκων καφέ:",
  "Unlock new possibilities with this concept": "Ξεκλειδώστε νέες δυνατότητες με αυτή την έννοια",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Επιπλέον, μια τέτοια αυτοματοποιημένη μηχανή καφέ εισάγει διάφορες οικονομικές και κοινωνικές διαστάσεις. Ας τις ρίξουμε μια ματιά:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Οι προγραμματιστές μπορούν να καταθέτουν επιπλέον καφέ τόκενς όταν η κατανάλωση πέφτει κάτω από το όριο. Αυτό δημιουργεί ένα διαφανές σύστημα για ποικίλη χρήση καφέ εντός του ορίου.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "Η μηχανή καφέ θα μπορούσε να διατηρεί ένα κοινό λογαριασμό, επιτρέποντας στα μέλη του γραφείου να συνεισφέρουν κεφάλαια από τους προσωπικούς τους λογαριασμούς για μια πιο ποιοτική εμπειρία καφέ την επόμενη φορά.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Η ομάδα αποφασίζει συλλογικά την ποσότητα καφέ που θα παραγγείλει η μηχανή κάθε φορά μέσω ψηφοφορίας DAO. Αυτό παρέχει ελευθερία για να αντιμετωπίσει την πρόκληση με περιορισμένους πόρους.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Οι προγραμματιζόμενες διαδικασίες μειώνουν την επίδραση των ανθρώπινων παραγόντων και προσφέρουν μεγαλύτερη ευελιξία στην προσαρμογή των ρυθμίσεων γα συγκεκριμένες ομάδες.",
  "How we smarten up our coffee machine in real life": "Πώς εξυπναίνουμε την μηχανή καφέ μας στην πραγματική ζωή",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Για να αποκτήσουμε άμεσο έλεγχο της μηχανής καφέ, ενσωματώσαμε έναν υπολογιστή με μονό πίνακα, ειδικότερα το Raspberry Pi 4, μαζί με μια διαθέσιμη στην αγορά μηχανή καφέ που υποστήριζε σύνδεση GPIO. Η προτίμησή μας ήταν η",
  "selected for its affordability and the convenience of its easily removable front panel.": "επιλεγμένη για την προσιτότητά της και την ευκολία αφαίρεσης του μπροστινού πάνελ της.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Στη συνέχεια, δουλέψαμε τις λεπτομέρειες λειτουργίας, ειδικότερα όσον αφορά τα τόκεν που μπορούν οι χρήστες να στείλουν και τον υποκείμενο αλγόριθμο. Αυτό είναι το αποτέλεσμα:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Για να απολαύσουν ένα φλιτζάνι νόστιμου καφέ, οι χρήστες πρέπει να στείλουν ένα συγκεκριμένο ποσό κεφαλαίων (στην περίπτωσή μας, 1 τόκεν ACT του Statemine, id=3077) στη διεύθυνση της μηχανής καφέ από μια παραπομπή (Statemine). Στη συνέχεια, ξεκινά η διαδικασία ρίψης του καφέ και ακολουθείται από τη δημοσίευση ενός αρχείου καταγραφής ενεργειών στο",
  "the Robonomics Parachain portal": "το portal του Robonomics Parachain",
  "via the Datalog function": "μέσω της λειτουργίας Datalog",
  "When the concept extends beyond the office": "Όταν η έννοια επεκτείνεται πέρα από το γραφείο",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Αυτή η έννοια προσφέρει πολλές δυνατότητες για την επέκταση της ιδέας. Εφαρμόστηκε με επιτυχία στο Polkadot Web3 Hub κατά τη διάρκεια του Παγκοσμίου Οικονομικού Φόρουμ του 2022 στο Νταβός. Οι συμμετέχοντες μπόρεσαν να κάνουν παραγγελίες καφέ και να καθορίσουν τον επιθυμητό τύπο καφέ τους (π.χ. εσπρέσο, αμερικάνο, καπουτσίνο) αποστέλλοντας ένα συγκεκριμένο ποσό τόκεν. Ας μοιραστούμε φωτογραφίες και βίντεο από αυτήν την εκδήλωση:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Η μηχανή καφέ μας με την τεχνολογία blockchain που φτιάχνει καφέ στο Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "Φτιάξτε τη δική σας έξυπνη μηχανή καφέ blockchain",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Μπορείτε να βρείτε ένα λεπτομερές εγχειρίδιο και τεχνικές προδιαγραφές στο αποθετήριο GitHub ανοικτού κώδικα. Θυμηθείτε ότι μπορείτε να χρησιμοποιήσετε οποιαδήποτε μηχανή καφέ προτιμάτε και σχεδόν οποιοδήποτε τόκεν της επιλογής σας για να φέρετε αυτό το έργο στη ζωή στον δικό σας χώρο.",
  "Robonomics Ambassador Program": "Πρόγραμμα Πρεσβευτή του Robonomics",
  "Robonomics architecture": "Αρχιτεκτονική του Robonomics",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Στη συνέχεια θα θέλαμε να σας δείξουμε τους πρακτικούς τομείς αλληλεπίδρασης ανθρώπου-μηχανής χρησιμοποιώντας σύγχρονη τεχνολογία Internet. Θα μετακινηθούμε από την οικεία αρχιτεκτονική συσκευών IoT για την ανταλλαγή τεχνικών πληροφοριών μέσω υπηρεσιών cloud στον οργανισμό της τεχνικοοικονομικής αλληλεπίδρασης μέσω ενός αποκεντρωμένου, παγκοσμίως προσβάσιμου δικτύου παρόχων.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Για να ξεκινήσουμε, ρέπει να κάνουμε μια εκδρομή στον τομέα που σχετίζεται περισσότερο με τη δικτυακή σύνδεση αυτοματοποιημένων συστημάτων. Έπειτα, θα εξετάσουμε τις βασικές αρχές του Διαδικτύου των Πραγμάτων για να τονίσουμε τα προβλήματα και τις κύριες προκλήσεις που αντιμετωπίζουν οι δημιουργοί των συστημάτων IoT και στην επίλυση των οποίων στοχεύει το Robonomics.",
  "Overview of the state of the internet of things (IoT)": "Επισκόπηση της κατάστασης του Διαδικτύου των Πραγμάτων (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Το θέμα της προσβασιμότητας του δικτύου των αυτόματων συσκευών έχει συζητηθεί σε όλο τον πλανήτη από τη δεκαετία του '60 και ήδη τότε έγιναν αρκετές σοβαρές προσπάθειες για να το επιλσουν. Για παράδειγμα, ο σοβιετικός κυβερνητικός Βίκτορ Γκλούσκοφ πρότεινε και μερικώς υλοποίησε την αυτοματοποιημένη συλλογή πληροφοριών για τα όγκοι παραγωγής μιας μεμονωμένης εργοστασιακής μονάδας ως μέρος του σχεδιασμού του εθνικού συστήματος πληροφοριών OGAS στη δεκαετία του '60 και του '70. Είναι γνωστό πώς η αυτόματη μηχανή πώλησης της Coca-Cola συνδέθηκε με το ARPANET τη δεκαετία του 1980, έτσι ώστε οι μηχανές να μπορούν να αναφέρουν τη διαθεσιμότητα των ποτών και τη θερμοκρασία τους.",
  "OGAS": "Ωστόσο, η πραγματική ανάπτυξη του IoT συμβαίνει σήμερα, λόγω της ευρείας χρήσης των δυνατοτήτων που παρέχουν οι τεχνολογίες. Οι κύριοι κινητήριοι παράγοντες της γρήγορης εξέλιξης των εφαρμογών του Διαδικτύου των Πραγμάτων είναι τα αποτελέσματα της ανάπτυξης πολλών τομέων - από τις ασύρματες επικοινωνίες διάφορων εμβέλειών και των ενσωματωμένων συσκευών, μέχρι την ανάλυση στο cloud και την μηχανική μάθηση. Ο αριθμός των συσκευών IoT έχει αυξηθεί σταθερά τα τελευταία 10 χρόνια (με πρόβλεψη 25 δισεκατομμυρίων μονάδων έως το 2030), και αυτό έχει ενθαρρύνει τους ερευνητές και τους προγραμματιστές να δημιουργήσουν νέες εφαρμογές IoT σε διάφορους τομείς, όπως η υγεία, η αυτοματοποίηση του σπιτιού, η αγροτική επιχειρηματικότητα, η προστασία του περιβάλλοντος.",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "Ενδιαφερόμαστε περισσότερο για τη διαδικασία κατασκευής συστημάτων IoT και τα καθήκοντα που προκύπτουν σε αυτήν τη διαδικασία. Κατά τη διάρκεια των ετών έχουν προταθεί πολλές διαφορετικές αρχιτεκτονικές και με την ανασύνθεσή τους μπορούμε να διακρίνουμε τρεις βασικούς συστατικούς του συστήματος IoT: συσκευές, υποδομή δικτύου, αναλυτικές, υπολογιστικές και ελεγκτικές μηχανές.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Ενδιαφερόμαστε περισσότερο για τη διαδικασία κατασκευής συστημάτων IoT και τις εργασίες που προκύπτουν σε αυτήν τη διαδικασία. Κατά τα χρόνια έρευνας, έχουν προταθεί πολλές διαφορετικές αρχιτεκτονικές, και με τη μέη τιμή τους, μπορούμε να διακρίνουμε τρεις βασικούς συστατικούς του συστήματος IoT: συσκευές, υποδομή δικτύου, αναλυτικές, υπολογιστικές και ελεγκτικές μηχανές.",
  "New challenges": "Νέες προκλήσεις",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Μία άλλη πρόσφατη πρόκληση για την κατασκευή του IoT ήταν η έννοια του ψηφιακού διδίου - μία ψηφιακή έκδοση πραγματικού εξοπλισμού που αντιγράφει τις προδιαγραφές και τα ιστορικά δεδομένα του. Αυτή η έννοια είναι στο καλύτερό της σε περιοχές όπου είναι απαραίτητο να υπάρχει μία ακριβής και πλήρης προδιαγραφή ενός διαδικασίας και να είναι δυνατή η πρόβλεψη της εξέλιξής της. Το Διαδίκτυο των Πραγμάτων λειτουργεί ως ο κύριος ενοποιητής των ψηφιακών διδίων, αλλά αυτή η εργασία είναι πολύ πιο βαθιά από τη συνήθη συνδεσιμότητα των συσκευών IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Αυτή τη στιγμή παρατηρούμε έναν ολόκληρο τομέα του δικτύου, σχεδιασμένο και βολικό όχι για τους ανθρώπους, αλλά για τις μηχανές. Το Διαδίκτυο των Πραγμάτων δεν είναι πλέον απλά η μηχανική σύνδεσης μιας συσκευής στο δίκτυο, αλλά περισσότερες υπηρεσίες, δημιουργημένες και διαθέσιμες ειδικά για τις συσκευές. Το Διαδίκτυο των Πραγμάτων συνδέει όχι μόνο τον χρήστη και τη συσκευή, αλλά βοηθά επίσης τις συσκευές να αντιμετωπίσουν τις εργασίες παροχής υπηρεσίας για το άτομο, αλλά αυτόνομα.",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Η κύρια ιδέα που προσπάθησαν να μεταφέρουν οι συγγραφείς του Robonomics πριν από αυτό - είναι η φυσική, λογική και φαινομενικά αναπόφευκτη εξέλιξη από το τρέχον επίπεδο της οικονομίας σε λήρως αυτοματοποιημένες υπηρεσίες. Οι αυτοματοποιημένες υπηρεσίες θα πρέπει να έχουν τη δυνατότητα να μιλούν τη γλώσσα της ανθρώπινης οικονομίας και επίσης τη δική τους οικονομία των μηχανημάτων για να εκτελούν διάφορες λειτουργίες στον κόσμο γύρω τους με μια ταχύτητα που δεν είναι διαθέσιμη στους ανθρώπους.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Ωστόσο, η πραγματική ανάπτυξη του IoT συμβαίνει σήμερα, λόγω της ευρείας χρήσης των ενεργοποιητικών τεχνολογιών. Οι κύριοι κινητήρες της ταχείας εξέλιξης των εφαρμογών του Διαδικτύου των Πραγμάτων είναι τα αποτελέσματα της ανάπτυξης πολλών πεδίων - από ασύρματες επικοινωνίες διάφορων εμβέλειών και ενσωματωμένες συσκευές, έως αναλύσεις στο cloud και μηχανική μάθηση. Ο αριθμός των συσκευών IoT έχει αυξηθεί σταθερά τα τελευταία 10 χρόια (με πρόβλεψη 25 δισεκατομμυρίων μονάδων έως το 2030), και αυτό έχει ενθαρρύνει τους ερευνητές και τους προγραμματιστές να δημιουργήσουν νέες εφαρμογές IoT σε διάφορους τομείς όπως η υγεία, η αυτοματοποίηση του σπιτιού, η γεωργία, η προστασία του περιβάλλοντος.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Η ανάπτυξη και η εφαρμογή του Διαδικτύου των Πραγμάτων έχει δείξει ότι η επίλυση τυπικών προβλημάτων δεν είναι αρκετή. Εμφανίστηκαν εντελώς νέες έννοιες και αρχές, βασισμένες σε προηγούμενα λάθη και εντοπισμένα ελλείμματα, μέχρι τη σημερινή ημέρα. Αυτή η βολική προσέγγιση της χρήσης υπηρεσιών στο cloud αποδείχθηκε ότι έχει ορισμένα κρίσιμα ελλείμματα που σχετίζονται με την κλιμακωσιμότητα, την ιδιωτικότητα και την ασφάλεια. Στην προσπάθεια επίλυσης αυτών των προβλημάτων, προτάθηκε η εγγύτητα της επεξεργασίας δεδομένων, της λογικής και του υπολογισμού στον άμεσο χώρο όπου χρησιμοποιούνται. Έτσι, εμφανίστηκαν οι έννοιες του ομίχλης και του edge computing, με ενδιάμεσα συστήματα μεταξύ του cloud και των συσκευών που αναλαμβάνουν μερικές από τις λειτουργίες του cloud. Έτσι, η δημιουργία συστημάτων edge έχει γίνει ένα από τα νέα προβλήματα της κατασκευής του Διαδικτύου των Πραγμάτων.",
  "Classification of IoT devices": "Κατηγοριοποίηση των συσκευών IoT",
  "Embedded iot systems": "Ενσωματωμένα συστήματα IoT",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Τέτοια συστήματα δεν έχουν διεπαφές χρήστη και συνήθως χρησιμοποιούνται στο χαμηλότερο επίπεδο των οικοσυστημάτων IoT για να παρέχουν βασική λειτουργικότητα. Πρέπει να είναι ενεργειακά αποδοτικά και μικρά. Έχουν περιορισμένους υπολογιστικούς και επικοινωνιακούς πόρους. Οι πύλες ή ελεγκές IoT συνήθως λειτουργούν ως δέκτες σήματος.",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: IoT πύλες και ελεγκτές",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Αυτά τα συστήματα λειτουργούν ως σύνδεσμος μεταξύ των τοπικά προσβάσιμων ενσωματωμένων συστημάτων και του παγκόσμιου Διαδικτύου. Συνήθως υποστηρίζον πολλά πρωτόκολλα επικοινωνίας ενσωματωμένων συστημάτων και μεταφέρουν τηλεμετρία από συσκευές στον νέφος και ελέγχουν αντίστροφα τα σήματα. Συχνά αυτές οι συσκευές είναι μια πιο εξελιγμένη έκδοση του ασύρματου δρομολογητή WiFi, εξοπλισμένη με έναν μονοπλακέ υπολογιστή για την πρωταρχική επεξεργασία πληροφοριών από συσκευές χωρίς να αποχωρεί από το τοπικό δίκτυο.",
  "Autonomous systems": "Αυτόνομα συστήματα",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Αυτή η κατηγορία περιλαμβάνει πολύπλοκα αυτόματα συστήματα (όπως το Spot από την Boston Dynamics), τα οποία διαθέτουν έναν ελεγκτικό στοιχείο στο επίπεδο ενός πλήρους υπολογιστή με έναν επεξεργαστή υψηλής απόδοσης και μεγάλη ποσότητα μνήμης. Σε τέτοιες περιπτώσεις, ο ρομπότ συνδέεται στο Διαδίκτυο χωρίς πρόσθετες ενδιάμεσες λύσεις (edge-systems). Το απαραίτητο λογισμικό για την πρόσβαση στο Διαδίκτυο των Πραγμάτων εγκαθίσταται απευθείας στον υπολογιστή του αυτόνομου συστήματος. Τα δεδομένα συλλέγονται και επεξεργάζονται εν μέρει τοπικά, και στη συνέχεια μεταδίδονται στο Διαδίκτυο όπως οποιαδήποτε πλήρης συσκευή δικτύου.",
  "Internet of Things providers": "Πάροχοι Internet of Things",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Ο κύριος ρόλος των παρόχων IoT είναι να παρέχουν στους χρήστες απομακρυσμένη πρόσβαση σε δεδομένα και αναλύσεις, καθώς και διαχείριση έξυπνων συσκευών μέσω του Δαδικτύου. Τα κύρια κριτήρια για την ποιότητα του παρόχου είναι η ασφάλεια των λειτουργιών, η σταθερότητα της σύνδεσης και η διαθεσιμότητα του παρόχου από οπουδήποτε στον κόσμο.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Το πρότυπο σχήμα για την εργασία με έναν πάροχο IoT περιλαμβάνει: την εγκατάσταση λογισμικού συμβατού με την έξυπνη συσκευή στο cloud, τη ρύθμιση υπηρεσιών διαχείρισης από την πλευρά του cloud μετά την πρώτη επιτυχημένη σύνδεση μιας συσκευής, τη σύνδεση διάφορων ειδών αναλυτικών υπηρεσιών.",
  "Digital twins are the heart of the internet of things": "Οι ψηφιακοί δίδυμοι είναι η καρδιά του Internet of Things",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Ομιλώντας για τους ψηφιακούς δίδυμους, πρέπει να σημειωθεί ότι αρχιτεκτονικά απαιτείται η υλοποίησή τους· ως απόρριψη της παροχής άμεσης πρόσβασης του χρήστη για τον έλεγχο των συσκευών και την αλλαγή των καταστάσεών τους. Από τους πιο προφανείς λόγους απόρριψης είναι, πρώτον, η παρουσία των δικών τους απαιτήσεων και συνθηκών στις συσκευές λίγο πριν την εκκίνηση. Δεύτερον, εάν πολλές συσκευές χρηστών πρέπει να έχουν πρόσβαση σε έναν μόνο πηγή δεδομένων, η παροχή εξατομικευμένου ελέγχου σε κάθε χρήστη μπορεί να είναι κρίσιμη. Τέλος, είναι εξαιρετικά χρήσιμο να διατηρείται η τελευταία πραγματική κατάσταση της συσκευής διαθέσιμη σε περίπτωση που παύσει να λειτουργεί.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Ως αποτέλεσμα, έχουμε μια διάκριση του κύκλου ανταλλαγής πληροφοριών με τον χρήστη και την πραγματική δημιουργία πραγματικών δεδομένων από τους αισθητήρες. Για να εικονογραφήσουμε αυτήν την αρχή, παρακάτω παρουσιάζεται η διαδικασία του χρήστη που χρησιμοποιεί μια συσκευή IoT χρησιμοποιώντας έναν ψηφιακό δίδυμο.",
  "IoT data flows in cloud services": "Τα δεδομένα IoT ρέουν σε υπηρεσίες cloud",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Τιμές εισόδου για cloud triggers. Για παράδειγμα, η υπηρεσία cloud στέλνει διάφορες ειδοποιήσεις στον χρήστη σε περίπτωση αναφοράς από έναν αισθητήρα συναγερμού αυτοκινήτου για απεργία.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Δεδομένα εξόδου για πολύπλοκη αναλυτική που δεν μπορεί να παραχθεί στο επίπεδο της άκρης. Για παράδειγμα, κατά την επεξεργασία βίντεο για αναγνώριση προσώπου σε πλήθος.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Η βάση για τον δημιουργία ενός ψηφιακού διδύμου της συσκευής για τη δημιουργία ενός αποτυπώματος της κατάστασής της. Για παράδειγμα, κατά το αίτημα του χρήστη στην κινητή εφαρμογή ή στον ιστότοπο.",
  "Popular examples of IoT solutions": "Δημοφιλείς παραδείγματα λύσεων IoT",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Ένα τυπικό σύστημα έξυπνου σπιτιού παρέχει μια ευρεία γκάμα επιλογών για τον έλεγχο του χώρου διαβίωσής σας. Με τη βοήθειά του μπορείτε να ελέγχετε απομακρυσμένα τα κλειδαριές των πορτών, να ρυθμίζετε μια φορά ή τακτική πρόσβαση στο δωμάτιο ως οικογένεια και φίλοι, καθώς και για το προσωπικό συντήρησης ή παράδοσης. Με τους πολλαπλούς αισθητήρες και τις συσκευές καταγραφής, το σύστημα είναι σε θέση να περιλαμβάνει την εγγραφή βίντεο όταν ενεργοποιούνται οι αισθητήρες κίνησης, να παίρνει αυτόνομες αποφάσεις για να κλείνει την παροχή νερού όταν ανιχνεύεται διαρροή στο σύστημα ύδρευσης, να ξεκινά ένα προγραμματισμένο ρομπότ ηλεκτρικής σκούπας, παρέχοντας ένα αναφορά καθαρισμού στην εφαρμογή χρήστη, να αλλάζει τη θερμοκρασία του δωματίου στην βέλτιστη τιμή ανάλογα με το πρόγραμμά σας.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Έξυπνα αυτοκίνητα. Παρέχοντας στην ενσωματωμένη ηλεκτρονική του αυτοκινήτου πρόσβαση στο κινητό Διαδίκτυο, ο χρήστης έχει πρόσβαση στον απομακρυσμένο έλεγχο διάφορων λειτουργιών του αυτοκινήτου απευθείας από το smartphone του: ανοίγοντας τις πόρτες, ενεργοποιώντας τον κλιματιστικό, ελέγχοντας τα φώτα. Εάν τέτοια αυτοκίνητα χρησιμοποιούνται για carsharing, τότε μπορείτε να δημιουργήσετε μια διαδραστική χάρτη της τοποθεσίας των αυτοκινήτων με την κατάστασή τους, το υπόλοιπο καύσιμο κ.λπ. για τους πελάτες αυτής της υπηρεσίας.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Έξυπνο σύστημα ενοικίασης εξοπλισμού. Η εταιρεία εγκαθιστά ρομποτικούς μανιπουλατόρ στη γραμμή παραγωγής σύμφωνα με συμβόλαιο με πληρωμή για τον αριθμό των εργασιών ή για το χρόνο του ρομπότ. Οι μανιπουλατόρ παρέχουν τακτικά ένα αρχείο με τις εκτελεσμένες εργασίες, τα σφάλματα και τις προειδοποιήσεις. Το ενοίκιο ου ρομπότ υπολογίζεται με βάση αυτό, καθώς και την προληπτική συντήρηση των ρομπότ από τον προμηθευτή.",
  "Current problems of building IoT solutions": "Τρέχοντα προβλήματα κατασκευής λύσεων IoT",
  "Global availability": "Παγκόσμια διαθεσιμότητα",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Η τυπική αρχιτεκτονική πελάτη-εξυπηρετητή απαιτεί την καθορισμό των σημείων προορισμού κατά την δρομολόγηση μηνυμάτων από συσκευές IoT. Έτσι, κατά τη διάρκεια της ζωής μιας έξυπνης συσκευής, η έλλειψη σύνδεσης θα σημαίνει περιορισμό στη δυνατότητα έλεγχου και αλληλεπίδρασης με τη συσκευή.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Για παράδειγμα, ο εμπορικός πόλεμος μεταξύ Κίνας και Ηνωμένων Πολιτειών αποτελεί ήδη μια σπαθί του Δαμοκλέους που κρέμεται πάνω από χιλιάδες καταναλωτές κινέζικων έξυπνων συσκευών στις Ηνωμένες Πολιτείες και αντιστρόφως. Οποιαδήποτε στιγμή, ο αποκλεισμός των διακομιστών της Xiaomi από τις αρχές των Ηνωμένων Πολιτειών μπορεί να επηρεάσει τους χρήστες των συσκευών που συνδέονται στις υπηρεσίες νέφους του κατασκευαστή.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Βρίσκοντας στην άμεση γειτνίαση μιας συσκευής IoT, δεν μπορείτε να την ελέγξετε από μια κινητή εφαρμογή αν δεν υπάρχει σύνδεση με τους διακομιστές, μέσω των οποίων παρέχεται η πιστοποίηση του χρήστη και η συλλογή τηλεμετρίας από τις ίδιες τις συσκευές. Δηλαδή, η συσκευή ελέγχεται πραγματικά από το νέφος, όχι από τον χρήστη.",
  "Cybersecurity": "Κυβερνοασφάλεια",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Ο πιο σημαντικός λόγος για την χαμηλή κυβερνοασφάλεια των περισσότερων λύσεων IoT πηγάζει από την προβληματική κληρονομιά της αρχιτεκτονικής πελάτη-εξυπηρετητή του νέφους. Για παράδειγμα, η πιο συνηθισμένη αρχιτεκτονική έξυπνου σπιτιού αυτή τη στιγμή είναι συνήθως ένα IoT κέντρο, συνδεδεμένο με ένα νέφος υπηρεσίας. Έτσι, ένα τυπικό σύστημα IoT είναι ένα κεντρικό στοιχείο ελέγχου που συνδέεται με πολλά εξωτερικά συστήματα. Σίγουρα, η υπηρεσία νέφους είναι πιο ασφαλής από τις συσκευές χαμηλού επιπέδου, αλλά η συγκέντρωση κεντρικού ελέγχου άνω από εκατοντάδες χιλιάδες τέτοια συστήματα καθιστά οποιαδήποτε παραβίαση ασφάλειας και διαρροή μαζική καταστροφή.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Οι διακομιστές της υπηρεσίας νέφους υπόκεινται σε όλα τα τυπικά προβλήματα κυβερνοασφάλειας: επιθέσεις δικτύου, επιθέσεις DoS (οδηγώντας το σύστημα σε αποτυχία), κακόβουλες τροποποιήσεις, απαγωγή συνεδρίας χρήστη κ.λπ. Ωστόσο, ισχυρές απειλές περιλαμβάνουν επίσης ακούσια προβλήματα όπως σφάλματα σχεδίασης, κατάχρηση ή φυσικές καταστροφές που προκαλούν αποτυχία των διακομιστών. Επίσης, ένα άλλο οριστικά σημαντικό σημείο είναι η ανάγκη αρχικά να εμπιστευτείτε το νέφος και τους ανθρώπους που το διαχειρίζονται.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Όλα αυτά επιδεινώνονται από την κλίμακα των λύσεων IoT. Ο αριθμός των συστημάτων IoT. Σίγουρα, η υπηρεσία νέφος είναι πιο ασφαλής από τις συσκευές χαμηλού επιπέδου, αλλά η συγκέντρωση κεντρικού ελέγχου πάνω από εκατοντάδες χιλιάδες τέτοια συστήματα καθιστά οποιαδήποτε παραβίαση ασφάλειας και διαρροή μαζική καταστροφή.",
  "Data privacy": "Απορρήτου δεδομένων",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Το θέμα της απορρήτου πρέπει να χωριστεί από την κυβερνοασφάλεια, επειδή αυτό το πρόβλημα είναι ειδικό για τα συστήματα IoT. Λόγω του μεγάλου αριθμού και των διάφορων τύπων συσκευών που είναι πολύ περισσότερο ενσωματωμένες στο φυσικό κόσμο από απλούς υπολογιστές και smartphones, οι τύποι ιδιωτικών δεδομένων πολλαπλασιάζονται. Δεν πρόκειται πλέον μόνο για τοποθεσία GPS, αγορές, οικονομικές συναλλαγές και φωτογραφίες, αλλά και για μόνιμη εγγραφή βίντεο και συνομιλιών, φωνητικά αποτυπώματα, καταστάσεις υγείας και ακόμα και μια λίστα με τις συνήθειες ενός ατόμου. Ανάμεσα στους τύπους απειλών που σχετίζονται με την απορρήτου είναι: αναγνώριση πληροφοριών, εντοπισμός και παρακολούθηση, προφίλινγκ, επίθεση απόθεμα, επίθεση σύνδεσης δεδομένων.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "Το πιο ανατριχιαστικό μέρος είναι ότι οι χρήστες έχουν ελάχιστη ή καμία ενημέρωση ότι παραχωρούν την απορρήτου τους επειδή έχουν σχεδόν καμία ιδέα για τα δεδομέν που συλλέγονται και πώς χρησιμοποιούνται. Η απειλή για την απορρήτου αυξάνεται όχι μόνο από εισβολείς, αλλά και από οργανισμούς και κυβερνητικές υπηρεσίες ακριβώς για αυτόν τον λόγο. Οι υπηρεσίες cloud IoT απαιτούν συνήθως μέγιστη μεταφορά δεδομένων από τις συσκευές και δεν υπάρχουν τρόποι για να απαγορευτεί ή να περιοριστεί η μεταφορά δεδομένων («Αποδοχή των Όρων ή Παραίτηση»). Επιπλέον, παρά το γεγονός ότι τα συλλεγόμενα δεδομένα είναι ένα περιουσιακό στοιχείο και έχει πραγματική αξία, ο ίδιος ο άνθρωπος από τον οποίο συλλέγονται τα δεδομένα δεν μόνο ότι του αρνείται το δικαίωμα να διαθέτει ενεργά αυτά τα δεδομένα, αλλά του αρνείται ακόμα και οποιαδήποτε αποζημίωση για τη συλλογή και χρήση των δικών του δεδομένων.",
  "\"Main tasks of robonomics architecture": "\"Κύριες εργασίες της αρχιτεκτονικής του ρομπονομικούς",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Επωφελούμενοι από τις επιτεύξεις και τις προκλήσεις των πλατφορμών νέφους, οι ρομπονομικοί στόχος είναι να προσφέρουν στην αγορά του IoT πιο ασφαλείς και προηγμένες λύσεις διαδικτύου σε κάθε στάδιο της ανθρώπινης-μηχανής επικοινωνίας. Παρακάτω παρουσιάζονται οι κύριες εργασίες στις οποίες απευθύνεται ο ρομπονομικοί:",
  "Managing an IoT device using a decentralized cloud": "Διαχείριση μιας συσκευής IoT χρησιμοποιώντας ένα αποκεντρωμένο νέφος",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Οι αλυσίδες μπλοκ έχουν όλες τις δυνατότητες να παρέχουν το υψηλότερο επίπεδο ασφάλειας για την λειτουργία μιας συσκευής και τη λήψη τηλεμετρίας της. Η αλληλεπίδραση με τη συσκευή μπορεί πραγματικά να περιγραφεί αλλάζοντας την κατάσταση του ψηφιακού διδίου που αποθηκεύεται στο δίκτυο των αλυσίδων μπλοκ και αποστέλλοντας πληροφορίες σχετικά με αυτές τις αλλαγές. Στην περίπτωση μιας άδειας αλυσίδας μπλοκ, μπορούμε να μιλήσουμε για τις εγγυήσεις της παγκόσμιας διαθεσιμότητας των παρόχων για το IoT, καθώς και για ένα υψηλό επίπεδο προστασίας των δεδομένων του ψηφιακού διδίου από ανεπιθύμητες αλλαγές.",
  "Performing technical and economic transaction between people and machines": "Εκτέλεση τεχνικών και οικονομικών συναλλαγών μεταξύ ανθρώπων και μηχανών",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Χάρη στον μηχανισμό των κρυπτονομισμάτων και των έξυπνων συμβολαίων, μπορούμε να παρέχουμε πρόσβαση σε αυτοματοποιημένα συστήματα απευθείας στις ψηφιακές αγορές. Για παράδειγμα, η Ethereum ήδη υλοποιεί τα περισσότερα από τα βασικά εργαλεία οικονομικής δραστηριότητας που μπορούν να χρησιμοποιηθούν στη λειτουργία αυτόνομων συσκευών. Οι εφαρμογές που δημιουργούνται για την αλληλεπίδραση μεταξύ του τελικού χρήστη και της συσκευής IoT θα είναι πολύ πιο αποτελεσματικές εάν οι όροι της υπηρεσίας και η πληρωμή για αυτήν είναι αναπόσπαστα υνδεδεμένοι με τις παραμέτρους εκκίνησης της συσκευής.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Οι σύγχρονες εξελίξεις στην τεχνολογία Web3 μπορούν να λύσουν το ζήτημα της ιδιωτικότητας των χρηστών. Με το Web3 δεν χρειάζεται πια να γίνεται πιστοποίηση ταυτότητας ή να απαιτείται σύνδεση σε συγκεκριμένους διακομιστές για να αποκτηθεί πρόσβαση στην τηλεμετρία και τον έλεγχο της συσκευής.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Οι ρομπονομικοί είναι ένα αποκεντρωμένο νέφος για τα ψηφιακά δίδυμα των συσκευών IoT. Οι ρομπονομικοί υποστηρίζουν την τεχνο-οικονομική μορφή επικοινωνίας, καθώς και παρέχουν ιδιωτικές εφαρμογές για τους χρήστες",
  "Basic components of Robonomics architecture": "Βασικά στοιχεία της αρχιτεκτονικής του Robonomics",
  "A human interface to access the system": "Μια ανθρώπινη διεπαφή για πρόσβαση στο σύστημα",
  "A communication protocol": "Ένα πρωτόκολλο επικοινωνίας",
  "A machine interface": "Μια μηχανική διεπαφή",
  "Human interface": "Ανθρώπινη διεπαφή",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Προτείνουμε τη χρήση αποκεντρωμένων εφαρμογών (dapps) ως τον κύριο τρόπο σύνδεσης των χρηστών για τον έλεγχο έξυπνων συσκευών μέσω του Διαδικτύου. Έτσι, θα είμαστε σε θέση να παρέχουμε την πιο ασφαλή (σε όρους δεδομένων) διεπαφή χρήστη στο σύστημα, η οποία θα μπορεί να λειτουργεί ταυτόχρονα στις συνθήκες του τοπικού δικτύου της πόλης και μέσω ενός κοινού παγκόσμιου δικτύου.",
  "Communication protocol": "Πρωτόκολλο επικοινωνίας",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Το ρόλο του παίζει ο δικτυακός τόπος του Robonomics, μια προδιαγραφή που αναπτύχθηκε από την ομάδα του έργου και υλοποιεί ένα αποκεντρωμένο δίκτυο παρόχων που παρέχουν τη μετάδοση, επεξεργασία και αποθήκευση των πληροφοριών που απαιτούνται για τη λειτουργία των συσκευών IoT. Στην πραγματικότητα, αποτελεί μια υλοποίηση ενός κόμβου με συγκεκριμένη λειτουργί για τα δίκτυα IPFS, Ethereum και Polkadot.",
  "Machine interface": "Μηχανική διεπαφή",
  "A simple representation of Robonomics architecture": "Μια απλή αναπαράσταση της αρχιτεκτονικής του Robonomics",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Εδώ υπάρχει ένα γενικό διάγραμμα του πλήρους κύκλου εκκίνησης της συσκευής χρησιμοποιώντας την πλατφόρμα Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "Η αποκεντρωμένη εφαρμογή του χρήστη αποστέλλει ένα αίτημα για μια λειτουργία έλεγχου συσκευής μέσω του δικτύου Robonomics.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "Το δίκτυο Robonomics παρέχει μετάφραση του αιτήματος χρησιμοποιώντας το libP2P και καταγράφει τα γεγονότα στο Ethereum blockchain ή στο Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Ο έλεγχος της συσκευής παρέχεται από ένα αποκεντρωμένο δίκτυο, το οποίο εγγυάται την αποθήκευση των απαραίτητων πληροφοριών για τη λειτουργία της συσκευής IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "Η συσκευή IoT λαμβάνει ανεξάρτητα πληροφορίες από τα δίκτυα Ethereum και Polkadot σχετικά με την τρέχουσα κατάσταση του ψηφιακού διδίου. Αυτό εξασφαλίζει ότι η συσκευή μπορεί να ξεκινήσει με ασφάλεια μόνο όταν έχουν επιλυθεί οι τεχνικές και οικονομικές παράμετροι εκκίνησης.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Ως αποτέλεσμα της λειτουργίας, η συσκευή IoT δημοσιεύει ένα αρχείο καταγραφής των ολοκληρωμένων λειτουργιών, το οποίο μπορεί να χρησιμοποιηθεί ως απόδειξη της παρεχόμενης υπηρεσίας ή για την εντοπισμό σφαλμάτων.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Η καταγραφή μετατρέπεται σε έκθεση για τον χρήστη και γίνεται διαθέσιμη στην εφαρμογή του.",
  "No posts yet": "Δεν υπάρχουν ακόμα αναρτήσεις",
  "If you want to help us with translation": "Εάν θέλετε να μας βοηθήσετε με τη μετάφραση",
  "contact us at": "επικοινωνήστε μαζί μας στο",
  "send": "στείλτε",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Κτίριο Dapps && Υπηρεσίες ΙοΤ στο Robonomics Parachain",
  "Sergei Lonshakov, software architect": "Σεργκέι Λονσάκοφ, αρχιτέκτονας λογισμικού",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Ας θυμηθούμε ότι η αυτόματη μηχανή είναι η ακριβής οικονομική ισοδύναμη της σκλαβικής εργασίας. Κάθε εργασία που ανταγωνίζεται τη σκλαβική εργασία πρέπει να αποδεχθεί τις οικονομικές συνέπειες της σκλαβικής εργασίας.",
  "Norbert Wiener": "Νόρμπερτ Γουίνερ",
  "cybernetics": "κυβερνοβιολογία",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Οι ρομπότ είναι σαν ενήλικα παιδιά σήμερα - ήδη μπορούν να διαχειρίζονται χρήματα και να συνάπτουν νομικές σχέσεις, να είναι ανεξάρτητα.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Το μέλλον της ανθρωπότητας εξαρτάται από τον τρόπο που διδάσκουμε τα ρομπότ να διαχειρίζονται τις δυνατότητές τους.",
  "What is Robonomics network?": "Τι είναι το δίκτυο Robonomics;",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Το Robonomics είναι μια πλατφόρμα ανοιχτού κώδικα για εφαρμογές ΙοΤ που επιτρέπει την ανταλλαγή τεχνικών και οικονομικών πληροφοριών σε μορφή ατομικών συναλλαγών μεταξύ εφαρμογών χρηστών, υπηρεσιών ΙοΤ και πολύπλοκων ρομποτικών.",
  "Robonomics tools": "Εργαλεία Robonomics",
  "Operate with digital twins of IoT devices": "Λειτουργήστε με ψηφιακά αντίγραφα συσκευών ΙοΤ",
  "The first tools of the robot economy: money for robots, contracts for robots": "Τα πρώτα εργαλεία της οικονομίας των ρομπότ: χρήματα για ρομπότ, συμβόλαια για ρομπότ",
  "Software for connecting devices to a decentralized cloud": "Λογισμικό για τη σύνδεση συσκευών με ένα αποκεντρωμένο νέφος",
  "API library for custom IoT applications": "Βιβλιοθήκη API για προσαρμοσμένες εφαρμογές ΙοΤ",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Το Robonomics περιλαμβάνει ένα πλήρες σύνολο εργαλείων για την ανάπτυξη εφαρμογών ΙοΤ, τόσο στον τομέα της ρομποτικής όσο και στον τομέα της διεπαφής χρήστη. Η επικοινωνία μεταξύ χρήστη και συσκευής γίνεται χρησιμοποιώντας τις πιο επιτυχημένες τεχνολογίες από τον κόσμο του Web3 - IPFS, Ethereum και Polkadot. Έτσι, οι προγραμματιστές μπορούν να δημιουργήσουν σύγχρονες και ασφαλείς εφαρμογές για Έξυπνες Πόλεις και Βιομηχανία 4.0.",
  "Robonomics Connectivity": "Συνδεσιμότητα Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Για την ευκολία των προγραμματιστών, το Robonomics περιέχει ένα σύνολο λογισμικού για τη σύνδεση: συσκευών IoT χρησιμοποιώντας το πρωτόκολλο HTTP/MQTT, πολύπλοκων ρομποτικών συστημάτων χρησιμοποιώντας το Λειτουργικό Σύστημα Ρομπότ (ROS).",
  "Connect a sensor": "Συνδέστε έναν αισθητήρα",
  "to the Robonomics network": "στο δίκτυο Robonomics",
  "Try": "Δοκιμάστε",
  "Robonomics IO": "Robonomics IO",
  "a simple prototyping tool": "ένα απλό εργαλείο πρωτοτυπίας",
  "Start building your own cyber physical system with": "Ξεκινήστε να δημιουργείτε το δικό σας κυβερνο-φυσικό σύστημα με το",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Το Robonomics υποστηρίζει εκατοντάδες ρομπότ από το κουτί",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Οι χρήστες της πλατφόρμας μπορούν να συνδέσουν ρομπότ συμβατά με το ROS στην ψηφιακή οικονομία σε λίγα λεπτά. Για μια πλήρη λίστα των υποστηριζόμενων ρομπότ, παρακαλούμε ακολουθήστε τον σύνδεσμο",
  "Decentralized Cloud infrastructure for IoT": "Αποκεντρωμένο υποδομή νέφους για το IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Οι Υπηρεσίες Ιστού Robonomics (RWS) είναι ο βασικός υποδομητικός χώρος για τη ρομποτική και το IoT πάνω από το Robonomics Parachain και το IPFS",
  "Robonomics web services (RWS)": "Υπηρεσίες ιστού Robonomics (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "οικονομία των ρομπότ",
  "Core RWS features available for IoT today": "Βασικά αρακτηριστικά RWS διαθέσιμα για το IoT σήμερα",
  "RWS PubSub Message Broker": "Μεσίτης μηνυμάτων RWS PubSub",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Χρησιμοποιήστε απεριόριστη ανταλλαγή μηνυμάτων μέσω ενός δικτύου P2P βασισμένου στο πρωτόκολλο IPFS",
  "RWS Data Blockchainization Service": "Υπηρεσία Εξασφάλισης Δεδομένων RWS",
  "Put data into IPFS and store hashes in a public Blockchain": "Τοποθετήστε δεδομένα στο IPFS και αποθηκεύστε τις κατακερματισμένες τιμές σε ένα δημόσιο Blockchain",
  "RWS Robot Actions": "Ρομποτικές Ενέργειες RWS",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Ενεργοποίηση / απενεργοποίηση, εκκίνηση ή διακοπή των συσκευών IoT σας υπό τον έλεγχο ενός αποκεντρωμένου υπολογιστή",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Καρδιά της εφαρμογής IoT σας - Ψηφιακό Δίδυμο στο Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Στην τεχνική αρχιτεκτονική, τα ψηφιακά δίδυμα IoT παρέχουν την ορατότητα και την παρακολούθηση των πραγμάτων και των σχετικών γεγονότων (π.χ. χρησιμοποιώντας συσκευές IoT για την αυτόματη καταγραφή της προέλευσης ενός προϊόντος), και το blockchain επιτρέπει την κοινή μοναδική έκδοση της αλήθειας όσον αφορά την κατάσταση αυτών των πραγμάτων κατά τη διάρκεια των κύκλων ζωής τους και των σχετικών επιχειρηματικών γεγονότων",
  "from Gartner research": "από την έρευνα Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Το Robonomics Parachain παρέχει τη δυνατότητα δημιουργίας μοντέλου ενός ψηφιακού διδύμου και ενημέρωσης της κατάστασής του κάθε 6 δευτερόλεπτα.",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Εδώ, έχουμε συγκεντρώσει μια συλλογή από NFTs που έχουν δημιουργηθεί κατά τη διάρκεια του εκτεταμένου κρυπτονομισματικού μας ταξιδιού, τόσο ανεξάρτητα όσο και με εξαιρετιές ομάδες. Αυτά τα μοναδικά τοκεν προσφέρουν επαληθεύσιμη ιδιοκτησία στο blockchain και αποτελούν εξαιρετικά αξεσουάρ για να διακοσμήσετε τον λογαριασμό σας στο blockchain. Μπορείτε να προσφέρετε σε κάποια από αυτά σε δημοπρασία ή ακόμα και να δημιουργήσετε το δικό σας μοναδικό κομμάτι.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Κατά τη διάρκεια της αρχικής μας καμπάνιας crowdloan στο Kusama, πήραμε την απόφαση να ανταμείψουμε τους συνεισφέροντες των κρυπτονομισματικών πρωτοπόρων μας με περισσότερα από απλά τοκεν - τους χαρίσαμε επίσης ένα πολύχρωμο NFT. Αυτή η κάρτα έχει μεγάλη σημασία για εμάς και αν κάποιος την κατέχει, ξέρουμε ότι είναι ένας φανταστικός υποστηρικτής των αξιών του Robonomics: ελευθερία και αποκεντρωμένη διακυβέρνηση.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Είμαστε ενθουσιασμένοι να σας παρουσιάσουμε την ειδική σειρά ψηφιακών περιουσιακών στοιχείων - Robonomics Crypto Girls, που δημιουργήθηκε από την ομάδα Robonomics Art&Science. Κάθε NFT σε αυτή τη συλλογή είναι μια μοναδική γραφική αναπαράσταση της τεχνολογίας που χρησιμοποιείται στο Robonomics ή που έχει χτιστεί πάνω από περιπτώσεις χρήσης του Robonomics. Οι ταλαντούχοι καλλιτέχνες μας έχουν σχεδιάσει κάθε κορίτσι με το χαρακτηριστικό στυλ του Robonomics. Μπορείτε να επιλέξετε αυτό που σας αντικατοπτρίζει ή να συλλέξετε ολόκληρη τη σειρά! Αγοράζοντας αυτά τα NFTs, δεν προσθέτετε μόνο ένα στιλάτο στοιχείο στη συλλογή σας, αλλά μας υποστηρίζετε και στη συνέχιση της καινοτομίας και της εφαρμογής της αποκεντρωμένης συνδεσιμότητας για ρομπότ. Μείνετε συντονισμένοι για νέες πρσθήκες στη συλλογή!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. ΣΥΛΛΟΓΕΣ NFT ΕΠΟΧΙΑΚΩΝ ΣΗΜΕΙΩΝ",
  "On demand minting": "Δημιουργία κατά παραγγελία",
  "SEASONAL SPOT NFT COLLECTIONS": "ΣΥΛΛΟΓΕΣ NFT ΕΠΟΧΙΑΚΩΝ ΣΗΜΕΙΩΝ",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Αυτές οι εποχιακές συλλογές NFT αντιπροσωπεύουν ένα μοναδικό ψηφιακό περιουσιακό στοχείο που αποτυπώνει τη μοναδική αλληλεπίδραση μεταξύ του χρήστη και του Spot εντός του Robonomics parachain. Οι χρήστες μπορούν να σχεδιάσουν οτιδήποτε στον περιηγητή και ο ρομπότ θα αναπαράγει τις κινήσεις τους για να δημιουργήσει μια χειροποίητη εικόνα. Αφού ολοκληρωθεί η αλληλεπίδραση, το NFT δημιουργείται στην αγορά Singular για τον λογαριασμό του χρήστη στο Polkadot. Τώρα, οποιοσδήποτε μπορεί να αλληλεπιδράσει με ένα ρομπότ στην πραγματική ζωή που βρίσκεται σε ένα εργαστήριο στην Καλιφόρνια για να δημιουργήσει εξατομικευμένα και μοναδικά ψηφιακά περιουσιακά στοιχεία που μπορούν να ανήκουν, να αγοραστούν και να πωληθούν όπως οποιοδήποτε άλλο ψηφιακό περιουσιακό στοιχείο.",
  "Create your NFT": "Δημιουργήστε το NFT σας",
  "4. automated telescope collection": "4. συλλογή αυτόματου τηλεσκοπίου",
  "automated telescope collection": "συλλογή αυτόματου τηλεσκοπίου",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Στην έρημο Atacama της Χιλής, ένα φυσικό τηλεσκόπιο μπορεί να προσεγγιστεί μέσω μιας αποκεντρωμένης εφαρμογής για τη λήψη εικόνων σε πραγματικό χρόνο αστρονομικών αντικειμένων στο βαθύ διάστημα. Κάθε χρήστης με σύνδεση στο διαδίκτυο μπορεί να το προσεγγίσει με τα κέρματα $STRGZN, τα οποία είναι διαθέσιμα για αγορά στην εφαρμογή χρησιμοποιώντας πιστωτική κάρτα. Επιλέξτε ένα αστρονομικό αντικείμενο, στείλτε μια εντολή στο τηλεσκόπιο για να πάρει μια φωτογραφία και περιμένετε το NFT που δημιουργήθηκε στην πλατφόρμα Singular. Σημειώστε ότι η εφαρμογή είναι διαθέσιμη μόνο για χρήση από τις 11 μ.μ. έως τις 6 π.μ. GMT-3 λόγω των ωρών λειτουργίας του τηλεσκοπίου.",
  "Try yourself": "Δοκιμάστε το μόνοι σας",
  "5. Robonomics Polka pet": "5. Ρομπονομικά Polka pet",
  "In collaboration with Polkapets": "Σε συνεργασία με τους Polkapets",
  "and": "και",
  "Robonomics Polka pet": "ομπονομικά Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Ως υπερήφανο μέλος του οικοσυστήματος του Polkadot, τα Ρομπονομικά συμμετείχαν στον κόσμο των Polka Pets. Μαζί με την ομάδα των Polka Pets, δημιουργήσαμε 1200 NFT με μια μοναδική ιδέα σχεδίασης που αποδεικνύει την κεντρική μας ιδέα της συνδεσιμότητας. Για να δώσουμε ζωή σε αυτήν την ιδέα, δημιουργήσαμε μια προσωπικότητα: ένα ανδροειδές που εξειδικεύεται στη βοήθεια των ανθρώπων να συνδεθούν με οποιοδήποτε ρομποτικό οντότητα.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "Το 2021, τα Ρομπονομικά ξεκίνησαν τη δέσμευσή τους να υποστηρίξουν την προσθήκη των παλέτων της RMRK στο runtime τους, που θα οδηγούσε σε φυσική ενσωμάτωση με την πιο προηγμένη λογική NFT στον κόσμο. Για να γιορτάσουμε αυτό το εξαιρετικό ορόσημο, κυκλοφορήσαμε ένα ειδικό αντικείμενο συμβατό με το Kanaria - ένα παιδικό NFT που μπορεί να τοποθετηθεί στο πουλί Kanaria κάποιου και μπορεί να παρέχει πλεονεκτήματα στο μεταβατικό χώρο της RMRK.",
  "RMRK Partnerships": "Συνεργασίες RMRK",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Το έτος ξεκίνησε με μια σημαντική επίτευξη - ο Robonomics κέρδισε την 20η δημοπρασία υποδοχής parachain και",
  "officially became": "επίσημα έγινε",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "ένα parachain με ID 2048 στο δίκτυο Kusama. Ο λανσάρισμος, το datalog, οι λειτουργίες DigitalTwin, ευθύνης και οι συνδρομές IoT έχουν γίνει διαθέσιμες για όλους τους χρήστες του οικοσυστήματος. Για να παρέχουμε λεπτομέρειες για αυτήν τη φάση του έργου, η πυρήνας ομάδα έχει δημοσιεύσει τα πρώτα κεφάλαια του",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Ο Robonomics 2.0 στο Substrate έχει κυκλοφορήσει με υποστήριξη για μηνύματα XCM, και ξεκινήσαμε να ανοίγουμε κανάλια HRMP με άλλα parachains (όπως Crust Shadow και Darwinia), οι λειτουργίες των οποίων είναι εξαιρετικά χρήσιμες για εμάς.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Ταυτόχρονα, έχουμε ξεκλειδώσει μια στρατηγική για την εισαγωγή της αγοράς IoT στο πρωτόκολλό μας. Οι πειραματισμοί μας με τον εξοπλισμό IoT μας οδήγησαν στην έννοια ενός κυρίαρχου έξυπνου σπιτιού, που είναι ανεξάρτητο από κεντρικούς παροχείς υπηρεσιώ συννεφιακού υπολογιστικού νέφους. Έχουμε αναπτύξει την",
  "integration": "ενσωμάτωση",
  "with the Home Assistant automation system, and also designed our own": "μας με το σύστημα αυτοματισμού Home Assistant, και έχουμε σχεδιάσει επίσης τη δική μας",
  "IoT gateway": "πύλη IoT",
  "for connecting smart devices.": "για τη σύνδεση έξυπνων συσκευών.",
  "We have launched two big initiatives in order to increase community engagement —": "Έχουμε ξεκινήσει δύο μεγάλες πρωτοβουλίες για να αυξήσουμε τη συμμετοχή της κοινότητας -",
  "Robonomics Academy": "Robonomics Academy",
  "Additionally,": "Επιπλέον,",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "διεξήχθη το φθινόπωρο, ώστε η κοινότητα του Robonomics να μπορέσει να δοκιμάσει για πρώτη φορά τους μηχανισμούς διακυβέρνησής μας. Πρόσφατα, η ομάδα του Robonomics βοήθησε το έργο DAO IPCI να αποκτήσει μια θέση parachain για την παρουσίαση υπηρεσίας αντιστάθμισης άνθρακα για έξυπνα κτίρια.",
  "In 2021, our": "Το 2021, ο",
  "main focus": "κύριος εστίαση",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "μας μετατοπίστηκε στην προετοιμασία του έργου, ώστε οι εφαρμογές IoT να μπορούν να χρησιμοποιηθούν μέσω του parachain μας στο δίκτυο Kusama. Ο Robonomics 1.0 στο Substrate έχει κυκλοφορήσει, και έχουμε δοκιμάσει τη σύνδεση αισθητήρων στο parachain για να στείλουμε τα δεδομένα τηλεμετρίας τους, καθώς και την ανάπτυξη της λειτουργικότητας του ψηφιακού διδίου. Στη μέση του έτους, αποφασίσαμε να δοκιμάσουμε τον πλήρη κύκλο του δικτύου μας και δημιουργήσαμε τη δική μας αλυσίδα μεταφοράς κλήσεων με την ονομασία",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "στην οποία ενσωματώθηκε το Robonomics parachain (πριν μεταναστευθεί στην αλυσίδα μεταφοράς κλήσεων Kusama). Έχει δοθεί μεγάλη έμφαση στην απόκτηση μιας θέσης parachain στο Kusama, για την οποία οργανώσαμε αρκετές εκστρατείες crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Υπήρξαν δύο μεγάλες αλλαγές για την κοινότητα. Πρώτον, ξεκινήσαμε το",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "που επιτρέπει σε έργα ρομποτικής και IoT Web3 να λάβουν χρηματοδότηση για ερευνητικές και αναπτυξιακές εργασίες. Μέχρι το τέλος του έτους, τέσσερα ενεργά έργα συμμετείχαν στο πρόγραμμα. Δεύτερον, η ομάδα ξεκίνησε τη διαδικασία",
  "Exodus process": "Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "που επιτρέπει στους κατόχους Ethereum να μεταφέρουν τα κέρματά τους XRT στο parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Ανάμεσα στις συνεργασίες, μπορούμε να θυμηθούμε την εντυπωσιακή εμφάνιση του Boston Dynamics Spot στο MerkleBot, για το οποίο αναπτύχθηκε ένα",
  "rental remote control system": "σύστημα ενοικίασης απομακρυσμένου ελέγχου",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": ". Θα θέλαμε επίσης να σας ενημερώσουμε για την εταιρεία Multi-Agent Systems, η οποία είναι ένα προσωπικό έργο που έχει δημιουργηθεί από μια ομάδα μηχανικών του Robonomics. Έχουν αναπτύξει ένα ρομποτικό μηχάνημα για την παρασκευή βάφλας με την ονομασία Eisenkoch, το οποίο εκτελεί εργασίες μαγειρικής για ιδιοκτήτες καφετεριών.",
  "There came a time when the existing limitations of Ethereum": "Ήρθε ένας καιρός όταν οι υπάρχουσες περιορισμοί του Ethereum",
  "began to stand out clearly": "άρχισαν να φαίνονται σαφώς",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(ιδίως η κακή κλιμακωσιμότητα, η χαμηλή ταχύτητα και το πολύ υψηλό κόστος των συναλλαγών). Η ναβάθμιση σε ETH2.0 αναμενόταν να διορθώσει την κατάσταση, αλλά αυτή η αναβάθμιση καθυστερήθηκε επανειλημμένα. Ενώ δεν θέλαμε να αποχωρήσουμε από το δίκτυο Ethereum, συνειδητοποιήσαμε ότι στην τρέχουσα κατάσταση ήταν δύσκολο να υλοποιήσουμε τις περιπτώσεις χρήσης μας και άρχισαμε να αναζητούμε ένα εναλλακτικό δίκτυο. Το οικοσύστημα του sharded blockchain Polkadot έγινε αυτή η εναλλακτική. Ξεκινήσαμε πειραματιζόμενοι με το πλαίσιο Substrate για να μεταφέρουμε τα κύρια χαρακτηριστικά του Robonomics και να αναπτύξουμε το δικό μας δοκιμαστικό δίκτυο. Μέχρι το τέλος αυτού του σταδίου, είχαμε αναπτύξει το parachain μας στο δοκιμαστικό δίκτυο Rococo και ξεκινήσαμε την προετοιμασία για να λάβουμε θέση στο δίκτυο Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Συνεχίζοντας τη μελέτη των συστημάτων IoT, εντοπίσαμε την κρια λειτουργικότητα του Robonomics, η οποία μπορεί να προσθέσει αξία στους χρήστες - τη λειτουργία του αποκεντρωμένου νέφους για το IoT. Αυτή η ιδέα αποτέλεσε τη βάση των",
  "Robonomics Web Services": "Robonomics Web Services",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Η υποδομή του RWS ανέλαβε όλες τις λειτουργίες ενός τυπικού κεντρικού νέφους, αλλά χωρίς τα τυπικά προβλήματα παγκόσμιας διαθεσιμότητας, ασφάλειας και απορρήτου. Επιπλέον, είχαμε την ιδέα των συνδρομών IoT του parachain που επιτρέπει στους κατόχους συνδρομής να χρησιμοποιούν το δίκτυο blockchain χωρίς να πληρώνουν ένα τέλος για κάθε συναλλαγή. Το πρώτο πείραμα με τις συνδρομές IoT ήταν η έκδοση του κρυπτονομίσματος RWS, το οποίο επιτρέπει στον κάτοχό του να στέλνει 1 συναλλαγή ανά μπλοκ. Επιπλέον, ξεκινήσαμε τα πρώτα βήματα για την ανάπτυξη του δικού μας υλικού συστήματος γι τον έλεγχο έξυπνων συσκευών (το DAOS concept).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Φυσικά, η υποστήριξη του Robonomics στο Ethereum δεν έχει σταματήσει. Το στοίβα επικοινωνίας του Robonomics έχει ολοκληρωθεί στην έκδοση",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Το κρυπτονόμισμα XRT άρχισε να κατατίθεται σε αρκετά ανταλλακτήρια (ιδίως στο Uniswap DEX) και ξεκίνησε το πρόγραμμα ενθάρρυνσης της ρευστότητας.",
  "The team actively developed ways to interact with the community. The first version of our": "Η ομάδα ανέπτυξε ενεργά τρόπους αλληλεπίδρασης με την κοινότητα. Έχει ξεκινήσει η πρώτη έκδοση του",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "ιστότοπου μας και του Robonomics Wiki. Για πιο διαφανή και βολική διαχείριση του έργου, ξεκινήσαμε να χρησιμοποιούμε το",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Φιλοξενήσαμε το",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "το 2019 για νέους στο έργο.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Συνεχίστηκαν επίσης οι συνεργασίες με συναφή έργα. Ο Robonomics και ο DAO IPCI παρουσίασαν έναν υπηρεσία για τη συλλογή και ανάλυση αισθητήριων δεδομένων -",
  "RoSeMAN": "RoSeMAN",
  "Robonomics became the foundation for the": "Ο Robonomics έγινε η βάση για το έργο",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "που αναπτύσσει ένα σύστημα για έξυπνη μίσθωση ρομποτικού εξοπλισμού.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Καταλάβαμε ότι οι αυτόνομοι πράκτορες χρειαζόντουσαν ένα περιβάλλον που θα εξασφάλιζε την αξιόπιστη τεχνική και οικονομική λειτουργία τους. Για αρκετά χρόνια είχαμε αναπτύξει ένα ρωτόκολλο για τη δημιουργία ενός αποκεντρωμένου δικτύου παρόχων που βοηθούν τους ρομποτικούς πράκτορες να παρέχουν τις υπηρεσίες τους. Έχουν αναπτυχθεί εργαλεία για τη συντήρηση του δικτύου και για το στοίβα επικοινωνίας μεταξύ Ethereum και ROS. Το 2018 δημοσιεύσαμε το",
  "Robonomics Whitepaper": "Λευκό Βιβλίο του Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "και η έκδοση alpha του Robonomics Network ξεκίνησε στο Ethereum mainnet. Συνεχίστηκαν ενεργές προετοιμασίες για τη γενέση του τοκεν XRT (που στη συνέχεια συνέβη την άνοιξη του 2019 λόγω του πρώτου κρυπτοχειμώνα).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Από αυτήν την περίοδο, ο Robonomics άρχισε να αναπτύσσει δυναμικά περιπτώσεις χρήσης που σχετίζονται με την Βιομηχανία 4.0 - έξυπνες εργοστασιακές μονάδες, έξυπνες πόλεις και έξυπνα σπίτια - και αυτό έφερε τη στενή μας προσοχή στον κόσμο του IoT. Στην αναζήτηση καινοτομίας, η ομάδα παρουσίασε αρκετά μεγάλα και μοναδικά R&D demos: ένα πολιτικό",
  "sensor network": "δίκτυο αισθητήρων",
  "a water drone": "ένα υδρο-ρομπότ",
  "for environmental monitoring (supported by a sensor systems manufacturer": "για την περιβαλλοντική παρακολούθηση (υποστηριζόμενο από κατασκευαστή συστημάτων αισθητήρων",
  "Libelium": "Libelium",
  "a smart factory model": "ένα έξυπνο εργοστάσιο μοντέλο",
  "a self-employed": "ένας αυτοαπασχολούμενος",
  "robot artist Gaka-chu": "καλλιτέχνης ρομπότ Gaka-chu",
  "and a": "και ένα",
  "drone traffic management system": "σύστημα διαχείρισης κίνησης των ρομπότ",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Ο Robonomics ξεκίνησε συνεργασία με το έργο DAO IPCI για τη διαχείριση περιβαλλοντικών πόρων χρησιμοποιώντας τεχνολογίες Web3 και συσκευές IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Αυτή ήταν μια περίοδος ενεργής έρευνας και ανάπτυξης κατά την οποία εντοπίσαμε μια σειρά από εργασίες, στις οποίες οι τεχνολογίες P2P έχουν δυνατότητες που δεν ήταν προηγουμένως διαθσιμες για τη ρομποτική. Συνδυάζοντας τον υπολογιστή Ethereum, την αποθήκευση αρχείων IPFS και το Λειτουργικό Σύστημα Ρομπότ, συνειδητοποιήσαμε ότι οποιαδήποτε συσκευή θα μπορούσε πιθανώς να γίνει ένα",
  "autonomous intelligent robot agent": "αυτόνομο έξυπνο ρομπότ πράκτορα",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Αυτό ανοίγει το δρόμο για εμάς στις έννοιες του Ρομπότ-ως-Υπηρεσία και της ρομποτικής οικονομίας.",
  "Our publications in scientific journals of this period are available in the": "Οι δημοσιεύσεις μας σε επιστημονικά περιοδικά αυτής της περιόδου είναι διαθέσιμες στην",
  "Papers section": "ενότητα Άρθρα",
  "We have collected all R&D projects over the years in the": "Έχουμε συγκεντρώσει όλα τα έργα έρευνας και ανάπτυξης κατά τα χρόνια σε",
  "a handy book": "ένα βολικό βιβλίο",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Όλα ξεκίνησαν με μια ιδέα που ήρθε στους ιδρυτές όταν το Ethereum είχε μόλις κυκλοφορήσει το κύριο δίκτυό του. Τι γίνεται αν το ρομπότ εκτελεί μια εργασία για έναν πελάτη με κρυπτονόμισμα και η λογική του ελέγχεται από ένα έξυπνο συμβόλαιο;",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Για να δοκιμάσουμε την ιδέα, δημιουργήσαμε ένα demo στο οποίο ένα drone που ελέγχεται από έναν υπολογιστή Ethereum εκτοξεύτηκε για να επιτύχει τις καθορισμένες συντεταγμένες GPS μετά από την ολοκλήρωση μιας συναλλαγής πληρωμής από τον χρήστη.",
  "The demo is available on": "Το demo είναι διαθέσιμο στο",
  "YouTube": "YouTube",
  "Secure": "Ασφαλής",
  "Serverless": "Χωρίς διακομιστή",
  "Futuristic": "Μελλοντικός",
  "IoT applications": "Εφαρμογές IoT",
  "Robonomics network vision": "Οραματισμός δικτύου Robonomics",
  "At the frontier of cybernetics and economics": "Στο προσκήνιο της κυβερνονομίας και της οικονομίας",
  "Build your IoT services on Robonomics platform": "Δημιουργήστε τις υπηρεσίες IoT σας στην πλατφόρμα Robonomics",
  "taking full advantage of decentralized architecture": "αξιοποιώντας πλήρως την αποκεντρωμένη αρχιτεκτονική",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Το Robonomics επιτρέπει στους χρήστες να συνδέονται με έξυπνες συσκευές χρησιμοποιώντας αποκεντρωμένες εφαρμογές (dapp) που δεν απαιτούν μεταφορά δεδομένων του χρήστη για την πιστοποίηση. Η επικοινωνία πραγματοποιείται μέσω ενός αποκεντρωμένου δικτύου παρόχων χωρίς ένα μόνο σημείο αποτυχίας, και η συσκευή ανεξάρτητα αποκτά πληροφορίες από το δίκτυο του blockchain για να εκτελέσει ή να μεταδώσει δεδομένα απομακρυσμένα. Έτσι, το Robonomics παρέχει υψηλό επίπεδο κυβερνοασφάλειας της συσκευής και ιδιωτικότητα των δεδομένων του χρήστη σε όλα τα στάδια της επικοινωνίας από την εφαρμογή του χρήστη μέχρι την εκκίνηση της έξυπνης συσκευής.",
  "From smart contracts to cross chain IoT platform": "Από έξυπνα συμβόλαια σε πλατφόρμα διασυνδεδεμένου IoT",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Το έργο Robonomics είναι πάνω από 6 χρόνια. Ξεκινήσαμε να προετοιμαζόμαστε για το πρώτο πείραμα που δείχνει την ανθρώπινη-μηχανή επικοινωνία χρησιμοποιώντας ένα ανεξάρτητο αποκεντρωμένο δίκτυο παροχέα το 2015, από τις πρώτες μέρες του δικτύου Ethereum. Μέχρι αρχές του 2021, η ομάδα του έργου κατάφερε να δημιουργήσει ένα πρωτόκολλο επικοινωνίας μηχανής-οικονομίας που λειτουργεί πάνω από το Ethereum και το IPFS, και να το συμπληρώσει με στοιχεία μιας πλατφόρμας IoT βασισμένης στον παρακείμενο του Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Ως αποτέλεσμα, σήμερα έχουμε ήδη μια υβριδική πλατφόρμα για τη δημιουργία μελλοντικών εφαρμογών IoT που επιτρέπουν την αλληλεπίδραση με συσκευές υπό τον έλεγχο ενός παγκόσμιου αποκεντρωμένου υπολογιστή.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Οι δημιουργοί του Robonomics είναι πειραματιστές, μηχανικοί και επιστήμονες που ενδιαφέρονται να κατανοήσουν την επιστημονική ορθότητα της προσέγγισης και να επιτύχουν σαφήνεια την παρουσίαση των αρχών που θα πρέπει να αποτελέσουν τη βάση ολόκληρης της αρχιτεκτονικής της λογισμικού λύσης.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "Στα άρθρα μας μεταξύ 2017 και 2020, παρουσιάσαμε στην επιστημονική κοινότητα πολλές έννοιες και λύσεις που ενώνονται γύρω από την ιδέα της οικονομίας του ρομπότ, ένα οικονομικό σύστημα στο οποίο τα ρομποτικά συστήματα ενεργούν ως ανεξάρτητοι πράκτορες ικανοί να εκτελούν βασικές οικονομικές δραστηριότητες που προηγουμένως ήταν διαθέσιμες μόνο για τους ανθρώπους. Μπορείτε να διαβάσετε τα επιστημονικά άρθρα στο",
  "this link": "αυτό το σύνδεσμο",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Θα θέλαμε να δικαιολογήσουμε την εμφάνιση της οικονομίας του ρομπότ και να εξηγήσουμε γενικά γιατί πιστεύουμε ότι αυτή η έννοια είναι η αναπόφευκτη και προφανής απάντηση στη λειτουργία των μεγλης κλίμακας ρομποτικών συστημάτων της νέας βιομηχανικής επανάστασης.",
  "Move towards the factory of the future": "Κίνηση προς το εργοστάσιο του μέλλοντος",
  "Inspired by Ronald Coase": "Εμπνευσμένος από τον Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Ο βραβευμένος με Νόμπελ στην οικονομία Ronald Coase στο έργο του το 1937 “Η φύση της επιχείρησης” απέδειξε καλύτερα τη διχοτόμο «ιεραρχία έναντι ελεύθερης αγοράς» και έδωσε μια εξήγηση για τους λόγους ύπαρξης των οργανισμών, ειδικότερα των εταιρειών. Ο Coase συζητά την επίδραση των διατρανωτικών κοστών (το κόστος συλλογής και επεξεργασίας πληροφοριών) για να πάρει αποφάσεις σχετικά με τη σύναψη συμβολαίου και την παρακολούθηση της εκτέλεσής του. Η εταιρεία, με όλη την ιεραρχική της δομή εκτός αγοράς, δημιουργείται ως ο πιο αποδοτικός τρόπος να παρέχει στον καταναλωτή το επιθυμητό προϊόν με το χαμηλότερο δυνατό κόστος συναλλαγής στη στιγμή που η προσπάθεια συναλλαγής για τη δημιουργία του ίδιου προϊόντος μέσω πολλαπλών ανταλλαγών στην αγορά μεταξύ ατόμων γίνεται πολύ μεγαλύτερη. Για να οπτικοποιήσουμε καλύτερα αυτήν τη διαδικασία, ας ρίξουμε μια ματιά στον επεξηγηματικό παραδείγματος της αγοράς αυτοκινήτου. Δοκιμάστε να αγοράσετε ένα αυτοκίνητο από τα μέρη και υπολογίστε πόσα χρήματα και χρόνο θα ξοδέψετε απλά για να συναρμολογήσετε όλα τα εξαρτήματα στο γκαράζ σας. Οι κίνδυνοι και τα κόστη διαπραγμάτευσης για την αγορά εξαρτημάτων είναι πολύ υψηλά σε σύγκριση με το έτοιμο μοντέλο Tesla Model X.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Ωστόσο, αυτό δεν οδηγεί στην εμφάνιση της μοναδικής εταιρείας στον κόσμο για την παραγωγή τα πάντα. Το θέμα είναι ότι τα ίδια διατρανωτικά κόστη επιβάλλουν περιορισμούς στο μέγεθος των εταιρειών. Ο Coase γράφει:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...μια εταιρεία θα τείνει να διευρύνεται μέχρις ότου τα κόστη οργάνωσης μιας επιπλέον συναλλαγής εντός της εταιρείας γίνουν ίσα με τα κόστη πραγματοποίησης της ίδιας συναλλαγής μέσω ανταλλαγής στην ανοικτή αγορά...”",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Με άλλα λόγια, όσο πιο πολύπλοκη είναι η ιεραρχία εντός της εταιρείας, τόσο μεγαλύτερα είναι τα εσωτερικά κόστη και σε κάποιο σημείο αποδεικνύονται υπερβολικά σε σύγκριση με τα κόστη επιστροφής στην αγορά. Για να διασφαλίσουν την ανάπτυξή τους ως ένας από τους κινητήρες, οι επιχειρηματίες αναζητούν τρόπους για να μειώσουν αυτά τα κόστη.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Η ιδέα της μείωσης των δαπανών συναλλαγών μέσω της ικανότητας όλων των συμμετεχόντων στην επιχειρηματική διαδικασία (παραγωγή, λογιστική, κατανάλωση) να ενωθούν σε έναν πιο στενό βαμό",
  "clearly correlates": "συσχετίζεται σαφώς",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "με τα προβλήματα και τις προκλήσεις που αντιμετωπίζουν οι κατασκευαστές λύσεων αυτοματισμού. Τα τελευταία 50 χρόνια, οι τυπικές/κανονικές λειτουργίες των περισσότερων επιχειρηματικών διαδικασιών μεγάλων εταιρειών έχουν αυτοματοποιηθεί σχεδόν πλήρως. Οι κατασκευαστές έχουν ουσιαστικά αφεθεί με το καθήκον να δημιουργήσουν ασφαλή επικοινωνία μεταξύ πλήρως αυτοματοποιημένων μερών της αλυσίδας εφοδιασμού, και αυτό το καθήκον αποτελεί έναν παράγοντα που εμποδίζει περαιτέρω μείωση των δαπανών συναλλαγών μέσω του αυτοματισμού. Η επιθυμία να προωθηθούν πιο ανταγωνιστικά προϊόντα ή υπηρεσίες σε σύγκριση με εταιρείες με μερικό αυτοματισμό",
  "firms spurs the search for solutions to": "ενθαρρύνει την αναζήτηση λύσεων για",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "αυτές τις προκλήσεις. Φαίνεται ότι όλα κινούνται προς την εμφάνιση των ρομποεταιρειών - οργανισμών στους οποίους ολόκληρη η επιχειρηματική διαδικασία είναι πλήρως αυτοματοποιημένη και δεν απαιτεί ανθρώπινη συμμετοχή, εκτός από τους δικαιούχους και τους καταναλωτές.",
  "Get rid of transaction costs": "Απαλλαγείτε από τις δαπάνες συναλλαγών",
  "Our future in smart cities": "Το μέλλον μας στις έξυπνες πόλεις",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Η αποστολή που αντιμετωπίζουν οι κατασκευαστές αυτοματισμού σήμερα έχει ένα συγκεκριμένο όνομα - η κατασκευή κυβερνο-φυσικών συστημάτων (συντοευμένα ως CPS). Με βάση τον ορισμό, ένα CPS είναι μια ισχυρή ενοποίηση και αμοιβαία ενσωμάτωση πολλαπλών υπολογιστικών, δικτυακών και φυσικών διεργασιών.",
  "definition,": "Οι αποστολές της κατασκευής CPS είναι κεντρικές για οποιαδήποτε ιδέα περιγράφεται στη νέα (τέταρτη) βιομηχανική επανάσταση. Επομένως, το CPS είναι το θεμέλιο της μελλοντικής μας ζωής στις Έξυπνες Πόλεις, εμφανίζοντας παντού. Παραδείγματα κυβερνο-φυσικών συστημάτων του μέλλοντος είναι: Uber autopilot, drone selfies, δίκτυο 3D εκτυπωτών σε σταθμούς μετρό.",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "Το CPS είναι μια πολύπλοκη δομή πολλαπλών συνδεδεμένων στοιχείων: από την εφαρμογή στο τηλέφωνο, επεκτείνεται στον έλεγχο του drone κατά τη διάρκεια πτήσης πάνω από την πόλη και στη συνέχεια προχωρά στη δημοσίευση των αποτελεσματικών φωτογραφιών στο Instagram, αλλά μόνο μετά την επεξεργασία από το cloud AI.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Το πιο σημαντικό πράγμα στη διαδικασία σχεδίασης CPS είναι να βρεθεί η λεπτή γραμμή μεταξύ επαρκούς και υπερβολικού αριθμού αυτοματοποιημένων στοιχείων στην αλυσίδα εφοδιασμού χρηστών υπηρεσίας. Με άλλα λόγια, πού βρίσκεται το όριο μεγέθους του CPS; Για να απαντήσουμε σε αυτήν την ερώτηση, πρέπει να απευθυνθούμε στον διάσημο μαθηματικό Νόρμπερτ Βίνερ.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "Αυτορυθμιζόμενα συστήματα",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Εμπνευσμένος από τον Νόρμπερτ Βίνερ",
  "Self-regulating systems": "Το 1948, ο καθηγητής μαθηματικών στο MIT Νόρμπερτ Βίνερ δημοσίευσε ένα από τα πιο σημαντικά έργα \"Κυβερνητική: Ή Έλεγχος και Επικοινωνία στο Ζώο και τη Μηχανή\". Χρησιμοποίησε τον όρο \"κυβερνητική\" για πρώτη φορά ως αυτορυθμιζόμενους μηχανισμούς και, ως εκ τούτου, αυτή η δημοίευση θεωρείται αναγνωρισμένη ως η κυβερνητική γένεση.",
  "Inspired by Norbert Wiener": "Ο Νόρμπερτ Βίνερ μιλά για την εφαρμογή της διεπιστημονικής προσέγγισης στην επιστήμη. Για παράδειγμα, συνέδεσε τα αυτοματοποιημένα συστήματα ελέγχου με τις προκλήσεις της κλιμάκωσης και της αύξησης της πολυπλοκότητας της ανθρώπινης κοινωνίας.",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "Έτσι, με άλλα λόγια, η κυβερνητική προσέγγιση μπορεί να εφαρμοστεί ισότιμα στην ψυχοθεραπεία, τη βιολογία και την αυτόματη πλοήγηση. Βασίζεται στη λειτουργία του συστήματος, πώς ελέγχονται οι ατομικές ενέργειες και πώς αλληλεπιδρούν οι ατομικοί κόμβοι μεταξύ τους.",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Λαμβάνοντας υπόψη τις δημοσιεύσεις των Ρόναλντ Κοουζ και Νόρμπερτ Βίνερ, ακολουθώντας την ανάπτυξη της Βιομηχανίας 4.0, μπορούμε να θεωρήσουμε τη χρήση του CPS ως οικονομικύ παράγοντα κατά τον σχεδιασμό ρομποτοποιημένων υπηρεσιών. Για να ρυθμίσουμε το μέγεθος του CPS και να προσαρμοστούμε στις μεταβαλλόμενες ανάγκες των ατόμων, μπορούμε να χρησιμοποιήσουμε το μηχανισμό της αγοράς.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Και το επιστημονικά ενδιαφέρον, λαμβάνοντας ως βάση την ιδέα των περιορισμών που επιβάλλονται από την αγορά στο μέγεθος της εταιρείας, μπορούμε να πούμε ότι το όριο αύξησης του CPS θα καθορίζεται πάντα από την αγορά και δεν απαιτείται τίποτα άλλο.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Οι ρομποεταιρίες είναι μια ιδανική αναπαράσταση των κυβερνο-φυσικών συστημάτων. Είναι μια αρκετά αυτόνομη μονάδα ικανή να παρέχει υπηρεσίες τόσο σε ανθρώπους όσο και σε άλλα ρομπότ έναντι χρημάτων. Ως αποτέλεσμα, η ρομπονομία μας φαίνεται να είναι ένα γενικό σύνολο CPS που παρέχει υπηρεσίες και αγαθά απευθείας στην αγορά.",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "Και τι είναι τόσο επιστημονικά ενδιαφέρον, λαμβάνοντας ως βάση την ιδέα των περιορισμών που επιβάλλονται από την αγορά στο μέγεθος της εταιρείας, μπορούμε να πούμε ότι το όριο της αύησης του CPS θα καθορίζεται πάντα από την αγορά και δεν απαιτείται τίποτα άλλο για αυτό.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Οι ρομποεταιρίες είναι μια ιδανική αναπαράσταση για τα κυβερνοφυσικά συστήματα. Είναι μια αρκετά αυτόνομη μονάδα ικανή να παρέχει υπηρεσίες τόσο σε ανθρώπους όσο και σε άλλους ρομπότ για χρήματα. Ως αποτέλεσμα, η ρομπονομία μας φαίνεται να είναι ένα γενικό σύνολο CPSs που παρέχουν υπηρεσίες και αγαθά απευθείας στην αγορά.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Χρήμα για ρομπότ",
  "Industry 1.0": "Βιομηχανία 1.0",
  "Mechanization:": "Μηχανοποίηση:",
  "replacement of muscle power with steam energy.": "αντικατάσταση της μυϊκής δύναμης με ατμοενέργεια.",
  "1784 y.": "1784 μ.",
  "Industry 2.0": "Βιομηχανία 2.0",
  "Electrification:": "Ηλεκτροφόρηση:",
  "introduction of assembly-line production.": "εισαγωγή της παραγωγής σε αρθρωτή γραμμή.",
  "1870 y.": "1870 μ.",
  "Industry 3.0": "Βιομηχανία 3.0",
  "Automation:": "Αυτοματοποίηση:",
  "introduction of automated systems with CNC.": "εισαγωγή αυτοματοποιημένων συστημάτων με CNC.",
  "1969 y.": "1969 μ.",
  "Industry 4.0": "Βιομηχανία 4.0",
  "Smart production:": "Έξυπνη παραγωγή:",
  "development of cyber physical systems.": "ανάπτυη κυβερνοφυσικών συστημάτων.",
  "Now": "Τώρα",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "Στον κόσμο των ρομποεταιριών φαίνεται φυσικό να παρέχουμε στα ρομπότ πρόσβαση σε κοινωνικά ιδρύματα που προηγουμένως χρειάζονταν μόνο οι άνθρωποι.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Τα κοινωνικά ιδρύματα δεν προκύπτουν επειδή οι άνθρωποι δεν μπορούν να ζήσουν χωρίς τράπεζες, συμβόλαια και άλλα εργαλεία της κοινωνίας. Προκύπτουν μόνο επειδή ένας άνθρωπος σε κάποιο σημείο του χρόνου βήματος στο μονοπάτι των πιο πολύπλοκων σχέσεων στην κοινωνία και έκανε ένα σημαντικό βήμα προς την επιτάχυνση των γύρω διεργασιών.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Τα χρήματα και τα συμβόλαια πρέπει να γίνουν διαθέσιμα στα ρομπότ, όχι επειδή αυτό είναι ένα αρρωστημένο φαντασιακό των οπαδών των ρομπότ που έχουν ξεχάσει τι είναι το Skynet. Αλλά μόνο επειδή η νέα βιομηχανική επανάσταση έτει ως στόχο την κατασκευή πολύπλοκων αυτοματοποιημένων αλυσίδων, οι διεργασίες των οποίων θα επηρεάζουν την ανταλλαγή τόσο τεχνικών πληροφοριών όσο και οικονομικών πληροφοριών, και θα προχωρήσουν με μια ταχύτητα που δεν είναι προσβάσιμη στους ανθρώπους.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Ένα από τα παραδείγματα των πειραμάτων μας: διαπραγμάτευση χώρου κυκλοφορίας και πληρωμών για αυτόνομα οχήματα για τη μείωση της συμφόρησης. Αυτό που ένα άτομο αποφασίζει αποφασίζε να μην κάνει στην κυκλοφορία, το αυτοκίνητο θα το κάνει για εσάς χωρίς δυσκολία: θέλετε να αλλάξετε λωρίδα, το αυτοκίνητό σας και το αυτοκίνητο του γείτονά σας ανταλλάσσουν προσφορές για το κόστος μιας τέτοιας λειτουργίας με ρυθμό εκατοντάδων μηνυμάτων ανά δευτερόλεπτο, θα αποκαλύψουν μια ισορροπημένη τιμή και έτσι είστε ήδη στην επόμενη γρηγορότερη λωρίδα κίνησης. Αυτό σημαίνει ότι τώρα θα είναι διαθέσιμο να \"χρεώσετε\" το ταξίδι σας με την Uber και να το κάνετε πιο γρήγορο.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Οι ρομπότ χρειάζονται χρήματα που θα είναι άμεσα διαθέσιμα για να μπορούν να πραγματοποιούν λειτουργίες χωρίς την παρουσία ενός ατόμου με την ταχύτητα με την οποία μόνο οι μηχανές μπορούν να πάρουν αποφάσεις. Και όλα αυτά είναι αποκλειστικά για να απολαύσει ένα άτομο τη ζωή στη Συνετή Πόλη!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "Και εδώ έρχομαστε ομαλά στο πρώτο ηλεκτρονικό χρήμα - το Bitcoin. Το γεγονός ότι το Bitcoin μπορεί να αποθηκευτεί στον λογαριασμό σας με την αρχή όχι ενός τραπεζικού λογαριασμού, αλλά μετρητά στο πορτοφόλι σας το καθιστά τα πρώτα χρήματα που το ρομπότ μπορεί να διαχειριστεί ανεξάρτητα, ακριβέστερα αυτόνομα. Ταυτόχρονα, σήμερα μπορούμε ήδη να πούμε ότι το Bitcoin δεν είναι απλώς ηλεκτρονικά χρήματα, αλλά μια πραγματικά παγκόσμια χρηματοπιστωτική ιδρυματική οντότητα.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Ως αποτέλεσμα: ένα γεγονός που δεν το εφεύραμε εμείς, αλλά προφανώς εμπίπτει στο όραμά μας, καθιστά το Bitcoin τα πρώτα χρήματα για τα ρομπότ, ή, αν κοιτάξουμε ακόμα πιο βαθιά, ακριβώς αυτό το κοινωνικό θεσμικό όργανο που θα βοηθήσει στο σχηματισμό ρομποτικών ετιρειών.",
  "Smart contracts": "Έξυπνα συμβόλαια",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Το Bitcoin έγινε το πρώτο χρήμα που είναι διαθέσιμο στους ρομπότ. Παράλληλα, δεν μπορούμε να μιλήσουμε για το Bitcoin στην τρέχουσα μορφή του ως ένα εργαλείο για λήρη τεχνική και οικονομική ανταλλαγή.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Τώρα ήδη έχουμε έξυπνα συμβόλαια, αγορές DeFi και μια αποκεντρωμένη υποδομή για την ανταλλαγή μηνυμάτων μεταξύ ρομπότ που ανοίγουν τη δυνατότητα για την ανθρωπότητα να δημιουργήσει ένα πλήρως αυτοματοποιημένο μέρος της ανθρώπινης οικονομίας - η οικονομία των ρομπότ.",
  "One of the great opportunity to build the economy of robots is": "Μία από τις μεγάλες ευκαιρίες για την κατασκευή της οικονομίας των ρομπότ είναι η τεχνολογία. Με τη λειτουργικότητα του Ethereum, τα ρομπότ μπορούν όχι μόνο να ανταλλάσσουν χρήματα, αλλά να συνάπτουν συμβόλαια με ανθρώπους και μεταξύ τους.",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "τεχνολογία. Με τη λειτουργικότητα Ethereum τα ρομπότ μπορούν όχι μόνο να ανταλλάσσουν χρήματα, αλλά να συνάπτουν συμβάσεις με ανθρώπους και μεταξύ τους",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": " Αλλά ποιος είναι ο σκοπός της επικοινωνίας βασισμένης σε συμβόλαια μεταξύ μηχανής και μηχανής (m2m); Αυτή είναι μία εξαιρετική ερώτηση! Ας επιστρέψουμε στο CPS. Όταν μιλάμε για άμεση επικοινωνία μεταξ αισθητήρων, μηχανολογικού εξοπλισμού ή οποιωνδήποτε άλλων στοιχείων, μιλάμε ακόμα για συνεργασία εντός ενός κανονισμένου συστήματος. Αλλά αν θέλουμε οι υπηρεσίες έξυπνων πόλεων να είναι ζωντανές (ή ακόμα και έξυπνο σπίτι σε ορισμένες περιπτώσεις), χρειαζόμαστε επικοινωνία με διάφορα στοιχεία τρίτων.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Ας φανταστούμε ένα υπηρεσία παράδοσης με drone. Αν ένα drone, για παράδειγμα, ανήκει στην DHL, πώς μπορεί να έχει πρόσβαση στα αποθήκευτικά κέντρα της Amazon ή πρόσβαση σε ολόκληρο τον εναέριο χώρο της πόλης; Θα είναι μονοπώλιο; Αυτό είναι ένα μεγάλο πρόβλημα για πολλές πρωτοβουλίες της 4ης βιομηχανικής επανάστασης!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Οι περισσότερες εταιρείες λένε ότι χρειάζονται σχεδόν πλήρη δικαιώματα στο περιβάλλον τους επειδή δεν ξέρουν πώς να εγκαθιδρύσουν με ασφάλεια την ανταλλαγή τεχνικών πληροφοριών μεταξύ αυτοματοποιημένων συστημάτων εκτός της εσωτερικής εταιρικής τους δομής. Ταυτόχρονα, αν κοιτάξουμε τις διαδικασίες όπου δουλεύει ένα άτομο, τότε βλέπουμε ότι η συνεργασία διαφορετικών εταιρειών υπάρχει εδώ και καιρό και λειτουργεί με επιτυχία. Μπορείτε εύκολα να παραγγείλετε παράδοση προϊόντων που αγοράσατε από τον ιστότοπο της Amazon και ο courier θα μπορεί να οδηγήσει ένα αυτοκίνητο στους δρόμους της πόλης, να παραλάβει μια παραγγελία στο αποθεματικό κέντρο και να την φέρει σε εσάς.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Ποια είναι η διαφορά; Στην πρώτη περίπτωση δεν υπάρχει τρόπος να δημιουργηθεί συμβατική σχέση μεταξύ μηχανών και στη δεύτερη περίπτωση, στον κόσμο των ανθρώπων, οι συμβατικές σχέσεις υπάρχουν ήδη.",
  "Parachains": "Παρασυνδέσεις",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Το κύριο πρόβλημα που αντιμετωπίζει η Robonomics σήμερα είναι η υψηλή τιμή για την εκκίνηση μιας συσκευής IoT χρησιμοποιώντας το Ethereum. Στο Ethereum πρέπει να πληρώσετε προμήθεια για κάθε συναλλαγή σε δολάρια ΗΠΑ στο εύρος των 10 έως 100 δολαρίων. Είναι αρκετά ακριβό για τις περισσότερες περιπτώσεις από την πραγματική οικονομία, είτε πρόκειται για ένα ταξίδι κοινής χρήσης αυτοκινήτου, ενοικίαση έξυπνου διαμερίσματος, παράδοση με drone ή εκτύπωση 3D του αγαπημένου σας ήρωα ανιμέ για παραγγελία.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Για να είμαστε δίκαιοι, θα θέλαμε να σημειώσουμε ότι υπάρχουν κερδοφόρες περιπτώσεις ακόμα και με τα τέλη συναλλαγής στο δίκτυο Ethereum του 2018 - 2019. Για παράδειγμα, αυτόματες συναλλαγές αντιστάθμισης του οικολογικού αποτυπώματος άνθρακα ή μεταφορά της παραγγελίας απευθείας από τον ιστότοπο στην παραγωγή. Ωστόσο, για τη μαζική εφαρμογή των τεχνολογιών Web3 στον τομέα του IoT, απαιτείται μείωση της τιμής που η νέφος χρεώνει από τη συνδεδεμένη συσκευή.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Αναζητώντας μια ευκαιρία για μείωση του κόστους αλληλεπίδρασης με μια συσκευή IoT, οι προγραμματιστές του Robonomics έχουν μελετήσει εναλλακτικές εξελίξεις στο Ethereum. Η επιλογή μας επικεντρώθηκε στην",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "αρχιτεκτονική, η οποία θα μας επιτρέπει να εκτελέσουμε το δικό μας blockchain, εντός ενός κοινού δικτύου, στο οποίο η ασφάλεια εξασφαλίζεται από επικυρωτές ανεξάρτητους από το έργο μας.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Ομοιογενές δίκτυο blockchain",
  "Homogeneous Shard Network": "Ομοιογενές δίκτυο Shard",
  "On-chain protocol control": "Έλεγχος πρωτοκόλλου στην αλυσίδα",
  "Protection against the tyranny of the crowd": "Προστασία από την τυραννία του πλήθους",
  "Auction of bandwidth in the common network": "Δημοπρασία εύρους ζώνης στο κοινό δίκτυο",
  "Payment for gas by users": "Πληρωμή για το αέριο από τους χρήστες",
  "Have you read this?": "Το έχετε διαβάσει αυτό;",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Τα μεγάλα βιβλία οδηγούν σε μεγάλες ιδέες. Αν ψάχνετε για περισσότερη έμπνευση σχετικά με την ανθρώπινη-μηχανή επικοινωνία, δοκιμάστε να διαβάσετε βιβλία επιστημονικής φαντασίας. Σημειώστε τα βιβλία που έχετε ήδη διαβάσει και δείτε τι άλλο μπορούμε να σας προσφέρουμε για περαιτέρω σκέψη.",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Εγώ, ο ρομπότ",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "Ο διακοστοπενταετής άνθρωπος",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Κούκλες, ΙΚΕ",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Ανοιχτά ερωτήματα τηλεολογίας",
  "and a treatise by L. von Mises": "και ένα κείμενο του L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Συμπερασματικά, θα θέλαμε να αναφέρουμε ερωτήματα που παραμένουν ανοιχτά από παγκόσμια οπτική γωνία. Ποιος είναι ο στόχος των ρομπότ; ",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Στην πραγματικότητα, η οικονομία των ανθρώπων συνδέεται συχνά με τη συνείδηση της εκτέλεσης καθηκόντων εντός του πλαισίου της σύμβασης, την επιθυμία των μερών να επιτύχουν ένα αποτέλεσμα, την ευκαιριακή και αλτρουιστική συμπεριφορά του ατόμου στην κοινωνία. Όλες αυτές οι αρχές είναι δύσκολο να εφαρμοστούν στην οικονομία των ρομπότ. Ποιοι είναι οι κίνητροι της οικονομίας των ρομπότ; Είναι ένα ανοιχτό ερώτημα που πρέπει να ερευνήσουμε και να συζητήσουμε στην κοινωνία για καλύτερη κατανόηση και εφαρμογή των ρομπότ.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Για αρχή προτείνουμε να ρίξετε μια ματιά στο έργο του Mises \"Ανθρώπινη Δράση: Ένα Κείμενο για την Οικονομία\" (πραξεολογική προσέγγιση) και στο πρώιμο άρθρο του Norbert Wiener \"Συμπεριφορά, Σκοπός και Τηλεολογία\" (τηλεολογική όραση).",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Η πραξεολογία μας εμπνέει με ενδιαφέρουσες ιδέες για την ανθρώπινη συμπεριφορά χωρίς άμεση εξάρτηση από τους σκοπούς. Αυτό μας δίνει τη δυνατότητα να εργαστούμε στις διαδικασίες της οικονομίας των ρομπότ ως με ένα μαύρο κουτί χωρίς να εμβαθύνουμε στους τελικούς στόχους. Ταυτόχρονα, η τηλεολογία θέτει ένα πρόβλημα για να εξηγήσει τις αιτίες.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Ελπίζουμε ότι κάπου στο σημείο των έργων του Mises και του Wiener, μπορεί να βρεθεί ένα σημείο για περαιτέρω ανάπτυξη της οικονομίας των ρομπότ, όχι μόνο ως ένα πρωτόκολλο αλληλεπίδρασης μεταξύ ανθρώπων και μηχανών με πραξεολογική φύση, αλλά λαμβάνοντας υπόψη τα τηλεολογικά στοιχεία της κατασκευής της διακοινοτικής επικοινωνίας.",
  "Robonomics whitepaper 2022 welcome guide": "Οδηγός καλωσορίσματος του Robonomics whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Έχουμε αναπτύξει ένα πρωτόκολλο επικοινωνίας μηχανής τεχνοοικονομικής τεχνολογίας που λειτουργεί πάνω από το Ethereum και το IPFS και το συμπληρώνουμε με στοιχεία μιας πλατφόρμας IoT βασισμένης στον παρακείμενο του Polkadot. Σήμερα, έχουμε ήδη μια υβριδική πλατφόρμα για τη δημιουργία μελλοντικών εφαρμογών IoT. Παρέχει αλληλεπίδραση με συσκευές υπό τον έλεγχο ενός παγκόσμιου αποκεντρωμένου υπολογιστή. Πριν αρχίσουμε να δημιουργούμε ασφαλείς, ανυπηρέτητες και μελλοντικές εφαρμογές IoT χρησιμοποιώντας την πλατφόρμα Robonomics, ας βουτήξουμε λίγο στη θεωρία...",
  "Chapter 1.": "Κεφάλαιο 1.",
  "At the intersection of cybernetics and economics": "Στο σημείο της κυβερνονομίας και της οικονομίας",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Παρουσιάσαμε ένα οικονομικό σύστημα στο οποίο τα ρομποτικά συστήματα λειτουργούν ως ανεξάρτητοι πράκτορες ικανοί να εκτελούν βασικές οικονομικές δραστηριότητες, που προηγουμένως ήταν κατοχυρωμένες για τους ανθρώπους. Σε αυτό το κεφάλαιο, θα μιλήσουμε για τη σημασία της οικονομίας των ρομπότ, η οποία μπορεί να γίνει σημαντικό μέρος της ζωής των ανθρώπων και να αλλάξει το τρέχον επίπεδο της οικονομίας σε πλήρως αυτοματοποιημένες υπηρεσίες στο μέλλον.",
  "In this chapter you will learn": "Σε αυτό το κεφάλαιο θα μάθετε",
  "Ronald Coase and The Nature of the Firm": "Ο Ronald Coase και η φύση της εταιρείας",
  "CPS - cyber-physical system": "CPS - κυβερνο-φυσικό σύστημα",
  "Norbert Wiener and the search for patterns in living and machine": "Ο Norbert Wiener και η αναζήτηση προτύπων στον ζωντανό και μηχανικό κόσμο",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Η Τέταρτη Βιομηχανική Επανάσταση, Χρήμα για Ρομπότ και Bitcoin",
  "Ethereum Smart Contracts": "Έξυπνα Συμβόλαια Ethereum",
  "Polkadot Parachains": "Παρακείμενοι του Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot έναντι Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Ανοιχτά ερωτήματα τηλεολογίας και το έργο του Mises",
  "Read chapter 1": "Διαβάστε το κεφάλαιο 1",
  "Chapter 2.": "Κεφάλαιο 2.",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Στο δεύτερο κεφάλαιο, θα διαβάσετε για την αλληλεπίδραση ανθρώπου-μηχανής χρησιμοποιώντας σύγχρονη τεχνολογία Internet - από συσκευές IoT έως ένα αποκεντρωμένο και παγκοσμίως προσβάσιμο δίκτυο παρόχων. Θα εξετάσουμε τα βασικά στοιχεία του Διαδικτύου των Πραγμάτων για να τονίσουμε τα προβλήματα και τις κύριες προκλήσεις που αντιμετωπίζουν οι δημιουργοί συστημάτων IoT και στην επίλυση των οποίων στοχεύει ο Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Επισκόπηση της κατάστασης του Διαδικτύου των Πραγμάτων (IoT)",
  "Autonomous Systems": "Αυτόνομα Συστήματα",
  "Digital twins are the heart of the Internet of Things": "Οι ψηφιακοί δίδυμοι είναι η καρδιά του Διαδικτύου των Πραγμάτων",
  "IoT data flows in cloud service": "Ροές δεδομένων IoT σε υπηρεσία cloud",
  "Read chapter 2": "Διαβάστε το κεφάλαιο 2",
  "We continue to update the white paper of Robonomics": "Συνεχίζουμε να ενημερώνουμε το white paper του Robonomics",
  "stay tuned for new parts on our website and in Discord": "μείνετε συντονισμένοι για νέα μέρη στον ιστότοπό μας και στο Discord",
  "Join our discord": "Συμμετέχετε στο Discord μας",
  "Robonomics tokenomics": "Οικονομικά των Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "είναι το χρησιμότητας token που θα καθιστά δυνατό τον έλεγχο των συσκευών IoT πάνω από το δίκτυο Ethereum και το Robonomics parachain στο οικοσύστημα του Polkadot.",
  "Token distribution": "Διανομή των token",
  "Try our Dapp": "Δοκιμάστε την εφαρμογή μας Dapp",
  "In addition": "Επιπλέον",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "μπορείτε να λειτουργήσετε το XRT εντός των blockchain χρησιμοποιώντας εργαλεία που παρέχονται από διάφορες ανεξάρτητες ομάδες στις κοινότητε του Polkadot (Kusama) και του Ethereum.",
  "Within the Kusama network, you have the capability use": "Εντός του δικτύου Kusama, έχετε τη δυνατότητα να χρησιμοποιήσετε",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "επικοινωνία μεταξύ του Robonomics parachain και άλλων parachains χρησιμοποιώντας διάφορες αποκεντρωμένες εφαρμογές (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Εντός του δικτύου Ethereum μπορείτε να χρησιμοποιήσετε αποκεντρωμένη εφαρμογή που τροφοδοτείται από το",
  "Be aware of scammers": "Να είστε προσεκτικοί με τους απατεώνες",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "παρακαλούμε χρησιμοποιήστε μόνο γνωστές αγορές για την ανταλλαγή XRT. Μην στέλνετε τα κέρματά σας σε λογαριασμούς που σας δίνονται μέσω προσωπικών μηνυμάτων, ανεξάρτητα από τη συναλλαγή που θέλετε να πραγματοποιήσετε (αγορά ή πώληση κερμάτων). Εάν λάβετε οποιεσδήποτε 'δυνατές δηλώσεις' σχετικά με το κέρμα Robonomics (οι απατεώνες χρησιμοποιούν συχνά κάτι σαν ανακοίνωση airdrop), παρακαλούμε ελέγξτε αυτήν την ιστοσελίδα (https://robonomics.network/) ή το",
  "for official updates. Be careful, be safe.": "για επίσημες ενημερώσεις. Να είστε προσεκτικοί, να είστε ασφαλείς.",
  "XRT in Ethereum": "XRT στο Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Εφαρμογή του έργου Robonomics από το 2015 έως το 2018, η ομάδα του έργου χρειαζόταν να βρει μια σύνδεση μεταξύ της παροχής μιας χρήσιμης λειτουργίας από το δίκτυο Robonomics, δηλαδή τν εκκίνηση συσκευών IoT σύμφωνα με το μοντέλο ρομπότ-ως-υπηρεσίας και την αποζημίωση των εξόδων για τα τέλη αερίου στο Ethereum στους παρόχους του Robonomics. Χρειαζόμασταν να σκεφτούμε τον κύκλο ζωής της ευθύνης κάθε ξεχωριστής έξυπνης συσκευής για να εκτελέσει μια υπηρεσία. Ως αποτέλεσμα της πρώιμης έρευνας και ανάπτυξης στο Robonomics, η ομάδα δημιούργησε έναν μηχανισμό για την εξόρυξη νέων κρυπτονομισμάτων για να ανταμείψει κάθε δημιουργημένο έξυπνο συμβόλαιο ρομπότ-ως-υπηρεσίας. Αυτό το μοντέλο παραμένει εφικτό για το μέλλον του Robonomics στο Ethereum, αλλά μόνο με σημαντικές βελτιώσεις στο Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Διαβάστε αυτό για να γνωρίσετε το ιστορικό υπόβαθρο και τα μακροπρόθεσμα σχέδια της ομάδας για το XRT στο οικοσύστημα του Ethereum.",
  "Etherscan profile": "Προφίλ Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Προβολή έξυπνου συμβολαίου των τοκετών και συναλλαγών στο δίκτυο Ethereum εδώ.",
  "Coingecko markets": "Αγορές Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Εδώ μπορείτε να βρείτε αγορές CEX και DEX για την εμπορία του XRT.",
  "XRT In Polkadot": "XRT στο Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Μετακίνηση από το Ethereum στο Polkadot, χρειαζόμαστε ένα «αναβαθμισμένο» στην τοκετονομία. Οι Parachains στο οικοσύστημα του Polkadot δεν είναι ισοδύναμες με ένα έξυπνο συμβόλαιο, αλλά είναι ένα πλήρως προγραμματιζόμενο blockchain που μισθώνει ένα τμήμα του συνολικού δικτύου.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Η πραγματική πληρωμή από τα Parachains του Polkadot και του Kusama είναι η μακροπρόθεσμη δέσμευση των νατίβων τοκετών του Relay chain (DOT / KSM) σε επαρκή ποσότητα για να κερδίσει μία από τις δημοπρασίες. Το XRT στο Robonomics parachain υποστηρίζει την ανανέωση θέσης και τις ανταμοιβές για τους ενδιαφερόμενους φορείς. Ο μηχανισμός καύσης XRT που βρίσκεται στη βάση της ενεργοποίησης των συνδρομών IoT σχεδιάστηκε για να μειώσει την πληθωριστική πίεση στο ελάχιστο και σε περίπτωση αυξημένου ενδιαφέροντος να τη μειώσει στο μηδέν.",
  "Learn more": "Μάθετε περισσότερα",
  "in Twitter thread from our network architect.": "στο νήμα Twitter από τον αρχιτέκτονα του δικτύου μας.",
  "Usage:": "Χρήση:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "Το XRT μπορεί να χρησιμοποιηθεί τόσο για την πληρωμή των τελών για την εκτέλεση συναλλαγών στο parachain όσο και για την αγορά μιας συνδρομής IoT που εγγυάται προτεραιότητα στην επεξεργασία συσκευών ή χρηστών IoT.",
  "Rewards:": "Ανταμοιβές:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Καθ' όλη τη διάρκεια του έτους, το parachain εκδίδει μια μικρή ποσότητα XRT για να ενθαρρύνει τους συλλέκτες του parachain.",
  "The parameter of the total reward": "Ο παράμετρος της συνολικής ανταμοιβής",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "για τους συλλέκτες για το έτος καθορίζεται από ψηφοφορία των κατόχων των τοκετών στην αλυσίδα και μπορεί να αλλάξει με τη διεξαγωγή δημοψηφίσματος.",
  "Use XRT": "Χρησιμοποιήστε το XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Αγοράστε μια συνδρομή IoT στην αποκεντρωμένη εφαρμογή μας. Ελέγξτε τις έξυπνες συσκευές σας μέσω του blockchain χωρίς καμία κεντρική εταιρεία να παρακολουθεί.",
  "Subscan profile": "Προφίλ Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Προβολή στατιστικών τοκετών πάνω από το οικοσύστημα του Polkadot.",
  "Other questions": "Άλλες ερωτήσεις",
  "What is RWS?": "Τι είναι το RWS;",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Υπό ανάπτυξη της πυρήνα λειτουργικότητας] Για τους μηχανικούς, η ομάδα Core Dev θα προσπαθήσει να δημιουργήσει διάφορα μοντέλα χρήσης του Robonomics και το πρώτο βήμα σε αυτήν την κατεύθυνση είναι η εκκίνηση ενός διαρκούς συμβολαίου συνδρομής - του RWS token. Κάθε RWS token θα σας παρέχει 1 συναλλαγή ανά δευτερόλεπτο (tps) από/προς τη συσκευή IoT σας μέσω του Robonomics Parachain. Ενεργοποιήστε το RWS token σας και πραγματοποιήστε σναλλαγές με «δωρεάν αέριο» με προβλέψιμη καθυστέρηση. Απενεργοποιήστε το RWS token σας και εμπορευθείτε το στο DEX.",
  "What is AIRA/AIR ID?": "Τι είναι το AIRA/AIR ID;",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Προ-XRT token που διανεμήθηκε το 2017 ως αυτόνομο μέρος της περαιτέρω υποδομής του Robonomics στο Ethereum. Μετά την επιτυχή εκκίνηση του Robonomics στο Ethereum το 2019, τα AIRA tokens συνδέθηκαν με τη δημιουργημένη υποδομή του έργου μέσω του έξυπνου συμβολαίου ambix, το οποίο εγγυάται αυτόνομη και ανεξάρτητη διαδικασία ανταλλαγής των προ-XRT σε ERC-20 XRT.",
  "This page is out of your space": "Αυτή η σελίδα είναι εκτός του χώρου σας",
  "Check url once more or create an": "Ελέγξτε ξανά το URL ή δημιουργήστε ένα",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "μας λέει ότι έχετε σφάλμα 404 (μην ξεχάσετε να αναφέρετε το τρέχον URL)",
  "This page has moved to a": "Αυτή η σελίδα έχει μετακινηθεί σε μια",
  "Automatic redirecting": "Αυτόματη ανακατεύθυνση",
  "Embedded IoT systems": "Ενσωματωμένα συστήματα IoT",
  "Main tasks of Robonomics architecture": "Κύριες εργασίες τς αρχιτεκτονικής Robonomics",
  "ambix smart contract": "έξυπνο συμβόλαιο ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "το οποίο εξασφάλιζε αυτόνομη και ανεξάρτητη διαδικασία ανταλλαγής προ-XRT σε ERC-20 XRT.",
  "or": "ή",
  "User (D)App": "Χρήστης (D)App",
  "Function request": "Αίτηση λειτουργίας",
  "Report": "Αναφορά",
  "Digital twin": "Ψηφιακός δίδυμος",
  "Control": "Έλεγχος",
  "Log": "Αρχείο καταγραφής",
  "IoT Device": "Συσκευή IoT",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Η αποκεντρωμένη εφαρμογή (dapp) λειτουργεί εντός του Blockchain. Είναι ανοιχτού κώδικα και τα δεδομένα της εξυπηρετούνται στο IPFS και το Github. Αυτές οι τεχνολογίες επιτρέπουν στην εφαρμογή να είναι ασφαλής και διαφανής ταυτόχρονα. Οι προγραμματιστές μας εργάζονται τόσο στην ανάπτυξη της εφαρμογής Robonomics όσο και στις βιβλιοθήκες που μπορείτε να χρησιμοποιήσετε κατά την κατασκευή της δικής σας dapp.",
  "Decentralized application": "Αποκεντρωμένη εφαρμογή",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Ο ψηφιακός δίδυμος είναι ένα από τα εργαλεία που παρέχονται από τις Υπηρεσίες Ιστού Robonomics (RWS). Λειτουργεί ως μια ψηφιακή έκδοση του πραγματικού εξοπλισμού και αντιγράφει όλα τα τεχνικά του χαρακτηριστικά. Επιτρέπει να γίνει μια αποκεντρωμένη εφαρμογή πιο ανταποκρίσιμη στις εντολές του χρήστη.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Μπορείτε να χρησιμοποιήσετε το Robonomics με μια ευρεία γκάμα έξυπνων συσκευών Zigbee για την αυτοματοποίηση και έλεγχο διάφορων πτυχών του σπιτιού/γραφείου σας ή να το χρησιμοποιήσετε με ρομποτική βασισμένη στο ROS για πιο πολύπλοκες βιομηχανικές εργασίες.",
  "IoT / Smart device": "Συσκευή IoT / Έξυπνη συσκευή",
  "Notable events": "Σημαντικά γεγονότα",
  "Important news &amp; announcements": "Σημαντικά νέα και ανακοινώσεις",
  "The task": "Η εργασία",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "του Robonomics token είναι να εξασφαλίσει τη λειτουργία ενός αποκεντρωμένου δικτύου για τη συντήρηση των Έξυπνων Πόλεων και της Βιομηχανίας 4.0 στην υποδομή του blockchain. Για να επιτευχθεί αυτός ο στόχος, η οικονομία του token πρέπει να αντανακλά τις κινήτρα για την υλοποίηση του δικτύου.",
  "Robonomics White Paper": "Λευκή Βίβλος Robonomics",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Εδώ μπορείτε να βρείτε και να κατεβάσετε (εντελώς δωρεάν, φυσικά) την πρώτη Λευκή Βίβλο του Robonomics, η οποία παρουσιάστηκε τον Μάιο του 2018. Παρόλο που πολλά έχουν εξελιχθεί από τότε, τα θεμέλια του Robonomics περιγράφονται ακόμα σε αυτό το έγγραφο.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Ένας Αυτόνομος Ρομποτικός Καλλιτέχνης Ελεύθερης Επαγγελματικής Δραστηριότητας",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Συνεργατική Ανίχνευση και Παρακολούθηση Κινούμενων Ορίων Περιβαλλοντικών Περιοχών από Ομάδες Μη Ολονομικών Ρομπότ",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Ρομπότ-ως-Υπηρεσία: Από τις Τεχνολογίες Νέφους στις Τεχνολογίες Συνδεσμολογίας",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Αξιόπιστη Περιβαλλοντική Παρακολούθηση μέσω Δικτύων Αισθητήρων σε Σμηνοπλωτά Αυτόνομα Ναυτικά Σκάφη και Τεχνολογία Κατανεμημένου Λογιστικού Βιβλίου",
  "Digital Passport for Unmanned Vehicles": "Ψηφιακό Διαβατήριο για Ανεπανόρθωτα Οχήματα",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics ως Μια Βασισμένη σε Αλυσίδα Τμήματος για τη Διαχείριση Μη Επανδρωμένης Κίνησης Κινητών Οχημάτων",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Προς Βασισμένα σε Αλυσίδα Πολυπληθείς Ρομποτικά Συστήματα Πολπληθών Πρακτόρων: Ανάλυση, Κατηγοριοποίηση και Εφαρμογές",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Ρομποτικές Υπηρεσίες για Νέες Παραδείγματος Έξυπνες Πόλεις Βασισμένες σε Αποκεντρωμένες Τεχνολογίες",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Πρωτόκολλο για την Οργάνωση Διακεντρωμένου Δικτύου Αυτόνομων Πρακτόρων σε Εργοστάσια με Χρήση Μηχανισμών Αγοράς",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Προς Βασισμένο σε Αλυσίδα Robonomics: Επικύρωση Συμπεριφοράς Αυτόνομων Πρακτόρων",
  "Transforming Climate Finance and Green Investment with Blockchains": "Μετασχηματίζοντας την Χρηματοδότηση του Κλίματος και τις Πράσινες Επενδύσεις με Αλυσίδες Μπλοκ",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: πλατφόρμα για την ένταξη κυβερνοφυσικών συστημάτων στην ανθρώπινη οικονομία",
  "Blockchain based protocol for economical communication in industry 4.0": "Πρωτόκολλο βασισμένο σε αλυσίδα για οικονομική επικοινωνία στη βιομηχανία 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics βασισμένο σε αλυσίδα ως αρχή δημιουργίας έξυπνων εργοστασίων",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Οικοσύστημα αλυσίδας για αγορές άνθρακα, περιβαλλοντικά περιουσιακά στοιχεία, δικαιώματα και υποχρεώσεις: Σχεδιασμός και υλοποίηση έννοιας",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Πρωτόκολλο βασισμένο σε αλυσίδα για αυτόνομη επιχειρηματική δραστηριότητα πολυπληθών συστημάτων πρακτόρων που αποτελούνται από UAVs",
  "English": "Αγγλικά",
  "Russian": "Ρωσικά",
  "Chinese": "Κινεζικά",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Το Robonomics είναι μια πλατφόρμα ανοιχτού κώδικα που διευκολύνει τόσο απλές υπηρεσίες IoT όσο και πολύπλοκη ρομποτική, δυνατότητα αποτελεσματικής επικοινωνίας μεταξύ πρακτόρων, είτε αυτοί είναι ανθρώπινοι είτε ρομποτικοί. Για να ενσωματώσουμε τα ρομπότ σε αυτό το σύστημα, χρησιμοποιούμε το ROS. Σε αυτό το άρθρο, στοχεύουμε να παρέχουμε μια επισκόπηση της διαδικασίας μας για την ενσωμάτωση του Robonomics στο ROS 2.",
  "Research papers": "Ερευνητικά άρθρα",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Χωρίς ακαδημαϊκή έρευνα, η προαγωγή πολύπλοκων συστημάτων που μπορούν να ενσωματωθούν στην καθημερινή μας ζωή μπορεί να χάσει τον σκοπό της ή ακόμα και να δημιουργήσει κινδύνους. Πρέπει να σκεφτούμε προσεκτικά την κατεύθυνσή μας, τους στόχους μας και τις πιθανές συνέπειες. Οι τομείς όπου λειτουργεί το Robonomics, ειδικότερα η Ρομποτική, οι Οικονομικές σχέσεις και οι τεχνολογίες Web3, αξίζει να μελετηθούν ξεχωριστά, εξερευνώντας πώς μπορούν να ενσωματωθούν μεταξύ τους και αξιολογώντας την πιθανή επίδρασή τους στη ζωή μας.",
  "Why ROS 2 in Robonomics?": "Γιατί το ROS 2 στο Robonomics;",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "Το ROS, το Λειτουργικό Σύστημα Ρομπότ, είναι ένα από τα παλαιότερα ανοικτού κώδικα πλαίσια για ρομποτική. Είναι μια συλλογή από βιβλιοθήκες λογισμικού και εργαλεία για τη λειτουργία των ρομπότ. Διαθέτει τα πάντα από τα βασικά έως τα προηγμένα χαρακτηριστικά και παρέχει χρήσιμα εργαλεία για τους προγραμματιστές. Χρησιμοποιείται ευρέως από πανεπιστήμια σε όλο τον κόσμο για τη διδασκαλία και την έρευνα στη ρομποτική, οπότε είναι εδραιωμένο, λειτουργεί με πολλούς τύπους ρομπότ και έχει μια μεγάλη κοινότητα προγραμματιστών.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Από τότε που ξεκίνησε το ROS το 2007, έχουν γίνει σημαντικές αλλαγές στον τομέα της ρομποτικής και μέσα στην κοινότητα του ROS. Ως απάντηση σε αυτές τις εξελίξεις, εισήχθη το ROS 2 με σκοπό να προσαρμοστεί σε αυτές τις αλλαγές. Βασίζεται στα πλεονεκτήματα του ROS 1 ενώ αντιμετωπίζει τους περιορισμούς του. Χρησιμοποιούμε το ROS στο Robonomics από την αρχή και τώρα είναι η στιγμή να μεταβούμε στο ROS 2.",
  "You might find this interesting": "Μπορεί να σας ενδιαφέρει αυτό",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Υπάρχουν πολλά ανοικτού κώδικα ρομπότ και πολύπλοκες ρομποτικές πλατφόρμες που υποστηρίζουν το ROS. Αυτό σημαίνει ότι μπορείτε να δημιουργήσετε ένα εντυπωσιακό πολυ-ρομποτικό σύστημα για την επίτευξη των συγκεκριμένων στόχων σας. Για την ",
  "the most current list of supported robots": "η πιο πρόσφατη λίστα υποστηριζόμενων ρομπότ",
  "please visit the ROS website.": "επισκεφθείτε την ιστοσελίδα του ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Ας δούμε πώς χρησιμοποιείται το ROS εντός του πλαισίου Robonomics, εικονίζοντας το σύνολο του συστήματος με το Robonomics να λειτουργεί ως διάφορα επίπεδα:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "Στο επίπεδο 'Διεπαφής Μηχανής', χρειαζόμαστε εργαλεία για ασύγκριτη σύνδεση ρομπότ με λογισμικό. Το ROS 2 παρέχει ένα αξιόπιστο σύνολο εργαλείων για προγραμματιστές που είναι ιδανικά κατάλληλα για αυτήν την εργασία.",
  "Robonomics packages for ROS and ROS 2": "Πακέτα Robonomics για το ROS και το ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "Η δημιουργία ενός πολυ-ρομποτικού συστήματος συχνά περιλαμβάνει την πρόκληση της σύνδεσης συσκευών από διάφορους προμηθευτές, ή ακόμα και συσκευών εντός ενός μόνο προμηθευτή, καθένας χρησιμοποιώντας διαφορετικά πρωτόκολλα. Είτε πρόκειται για μια έξυπνη οικιακή εγκατάσταση είτε για αυτοματοποιημένη κατασκευή, η αποτελεσματική επικοινωνία μεταξύ των μηχανών σας είναι ζωτικής σημασίας. Το ROS (και, φυσικά, το ROS 2) προσφέρει διάφορους τρόπους για να αντιμετωπίσει αυτό. Τι θα γινόταν αν μπορούσατε να προσαρμόσετε τις εργασίες ενώ το ROS διαχειρίζεται την επικοινωνία μεταξύ των κόμβων;",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Η ομάδα του Robonomics έχει δημιουργήσει διάφορα πακέτα για το ROS προκειμένου να καθιστά τα ρομπότ πιο έξυπνα και να αντιμετωπίζει συγκεκριμένες εργασίες όπως απαιτείται. Για να δείτε τις εργασίες που έχουμε επιτελέσει με το ROS, ελέγξτε τη σελίδα μας με τις περιπτώσεις έρευνας και ανάπτυξης. Σχεδόν κάθε αλληλεπίδραση με ένα ρομπότ βασίζεται στο ROS. Μπορείτε να βρείτε τα ανοικτού κώδικα πακέτα Robonomics για το ROS στο GitHub, και εδώ είναι μερικά από αυτά.",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Το στοίβα επικοινωνίας του Robonomics περιλαμβάνει ένα σύνολο πακέτων ROS για οικονομικούς σκοπούς επικοινωνίας.",
  "Robonomics' contribution in the ROS 2 community": "Η συνεισφορά του Robonomics στην κοινότητα ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Το Robonomics συνδυάζει τη ρομποτική με τις τεχνολογίες Web3 και στοχεύουμε να αναπτυχθούμε σε αυτούς τους τομείς. Από την εισαγωγή του ROS 2, έχουμε αναγνωρίσει τρεις κύριες προκλήσεις που αφορούν την υποστήριξη της κοινότητας ROS 2 και τη βελτίωση των δυνατοτήτων του Robonomics:",
  "Creating ROS 2 tools for Rust:": "Δημιουργία εργαλείων ROS 2 για τη Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Αυτά τα εργαλεία επιτρέπουν στους προγραμματιστές να γράψουν εφαρμογές ROS 2 χρησιμοποιώντας τη Rust. Για να μάθετε περισσότερα γιατί επιλέξαμε τη Rust και τη σημασία αυτού του έργου για εμάς, μπορείτε να βρείτε",
  "additional details": "πρόσθετες λεπτομέρειες",
  "Developing Robonomics Middleware for ROS 2:": "Ανάπτυξη του Robonomics Middleware για το ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Αυτό παίζει ένα σημαντικό ρόλο στη διασφάλιση της άρρηκτης ενσωμάτωσης του Robonomics σε διάφορα πολυ-πράκτορα ρομποτικά συστήματα χρησιμοποιώντας το ROS 2. Μπορεί να διευκολύνει την ενσωμάτωση των ρομπότ στις τεχνολογίες αλυσίδας Web 3, μειώνοντας τα σφάλματα κατά τη διάρκεια της διαδικασίας ενσωμάτωσης, εξοικονομώντας έτσι χρόνο και κόστος.",
  "Creating a robotics lab with ROS 2:": "Δημιουργία ενός εργαστηρίου ρομποτικής με το ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Καθώς το ROS 2 κερδίζει δημοτικότητα στη ρομποτική κοινότητα, είμαστε ανυπόμονοι να δούμε περισσότερα ρομπότ και υλικό να λειτουργούν με το ROS 2. Ο στόχος μας είναι να τα συνδέσουμε με το οικοσύστημα Web3 χρησιμοποιώντας το Robonomics.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Αυτή η υπόθεση βρίσκεται αυτή τη στιγμή σε εξέλιξη· μην χάσετε τα νέα - εγγραφείτε για ενημερώσεις στο παρακάτω πλαίσιο",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "Η «Robonomics Coffee» είναι μια έξυπνη καφετιέρα ενσωματωμένη στο δίκτυο Robonomics. Αυτό το έργο στοχεύει να απεικονίσει τις δυνατότητες της Robonomics στη σφαίρα του IoT μέσω ενός πραγματικού παραδείγματος.",
  "logos and assets": "λογότυπα και περιουσιακά στοιχεία",
  "Download the Robonomics logos here. We've got two options for your": "Κατεβάστε τα λογότυπα του Robonomics εδώ. Έχουμε δύο επιλογές για τις",
  "basic needs": "βασικές σας ανάγκες",
  "and one designed for": "και μία σχεδιασμένη για το",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "token. Επιπλέον, ανακαλύψτε την βέλτιστη",
  "color palette": "παλέτα χρωμάτων",
  "for the distinguished Robonomics brand": "για το διακεκριμένο brand του Robonomics",
  "Robonomics logos": "Λογότυπα Robonomics",
  "Download all": "Κατεβάστε όλα τα",
  "XRT logos": "λογότυπα XRT",
  "Recommended color palette": "Προτεινόμενη παλέτα χρωμάτων",
  "RWS logos": "Λογότυπα RWS",
  "You are currently opted out. Click here to opt in.": "Αυτήν τη στιγμή έχετε εξαιρεθεί. Κάντε κλικ εδώ για να δηλώσετε συμμετοχή.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Η εξαίρεση ολοκληρώθηκε. οι επισκέψεις σας σε αυτόν τον ιστότοπο δεν θα καταγράφονται από το εργαλείο Web Analytics. Σημειώστε ότι εάν διαγράψετε τα cookie, διαγράψετε το cookie εξαίρεσης ή εάν αλλάξετε υπολογιστές ή προγράμματα περιήγησης Ιστού, θα χρειαστεί να εκτελέσετε ξανά τη διαδικασία εξαίρεσης.",
  "Please click below to opt in:": "Κάντε κλικ παρακάτω για να δηλώσετε συμμετοχή:",
  "You are currently opted in. Click here to opt out.": "Αυτήν τη στιγμή έχετε επιλέξει συμμετοχή. Κάντε κλικ εδώ για να εξαιρεθείτε.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Μπορείτε να επιλέξετε να μην εκχωρηθεί ένας μοναδικός αριθμός αναγνώρισης cookie αναλυτικών στοιχείων ιστού στον υπολογιστή σας για να αποφύγετε τη συγκέντρωση και ανάλυση των δεδομένων που συλλέγονται σε αυτόν τον ιστότοπο.",
  "To make that choice, please click below to receive an opt-out cookie": "Για να κάνετε αυτήν την επιλογή, κάντε κλικ παρακάτω για να λάβετε ένα cookie εξαίρεσης",
  "Privacy Policy": "Πολιτική Απορρήτου",
  "Robonomics Middleware Framework for ROS 2": "Πλαίσιο Middleware Robonomics για το ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Συνδυάζοντας τεχνολογίες Web3 και πλαισίων ρομποτικής",
  "Playing with Human-Machine Interaction through Ethereum": "Παιχνίδι με την αλληλεπίδραση ανθρώπου-μηχανής μέσω του Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Αυτές οι πληροφορίες μελέτης έχουν λήξει. Για ενημερωμένα μαθήματα και εργαστήρια επισκεφθείτε την",
  "academy": "ακαδημία",
  "Home assistant themes": "Θέματα βοηθού στο σπίτι",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Προσαρμόστε το Home Assistant σας με τα θέματά μας που μπορείτε να χρησιμοποιήσετε δωρεάν. Ακολουθήστε τις οδηγίες για την εγκατάσταση στο",
  "Do you want": "Θέλετε",
  "to dive even deeper?": "να καταδυθείτε ακόμα πιο βαθιά;",
  "Our": "Το",
  "White Paper": "Λευκό Χαρτί",
  "Science": "Επιστήμη",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Νομίζουμε ότι το διάβασμα βιβλίων μπορεί πραγματικά να ανοίξει το μυαλό σας. Είτε πρόκειται για απλές αλλά έξυπνες ιδέες είτε για πιο πολύπλοκες, τα βιβλία είναι ο καλύτερος τρόπος για το μυαλό σας να απορροφήσει τα πάντα. Μπορείτε να αποκτήσετε τα βιβλία μας δωρεάν και να ελέγξετε τη λίστα μας με τις συνιστώμενες αναγνώσεις για να καταδυθείτε στον συναρπαστικό κόσμο της ρομποτικής!",
  "Download books about Robonomics": "Λήψη βιβλίων για τη Ρομπονομική",
  "Open your mind [list of recommendations]": "Ανοίξτε το μυαλό σας [λίστα συστάσεων]",
  "Robonomics R&D": "R&D Ρομπονομικής",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Οικονομική των Ρομπότ",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Πάρτε τα εμπορεύματά σας με μοναδική τέχνη Robonomics ζωγραφισμένη από τα όμορφα κορίτσια μας. Δημιουργήσαμε καταστήματα στις μεγαλύτερες online αγορές για καλλιτέχνες, τσεκάρετέ το και βρείτε μπλούζες, μακρυμάνικα, φούτερ, κουρτίνες ντους, μαξιλάρια, κουβέρτες και άλλα χρήσιμα αντικείμενα.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Έχουμε επιλέξει το πιο γνωστό πλαίσιο ρομποτικής που ονομάζεται Λειτουργικό Σύστημα Ρομπότ (ROS) ως το πρότυπο διεπαφής για την ολοκλήρωση οποιουδήποτε συμβατού κυβερνο-φυσικού συστήματος. Το Robonomics υποστηρίζει αρκετές χρήσεις για το ROS. Η υλοποίηση του Robonomics για το δίκτυο Ethereum είναι στη μορφή του πακέτου ROS robonomics_comm. Για την αρχιτεκτονική ROS 2, υλοποιούμε υποστήριξη για το Robonomics ως ενδιάμεσο επίπεδο (δείτε το «Robonomics ως ενδιάμεσο επίπεδο ROS 2» για λεπτομέρειες). Όταν η χρήση του ROS είναι περιττή (π.χ. όταν εργάζεστε με συσκευές IoT), έχει αναπτυχθεί ένα πρόσθετο Python robonomics-interface module. Βοηθά στην πρόσβαση στις λειτουργίες του Robonomics με φυσικό τρόπο και λειτουργεί τόσο με τοπικούς και ιδιωτικούς κόμβους όσο και με απομακρυσμένους και δημόσιους κόμβους.",
  "read our almanac": "διαβάστε τον αλμανάκ μας",
  "Begin your adventure in the world of cyberpunks": "Ξεκινήστε την περιπέτειά σας στον κόσμο των cyberpunks",
  "Pure open source": "Καθαρό open source",
  "Local and Global Availability": "Τοπική και Παγκόσμια Διαθεσιμότητα",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Χρησιμοποιώντας το ανοιχτό κώδικα, την P2P και το Web3, δεν υπάρχει χώρος για εταιρικά κόλπα, εξασφαλίζοντας ότι τα προσωπικά σας δεδομένα προστατεύονται. Όλες οι πληροφορίες αποθηκεύονται είτε τοπικά είτε κρυπτογραφημένες με το προσωπικό σας κλειδί στο Web3 cloud.",
  "Interested in how the team reached this stage?": "Ενδιαφέρεστε για το πώς η ομάδα έφτασε σε αυτό το στάδιο;",
  "The Robonomics Timeline": "Η Χρονολογία του Robonomics",
  "can guide you through our journey": "μπορεί να σας καθοδηγήσει μέσα από το ταξίδι μας",
  "Device Design and Development": "Σχεδιασμός και Ανάπτυξη Συσκευών",
  "Smart devices": "Έξυπνες συσκευές",
  "Wearable merch": "Φορετά είδη",
  "Academy": "Ακαδημία",
  "Wiki": "Βικιπαίδεια",
  "Science & White paper": "Επιστήμη & Λευκό βιβλίο",
  "Tokenomics": "Tokenomics",
  "Cases": "Περιστατικά",
  "Brand assets": "Εμπορικά σήματα",
  "Wallpapers": "Ταπετσαρίες",
  "NFT": "NFT",
  "Blog": "Ιστολόγιο",
  "Contacts": "Επαφές",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Γίνετε πάροχος δεδομένων περιβάλλοντος στους φίλους και τους γείτονές σας στην περιοχή. Αποκτήστε πρόσβαση σε πραγματικά αποκεντρωμένες μετρήσεις ποιότητας αέρα, θορύβου, θερμοκρασίας και άλλων περιβαλλοντικών συνθηκών στο χάρτη αισθητήρων.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "Ο πιο ανοικτού κώδικα διακομιστής έξυπνου σπιτιού, με τροφοδοσία από RISC-V, με ένα νέφος Web3 που αντικαθιστά τους διακομιστές της Google κάτω από το καπό.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Έξυπνες συσκευές WI-FI MQTT με ανοικτού κώδικα firmware Tasmota στο πίνακα πλήρως συμβατές με το Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Συνδέστε το έξυπνο σπίτι και τα έξυπνα ρούχα σας στο Hikikomori για να παρακολουθείτε τα δεδομένα των αισθητήρων - ακριβώς στα δάχτυλά σας. Κυριολεκτικά.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Γνωρίστε έξυπνες συσκευές και μελλοντικό υλικό από μια αυτόνομη ομάδα με εκτεταμένη εμπειρία σε ρομποτική, blockchain και IoT",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "Η επεξεργασία δεδομένων είναι πάντα ένα ευαίσθητο θέμα. Γι' αυτό προσφέρουμε ένα πλήρως ανοικτού κώδικα",
  "connectivity module": "μονάδα συνδεσιμότητας",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Το Robonomics ίδρυσε τρεις κέντρα Συνδεσιμότητας για να εξασφαλίσει μια σταθερή σύνδεση. Αυτή η επιλογή είναι ενεργοποιημένη από προεπιλογή στο σταθμό.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Μπορείτε να ξεκινήσετε το δικό σας κέντρο για τη λήψη δεδομένων από τον Σταθμό Αλτρουιστών και για περαιτέρω επεξεργασία.",
  "Steps to set up your Connectivity": "Βήματα για την εγκατάσταση της Συνδεσιμότητάς σας",
  "Deploy Connectivity": "Αναπτύξτε τη Συνδεσιμότητα",
  "Technical requirements:": "Τεχνικές απαιτήσεις:",
  "2 CPU cores;": "2 πυρήνες CPU;",
  "4 GB RAM;": "4 GB RAM;",
  "40 GB storage;": "40 GB αποθήκευση;",
  "Static IP": "Στατική IP",
  "Than set up": "Στη συνέχεια εγκαταστήστε",
  "and follow": "και ακολουθήστε",
  "the instructions": "τις οδηγίες",
  "Connect a station to your connectivity": "Συνδέστε μια σταθμό στη σύνδεσή σας",
  "Open your sensor settings by its IP.": "Ανοίξτε τις ρυθμίσεις αισθητήρα σας με τη διεύθυνση IP του.",
  "Go to APIs settings": "Πηγαίνετε στις ρυθμίσεις των APIs",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Ελέγξτε το πλαίσιο ελέγχου για την αποστολή δεδομένων σε προσαρμοσμένο API και συμπληρώστε τα αντίστοιχα πεδία (διεύθυνση IP διακομιστή, θύρες, κλπ.).",
  "Join with your setup to global map (optional)": "Συνδεθείτε με την εγκατάστασή σας στον παγκόσμιο χάρτη (προαιρετικό)",
  "If you want to publish data to": "Αν θέλετε να δημοσιεύσετε δεδομένα στον παγκόσμιο χάρτη",
  "the global map": "χρειάζεται να κάνετε δύο αιτήσεις pull:",
  "you need to make two pull requests:": "Προσθέστε το IPFS ID της σύνδεσής σας στη λίστα πρακτόρων του χάρτη αισθητήρων:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Προσθέστε τη διεύθυνση parachain της σύνδεσής σας στη λίστα πρακτόρων προτύπου του διακομιστή αποθήκευσης μακροπρόθεσμης αποθήκευσης:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Ανοικτού κώδικα κάτω από το καπό: ελέγξτε τον ονάδα σύνδεσής μας",
  "Steps for launching your own map": "Βήματα για την εκκίνηση του δικού σας χάρτη",
  "Deploy web interface": "Αναπτύξτε διαδικτυακή διεπαφή",
  "Fork the map repository:": "Κλωνοποιήστε το αποθετήριο του χάρτη:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Επεξεργαστείτε τις ρυθμίσεις για να προσαρμόσετε τον χάρτη σας, συμπεριλαμβανομένου του τομέα, του παροχέα, της αρχικής σκοπιάς και του αναγνωριστικού σύνδεσής σας IPFS για τη λίστα των παραγόντων.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Αναπτύξτε τη δική σας έκδοση της διαδικτυακής διεπαφής και αρχίστε να λαμβάνετε πραγματικά δεδομένα από τον αισθητήρα σας.",
  "Full guide here:": "Πλήρης οδηγός εδώ:",
  "Launch long-term storage": "Εκκίνηση αποθήκευσης μακροπρόθεσμης αποθήκευσης",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Απλά η συλλογή δεδομένων από αισθητήρες δεν είναι αρκετή. Χρειάζεται να επεξεργαστεί. Ρύθμιση ενός διακομιστή για τη συλλογή δεδομένων αισθητήρα βασισμένη σε λογισμικό node.js ανοικτού κώδικα",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Οι αισθητήρες Robonomics μετρούν αναλύσεις και αρχειοθετούν τον κόμβο (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "και αποκτήστε τον δικό σας λειτουργικό διακομιστή για τη μακροπρόθεσμη αποθήκευση δεδομένων χαρτών.",
  "Static IP.": "Στατική διεύθυνση IP.",
  "Steps for launching a storage:": "Βήματα για την εκκίνηση μιας αποθήκευσης:",
  "Fork the RoSeMAN repository:": "Κλωνοποιήστε το αποθετήριο RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Επιλέξτε την έκδοση Docker ή Node.js (απαιτείται βάση δεδομένων MongoDB).",
  "Add a parachain address of your Connectivity to agents list.": "Προσθέστε μια διεύθυνση παρακείμενου της σύνδεσής σας στη λίστα πρακτόρων.",
  "Run the project.": "Εκτελέστε το έργο.",
  "Memory:": "Μνήμη:",
  "Add RoSeMAN domain to remote provider of map.": "Προσθέστε τον τομέα RoSeMAN στον απομακρυσμένο πάροχο χάρτη.",
  "All hardware": "Όλο το υλικό",
  "Use it": "Χρησιμοποίησέ το",
  "Learn": "Μάθε",
  "Explore website": "Εξερεύνησε την ιστοσελίδα",
  "Timeline since 2015": "Χρονολόγιο από το 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "Η ομάδα αποκτά νέες δεξιότητες στο σχεδιασμό και την προγραμματισμό έξυπνων συσκευών από το μηδέν. Οι",
  "sensors.social": "αισθητήρες.κοινωνικό",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "Δημιουργήθηκε ένα δίκτυο, όπου λειτουργούν συσκευές δοκιμής που αναπτύχθηκαν από μηχανικούς της Robonomics. Έχει αναπτυχθεί επίσης μια σειρά έξυπνων συσκευών στο σπίτι βασισμένων στο Tasmota Wi-Fi, και από το καλοκαίρι του 2024, αυτή η σειρά υποβάλλεται σε πιστοποίηση για την αγορά της ΕΕ. Το φθινόπωρο του 2024, η ομάδα του έργου θα παρουσιάσει μια σειρά συσκευών ανοικτού κώδικα με την ονομασία \"Hardware for Cryptopunks\".",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Η Robonomics συνεχίζει να αναπτύσσεται εντός του οικοσυστήματος του Polkadot. Η parachain δικτύου Kusama λειτουργεί εδώ και πάνω από δύο χρόνια, και από το φθινόπωρο του 2024, μια parachain θα ξεκινήσει επίσης στο δίκτυο του Polkadot. Έχουν καταγραφεί πάνω από 5 εκατομμύρια συναλλαγές από συσκευές χρηστών στο δίκτυο. Η ομάδα συνεχζει να εξερευνά τις δυνατότητες για την ενσωμάτωση των υλοποιήσεών τους και στα δύο Ethereum και Polkadot.",
  "Robo Smart Devices:": "Έξυπνες Συσκευές Robo:",
  "Read books": "Διαβάστε βιβλία",
  "Robonomics merch": "Εμπορεύματα Robonomics",
  "Desktop": "Επιφάνεια εργασίας",
  "Smartphone": "Κινητό τηλέφωνο",
  "our robo art wallpapers": "οι ταπετσαρίες τέχνης του ρομπό μας",
  "Space monkey devcon 2024 special": "Space monkey devcon 2024 ειδικό",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Κατεβάστε αυτήν την εικόνα στη συσκευή σας και συμμετέχετε στην ειδική αποστολή Devcon 2024 σε συναρπαστικές τοποθεσίες γύρω από τη Βαγκόκ! ",
  "Free Wallpapers for you from our artists": "Δωρεάν ταπετσαρίες για εσάς από τους καλλιτέχνες μας",
  "Hide your folder with secret wallpaper": "Κρύψτε το φάκελό σας με μυστική ταπετσαρία",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "Δημιουργήσαμε μυστικές ταπετσαρίες μόνο για εσάς! Κατεβάστε το φόντο και τα εικονίδια φακέλου και οι φάκελοί σας θα συγχωνευτούν αρμονικά στην Αρχική οθόνη σας - αφήνοντας ορατό μόνο το όμορφο έργο τέχνης. ",
  "Desktop background": "Φόντο επιφάνειας εργασίας",
  "Mac OS icons": "Εικονίδια Mac OS",
  "Windows icons": "Εικονίδια Windows",
  "Iphone": "Ιphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "Outdoor sensor “Altruist“": "Εξωτερικός αισθητήρας “Altruist“",
  "Sign up for updates": "Εγγραφείτε για ενημερώσεις",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics.": "Κάνοντας κλικ στο κουμπί “Υποβολή” συμφωνείτε να λαμβάνετε τακτικά emails από τη Robonomics.",
  "Hardware for cyberpunks": "Υλικό για cyberpunks",
  "Tech Blog & Updates": "Τεχνικό Blog & Ενημερώσεις",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Κοινοποιήστε και έχετε πρόσβαση σε δεδομένα θορύβου, σκόνης και θερμοκρασίας από άλλους ανεξάρτητους αισθητήρες κοντά. Ξεχάστε τους εταιρικούς διακομιστές—αυτά τα δεδομένα διανέμονται με ασφάλεια παγκοσμίως μέσω καινοτόμων τεχνολογιών Web3.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Ζήστε τη δύναμη του πραγματικού DePIN (Αποκεντρωμένο Δίκτυο Φυσικής Υποδομής) — μια επαναστατική τεχνολογική κίνηση που έχει ζωντανέψει και ακμάζει εδώ και χρόνια στο",
  "decentralized sensor map": "αποκεντρωμένο χάρτη αισθητήρων",
  "3 ways to use it": "3 τρόποι για να το χρησιμοποιήσετε",
  "Access": "Πρόσβαση",
  "noise, dust, and temperature data": "σε δεδομένα θορύβου, σκόνης και θερμοκρασίας",
  "from other independent sensors on our": "από άλλους ανεξάρτητους αισθητήρες στον",
  "Connect your device as simple as other smart devices and share your environmental outdoor data with community.": "Συνδέστε τη συσκευή σας τόσο απλά όσο και άλλες έξυπνες συσκευές και μοιραστείτε τα δεδομένα περιβαλλοντικού χώρου σας με την κοινότητα.",
  "Check open-source sensor firmware on GitHub": "Ελέγξτε το ανοιχτού κώδικα λογισμικό αισθητήρα στο GitHub",
  "Operate your own Data Server": "Λειτουργήστε τον Δικό σας Διακομιστή Δεδομένων",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "δίνοντάς σας την ελευθερία να επιλέξετε ποιους διακομιστές θα χρησιμοποιήσετε για την επεξεργασία. Χωρίς ιδιοκτησία συννεφιών, χωρίς κρυφό κώδικα.",
  "Keep in mind, you can join the": "Να έχετε υπόψη, μπορείτε να συμμετέχετε στον",
  "global decentralized sensor map": "παγκόσμιο αποκεντρωμένο χάρτη αισθητήρων",
  "even with a sensor connected through your own server!": "ακόμη και με έναν αισθητήρα που συνδέεται μέσω του δικού σας διακομιστή!",
  "Run your own Interactive Map": "Εκτελέστε τον Δικό σας Διαδραστικό Χάρτη",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Αγαπήστε την ιδέα ενός αποκεντρωμένου χάρτη αλλά θέλετε να το προσαρμόσετε με επιπλέον διατάξεις και να γίνετε διαχειριστής νέας κυρίαρχης υποδομής αισθητήρων; Μπορείτε να αναπτύξετε",
  "your own version by forking": "τη δική σας έκδοση διακλάδωσης",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "του ανοιχτού κώδικα μας στο GitHub (βεβαιωθείτε ότι ελέγχετε τον τύπο άδειας). Θυμηθείτε να χρησιμοποιείτε τους πόρους ανοιχτού κώδικα με ευθύνη.",
  "Device Specifications": "Προδιαγραφές Συσκευής",
  "Input Voltage:": "Τάση Εισόδου:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Hz",
  "Wireless protocol:": "Ασύρματο πρωτόκολλο:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Υποστηρίζει Wi-Fi 6 στα 2,4GHz (802.11 b/g/n) και Bluetooth 5 (LE), Zigbee με ενσωματωμένη κεραία",
  "Equipped with a high-performance": "Εξοπλισμένο με έναν υψηλής απόδοσης",
  "32-bit RISC-V processor": "επεξεργαστή RISC-V 32-bit",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "με ταχύτητα ρολογιού έως 160 MHz, και έναν χαμηλής κατανάλωσης επεξεργαστή RISC-V 32-bit με ταχύτητα ρολογιού έως 20MHz",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320KB ROM, 512KB HP SRAM, 16KB LP SRAM και 4MB μνήμη Flash",
  "USB-C": "USB-C",
  "for firmware development and updates": "για ανάπτυξη και ενημερώσεις λογισμικού",
  "PM sensor:": "Αισθητήρας PM:",
  "SDS011 laser PM2.5/PM10 sensor": "Αισθητήρας SDS011 laser PM2.5/PM10",
  "Supported sensors:": "Υποστηριζόμενοι αισθητήρες:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X,BME280,HTU21D; Αισθητήρας Επιπέδου Θορύβου:  I2S INMP441; Μετρητής Geiger : Radsens.",
  "Help & support": "Βοήθεια & υποστήριξη",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "Με τον αποκεντρωμένο χάρτη της Robonomics μπορείτε να χρησιμοποιήσετε τη Συνδεσιμότητα της Robonomics ή να δημιουργήσετε τη δική σας Υπηρεσία Συνδεσιμότητας.",
  "Your own Connectivity": "Η Δική σας Συνδεσιμότητα",
  "Robonomics open-source hardware": "Ανοιχτός υλικό της Robonomics",
  "Open-source hardware": "Ανοιχτό υλικό",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Ζήστε τη δύναμη του πραγματικού DePIN (Αποκεντρωμένο Δίκτυο Φυσικής Υποδομής) — μια επαναστατική τεχνολογική κίνηση που έχει ζωντανέψει και ακμάζει με τη Robonomics",
  "Home server with Web3 cloud": "Οικιακός διακομιστής με Web3 νέφος",
  "Early bird price": "Τιμή προπώρου",
  "Get updates about smart devices": "Λάβετε ενημερώσεις σχετικά με έξυπνες συσκευές",
  "Receive regular emails from Robonomics": "Λαμβάνετε τακτικά emails από την Robonomics",
  "Thanks for your submission!": "Ευχαριστούμε για την υποβολή σας!",
  "Not submitted": "Δεν έχει υποβληθεί",
  "Notify me when available": "Ενημερώστε με όταν είναι διαθέσιμο",
  "Captcha is not verified. Please, check your internet connection": "Το Captcha δεν έχει επαληθευτεί. Παρακαλώ, ελέγξτε τη σύνδεσή σας στο internet",
  "Thanks for the submition!": "Ευχαριστούμε για την υποβολή!",
  "Submitting": "Υποβολή",
  "Submit": "Υποβολή",
  "Follow for latest news and important updates": "Ακολουθήστε για τα τελευταία νέα και σημαντικές ενημερώσεις",
  "The best way to check open-source project": "Ο καλύτερος τρόπος για να ελέγξετε ένα ανοικτό πρόγραμμα",
  "Useful, serious, cute videos, teasers etc.": "Χρήσιμα, σοβαρά, χαριτωμένα βίντεο, teasers κλπ.",
  "Chat for engineers and developers": "Συνομιλία για μηχανικούς και προγραμματιστές",
  "X": "Χ",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Ανεπίσημη συνομιλία για τους φίλους των κρυπτονομισμάτων",
  "Use cases": "Περιπτώσεις χρήσης",
  "Coming in early 2025": "Έρχεται στις αρχές του 2025",
  "Rent in California, USA": "Ενοίκιο στην Καλιφόρνια, ΗΠΑ",
  "Available by the Hour, Day, or Week": "Διαθέσιμο ανά ώρα, ημέρα ή εβδομάδα",
  "Your name": "Το όνομά σας",
  "Your comment": "Το σχόλιό σας",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Κάνοντας κλικ σε αυτό το κουμπί, συμφωνείτε να λάβετε email σχετικά με την ενοικίαση του ρομπότ Unitree G1 Humanoid.",
  "We'll get in touch shortly!": "Θα επικοινωνήσουμε σύντομα!",
  "Contact me": "Επικοινωνήστε μαζί μου",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Ένα έξυπνο αισθητήρα που συλλέγει περιβαλλοντικά δεδομένα και τα ενσωματώνει σε ένα αποκεντρωμένο χάρτη αισθητήρων.",
  "Smart Tamagotchi “Hikikomori“": "Έξυπνο Tamagotchi 'Hikikomori'",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Πίνακας ανάπτυξης μικροελεγκτή σχεδιασμένος για να ενσωματωθεί σε συστήματα Web3. Μπορεί να είναι το έξυπνο tamagotchi του σπιτιού σας, ένας ελεγκτής παιχνιδιών, ένα εκπαιδευτικό εργαλείο - οτιδήποτε σχεδιάζετε!",
  "Energy monitor with USB-C": "Παρακολούθηση ενέργειας με USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Ένα μη επεμβατικό συσκευή σχεδιασμένη για τοποθέτηση σε ράγα DIN σε ηλεκτρικούς πίνακες, καταγράφει την κατανάλωση και παραγωγή ηλεκτρικής ενέργειας.",
  "Smart devices from Robonomics": "Έξυπνες συσκευές από τη Robonomics",
  "Our values": "Οι αξίες μας",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Οι συσκευές μας είναι σχεδιασμένες για απόλυτη διαφάνεια. Κάθε προϊόν διαθέτει ανοιχτό επεξεργαστή RISC-V, κώδικα και κυκλώματα ανοιχτού κώδικα, και τοπικές οδηγίες ενημέρωσης - χωρίς ανάγκη για συνδέσεις στο cloud. Έχετε τη δυνατότητα να κατανοήσετε, να προσαρμόσετε και να εμπιστευτείτε την τεχνολογία σας από την αρχή",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "Η συνδυασμός της επικοινωνίας P2P και του cloud Web3 εγγυάται ότι οι συσκευές σας θα είναι πάντα συνδεδεμένες. Δεν έχετε πρόσβαση στο internet; Μπορείτε ακόμα να συνδθείτε απευθείας στη συσκευή. Μετακομίζετε σε νέα περιοχή ή πηγαίνετε διακοπές; Οι συσκευές σας θα παραμείνουν online και προσβάσιμες οπουδήποτε βρίσκεστε",
  "Privacy by design": "Απορρήτου με σχεδιασμό",
  "Trust the Code": "Εμπιστευτείτε τον Κώδικα",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Πλήρως ανοιχτός κώδικας, χωρίς κρυμμένους αλγόριθμους, χωρίς εταιρική παρακολούθηση. Είναι διαφάνεια για τον αληθινό αποκεντρωτιστή.",
  "Your data, your keys": "Τα δεδομένα σας, τα κλειδιά σας",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Αναλάβετε πλήρη έλεγχο των δεδομένων σας με το πλήρως ανοιχτό μας μοντέλο σύνδεσης. Επιλέξτε μεταξύ Robonomics ή ασφαλούς αποθήκευσης στο cloud Web3 με το προσωπικό σας κλειδί - χωρίς κλειστά clouds, χωρίς αδιαφανή κώδικα.",
  "Always Connected, Always Secure": "Πάντα Συνδεδεμένο, Πάντα Ασφαλής",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "Η τοπική επικοινωνία P2P και το cloud Web3 εξασφαλίζουν ότι ο αισθητήρας σας είναι πάντα προσβάσιμος, όπου και αν βρίσκεστε. Δεν υπάρχουν κεντρικά σημεία αποτυχίας - μόνο καθαρή, peer-to-peer σύνδεση.",
  "Join the Altruist Collective": "Ενταχθείτε στην Αλτρουιστική Συλλογικότητα",
  "Plug the device into the global,": "Συνδέστε τη συσκευή στο παγκόσμιο,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Μοιραστείτε τις περιβαλλοντικές πληροφορίες σας με τους γείτονές σας, την κοινότητά σας ή το αποκεντρωμένο σας δίκτυο.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "Ο πρώτος διακομιστής για ένα έξυπνο σπίτι που κατασκευάζεται εξ' ολοκλήρου με ανοικτό κώδικα - από την CPU μέχρι το αποκεντρωμένο νέφος.",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Αναλάβετε τον έλεγχο των δεδομένων του έξυπνου σπιτιού σας με διακομιστή σπιτιού ανοικτού κώδικα σε επεξεργαστή RISC-V και σύνδεση Web3.",
  "Surveillance-free": "Χωρίς παρακολούθηση",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Χωρίς κρυφούς καταγραφικούς φακέλους σε εταιρικούς διακομιστές ενώ εξακολουθεί να επιτρέπει ασφαλή απομακρυσμένη πρόσβαση.",
  "No vendor lock-in": "Χωρίς κλειδαριές προμηθευτή",
  "Supports over 3000 integrations with devices from various manufacturers.": "Υποστηρίζει πάνω από 3000 ενσωματώσεις με συσκευές από διάφορους κατασκευαστές.",
  "Open hardware": "Ανοικτό υλικό",
  "Open processor architecture and open-source code ensure a trustless system.": "Η ανοικτή αρχιτεκτονική επεξεργαστή και ο ανοικτός κώδικας εξασφαλίζουν ένα αξιόπιστο σύστημα.",
  "Open and efficient hardware": "Ανοικτό και αποδοτικό υλικό",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Ο δικός μας Διακομιστής Οικιακού Χώρου τροφοδοτείται από έναν επεξεργαστή RISC-V και διαθέτει πλήρως διαφανή σχέδια κυκλωμάτων πλακέτας. Ο RISC-V είναι μια ανοικτή και μοντουλαρισμένη αρχιτεκτονική επεξεργαστή που διαθέτει άδεια BSD. Αντίθετα με τον ιδιοκτησίας ARM, προσφέρει ευελιξία για προσαρμογή χωρίς περιορισμούς άδειας χρήσης, κάνοντάς τον ιδανικό για αξιόπιστες συσκευές και διακομιστές IoT.",
  "Processor:": "Επεξεργαστής:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 με RISC-V 4-πύρηνο CPU, 2 MB L2 cache, έως 1,5 GHz, υποστήριξη RV64GC ISA",
  "GPU:": "GPU:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, έως 600 MHz",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 GB LPDDR4 SDRAM, έως 2800 Mbps",
  "Storage:": "Αποθήκευση:",
  "32 GB TF card (minimum)": "32 GB κάρτα TF (ελάχιστη)",
  "Interfaces:": "Διεπαφές:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2x θύρες Gigabit Ethernet, 4x θύρες USB 3.0 Type-A, κεφαλίδα 40-pin GPIO, σύνδεσμος M.2, υποδοχή eMMC, κεφαλίδα ανεμιστήρα 2-pin",
  "Power:": "Τροφοδοσία:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5V DC μέσω USB-C, έως 30 W (ελάχιστα 3 A) ή είσοδος 5V μέσω 40-pin GPIO",
  "OS:": "Λειτουργικό σύστημα:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Vendor agnostic smart home heart": "Αγνώστου προμηθευτή έξυπνο κέντρο σπιτιού",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "Ο διακομιστής έρχεται προ-εγκατεστημένος με το Home Assistant, μια πλατφόρμα αυτοματισμού σπιτιού ανοικτού κώδικα, που σας δίνει πλήρη έλεγχο του έξυπνου σπιτιού σας χωρίς να βασίζεστε σε υπηρεσίες νέφους τρίτων.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Η μοντουλαρική σχεδίασή του σάς επιτρέπει να προσθέτετε εύκολα στοιχεία, αυτοματισμούς και ενσωματώσεις, υποστηρίζοντας πάνω από 3.000 συσκευές από διάφορους κατασκευαστές χωρίς κλειδαριές προμηθευτή. Με υποστήριξη για τα πρωτόκολλα Zigbee και Wi-Fi, μπορείτε να συνδέσετε μια μεγάλη ποικιλία συσκευών, από αισθητήρες θερμοκρασίας έως μόνιτορ κατανάλωσης ενέργειας, όλα σε έναν τοπικό διακομιστή.",
  "Designed for privacy": "Σχεδιασμένο για απορρήτου",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Ο διακομιστής έξυπνου σπιτιού μας εξαλείφει την εταιρική παρέμβαση, κρατώντας τα δεδομένα σας τοπικά ή κρυπτογραφημένα με το προσωπικό σας κλειδί σε αποκεντρωμένη αποθήκευση Web3. Απολαύστε πλήρη απορρήτου χωρίς παρακολούθηση, χωρίς παρακολούθηση - απλά ασφαλής, αξιόπιστος έλεγχος του έξυπνου σπιτιού σας.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "Με το Robonomics Web3 cloud και τον απομακρυσμένο έλεγχο P2P, έχετε κρυπτογραφική πρόσβαση σε όλες τις λειτουργίες του έξυπνου σπιτιού:",
  "Home server on RISC V": "Διακομιστής Οικιακού Χώρου σε RISC V",
  "Home Assistant Core Installation": "Εγκατάσταση Πυρήνα Βοηθού Οικιακού",
  "Robonomics Integration Installation": "Εγκατάσταση Ενσωμάτωσης Robonomics",
  "Zigbee Devices in Zigbee2MQTT": "Συσκευές Zigbee στο Zigbee2MQTT",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Ένα μη επεμβατικό συσκευή για εγκατάσταση σε ηλεκτρικά πίνακες με τοποθέτηση σε ράγα DIN. Βασίζεται στο chip Espressif ESP32C6 με ανοικτή αρχιτεκτονική RISC-V.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Εξοπλισμένο με USB-C υποστηρίζει WiFi και Zigbee. Καταγράφει δεδομένα κατανάλωσης και παραγωγής ηλεκτρικής ενέργειας στο δίκτυο Polkadot σε διαστήματα 10 λεπτών.",
  "Measuring Range:": "Εύρος μέτρησης:",
  "0.1-80A": "0.1-80A",
  "Wireless Protocol:": "Ασύρματο πρωτόκολλο:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)",
  "CPU:": "Επεξεργαστής:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "ESP32-S3 MCU-based σύστημα ενσωματωμένου κυκλώματος (SoC) διπύρηνος μικροεπεξεργαστής (Xtensa 32-bit LX7), έως 240 MHz",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 KB ROM, 520 KB SRAM, 8 MB FLASH",
  "for development and updates": "για ανάπτυξη και ενημερώσεις",
  "To configure the device, please visit:": "Για να ρυθμίσετε τη συσκευή, επισκεφθείτε:",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Ένα έξυπνο βοηθό στο σπίτι που θα απολαύσετε να φροντίζετε, ακόμα και όταν είστε μακριά. Μόνο για προγραμματιστές.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Το Hikikomori είναι κατάλληλο για τη γρήγορη ανάπτυξη εφαρμογών IoT με υποστήριξη Web3. Αυτό μπορεί να είναι το έξυπνο tamagotchi του σπιτιού σας, ένας χειριστήριο παιχνιδιών, ένα εκπαιδευτικό εργαλείο - οτιδήποτε σχεδιάσετε!",
  "Supports": "Υποστηρίζει",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "2.4GHz Wi-Fi 6 (802.11 b/g/n) και Bluetooth 5 (LE), με ενσωματωμένη κεραία",
  "Built in": "Ενσωματωμένο",
  "Onboard": "Ενσωματωμένο",
  "1.47inch LCD display, 172x320 resolution, 262K color": "Οθόνη LCD 1,47 ιντσών, ανάλυση 172x320, 262K χρώματα",
  "Adapting": "Προσαρμογή",
  "multiple IO interfaces,": "πολλαπλές διεπαφές IO,",
  "integrates": "ενσωματώνει",
  "full-speed USB-С port": "θύρα USB-С με πλήρη ταχύτητα",
  "Onboard TF card slot": "Ενσωματωμένη υποδοχή κάρτας TF",
  "for external TF card storage of pictures or files": "για εξωτερική αποθήκευση καρτών TF εικόνων ή αρχείων",
  "Supports accurate control": "Υποστηρίζει ακριβή έλεγχο",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "όπως ευέλικτο ρολόι και πολλαπλές λειτουργίες ενέργειας για χαμηλή κατανάλωση ενέργειας σε διαφορετικά σενάρια",
  "Built-in RGB LED": "Ενσωματωμένο RGB LED",
  "with clear acrylic sandwich panel for cool lighting effect": "με διάφανο πάνελ ακρυλικού για καλό εφέ φωτισμού",
  "Battery Level Gauge": "Δείκτης επίπεδου μπαταρίας",
  "Low-Power I2C Temperature sensor": "Αισθητήρας θερμοκρασίας I2C χαμηλής κατανάλωσης",
  "RV-3032-C7 Real-Time Clock Module": "Πραγματικός ρολόι RV-3032-C7",
  "Battery 180mA": "Μπαταρία 180mA",
  "Unitree G1 Humanoid Robot": "Ρομπότ ανθρωποειδές Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Ενοικιάστε το προηγμένο ρομπότ ανθρωποειδές για τα ερευνητικά, προγραμματιστικά και ψυχαγωγικά σας έργα.",
  "Hour": "Ώρα",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Ενοικίαση στον χώρο (Oakland, CA)",
  "Suitable for short tasks": "Κατάλληλο για σύντομες εργασίες",
  "No engineering support included": "Δεν περιλαμβάνεται υποστήριξη μηχανικής",
  "Day": "Ημέρα",
  "$900": "$900",
  "Suitable for bigger tasks": "Κατάλληλο για μεγαλύτερες εργασίες",
  "Basic engineering support included": "Βασική υποστήριξη μηχανικής περιλαμβάνεται",
  "Week+": "Εβδομάδα+",
  "On demand": "Κατόπιν αιτήματος",
  "Delivery to your location": "Παράδοση στην τοποθεσία σας",
  "Customized approach": "Προσαρμοσμένη προσέγγιση",
  "Engineering support can be included": "Η υποστήριξη μηχανικής μπορεί να περιλαμβάνεται",
  "Enter the new era": "Εισέλθετε στη νέα εποχή",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "Το ρομπότ ανθρωποειδές G1 με τα καινοτόμα χαρακτηριστικά του προσφέρει ευελιξία γι τις ανάγκες ερευνών, προγραμματισμού και ψυχαγωγίας. Το Unitree G1 περιλαμβάνει ένα Χέρι Δεξιοτεχνίας Ελέγχου Ισχύος, επιτρέποντάς του να εκτελεί λεπτές εργασίες όπως η χειρισμός αντικειμένων, η πίεση κουμπιών και η εκτέλεση άλλων ακριβών λειτουργιών με διάφορα αντικείμενα.",
  "Tech specification": "Τεχνικές προδιαγραφές",
  "Height, Width and Thickness（Stand）": "Ύψος, Πλάτος και Πάχος（Στάση）",
  "1320x450x200mm": "1320x450x200mm",
  "Height, Width and Thickness（Fold）": "Ύψος, Πλάτος και Πάχος（Αναδίπλωση）",
  "690x450x300mm": "690x450x300mm",
  "Weight (With Battery)": "Βάρος (Με Μπαταρία)",
  "About 35kg": "Περίπου 35kg",
  "Arm Maximum Load": "Μέγιστο Φορτίο Μπράτσου",
  "About 2Kg": "Περίπου 2Kg",
  "Cooling System": "Σύστημα Ψύξης",
  "Local air cooling": "Τοπικό ψύξης αέρα",
  "Smart Battery (Quick Release)": "Έξυπνη Μπαταρία (Γρήγορη Απελευθέρωση)",
  "9000mAh": "9000mAh",
  "Charger": "Φορτιστής",
  "54V 5A": "54V 5A",
  "Battery Life": "Διάρκεια Μπαταρίας",
  "About 2h": "Περίπου 2ώρες",
  "Sensing Sensor": "Αισθητήρας Αντίληψης",
  "Depth Camera+3D LiDAR": "Κάμερα Βάθους+3D LiDAR",
  "5W Speaker": "Ηχείο 5W",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6 , Bluetooth 5.2",
  "Manual Controller": "Χειροκίνητος Ελεγκτής",
  "hour": "ώρα",
  "hours": "ώρες",
  "day": "ημέρα",
  "days": "ημέρες",
  "week": "εβδομάδα",
  "weeks": "εβδομάδες",
  "on demand": "κατόπιν αιτήματος",
  "Special offer": "Ειδική προσφορά",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Αποκτήστε αποκλειστική πρόσβαση σε έναν από τους πρώτους εμπορικά διαθέσιμους ανθρωποειδείς ρομπότ. Ευέλικτες επιλογές ενοικίασης για ερευνητικές, προγραμματιστικές και ψυχαγωγικές ανάγκες.",
  "With the Altruist Outdoor Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data—encrypted, mapped, and shared across a distributed network.": "Με τον Αλτρουιστικό Εξωτερικό Αισθητήρα, γίνεστε μια δύναμη στην αποκεντρωμένη περιβαλλοντική παρακολούθηση. Καταγράψτε δεδομένα θορύβου, σκόνης και θερμοκρασίας - κρυπτογραφημένα, χαρτογραφημένα και κοινοποιημένα σε ένα κατανεμημένο δίκτυο.",
  "Access current device states remotely": "Πρόσβαση σε τρέχουσες καταστάσεις συσκευών απομακρυσμένα",
  "Control devices remotely via parachain or LibP2P": "Έλεγχος συσκευών απομακρυσμένα μέσω parachain ή LibP2P",
  "Manage Home Assistant users": "Διαχείριση χρηστών Home Assistant",
  "Back up and restore Home Assistant configurations": "Αντίγραφα ασφαλείας και επαναφορά ρυθμίσεων Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Αποθηκεύστε το ψηφιακό δίδυμο του σπιτιού σας σε ένα ασφαλές, αποκεντρωμένο νέφος",
  "Books": "Βιβλία",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "Το 2022, η ομάδα του Robonomics άρχισε να συνεργάζεται με άλλες ομάδες parachain εντός του οικοσυστήματος του Polkadot για να αξιοποιήσει τα μοναδικά πλεονεκτήματα αυτού του αποκεντρωμένου δικτύου. Αυτή η συνεργασία οδήγησε στην έναρξη μιας Υπηρεσίας Αντιγραφής Ασφαλείας και Αρχειοθέτησης Δεδομένων που σχεδιάστηκε ειδικά για εταιρείες ρομποτικής.",
  "Digital markets for robots": "Ψηφιακές αγορές για ρομπότ",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "Η ανάπτυξη ρομποτικών και αυτοματοποιημένων συστημάτων κατά την Τέταρτη Βιομηχανική Επανάσταση θα απαιτήσει από τα ρομπότ να έχουν τη δυνατότητα να παραγγέλνουν υπηρεσίες για τη δική τους συντήρηση.",
  "Tokenization of Data of IOT devices": "Διακεκριμένοποίηση Δεδομένων Συσκευών IOT",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "Η διακεκριμένοποίηση δεδομένων από συσκευές IoT (Internet of Things) αντιπροσωπεύει μια καινοτόμο ανάπτυξη στην ψηφιακή οικονομία.",
  "Industrial zone management with capital": "Διαχείριση βιομηχανικής ζώνης με κεφάλαιο",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "Αυτή η περίπτωση εξετάζει τον ρόλο των έξυπνων εργοστασίων στην ανταπόκριση σε μετατοπίσεις κεφαλαίου στις σύγχρονες αγορές. Ως μέρος της μετασχηματιστικής διαδικασίας της Βιομηχανίας 4.0, εισάγει ένα αποκεντρωμένο πρωτόκολλο επικοινωνίας χρησιμοποιώντας κυβερνο-φυσικά συστήματα για τη βελτίωση της οικονομικής συντονισμού μεταξύ βιομηχανικών παραγόντων.",
  "Mars colonization, impossible without kusama": "Αποικιοκράτηση του Άρη, αδύνατη χωρίς kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Αυτή η περίπτωση έρευνας και ανάπτυξης εξετάζει τον ρόλο της αποκεντρωμένης υποδομής του δικτύου Kusama στην υποστήριξη διαστημικών αποστολών, ιδιαίτερα την αποικιοκράτηση του Άρη.",
  "A decentralized system for negotiating road space": "Ένα αποκεντρωμένο σύστημα για τη διαπραγμάτευση χώρου οδού",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Ο στόχος μας ήταν να αναπτύξουμε ένα αποκεντρωμένο σύστημα για τη διαπραγμάτευση χώρου οδού όπου τα αυτόνομα οχήματα μπορούν να πληρώνουν για διαδρομές και άδειες.",
  "Almanac": "Ημερολόγιο",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Το Hikikomori λειτουργεί σε ένα πίνακα ανάπτυξης μικροελεγκτών ESP32-C6, διαθέτει οθόνη LCD, υποστήριξη Wi-Fi 6 και BLE 5.",
  "Last updated: February 03, 2025": "Τελευταία ενημέρωση: 03 Φεβρουαρίου 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Αυτή η Πολιτική Απορρήτου περιγράφει τις πολιτικές και τις διαδικασίες μας σχετικά με τη συλλογή, τη χρήση και τη διαβίβαση των πληροφοριών σας όταν χρησιμοποιείτε την Υπηρεσία και σας ενημερώνει για τα δικαιώματα απορρήτου σας και τον τρόπο με τον οποίο ο νόμος σας προστατεύει.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Χρησιμοποιούμε τα προσωπικά σας δεδομένα για την παροχή και τη βελτίωση της Υπηρεσίας. Χρησιμοποιώντας την Υπηρεσία, συμφωνείτε με η συλλογή και χρήση πληροφοριών σύμφωνα με αυτήν την Πολιτική Απορρήτου.",
  "Interpretation and Definitions": "Ερμηνεία και Ορισμοί",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Αυτή η Συμφωνία είναι αρχικά γραμμένη στα Αγγλικά. Αυτή η μετάφραση AI παρέχεται μόνο για την αναφορά σας.",
  "Interpretation": "Ερμηνεία",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Οι λέξεις των οποίων το αρχικό γράμμα είναι κεφαλαίο έχουν ορισμένες σημασίες σύμφωνα με τις ακόλουθες συνθήκες. Οι ακόλουθοι ορισμοί θα έχουν την ίδια σημασία ανεξάρτητα από το αν εμφανίζονται στον ενικό ή στον πληθυντικό αριθμό.",
  "Definitions": "Ορισμοί",
  "For the purposes of this Privacy Policy:": "Για τους σκοπούς της παρούσας Πολιτικής Απορρήτου:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(αναφέρεται είτε ως \"το DAO\", \"εμείς\", \"μας\" ή \"μας\" σε αυτήν τη Συμφωνία) αναφέρεται στο αποκεντρωμένο αυτόνομο οργανισμό Robonomics Network, έναν χειριστή για τον ιστότοπο",
  "(referred to as": "(αναφέρεται ως",
  "Website": "Ιστοσελίδα",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "σε αυτήν τη Συμφωνία). Για τους σκοπούς του GDPR, το DAO είναι ο Ελεγκτής Δεδομένων.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "είαι μικρά αρχεία που τοποθετούνται στον υπολογιστή σας, τη συσκευή κινητής τηλεφωνίας ή οποιαδήποτε άλλη συσκευή από έναν ιστότοπο, περιέχοντας λεπτομέρειες του ιστορικού περιήγησής σας σε αυτόν τον ιστότοπο μεταξύ των πολλών χρήσεών του. Περισσότερες λεπτομερείς πληροφορίες σχετικά με τα cookies και τον τρόπο λειτουργίας τους μπορούν να βρεθούν στο:",
  "Country": "Χώρα",
  "refers to: Cyprus.": "αναφέρεται στην Κύπρο.",
  "Data Controller": "Ελεγκτής Δεδομένων",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "για τους σκοπούς του GDPR (Γενικός Κανονισμός Προστασίας Δεδομένων), αναφέρεται στο DAO ως το νομικό πρόσωπο που μόνο του ή από κοινού με άλλους καθορίζει τους σκοπούς και τα μέσα της επεξεργασίας των Προσωπικών Δεδομένων.",
  "Device": "Συσκευή",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "σημαίνει οποιαδήποτε συσκευή που μπορεί να έχει πρόσβαση στην Υπηρεσία, όπως ένας υπολογιστής, ένα κινητό τηλέφωνο ή ένα ψηφιακό ταμπλέτ.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "αναφέρεται στον Γενικό Κανονισμό Προστασίας Δεδομένων της ΕΕ.",
  "Personal Data": "Προσωπικά Δεδομένα",
  "is any information that relates to an identified or identifiable individual.": "είναι οποιεσδήποτε πληροφορίες που σχετίζονται με ένα αναγνωρισμένο ή εντοπίσιμο άτομο.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Για τους σκοπούς του GDPR, τα Προσωπικά Δεδομένα σημαίνουν οποιεσδήποτε πληροφορίες που σχετίζονται με εσάς, όπως ένα όνομα, ένας αριθμός αναγνώρισης, δεδομένα τοποθεσίας, διαδικτυακό αναγνωριστικό ή με έναν ή περισσότερους παράγοντες που είναι συγκεκριμένοι για τη φυσική, φυσιολογική, γενετική, νοητική, οικονομική, πολιτιστική ή κοινωνική ταυτότητα.",
  "Service": "Υπηρεσία",
  "refers to the Website": "αναφέρεται στην Ιστοσελίδα",
  "Service Provider": "Πάροχος Υπηρεσίας",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "σημαίνει οποιοδήποτε φυσικό ή νομικό πρόσωπο που επεξεργάζεται τα δεδομένα εκ μέρους του DAO. Αναφέρεται σε εαιρείες τρίτων ή άτομα που απασχολούνται από το DAO για τη διευκόλυνση της Υπηρεσίας, για την παροχή της Υπηρεσίας εκ μέρους του DAO, για την παροχή υπηρεσιών που σχετίζονται με την Υπηρεσία ή για την υποστήριξη του DAO στην ανάλυση του τρόπου χρήσης της Υπηρεσίας. Για τους σκοπούς του GDPR, οι Πάροχοι Υπηρεσίας θεωρούνται Επεξεργαστές Δεδομένων.",
  "Usage Data": "Δεδομένα Χρήσης",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "αναφέρεται σε δεδομένα που συλλέγονται αυτόματα, είτε παράγονται από τη χρήση της Υπηρεσίας είτε από την υποδομή της Υπηρεσίας ίδια (για παράδειγμα, η διάρκεια μιας επίσκεψης σε μια σελίδα).",
  "You": "Εσείς",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(αναφέρεστε είτε ως \"Σας\" σε αυτήν τη Συμφωνία) σημαίνει το άτομο που έχει πρόσβαση ή χρησιμοποιεί την Υπηρεσία, ή το DAO, ή άλλο νομικό πρόσωπο εκ μέρους του οποίου το άτομο αυτό έχει πρόσβαση ή χρησιμοποιεί την Υπηρεσία, όπως εφαρμόζεται.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Σύμφωνα με το GDPR, μπορείτε να αναφέρεστε ως Υποκείμενο Δεδομένων ή ως Χρήστης καθώς είστε το άτομο που χρησιμοποιεί την Υπηρεσία.",
  "Collecting and Using Your Personal Data": "Συλλογή και Χρήση των Προσωπικών Δεδομένων σας",
  "Types of Data Collected": "Τύποι Δεδομένων που Συλλέγονται",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Κατά τη χρήση της Υπηρεσίας μας, ενδέχεται να σας ζητήσουμε να μας παράσχετε ορισμένες προσωπικές πληροφορίες που μπορούν να χρησιμοποιηθούν για να επικοινωνήσουμε ή να σας αναγνωρίσουμε. Οι προσωπικές πληροφορίες μπορεί να περιλαμβάνουν, αλλά δεν περιορίζονται σε:",
  "Email address": "Διεύθυνση email",
  "First name and last name": "Όνομα και επώνυμο",
  "Usage Data is collected automatically when using the Service.": "Τα Δεδομένα Χρήσης συλλέγονται αυτόματα κατά τη χρήση της Υπηρεσίας.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Τα Δεδομένα Χρήσης μπορεί να περιλαμβάνουν πληροφορίες όπως η Διεύθυνση Πρωτοκόλλου Internet της Συσκευής σας (π.χ. διεύθυνση IP), τύπος περιηγητή, έκδοση περιηγητή, οι σελίδες της Υπηρεσίας μας που επισκέπτεστε, η ημερομηνία και η ώρα της επίσκεψής σας, ο χρόνος που αφιερώνετε σε αυτές τις σελίδες, μοναδικοί αναγνωριστικοί συσκευής και άλλα διαγνωστικά δεδομένα.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Όταν έχετε πρόσβαση στην Υπηρεσία μέσω κινητής συσκευής, ενδέχεται να συλλέξουμε ορισμένες πληροφορίες αυτόματα, συμπεριλαμβανομένων, αλλά όχι περιοριστικά, του τύπου της κινητής συσκευής που χρησιμοποιείτε, το μοναδικό αναγνωριστικό της κινητής συσκευής σας, τη διεύθυνση IP της κινητής συσκευής σας, το λειτουργικό σύστημα της κινητής συσκευής σας, τον τύπο του περιηγητή Internet της κινητής συσκευής σας, μοναδικούς αναγνωριστικούς συσκευής και άλλα διαγνωστικά δεδομένα.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Ενδέχεται επίσης να συλλέξουμε πληροφορίες που  περιηγητής σας αποστέλλει κάθε φορά που επισκέπτεστε την Υπηρεσία μας ή όταν έχετε πρόσβαση στην Υπηρεσία μέσω κινητής συσκευής.",
  "Cookies & Browser Storage": "Cookies & Αποθήκευση Περιηγητή",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Οι Ιστοσελίδες μπορεί να χρησιμοποιούν cookies. Χρησιμοποιούμε cookies και αποθήκευση περιηγητή μόνο για τις βασικές ρυθμίσεις για τη βελτίωση της εμπειρίας σας - όχι για παρακολούθηση. Αυτά βοηθούν να θυμόμαστε τις προτιμήσεις σας, όπως οι ρυθμίσεις γλώσσας ή οι επιλογές συγκατάθεσης, ώστε να μην χρειάζεται να τις επαναφέρετε κάθε φορά που επισκέπτεστε.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Δεν χρησιμοποιούμε cookies για παρακολούθηση ή εξατομικευμένη διαφήμιση. Μπορείτε να διαχειριστείτε ή να απενεργοποιήσετε τα cookies στις ρυθμίσεις του περιηγητή σας, αλλά ορισμένα χαρακτηριστικά ενδέχεται να μη λειτουργούν σωστά χωρς αυτά.",
  "Matomo Analytics": "Ανάλυση Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Η ιστοσελίδα μας μπορεί να χρησιμοποιεί το Matomo, μια πλατφόρμα ανοικτού κώδικα ανάλυσης, για να συγκεντρώσει εισαγωγές σχετικά με τη χρήση της ιστοσελίδας. Αυτό περιλαμβάνει ανωνυμοποιημένα δεδομένα όπως:",
  "Pages visited and navigation paths": "Σελίδες που επισκέφτηκαν και διαδρομές πλοήγησης",
  "Time spent on our website": "Χρόνος που αφιερώθηκε στην ιστοσελίδα μας",
  "Whether you’re a returning or new visitor": "Εάν είστε επιστρέφων ή νέος επισκέπτης",
  "Your device type (desktop, mobile, etc.)": "Ο τύπος της συσκευής σας (επιτραπέζιος υπολογιστής, κινητό κλπ.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Για να προστατεύσουμε την ιδιωτικότητά σας, η διεύθυνση IP σας ανωνυμοποιείται πριν από την αποθήκευση. Τα δεδομένα που συλλέγουμε χρησιμοποιούνται μόνο για τη βελτίωση της ιστοσελίδας και δεν χρησιμοποιούνται για προσωπική αναγνώριση.",
  "Under Art. 6(1)(f) GDPR": "Σύμφωνα με το άρθρο 6(1)(f) του GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "επεξεργαζόμαστε αυτά τα δεδομένα βασιζόμενοι στο νόμιμο μας συμφέρον για τη βελτίωση των υπηρεσιών μας.",
  "Opt-Out Option": "Επιλογή Απενεργοποίησης",
  "You can disable Matomo tracking at any time:": "Μπορείτε να απενεργοποιήσετε την παρακολούθηση του Matomo οποτεδήποτε:",
  "Use of Your Personal Data": "Χρήση των Προσωπικών Δεδομένων σας",
  "The DAO may use Personal Data for the following purposes:": "Το DAO μπορεί να χρησιμοποιήσει τα Προσωπικά Δεδομένα για τους ακόλουθους σκοπούς:",
  "To provide and maintain our Service": "Για την παροχή και διατήρηση της Υπηρεσίας μας",
  "including to monitor the usage of our Service.": "συμπεριλαμβανομένου του παρακολούθηση της χρήσης της Υπηρεσίας μας.",
  "For the performance of a contract": "Για την εκτέλεση μιας σύμβασης",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "την ανάπτυξη, τη συμμόρφωση και την εκτέλεση της σύμβασης αγοράς για τα προϊόντα, αντικείμενα ή υπηρεσίες που έχετε αγοράσει ή οποιαδήποτε άλλη σύμβαση μαζί μας μέσω της Υπηρεσίας.",
  "To contact You": "Για να επικοινωνήσουμε μαζί σας",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Για να επικοινωνήσουμε μαζί σας μέσω email, τηλεφωνικών κλήσεων, SMS ή άλλων ισοδύναμων μορφών ηλεκτρονικής επικοινωνίας, όπως ειδοποιήσεις push μέσω κινητών εφαρμογών σχετικά με ενημερώσεις ή ενημερωτικές επικοινωνίες που σχετίζονται μ τις λειτουργίες, τα προϊόντα ή τις συμβεβλημένες υπηρεσίες, συμπεριλαμβανομένων των ενημερώσεων ασφαλείας, όταν είναι απαραίτητο ή λογικό για την υλοποίησή τους.",
  "To provide You": "Για να σας παρέχουμε",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "νέα, ειδικές προσφορές και γενικές πληροφορίες σχετικά με άλλα αγαθά, υπηρεσίες και εκδηλώσεις που προσφέρουμε και είναι παρόμοια με αυτά που έχετε ήδη αγοράσει ή έχετε ενδιαφερθεί, εκτός εάν έχετε επιλέξει να μη λαμβάνετε τέτοιες πληροφορίες.",
  "To manage Your requests": "Για τη διαχείριση των αιτημάτων σας",
  "To attend and manage Your requests to Us.": "Για την εξυπηρέτηση και διαχείριση των αιτημάτων σας προς εμάς.",
  "For other purposes": "Για άλλους σκοπούς",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Μπορεί να χρησιμοποιήσουμε τις πληροφορίες σας για άλλους σκοπούς, όπως ανάλυση δεδομένων, αναγνώριση των τάσεων χρήσης, καθορισμό της αποτελεσματικότητας των προωθητικών μας εκστατειών και για την αξιολόγηση και βελτίωση της Υπηρεσίας μας, των προϊόντων, των υπηρεσιών, του μάρκετινγκ και της εμπειρίας σας.",
  "We may share Your personal information in the following situations:": "Μπορεί να μοιραστούμε τις προσωπικές σας πληροφορίες σας στις ακόλουθες καταστάσεις:",
  "With Service Providers": "Με Παροχείς Υπηρεσιών",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Μπορούμε να μοιραστούμε τα προσωπικά σας στοιχεία με Παροχείς Υπηρεσιών για την παρακολούθηση και ανάλυση της χρήσης της υπηρεσίας μας, για να επικοινωνήσουμε μαζί σας.",
  "With Your consent": "Με τη Συγκατάθεσή σας",
  "We may disclose Your personal information for any other purpose with Your consent.": "Μπορούμε να αποκαλύψουμε τα προσωπικά σας στοιχεία για οποιοδήποτε άλλο σκοπό με τη συγκατάθεσή σας.",
  "Retention of Your Personal Data": "Διατήρηση των Προσωπικών Δεδομένων σας",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "Η DAO θα διατηρήσει τα Προσωπικά Δεδομένα σας μόνο για το χρονικό διάστημα που είναι απαραίτητο για τους σκοπούς που ορίζονται σε αυτήν την Πολιτική Απορρήτου. Θα διατηρήσουμε και θα χρησιμοποιήσουμε τα Προσωπικά Δεδομένα σας στο μέτρο που είναι απαραίτητο για να συμμορφωθούμε με τις νομικές μας υποχρεώσεις (για παράδειγμα, αν απαιτείται να διατηρήσουμε τα δεδομένα σας για να συμμορφωθούμε με τους ισχύοντες νόμους), να επιλύσουμε διαφορές και να επιβάλουμε τις νομικές μας συμφωνίες και πολιτικές.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "Η DAO θα διατηρήσει επίσης Δεδομένα Χρήσης για εσωτερικούς σκοπούς ανάλυσης. Τα Δεδομένα Χρήσης διατηρούνται γενικά για μικρότερο χρονικό διάστημα, εκτός αν αυτά τα δεδομένα χρησιμοποιούνται για την ενίσχυση της ασφάλειας ή τη βελτίωση της λειτουργικότητας της υπηρεσίας μας, ή αν είμαστε υποχρεωμένοι νομικά να διατηρήσουμε αυτά τα δεδομένα για μεγαλύτερα χρονικά διαστήματα.",
  "Security of Your Personal Data": "Ασφάλεια των Προσωπικών Δεδομένων σας",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "Η ασφάλεια των Προσωπικών Δεδομένων σας είναι σημαντική γα εμάς, αλλά θυμηθείτε ότι κανένας τρόπος μετάδοσης μέσω του Διαδικτύου ή μέσω ηλεκτρονικής αποθήκευσης δεν είναι 100% ασφαλής. Ενώ προσπαθούμε να χρησιμοποιούμε εμπορικά αποδεκτά μέσα για την προστασία των Προσωπικών Δεδομένων σας, δεν μπορούμε να εγγυηθούμε την απόλυτη ασφάλειά του.",
  "Detailed Information on the Processing of Your Personal Data": "Λεπτομερείς πληροφορίες σχετικά με την επεξεργασία των προσωπικών σας δεδομένων",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Οι πληροφορίες σας, συμπεριλαμβανομένων των προσωπικών δεδομένων, επεξεργάζονται στον πάροχο υπηρεσιών της ιστοσελίδας του DAO και σε οποιαδήποτε άλλη τοποθεσία όπου βρίσκονται οι εμπλεκόμενες μερικές στην επεξεργασία. Αυτό σημαίνει ότι αυτές οι πληροφορίες μπορεί να μεταφερθούν σε υπολογιστές που βρίσκονται έξω από την πολιτεία, επαρχία, χώρα ή άλλη κυβερνητική δικαιοδοσία σας, όπου οι νόμοι προστασίας δεδομένων μπορεί να διαφέρουν από αυτούς της δικής σας δικαιοδοσίας.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Η συγκατάθεσή σας σε αυτήν την Πολιτική Απορρήτου ακολουθούμενη από την υποβολή τέτοιων πληροφοριών αντιπροσωπεύει τη συμφωνία σας για αυτν τη μεταφορά.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "Το DAO θα λάβει όλα τα απαραίτητα μέτρα για να διασφαλίσει ότι τα δεδομένα σας χειρίζονται με ασφάλεια και σύμφωνα με αυτήν την Πολιτική Απορρήτου και καμία μεταφορά των προσωπικών σας δεδομένων δεν θα πραγματοποιηθεί σε μια οργάνωση ή μια χώρα εκτός αν υπάρχουν επαρκείς ελέγχοι συμπεριλαμβανομένης της ασφάλειας των δεδομένων σας και άλλων προσωπικών πληροφοριών.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Σημειώστε ότι οποιαδήποτε μετάδοση δεδομένων στο Διαδίκτυο (π.χ. επικοινωνία μέσω ηλεκτρονικού ταχυδρομείου) γενικά δεν είναι ασφαλής και δεν αποδεχόμαστε καμία ευθύνη για τα δεδομένα που μας μεταδίδονται μέσω του Διαδικτύου. Δυστυχώς, η απόλυτη προστασία δεν είναι τεχνικά δυνατή. Αυτές οι πληροφορίες δεν ισχύουν για την Ιστοσελίδα τρίτων και τους αντίστοιχους συνδέσμους που δίνονται στην Ιστοσελίδα μας. Το DAO δεν φέρει καμία ευθύνη για αυτά.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Οι Παροχείς Υπηρεσιών που χρησιμοποιούμε μπορεί να έχουν πρόσβαση στα Προσωπικά Δεδομένα σας. Αυτοί οι προμηθευτές τρίτων μερών συλλέγουν, αποθηκεύουν, χρησιμοποιούν, επεξεργάζονται και μεταφέρουν πληροφορίες σχετικά με τη δραστηριότητά σας στην Υπηρεσία μας σύμφωνα με τις Πολιτικές Απορρήτου τους.",
  "Email Marketing": "Email Marketing",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Μπορούμε να χρησιμοποιήσουμε τα Προσωπικά Δεδομένα σας για να επικοινωνήσουμε μαζί σας με ενημερωτικά δελτία, υλικό μάρκετινγκ ή προώθησης και άλλες πληροφορίες που μπορεί να σας ενδιαφέρουν. Μπορείτε να επιλέξετε να μη λαμβάνετε καμία, ή όλες, αυτών των επικοινωνιών από εμάς ακολουθώντας τον σύνδεσμο απεγγραφής ή τις οδηγίες που παρέχονται σε οποιοδήποτε email που στέλνουμε ή επικοινωνώντας μαζί μας.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Μπορούμε να χρησιμοποιήσουμε Παροχείς Υπηρεσιών Email Marketing για τη διαχείριση και αποστολή email σε εσάς;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Η Πολιτική Απορρήτου τους μπορεί να βρεθεί στο",
  "Usage, Performance and Miscellaneous": "Χρήση, Απόδοση και Διάφορα",
  "We may use third-party Service Providers to maintain and improve our Service.": "Μπορούμε να χρησιμοποιήσουμε Παροχείς Υπηρεσιών τρίτων μερών για τη διατήρηση και βελτίωση της Υπηρεσίας μας.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "Απορρήτου GDPR",
  "Legal Basis for Processing Personal Data under GDPR": "Νομική Βάση για την Επεξεργασία Προσωπικών Δεδομένων σύμφωνα με το GDPR",
  "We may process Personal Data under the following conditions:": "Μπορούμε να επεξεργαστούμε Προσωπικά Δεδομένα υπό τις ακόλουθες συνθήκες:",
  "Consent:": "Συγκατάθεση:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Έχετε δώσει τη συγκατάθεσή σας για την επεξεργασία Προσωπικών Δεδομένων για έναν ή περισσότερους συγκεκριμένους σκοπούς.",
  "Performance of a contract:": "Εκτέλεση συμβολίου:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Η παροχή Προσωπικών Δεδομένων είναι απαραίτητη για την εκτέλεση μιας συμφωνίας μαζί σας και/ή για οποιεσδήποτε προσυμβατικές υποχρεώσεις αυτής.",
  "Legal obligations:": "Νομικές υποχρεώσεις:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Η επεξεργασία Προσωπικών Δεδομένων είναι απαραίτητη για τη συμμόρφωση με μια νομική υποχρέωση στην οποία υπόκειται το DAO.",
  "Vital interests:": "Βιταλικά συμφέροντα:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Η επεξεργασία Προσωπικών Δεδομένων είναι απαραίτητη για την προστασία των βιταλικών συμφερόντων σας ή ενός άλλου φυσικού προσώπου.",
  "Public interests:": "Δημόσια συμφέροντα:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Η επεξεργασία Προσωπικών Δεδομένων σχετίζεται με μια εργασία που εκτελείται στο δημόσιο συμφέρον ή στην άσκηση της επίσημης εξουσίας που ανατέθηκε στο DAO.",
  "Legitimate interests:": "Νόμιμα συμφέροντα:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Η επεξεργασία Προσωπικών Δεδομένων είναι απαραίτητη για τους σκοπούς των νόμμων συμφερόντων που ακολουθεί το DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "Σε κάθε περίπτωση, το DAO θα χαρεί να βοηθήσει στη διευκρίνιση της συγκεκριμένης νομικής βάσης που ισχύει για την επεξεργασία, και ειδικότερα εάν η παροχή Προσωπικών Δεδομένων είναι υποχρέωση σύμφωνα με τον νόμο ή τη σύμβαση, ή απαίτηση που είναι απαραίτητη για τη σύναψη σύμβασης.",
  "Your Rights under the GDPR": "Τα Δικαιώματά σας σύμφωνα με το GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "Το DAO δεσμεύεται να σεβαστεί την εμπιστευτικότητα των Προσωπικών Δεδομένων σας και να σας εγγυηθεί ότι μπορείτε να ασκήσετε τα δικαιώματά σας.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "Έχετε το δικαίωμα σύμφωνα με αυτή την Πολιτική Απορρήτου, και με τον νόμο εάν βρίσκεστε εντός της ΕΕ, να:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Το δικαίωμα να έχετε πρόσβαση, ενημέρωση ή διαγραφή των πληροφοριών που έχουμε για εσάς. Όποτε είναι δυνατόν, μπορείτε να έχετε πρόσβαση, να ενημερώσετε ή να ζητήσετε τη διαγραφή των προσωπικών δεδομένων σας απευθείας μέσα από την ενότητα ρυθμίσεων λογαριασμού σας. Εάν δεν μπορείτε να πραγματοποιήσετε αυτές τις ενέργειες μόνοι σας, επικοινωνήστε μαζί μας για να σας βοηθήσουμε. Αυτό σας επιτρέπει επίσης να λάβετε ένα αντίγραφο των προσωπικών δεδομένων που κρατάμε για εσάς.",
  "Request correction of the Personal Data that We hold about You.": "Ζητήστε τη διόρθωση των προσωπικών δεδομένων που κρατάμε για εσάς.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "Έχετε το δικαίωμα να διορθώσετε οποιεσδήποτε ατελείες ή αακρίβειες πληροφορίες που κρατάμε για εσάς.",
  "Object to processing of Your Personal Data.": "Αντιταχθείτε στην επεξεργασία των προσωπικών δεδομένων σας.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Αυτό το δικαίωμα υπάρχει όταν βασιζόμαστε σε έναν νόμιμο συμφέρον ως νομική βάση για την επεξεργασία μας και υπάρχει κάτι σχετικό με την συγκεκριμένη σας κατάσταση, που σας κάνει να θέλετε να αντιταχθείτε στην επεξεργασία των προσωπικών δεδομένων σας από εμάς. Έχετε επίσης το δικαίωμα να αντιταχθείτε όπου επεξεργαζόμαστε τα προσωπικά δεδομένα σας για σκοπούς άμεσης μάρκετινγκ.",
  "Request erasure of Your Personal Data.": "Ζητήστε τη διαγραφή των προσωπικών δεδομένων σας.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "Έχετε το δικαίωμα να μας ζητήσετε να διαγράψουμε τα προσωπικά δεδομένα σας όταν δεν υπάρχει καλός λόγος για εμάς να συνεχίσουμε την επεξεργασία τους.",
  "Request the transfer of Your Personal Data.": "Ζητήστε τη μεταφορά των προσωπικών δεδομένων σας.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Θα σας παρέχουμε, ή σε έναν τρίτο που έχετε επιλέξει, τα προσωπικά δεδομένα σας σε ένα δομημένο, κοινά χρησιμοποιούμενο, μηχανικά αναγνώσιμο μορφή. Σημειώστε ότι αυτό το δικαίωμα ισχύει μόνο για αυτόματες πληροφορίες για τις οποίες αρχικά παραχωρήσατε τη συγκατάθεσή σας για τη χρήση από εμάς ή όπου χρησιμοποιήσαμε τις πληροφορίες για να εκτελέσουμε ένα συμβόλαιο μαζί σας.",
  "Withdraw Your consent.": "Ανάκληψη της συγκατάθεσής σας.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "Έχετε το δικαίωμα να ανακαλέσετε τη συγκατάθεσή σας για τη χρήση των προσωπικών δεδομένων σας. Εάν ανακαλέσετε τη συγκατάθεσή σας, ενδέχεται να μην είμαστε σε θέση να σας παρέχουμε πρόσβαση σε συγκεκριμένες λειτουργίες της Υπηρεσίας.",
  "Exercising of Your GDPR Data Protection Rights": "Ασκηση των δικαιωμάτων προστασίας δεδομένων GDPR σας",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Μπορείτε να ασκήσετε τα δικαιώματα πρόσβσης, διόρθωσης, ακύρωσης και αντίθεσης επικοινωνώντας μαζί μας. Σημειώστε ότι ενδέχεται να σας ζητήσουμε να επαληθεύσετε την ταυτότητά σας πριν απαντήσουμε σε τέτοια αιτήματα. Εάν υποβάλετε αίτημα, θα προσπαθήσουμε το καλύτερο δυνατό να ανταποκριθούμε σε εσάς το συντομότερο δυνατό.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "Έχετε το δικαίωμα να καταγγείλετε σε μια Αρχή Προστασίας Δεδομένων για τη συλλογή και χρήση των προσωπικών δεδομένων σας από εμάς. Για περισσότερες πληροφορίες, εάν βρίσκεστε στην Ευρωπαϊκή Οικονομική Περιοχή (ΕΟΠ), επικοινωνήστε με την τοπική αρχή προστασίας δεδομένων στην ΕΟΠ.",
  "Children's Privacy": "Προστασία των παιδιών",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Η Υπηρεσία μας δεν απευθύνεται σε κανέναν κάτω των 13 ετών. Δεν συλλέγουμε επίτηδες προσωπικά αναγνωρίσιμες πληροφορίες από κανέναν κάτω των 13 ετών. Εάν είστε γονέας ή κηδεμόνας και γνωρίζετε ότι το παιδί σας μας έχει παράσχει Προσωπικά Δεδομένα, παρακαλούμε επικοινωνήστε μαζί μας. Εάν γίνουμε ενήμεροι ότι έχουμε συλλέξει Προσωπικά Δεδομένα από κάποιον κάτω των 13 ετών χωρίς επαλήθευση της γονικής συγκατάθεσης, λαμβάνουμε μέτρα για την αφαίρεση αυτών των πληροφοριών από τους διακομιστές μας.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Εάν χρειαστεί να βασιστούμε στη συγκατάθεση ως νομική βάση για την επεξεργασία των πληροφοριών σας και η χώρα σας απαιτεί τη συγκατάθεση από γονέα, μπορεί να απαιτηθεί η συγκατάθεση του γονέα σας πριν συλλέξουμε και χρησιμοποιήσουμε αυτές τις πληροφορίες.",
  "Links to Other Websites": "Σύνδεσμοι προς άλλες ιστοσελίδες",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Η Υπηρεσία μας μπορεί να περιέχει συνδέσμους προς άλλες ιστοσελίδες που δεν λειτουργούν από εμάς. Εάν κάνετε κλικ σε έναν σύνδεσμο τρίτου μέρους, θα ανακατευθυνθείτε στην ιστοσελίδα αυτού του τρίτου μέρους. Σας συνιστούμε ανεπιφύλακτα να ελέγξετε την Πολιτική Απορρήτου κάθε ιστοσελίδας που επισκέπτεστε.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Δεν έχουμε καμία ελέγχου και δεν φέρουμε καμία ευθύνη για το περιεχόμενο, τις πολιτικές απορρήτου ή τις πρακτικές οποιασδήποτε ιστοσελίδας ή υπηρεσίας τρίτου μέρους.",
  "Changes to this Privacy Policy": "Αλλαγές σε αυτήν την Πολιτική Απορρήτου",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Μπορούμε ν ενημερώσουμε την Πολιτική Απορρήτου μας από καιρό σε καιρό. Θα σας ειδοποιήσουμε για οποιεσδήποτε αλλαγές δημοσιεύοντας τη νέα Πολιτική Απορρήτου σε αυτήν τη σελίδα.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Θα σας ενημερώσουμε μέσω email και/ή με ένα εμφανές ανακοίνωση στην Υπηρεσία μας, πριν η αλλαγή τεθεί σε ισχύ και θα ενημερώσουμε την ημερομηνία \"Τελευταία ενημέρωση\" στην κορυφή αυτής της Πολιτικής Απορρήτου.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Σας συνιστούμε να ελέγχετε αυτήν την Πολιτική Απορρήτου περιοδικά για οποιεσδήποτε αλλαγές. Οι αλλαγές σε αυτήν την Πολιτική Απορρήτου είναι αποτελεσματικές όταν δημοσιεύονται σε αυτήν τη σελίδα.",
  "Contact Us": "Επικοινωνήστε μαζί μας",
  "If you have any questions about this Privacy Policy, You can contact us:": "Εάν έχετε οποιεσδήποτε ερωτήσεις σχετικά με αυτήν την Πολιτική Απορρήτου, μπορείτε να επικοινωνήσετε μαζί μας:",
  "By visiting this page on our website:": "Επισκεπτόμενοι αυτήν τη σελίδα στον ιστότοπό μας:"
}