{
  "What is Robonomics network?": "Che cos'è robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics è una piattaforma open source per applicazioni IoT. Supportiamo una nuova generazione di tecnologie Internet (web3) che implementano lo scambio di informazioni tecniche ed economiche sotto forma di transazioni atomiche tra applicazioni utente, servizi IoT e robotica complessa.",
  "Get started": "Per iniziare",
  "Explore Robonomics": "Esplorare robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics è una tecnologia open-source per il mercato IoT, disponibile per chiunque. Leggi un riepilogo esecutivo per saperne di più",
  "Get XRT": "Ottieni XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT è l'utility token che rende possibile il controllo dei dispositivi IoT sulla rete Ethereum e sulla parachain di Robonomics",
  "Use a Dapp": "Utilizza una Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Dai un''occhiata alla beta delle applicazioni decentralizzate per la gestione di dispositivi IoT",
  "Start building": "Inizia a costruire",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Impara di più su Robonomics grazie ai tutorial e ad alcuni utili esperimenti pratici disponibili sul Robonomics WIKI",
  "Robonomics objectives": "Gli obiettivi di Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Basandosi sui risultati delle piattaforme cloud, Robonomics vuole offrire al mercato IoT delle soluzioni Internet più sicure e avanzate per ogni fase della comunicazione uomo-macchina. Le principali funzioni per le quali si sta sviluppando Robonomics sono",
  "IoT device management with a decentralized cloud": "Gestione dei dispositivi iot con un cloud decentralizzato",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Le reti blockchain dispongono di tutti i parametri necessari a garantire ilmassimo livello disicurezza per l'avvio dei dispositivi e la ricezione della telemetria. L'interazione con un dispositivo può essere descritta modificando lo stato del digital twin memorizzato nella blockchain e fornendo al dispositivo fisico le informazioni su queste modifiche. Nel caso di utilizzo di una blockchain permissionless, possiamo essere certi della disponibilità globale dei provider, nonché di un elevato livello di protezione dei dati del digital twin da modifiche ndesiderate",
  "Techno-economic transactions between humans and machines": "Transazioni tecnico-economiche tra umani e macchine",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Possiamo parlare di risultati istituzionali in termini di accesso ai sistemi automatizzati direttamentenei mercati digitali, attraverso criptovalute e smart contract. Ad esempio, Ethereum implementa già la maggior parte degli strumenti alla base dell'attività economica. Le applicazioni create oggi per connettere l'utente finale e i dispositivi IoT, saranno molto più efficienti se il pagamento e le condizioni di servizio sono inseparabili dai parametri di lancio del dispositivo.",
  "Serverless IoT applications for users": "Applicazioni iot senza server per gli utenti",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "La questione della privacy degli utenti nelle moderne applicazioni, non dovrebbe bloccarsi per l'incapacità delle aziende di sfruttare gli ultimi progressi nel campo del Web3. Non è necessario autenticarsi o richiedere la connessione a dei server specifici per accedere alla telemetria e controllare un dispositivo.",
  "Learn with Robonomics": "Impara con robonomics",
  "Introduction course": "Corso Introduttivo",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Immergiti nei problemi che orbitano intorno alla creazione di moderne applicazioni Internet of Things e alle possibili soluzioni con tecnologie web3 e strumenti Robonomics per sviluppatori IoT e utenti.",
  "Boston dynamics spot software developing": "Sviluppo software Boston Dynamics Spot",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Siamo entusiasti di presentarvi il programma educativo Spot SDK! Il nostro obiettivo è farvi familiarizzare con l'SDK del Boston Dynamics Spot, consentendovi di testare le sue capacità utilizzandolo da remoto nel nostro laboratorio.",
  "Sovereign smart home with robonomics and home assistant": "Smart Home Sovrana con Robonomics e Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "In questo corso, eseguirete tutti i passaggi necessari a costruire la vostra smart home sovrana, il cui vantaggio principale è la sicurezza / privacy dei dati dell'utente.",
  "Shop": "Negozio",
  "Science papers": "Paper scientifici",
  "Books": "Libri",
  "Logo and assets": "Loghi e asset",
  "Blog": "Blog",
  "Ambassador program": "Programma ambassador",
  "Contacts": "Contatti",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Timeline",
  "Tokenomics": "ТTokenomics",
  "Parachain": "Parachain",
  "User (D)App": "User (D)App",
  "Function request": "Function request",
  "Report": "Report",
  "Control": "Control",
  "Log": "Log",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Applicazione decentralizzata",
  "Digital twin": "Digital twin",
  "IoT / Smart device": "IoT / Smart device",
  "Robonomics tokenomics": "Robonomics tokenomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "è l'utility token che consentirà di controllare i dispositivi IoT su Ethereum e sulla parachain Robonomics nell'ecosistema Polkadot.",
  "The task": "L'obiettivo",
  "Be aware of scammers": "Fai attenzione ai truffatori",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "utilizza solo mercati noti per scambiare XRT. Qualunque transazione tu voglia effettuare (acquista o vendi token), non inviare i tuoi token agli account che ti vengono forniti nei messaggi privati. Se hai ricevuto 'dichiarazioni rumorose' sul token di Robonomics (i truffatori spesso utilizzano l'annuncio di airdrop), controlla questo sito web (https://robonomics.network/) o il nostro ",
  "for official updates. Be careful, be safe.": "per gli aggiornamenti ufficiali. State attenti, state al sicuro.",
  "XRT in Ethereum": "XRT su Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Implementando il progetto Robonomics nel 2015-2018, il team aveva bisogno di trovare una connessione tra la fornitura di una funzione utile da parte di Robonomics Network, ovvero il lancio di dispositivi IoT secondo il modello robot-as-a-service, e il rimborso dei costi per le gas fee su Ethereum ai provider di Robonomics. Avevamo bisogno di pensare al ciclo vita della responsabilità di ogni singolo dispositivo intelligente per eseguire un servizio. Come risultato delle prime attività di ricerca e sviluppo su Robonomics, il team ha ideato un meccanismo per minare nuovi token e ricompensare ogni smart contract robot-as-a-service creato. Questo modello rimane valido per il futuro di Robonomics su Ethereum, ma solo con miglioramenti significativi a Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Leggi questo per conoscere il background storico e i piani di lungo periodo del team per XRT nell'ecosistema Ethereum.",
  "Etherscan profile": "Profilo Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Visualizza lo smart contract del token e le transazioni sulla rete Ethereum qui.",
  "Coingecko markets": "Mercati su Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Qui puoi trovare i mercati CEX e DEX per il trading di XRT.",
  "XRT In Polkadot": "XRT su Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Passando da Ethereum a Polkadot, dobbiamo fare uno 'scaling up' della tokenomics. Le parachain dell'ecosistema Polkadot non sono l'equivalente di uno smart contract, ma sono blockchain completamente programmabili che affittano un segmento della rete complessiva.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Il pagamento effettivo da parte delle parachain Polkadot e Kusama è il bonding a lungo termine di token nativi della Relay chain (DOT / KSM) in quantità sufficiente a vincere una delle aste. L'XRT della parachain Robonomics supporta il rinnovo degli slot e le ricompense per gli stakeholders. Il meccanismo di burning degli XRT alla base dell'attivazione degli abbonamenti IoT è progettato per ridurre l'inflazione al minimo e, in caso di aumento degli interessi, a zero.",
  "Learn more": "Scopri di più",
  "in Twitter thread from our network architect.": "col thread di Twitter scritto dal nostro network architect.",
  "Usage:": "Utilizzo:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT può essere utilizzato sia per pagare le commissioni per l'esecuzione di transazioni sulla parachain che per acquistare un abbonamento IoT che garantisca l'elaborazione prioritaria delle transazioni IoT del dispositivo o dell'utente.",
  "Rewards:": "Ricompense",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Durante tutto l'anno, la parachain emette una piccola quantità di XRT per incentivare i suoi collators.",
  "The parameter of the total reward": "Il parametro per la ricompensa totale",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": " dei collators per l'anno è determinato dal voto on-chain dei token holder e può essere modificato con un referendum.",
  "Use XRT": "Utilizza XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Acquista l'abbonamento IoT sulla nostra applicazione decentralizzata. Controlla i tuoi dispositivi intelligenti tramite blockchain senza che alcuna società centralizzata osservi.",
  "Subscan profile": "Profilo Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Visualizza le statistiche del token nell'ecosistema Polkadot.",
  "Other questions": "Altre domande",
  "What is RWS?": "Cos'è RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[In fase di sviluppo delle funzionalità di base] Per gli ingegneri, il team Core Dev proverà a creare diversi modelli di utilizzo di Robonomics e il primo passo è il lancio del token di abbonamento a vita - il token RWS. Ogni token RWS fornisce 1 transazione al secondo (tps) da/verso un dispositivo IoT sulla Parachain Robonomics. Attiva il tuo token RWS ed effettua transazioni 'free gas' con pre-esecuzione e latenza prevedibile. Disattiva il token RWS e scambialo su DEX.",
  "What is AIRA/AIR ID?": "Che cos'è l'AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Un token pre-XRT distribuito nel 2017 come parte autonoma di un'ulteriore infrastruttura Robonomics su Ethereum. Dopo il successo del lancio di Robonomics su Ethereum nel 2019, i token AIRA sono stati collegati all'infrastruttura del progetto tramite uno",
  "ambix smart contract": "smart contract ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "che ha garantito un processo autonomo e indipendente per scambiare il pre-XRT con l'XRT ERC-20.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "del token di Robonomics è garantire il funzionamento di una rete decentralizzata per il mantenimento di Smart Cities e dell'Industria 4.0 sull'infrastruttura blockchain. Per raggiungere questo obiettivo, la token economy deve riflettere gli incentivi per l'implementazione della rete.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "L'applicazione decentralizzata (dapp) funziona all'interno della Blockchain. È open source e i suoi dati sono archiviati su IPFS e Github. Queste tecnologie consentono all'applicazione di essere sicura e trasparente allo stesso tempo. I nostri sviluppatori lavorano sia allo sviluppo dell'applicazione di Robonomics sia alle librerie che potete utilizzare per costruire la vostra dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Il Digital Twin è uno degli strumenti forniti da Robonomics Web Services (RWS). Agisce come una versione digitale della strumentazione nel mondo reale e ne copia tutte le caratteristiche tecniche. Permette di rendere un'app decentralizzata più reattiva ai comandi dell'utente.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Potete usufruire di Robonomics con un'ampia gamma di smart device Zigbee per automatizzare e controllare vari aspetti della vostra casa/ufficio o utilizzarlo con la robotica basata su ROS per attività industriali più complesse.",
  "Do Androids Dream of Electric Sheep?": "Ma gli Androidi Sognano Pecore Elettriche?",
  "Sleeping Mew Space": "Sleeping Mew Space",
  "Are you ready for Mars?": "Are you ready for Mars?",
  "Shiva Robot": "Robot Shiva",
  "Space Travelers": "Space Travelers",
  "Retro Astronaut": "Retro Astronaut",
  "New Newton": "New Newton",
  "Your email": "Vostra email",
  "Want emails from robonomics": "Voglio ricevere email da robonomics",
  "Adding you to our special list...": "Vi aggiungiamo alla nostra lista speciale..",
  "Nice, you are in the list": "Ottimo, siete in lista",
  "Something went  wrong. Try again later": "Qualcosa è andato storto. Riprova più tardi",
  "Robonomics art shop": "Robonomics art shop",
  "Welcome to our brand new online shop on": "Benvenuti nel nostro nuovissimo negozio online su",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Il nostro negozio offre abbigliamento, accessori, decorazioni per la casa e altri articoli che mostrano il nostro amore per la robotica, la tecnologia e l'arte. Potete trovare magliette, maglie, felpe con cappuccio, tende da doccia, cuscini, coperte e altri prodotti utili con i nostri design unici realizzati dagli artisti Robonomics, mentre produzione e spedizione sono curate dai colleghi di Threadless. Enjoy!",
  "Shop now on threadless": "Acquista ora su threadless",
  "alternative shop": "negozio alternativo",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "L'anno è iniziato con un risultato importante: Robonomics ha vinto la 20a asta di slot come parachain ed è",
  "officially became": "diventato ufficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "na parachain su Kusama con ID 2048. Il lancio, il datalog, il DigitalTwin, le funzioni liability e gli abbonamenti IoT sono diventati disponibili per tutti gli utenti dell'ecosistema. Per fornire i dettagli su questa fase del progetto, il core team ha pubblicato i primi capitoli del",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 su Substrate è stato rilasciato con il supporto per messaggi XCM e abbiamo iniziato ad aprire canali HRMP con altre parachain (come Crust Shadow e Darwinia), le cui funzionalità ci sono estremamente utili.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Allo stesso tempo, abbiamo sbloccato una strategia per introdurre il mercato IoT sul nostro protocollo. I nostri esperimenti con le apparecchiature IoT ci hanno portato al concetto di smart home sovrana, indipendente dai fornitori di servizi cloud centralizzati. Abbiamo sviluppato la nostra",
  "integration": "integrazione",
  "with the Home Assistant automation system, and also designed our own": ", col sistema di automazione Home Assistant e progettato il nostro",
  "IoT gateway": "gateway IoT",
  "for connecting smart devices.": "per la connessione di dispositivi intelligenti.",
  "We have launched two big initiatives in order to increase community engagement —": "Abbiamo lanciato due grandi iniziative per aumentare il coinvolgimento della community:",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Inoltre, in autunno si è tenuto il",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "in modo che la community di Robonomics potesse provare i nostri meccanismi di governance per la prima volta. Di recente, il team di Robonomics ha aiutato il progetto DAO IPCI a ottenere uno slot come parachain, per presentare il servizio di compensazione della CO2 per gli edifici intelligenti.",
  "In 2021, our": "Nel 2021, il nostro",
  "main focus": "obiettivo principale",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "si è spostato sulla preparazione del progetto, in modo che le applicazioni IoT potessero essere utilizzate tramite la nostra parachain su Kusama. Robonomics 1.0 su Substrate è stato rilasciato e abbiamo testato la connessione dei sensori alla parachain per inviare i loro dati telemetrici, oltre a sviluppare la funzionalità del digital twin. A metà anno, abbiamo deciso di testare l'intero ciclo della nostra rete e abbiamo creato la nostra relay chain chiamata",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "sulla quale è stata integrata la parachain Robonomics (prima di essere migrata sulla relay chain di Kusama). Ci siamo concentrati molto sull'ottenere uno slot come parachain di Kusama, per il quale abbiamo organizzato diverse campagne di crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Ci sono stati due grossi cambiamenti per la community. Innanzitutto, abbiamo lanciato il",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "che consente ai progetti web3, di robotica e IoT di ricevere finanziamenti per attività di ricerca e sviluppo. Entro la fine dell'anno, quattro progetti attivi hanno partecipato al programma. Successivamente, il team ha avviato il",
  "Exodus process": "processo Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "consentendo ai possessori del token su Ethereum di migrare i propri XRT sulla parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Fra le collaborazioni, possiamo ricordare la notevole apparizione del Boston Dynamics Spot da MerkleBot, per il quale è stato sviluppato un",
  "rental remote control system": "sistema di controllo remoto a noleggio",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Vorremmo anche informarvi sulla società Multi-Agent Systems, un progetto personale messo insieme da un team di ingegneri Robonomics. Hanno sviluppato un robot di nome Eisenkoch che prepara waffle per una caffetteria.",
  "There came a time when the existing limitations of Ethereum": "È arrivato un momento dove i limiti esistenti di Ethereum hanno",
  "began to stand out clearly": "cominciato a emergere chiaramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(in particolare, scarsa scalabilità, bassa velocità e costo delle transazioni molto elevato). L'aggiornamento a ETH2.0 avrebbe dovuto risolvere la situazione, ma questo aggiornamento è stato continuamente rimandato. Sebbene non volessimo lasciare la rete Ethereum, ci siamo resi conto che nella situazione attuale sarebbe stato difficile implementare i nostri casi d'uso e abbiamo iniziato a cercare una rete alternativa. L'ecosistema blockchain frammentato di Polkadot è diventato la nostra scelta. Abbiamo iniziato sperimentando il framework Substrate per migrare le principali funzionalità di Robonomics e distribuire la nostra testnet. Alla fine di questa fase, avevamo implementato la nostra parachain sulla testnet Rococo e iniziato a prepararci per ottenere uno slot su Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando a studiare i sistemi IoT, abbiamo identificato la funzionalità principale di Robonomics, che può aggiungere valore agli utenti: la funzione del cloud decentralizzato per IoT. Questa idea ha costituito la base di",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "L'infrastruttura RWS ha assunto tutte le funzioni di un tipico cloud centralizzato, ma senza i classici problemi di disponibilità globale, sicurezza e privacy. Inoltre, abbiamo avuto l'idea degli abbonamenti IoT parachain che consentono ai loro possessori di utilizzare la rete blockchain senza dover pagare una commissione per ogni transazione. Il primo esperimento con gli abbonamenti IoT è stata l'emissione del token RWS, che consente al suo proprietario di inviare 1 transazione per blocco. Inoltre, abbiamo iniziato a muovere i primi passi nello sviluppare del nostro kit hardware per il controllo di dispositivi intelligenti (il concetto DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Naturalmente, il supporto per Robonomics su Ethereum non si è fermato. Lo stack di comunicazione di Robonomics è stato finalizzato alla versione",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Il token XRT ha iniziato a fare trading su diversi exchange (in particolare, Uniswap DEX) ed è stato lanciato il programma di incentivazione della liquidità.",
  "The team actively developed ways to interact with the community. The first version of our": "Il team ha sviluppato attivamente dei modi per interagire con la community. La prima versione del nostro sito",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "e il Robonomics Wiki sono stati lanciati. Abbiamo iniziato a utilizzare",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "per una gestione dei progetti più trasparente e conveniente. Abbiamo ospitato la",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "nel 2019 per i nuovi arrivati nel progetto.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Sono proseguite anche le collaborazioni con progetti congeniali. Robonomics e DAO IPCI hanno introdotto un servizio per la raccolta e l'analisi dei dati sensoriali: ",
  "Robonomics became the foundation for the": "Robonomics è diventata la base per il progetto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "che sta sviluppando un sistema per il noleggio intelligente di apparecchiature robotiche.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Abbiamo capito che gli agenti autonomi avevano bisogno di un ambiente che garantisse loro affidabili operazioni tecniche ed economiche. Per diversi anni abbiamo sviluppato un protocollo per la creazione di una rete decentralizzata di fornitori che aiutassero gli agenti robotici a fornire i loro servizi. Sono stati sviluppati degli strumenti per la manutenzione della rete e per lo stack di comunicazione fra Ethereum e ROS. Nel 2018 abbiamo pubblicato il",
  "Robonomics Whitepaper": "Whitepaper di Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "e la versione alpha di Robonomics Network è stata lanciata sulla mainnet di Ethereum. Sono proseguiti i preparativi per il token generation event di XRT (che alla fine è avvenuto nella primavera del 2019 a causa del primo crypto winter).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Da questo periodo, Robonomics ha iniziato a sviluppare dinamicamente i casi d'uso legati all'Industria 4.0 —  industrie, città e case smart — e questo ha portato la nostra attenzione al mondo dell'IoT. Alla ricerca d'innovazione, il team ha presentato diverse demo di ricerca e sviluppo uniche e di grandi dimensioni: una",
  "sensor network": "rete di sensori civili",
  "a water drone": "un drone acquatico",
  "for environmental monitoring (supported by a sensor systems manufacturer": "per il monitoraggio ambientale (supportato da un produttore di sistemi di sensori",
  "a smart factory model": "un odello di fabbrica intelligente",
  "a self-employed": "un",
  "robot artist Gaka-chu": "robot artista autonomo chiamato Gaka-chu",
  "and a": "en ",
  "drone traffic management system": "un sistema di gestione del traffico droni",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics ha avviato la collaborazione col progetto DAO IPCI sulla gestione dei beni ambientali utilizzando tecnologie web3 e dispositivi IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Questo è stato un florido periodo di ricerca e sviluppo, durante il quale abbiamo identificato una serie di compiti per i quali le tecnologie p2p hanno delle capacità che prima la robotica non aveva. Combinando il computer Ethereum, l'archiviazione di file IPFS e il Robot Operating System (ROS), ci siamo resi conto che ogni dispositivo può potenzialmente diventare un",
  "autonomous intelligent robot agent": "gente robotico autonomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "A sua volta, questo ci ha aperto la strada verso i concetti di Robot-as-a-Service e robot economy.",
  "Our publications in scientific journals of this period are available in the": "Le nostre pubblicazioni su riviste scientifiche di questo periodo sono disponibili nella sezione",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Abbiamo raccolto tutti i progetti di ricerca e sviluppo nel corso degli anni in un",
  "a handy book": "pratico libro",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tutto è iniziato con un'idea che è venuta ai fondatori quando Ethereum aveva appena lanciato la sua mainnet. Cosa succede se un robot esegue un'attività per un cliente in cambio di criptovaluta e la sua logica è controllata da uno smart contract?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Per testare l'idea, abbiamo realizzato una demo dove è stato lanciato un drone controllato da un computer Ethereum per raggiungere le coordinate GPS specificate, dopo che l'utente ha completato una transazione di pagamento.",
  "The demo is available on": "La demo è disponibile su",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Cronologia di sviluppo infrastruttura e tecnologia",
  "Notable events": "Eventi notevoli",
  "World Economic Forum Annual Meeting 2022": "Meeting Annuale del World Economic Forum 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "Sulla Strada per la Domotica Sovrana",
  "Becoming a Parachain for IoT Applications": "Diventare una Parachain per le Applicazioni IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (sponsorizzato da Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (ospitata da Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transizione al Multinetwork — È arrivato Polkadot",
  "The Rise of Robonomics Network": "L'Ascesa di Robonomics Network",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop 'The Economy of Robots'": "Workshop del Parlamento europeo 'L'economia dei Robot'",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simposio su Blockchain per Sistemi Robotici al MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics-2018 summer school ospitata dal team di Robonomics",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Riunire Tecnologie Web3 e Framework per la Robotica",
  "Playing with Human-Machine Interaction through Ethereum": "Giocare con l'interazione Uomo-Macchina tramite Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Guida di benvenuto al Whitepaper 2022 di Robonomics",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Abbiamo sviluppato un protocollo di comunicazione tecno-economico per le macchine in esecuzione su Ethereum e IPFS, che viene completato da una piattaforma IoT basata su cloud e Parachain Polkadot. Oggi abbiamo già una piattaforma ibrida per la creazione di applicazioni IoT futuristiche, che fornisce interazione coi dispositivi sotto il controllo di un computer decentralizzato globale. Prima di iniziare a creare applicazioni IoT sicure, senza server e futuristiche utilizzando la piattaforma Robonomics, immergiamoci un po' nella teoria...",
  "The first two chapters of the Robonomics white paper are already available to users.": "I primi due capitoli del whitepaper di Robonomics sono già disponibili per gli utenti.",
  "Chapter 1.": "Capitolo 1.",
  "At the intersection of cybernetics and economics": "All'intersezione fra cibernetica ed economia",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Abbiamo presentato un sistema economico dove i dispositivi robotici agiscono come degli agenti indipendenti in grado di svolgere attività economiche chiave, che prima erano riservate agli umani. In questo capitolo parliamo della rilevanza della robot economy, che in futuro può diventare una parte importante nella vita delle persone e cambiare l'attuale livello dell'economia in servizi completamente automatizzati.",
  "In this chapter you will learn": "In questo capitolo imparerete",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase e The Nature of the Firm",
  "CPS - cyber-physical system": "CPS - sistemi cyber-fisici",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener e la ricerca di pattern nella vita e nella macchina",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "La Quarta Rivoluzione Industriale, Denaro per i Robot e Bitcoin",
  "Ethereum Smart Contracts": "Smart Contract Ethereum",
  "Polkadot Parachains": "Parachain Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Domande aperte di teleologia e il lavoro di Mises",
  "Read chapter 1": "Leggi il capitolo 1",
  "Chapter 2.": "Capitolo 2.",
  "Robonomics architecture": "L'architettura di robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Nel secondo capitolo, leggerete sull'interazione uomo-macchina usando le moderne tecnologie Internet - dai dispositivi IoT a una rete di fornitori decentralizzata e accessibile a livello globale. Esamineremo le basi dell'Internet of Things per evidenziarne le problematiche e le sfide principali che i costruttori di sistemi IoT devono affrontare, arrivando poi alla soluzione a cui Robonomics sta puntando.",
  "Overview of the state of the Internet of Things (IoT)": "Panoramica sullo stato dell'Internet of Things (IoT)",
  "Classification of IoT devices": "Classificazione dei dispositivi IoT",
  "Embedded IoT systems": "Sistemi IoT embedded",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: Gateway e controller IoT",
  "Autonomous Systems": "Sistemi Autonomi",
  "Internet of Things providers": "Fornitori di Internet of Things",
  "Digital twins are the heart of the Internet of Things": "I digital twin sono il cuore dell'Internet of Things",
  "IoT data flows in cloud service": "Flussi di dati IoT nel servizio cloud",
  "Popular examples of IoT solutions": "Esempi popolari di soluzioni IoT",
  "Current problems of building IoT solutions": "Problemi attuali nella creazione di soluzioni IoT",
  "Main tasks of Robonomics architecture": "Principali compiti dell'architettura Robonomics",
  "Basic components of Robonomics architecture": "Componenti di base dell'architettura Robonomics",
  "A simple representation of Robonomics architecture": "Una semplice rappresentazione dell'architettura Robonomics",
  "Read chapter 2": "Leggi il capitolo 2",
  "We continue to update the white paper of Robonomics": "Il whitepaper di Robonomics è in continuo aggiornamento",
  "stay tuned for new parts on our website and in Discord": "restate sintonizzati sul nostro sito web e su Discord per le nuove parti",
  "Join our discord": "Unisciti al nostro discord",
  "Robonomics logos and usage": "Robonomics loghi e utilizzi",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Abbiamo messo insieme i loghi, i colori, le risorse e le linee guida di Robonomics per mostrarvi come utilizzarli.",
  "Download Robonomics logo": "Scarica il logo di Robonomics",
  "Download RWS logo": "Scarica il logo RWS",
  "Download wiki logo": "Scarica il logo wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Utilizzate questi loghi autorizzati per rimandare a Robonomics, RWS o Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Utilizzate il logo di Robonomics autorizzato per informare gli altri che siete integrati con Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Utilizzare i loghi autorizzati nei blog post, negli articoli e nelle diapositive sulla tecnologia di Robonomics e sui progetti integrati",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Non modificate i loghi di Robonomics autorizzati, incluse modifiche al colore, alle dimensioni o la combinazione con altre parole o elementi di design",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Non utilizzate il logo e il nome di Robonomics in modi che possano far intendere che siete Robonomics, che la vostra offerta o progetto appartengono a Robonomics o che Robonomics sta approvando voi, la vostra offerta o progetto se non è stato approvato da Robonomics DAO",
  "Robonomics Color pallet": "Color palette di robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Questi sono i colori che utilizziamo nelle nostre interfacce, stampe e altri elementi visivi. </br> Utilizzateli per le vostre diapositive, banner per post, ecc. che parlano di Robonomics"
}