{
  "What is Robonomics network?": "Che cos'è robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics è una piattaforma open source per applicazioni IoT. Supportiamo una nuova generazione di tecnologie Internet (Web3) che implementano lo scambio di informazioni tecniche ed economiche sotto forma di transazioni atomiche tra applicazioni utente, servizi IoT e robotica complessa.",
  "Serverless IoT applications for users": "Applicazioni iot senza server per gli utenti",
  "Timeline": "Timeline",
  "User (D)App": "User (D)App",
  "Function request": "Function request",
  "Report": "Report",
  "Control": "Control",
  "Log": "Log",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Applicazione decentralizzata",
  "Digital twin": "Digital twin",
  "IoT / Smart device": "IoT / Smart device",
  "Robonomics tokenomics": "Robonomics tokenomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "è l'utility token che consentirà di controllare i dispositivi IoT su Ethereum e sulla parachain Robonomics nell'ecosistema Polkadot.",
  "The task": "L'obiettivo",
  "Be aware of scammers": "Fai attenzione ai truffatori",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "utilizza solo mercati noti per scambiare XRT. Qualunque transazione tu voglia effettuare (acquista o vendi token), non inviare i tuoi token agli account che ti vengono forniti nei messaggi privati. Se hai ricevuto 'dichiarazioni rumorose' sul token di Robonomics (i truffatori spesso utilizzano l'annuncio di airdrop), controlla questo sito web (https://robonomics.network/) o il nostro ",
  "for official updates. Be careful, be safe.": "per gli aggiornamenti ufficiali. State attenti, state al sicuro.",
  "XRT in Ethereum": "XRT su Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Implementando il progetto Robonomics nel 2015-2018, il team aveva bisogno di trovare una connessione tra la fornitura di una funzione utile da parte di Robonomics Network, ovvero il lancio di dispositivi IoT secondo il modello robot-as-a-service, e il rimborso dei costi per le gas fee su Ethereum ai provider di Robonomics. Avevamo bisogno di pensare al ciclo vita della responsabilità di ogni singolo dispositivo intelligente per eseguire un servizio. Come risultato delle prime attività di ricerca e sviluppo su Robonomics, il team ha ideato un meccanismo per minare nuovi token e ricompensare ogni smart contract robot-as-a-service creato. Questo modello rimane valido per il futuro di Robonomics su Ethereum, ma solo con miglioramenti significativi a Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Leggi questo per conoscere il background storico e i piani di lungo periodo del team per XRT nell'ecosistema Ethereum.",
  "Etherscan profile": "Profilo Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Visualizza lo smart contract del token e le transazioni sulla rete Ethereum qui.",
  "Coingecko markets": "Mercati su Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Qui puoi trovare i mercati CEX e DEX per il trading di XRT.",
  "XRT In Polkadot": "XRT su Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Passando da Ethereum a Polkadot, dobbiamo fare uno 'scaling up' della tokenomics. Le parachain dell'ecosistema Polkadot non sono l'equivalente di uno smart contract, ma sono blockchain completamente programmabili che affittano un segmento della rete complessiva.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Il pagamento effettivo da parte delle parachain Polkadot e Kusama è il bonding a lungo termine di token nativi della Relay chain (DOT / KSM) in quantità sufficiente a vincere una delle aste. L'XRT della parachain Robonomics supporta il rinnovo degli slot e le ricompense per gli stakeholders. Il meccanismo di burning degli XRT alla base dell'attivazione degli abbonamenti IoT è progettato per ridurre l'inflazione al minimo e, in caso di aumento degli interessi, a zero.",
  "Learn more": "Scopri di più",
  "in Twitter thread from our network architect.": "col thread di Twitter scritto dal nostro network architect.",
  "Usage:": "Utilizzo:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT può essere utilizzato sia per pagare le commissioni per l'esecuzione di transazioni sulla parachain che per acquistare un abbonamento IoT che garantisca l'elaborazione prioritaria delle transazioni IoT del dispositivo o dell'utente.",
  "Rewards:": "Ricompense",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Durante tutto l'anno, la parachain emette una piccola quantità di XRT per incentivare i suoi collators.",
  "The parameter of the total reward": "Il parametro per la ricompensa totale",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": " dei collators per l'anno è determinato dal voto on-chain dei token holder e può essere modificato con un referendum.",
  "Use XRT": "Utilizza XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Acquista l'abbonamento IoT sulla nostra applicazione decentralizzata. Controlla i tuoi dispositivi intelligenti tramite blockchain senza che alcuna società centralizzata osservi.",
  "Subscan profile": "Profilo Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Visualizza le statistiche del token nell'ecosistema Polkadot.",
  "Other questions": "Altre domande",
  "What is RWS?": "Cos'è RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[In fase di sviluppo delle funzionalità di base] Per gli ingegneri, il team Core Dev proverà a creare diversi modelli di utilizzo di Robonomics e il primo passo è il lancio del token di abbonamento a vita - il token RWS. Ogni token RWS fornisce 1 transazione al secondo (tps) da/verso un dispositivo IoT sulla Parachain Robonomics. Attiva il tuo token RWS ed effettua transazioni 'free gas' con pre-esecuzione e latenza prevedibile. Disattiva il token RWS e scambialo su DEX.",
  "What is AIRA/AIR ID?": "Che cos'è l'AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Un token pre-XRT distribuito nel 2017 come parte autonoma di un'ulteriore infrastruttura Robonomics su Ethereum. Dopo il successo del lancio di Robonomics su Ethereum nel 2019, i token AIRA sono stati collegati all'infrastruttura del progetto tramite uno",
  "ambix smart contract": "smart contract ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "che ha garantito un processo autonomo e indipendente per scambiare il pre-XRT con l'XRT ERC-20.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "del token di Robonomics è garantire il funzionamento di una rete decentralizzata per il mantenimento di Smart Cities e dell'Industria 4.0 sull'infrastruttura blockchain. Per raggiungere questo obiettivo, la token economy deve riflettere gli incentivi per l'implementazione della rete.",
  "Token distribution": "Distribuzione dei token",
  "Try our Dapp": "Prova la nostra Dapp",
  "In addition": "Inoltre",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "puoi operare XRT all'interno delle blockchain utilizzando gli strumenti forniti da diverse squadre indipendenti nelle comunità di Polkadot (Kusama) ed Ethereum.",
  "Within the Kusama network, you have the capability use": "All'interno della rete Kusama, hai la possibilità di utilizzare",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "la comunicazione tra la parachain di Robonomics e altre parachain utilizzando varie applicazioni decentralizzate (dApp):",
  "Within the Ethereum network you can use decentralized application powered by the": "All'interno della rete Ethereum puoi utilizzare applicazioni decentralizzate alimentate da",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "L'applicazione decentralizzata (dapp) funziona all'interno della Blockchain. È open source e i suoi dati sono archiviati su IPFS e Github. Queste tecnologie consentono all'applicazione di essere sicura e trasparente allo stesso tempo. I nostri sviluppatori lavorano sia allo sviluppo dell'applicazione di Robonomics sia alle librerie che potete utilizzare per costruire la vostra dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Il Digital Twin è uno degli strumenti forniti da Robonomics Web Services (RWS). Agisce come una versione digitale della strumentazione nel mondo reale e ne copia tutte le caratteristiche tecniche. Permette di rendere un'app decentralizzata più reattiva ai comandi dell'utente.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Potete usufruire di Robonomics con un'ampia gamma di smart device Zigbee per automatizzare e controllare vari aspetti della vostra casa/ufficio o utilizzarlo con la robotica basata su ROS per attività industriali più complesse.",
  "Do Androids Dream of Electric Sheep?": "Ma gli Androidi Sognano Pecore Elettriche?",
  "Your email": "Vostra email",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "L'anno è iniziato con un risultato importante: Robonomics ha vinto la 20a asta di slot come parachain ed è",
  "officially became": "diventato ufficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "na parachain su Kusama con ID 2048. Il lancio, il datalog, il DigitalTwin, le funzioni liability e gli abbonamenti IoT sono diventati disponibili per tutti gli utenti dell'ecosistema. Per fornire i dettagli su questa fase del progetto, il core team ha pubblicato i primi capitoli del",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 su Substrate è stato rilasciato con il supporto per messaggi XCM e abbiamo iniziato ad aprire canali HRMP con altre parachain (come Crust Shadow e Darwinia), le cui funzionalità ci sono estremamente utili.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Allo stesso tempo, abbiamo sbloccato una strategia per introdurre il mercato IoT sul nostro protocollo. I nostri esperimenti con le apparecchiature IoT ci hanno portato al concetto di smart home sovrana, indipendente dai fornitori di servizi cloud centralizzati. Abbiamo sviluppato la nostra",
  "integration": "integrazione",
  "with the Home Assistant automation system, and also designed our own": ", col sistema di automazione Home Assistant e progettato il nostro",
  "IoT gateway": "gateway IoT",
  "for connecting smart devices.": "per la connessione di dispositivi intelligenti.",
  "We have launched two big initiatives in order to increase community engagement —": "Abbiamo lanciato due grandi iniziative per aumentare il coinvolgimento della community:",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Inoltre, in autunno si è tenuto il",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "in modo che la community di Robonomics potesse provare i nostri meccanismi di governance per la prima volta. Di recente, il team di Robonomics ha aiutato il progetto DAO IPCI a ottenere uno slot come parachain, per presentare il servizio di compensazione della CO2 per gli edifici intelligenti.",
  "In 2021, our": "Nel 2021, il nostro",
  "main focus": "obiettivo principale",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "si è spostato sulla preparazione del progetto, in modo che le applicazioni IoT potessero essere utilizzate tramite la nostra parachain su Kusama. Robonomics 1.0 su Substrate è stato rilasciato e abbiamo testato la connessione dei sensori alla parachain per inviare i loro dati telemetrici, oltre a sviluppare la funzionalità del digital twin. A metà anno, abbiamo deciso di testare l'intero ciclo della nostra rete e abbiamo creato la nostra relay chain chiamata",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "sulla quale è stata integrata la parachain Robonomics (prima di essere migrata sulla relay chain di Kusama). Ci siamo concentrati molto sull'ottenere uno slot come parachain di Kusama, per il quale abbiamo organizzato diverse campagne di crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Ci sono stati due grossi cambiamenti per la community. Innanzitutto, abbiamo lanciato il",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "che consente ai progetti Web3, di robotica e IoT di ricevere finanziamenti per attività di ricerca e sviluppo. Entro la fine dell'anno, quattro progetti attivi hanno partecipato al programma. Successivamente, il team ha avviato il",
  "Exodus process": "processo Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "consentendo ai possessori del token su Ethereum di migrare i propri XRT sulla parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Fra le collaborazioni, possiamo ricordare la notevole apparizione del Boston Dynamics Spot da MerkleBot, per il quale è stato sviluppato un",
  "rental remote control system": "sistema di controllo remoto a noleggio",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Vorremmo anche informarvi sulla società Multi-Agent Systems, un progetto personale messo insieme da un team di ingegneri Robonomics. Hanno sviluppato un robot di nome Eisenkoch che prepara waffle per una caffetteria.",
  "There came a time when the existing limitations of Ethereum": "È arrivato un momento dove i limiti esistenti di Ethereum hanno",
  "began to stand out clearly": "cominciato a emergere chiaramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(in particolare, scarsa scalabilità, bassa velocità e costo delle transazioni molto elevato). L'aggiornamento a ETH2.0 avrebbe dovuto risolvere la situazione, ma questo aggiornamento è stato continuamente rimandato. Sebbene non volessimo lasciare la rete Ethereum, ci siamo resi conto che nella situazione attuale sarebbe stato difficile implementare i nostri casi d'uso e abbiamo iniziato a cercare una rete alternativa. L'ecosistema blockchain frammentato di Polkadot è diventato la nostra scelta. Abbiamo iniziato sperimentando il framework Substrate per migrare le principali funzionalità di Robonomics e distribuire la nostra testnet. Alla fine di questa fase, avevamo implementato la nostra parachain sulla testnet Rococo e iniziato a prepararci per ottenere uno slot su Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando a studiare i sistemi IoT, abbiamo identificato la funzionalità principale di Robonomics, che può aggiungere valore agli utenti: la funzione del cloud decentralizzato per IoT. Questa idea ha costituito la base di",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "L'infrastruttura RWS ha assunto tutte le funzioni di un tipico cloud centralizzato, ma senza i classici problemi di disponibilità globale, sicurezza e privacy. Inoltre, abbiamo avuto l'idea degli abbonamenti IoT parachain che consentono ai loro possessori di utilizzare la rete blockchain senza dover pagare una commissione per ogni transazione. Il primo esperimento con gli abbonamenti IoT è stata l'emissione del token RWS, che consente al suo proprietario di inviare 1 transazione per blocco. Inoltre, abbiamo iniziato a muovere i primi passi nello sviluppare del nostro kit hardware per il controllo di dispositivi intelligenti (il concetto DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Naturalmente, il supporto per Robonomics su Ethereum non si è fermato. Lo stack di comunicazione di Robonomics è stato finalizzato alla versione",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Il token XRT ha iniziato a fare trading su diversi exchange (in particolare, Uniswap DEX) ed è stato lanciato il programma di incentivazione della liquidità.",
  "The team actively developed ways to interact with the community. The first version of our": "Il team ha sviluppato attivamente dei modi per interagire con la community. La prima versione del nostro sito",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "e il Robonomics Wiki sono stati lanciati. Abbiamo iniziato a utilizzare",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "per una gestione dei progetti più trasparente e conveniente. Abbiamo ospitato la",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "nel 2019 per i nuovi arrivati nel progetto.",
  "Robonomics became the foundation for the": "Robonomics è diventata la base per il progetto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "che sta sviluppando un sistema per il noleggio intelligente di apparecchiature robotiche.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Abbiamo capito che gli agenti autonomi avevano bisogno di un ambiente che garantisse loro affidabili operazioni tecniche ed economiche. Per diversi anni abbiamo sviluppato un protocollo per la creazione di una rete decentralizzata di fornitori che aiutassero gli agenti robotici a fornire i loro servizi. Sono stati sviluppati degli strumenti per la manutenzione della rete e per lo stack di comunicazione fra Ethereum e ROS. Nel 2018 abbiamo pubblicato il",
  "Robonomics Whitepaper": "Whitepaper di Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "e la versione alpha di Robonomics Network è stata lanciata sulla mainnet di Ethereum. Sono proseguiti i preparativi per il token generation event di XRT (che alla fine è avvenuto nella primavera del 2019 a causa del primo crypto winter).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Da questo periodo, Robonomics ha iniziato a sviluppare dinamicamente i casi d'uso legati all'Industria 4.0 —  industrie, città e case smart — e questo ha portato la nostra attenzione al mondo dell'IoT. Alla ricerca d'innovazione, il team ha presentato diverse demo di ricerca e sviluppo uniche e di grandi dimensioni: una",
  "sensor network": "rete di sensori civili",
  "a water drone": "un drone acquatico",
  "for environmental monitoring (supported by a sensor systems manufacturer": "per il monitoraggio ambientale (supportato da un produttore di sistemi di sensori",
  "a smart factory model": "un odello di fabbrica intelligente",
  "a self-employed": "un",
  "robot artist Gaka-chu": "robot artista autonomo chiamato Gaka-chu",
  "and a": "en ",
  "drone traffic management system": "un sistema di gestione del traffico droni",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Robonomics ha avviato la collaborazione col progetto DAO IPCI sulla gestione dei beni ambientali utilizzando tecnologie Web3 e dispositivi IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Questo è stato un florido periodo di ricerca e sviluppo, durante il quale abbiamo identificato una serie di compiti per i quali le tecnologie P2P hanno delle capacità che prima la robotica non aveva. Combinando il computer Ethereum, l'archiviazione di file IPFS e il Robot Operating System (ROS), ci siamo resi conto che ogni dispositivo può potenzialmente diventare un",
  "autonomous intelligent robot agent": "gente robotico autonomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "A sua volta, questo ci ha aperto la strada verso i concetti di Robot-as-a-Service e robot economy.",
  "Our publications in scientific journals of this period are available in the": "Le nostre pubblicazioni su riviste scientifiche di questo periodo sono disponibili nella sezione",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Abbiamo raccolto tutti i progetti di ricerca e sviluppo nel corso degli anni in un",
  "a handy book": "pratico libro",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tutto è iniziato con un'idea che è venuta ai fondatori quando Ethereum aveva appena lanciato la sua mainnet. Cosa succede se un robot esegue un'attività per un cliente in cambio di criptovaluta e la sua logica è controllata da uno smart contract?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Per testare l'idea, abbiamo realizzato una demo dove è stato lanciato un drone controllato da un computer Ethereum per raggiungere le coordinate GPS specificate, dopo che l'utente ha completato una transazione di pagamento.",
  "The demo is available on": "La demo è disponibile su",
  "YouTube": "YouTube",
  "Notable events": "Eventi notevoli",
  "Robonomics whitepaper 2022 welcome guide": "Guida di benvenuto al Whitepaper 2022 di Robonomics",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Abbiamo sviluppato un protocollo di comunicazione tecno-economico per le macchine in esecuzione su Ethereum e IPFS, che viene completato da una piattaforma IoT basata su cloud e Parachain Polkadot. Oggi abbiamo già una piattaforma ibrida per la creazione di applicazioni IoT futuristiche, che fornisce interazione coi dispositivi sotto il controllo di un computer decentralizzato globale. Prima di iniziare a creare applicazioni IoT sicure, senza server e futuristiche utilizzando la piattaforma Robonomics, immergiamoci un po' nella teoria...",
  "Chapter 1.": "Capitolo 1.",
  "At the intersection of cybernetics and economics": "All'intersezione fra cibernetica ed economia",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Abbiamo presentato un sistema economico dove i dispositivi robotici agiscono come degli agenti indipendenti in grado di svolgere attività economiche chiave, che prima erano riservate agli umani. In questo capitolo parliamo della rilevanza della robot economy, che in futuro può diventare una parte importante nella vita delle persone e cambiare l'attuale livello dell'economia in servizi completamente automatizzati.",
  "In this chapter you will learn": "In questo capitolo imparerete",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase e The Nature of the Firm",
  "CPS - cyber-physical system": "CPS - sistemi cyber-fisici",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener e la ricerca di pattern nella vita e nella macchina",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "La Quarta Rivoluzione Industriale, Denaro per i Robot e Bitcoin",
  "Ethereum Smart Contracts": "Smart Contract Ethereum",
  "Polkadot Parachains": "Parachain Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Domande aperte di teleologia e il lavoro di Mises",
  "Read chapter 1": "Leggi il capitolo 1",
  "Chapter 2.": "Capitolo 2.",
  "Robonomics architecture": "L'architettura di robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Nel secondo capitolo, leggerete sull'interazione uomo-macchina usando le moderne tecnologie Internet - dai dispositivi IoT a una rete di fornitori decentralizzata e accessibile a livello globale. Esamineremo le basi dell'Internet of Things per evidenziarne le problematiche e le sfide principali che i costruttori di sistemi IoT devono affrontare, arrivando poi alla soluzione a cui Robonomics sta puntando.",
  "Overview of the state of the Internet of Things (IoT)": "Panoramica sullo stato dell'Internet of Things (IoT)",
  "Classification of IoT devices": "Classificazione dei dispositivi IoT",
  "Embedded IoT systems": "Sistemi IoT embedded",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: Gateway e controller IoT",
  "Autonomous Systems": "Sistemi Autonomi",
  "Internet of Things providers": "Fornitori di Internet of Things",
  "Digital twins are the heart of the Internet of Things": "I digital twin sono il cuore dell'Internet of Things",
  "IoT data flows in cloud service": "Flussi di dati IoT nel servizio cloud",
  "Popular examples of IoT solutions": "Esempi popolari di soluzioni IoT",
  "Current problems of building IoT solutions": "Problemi attuali nella creazione di soluzioni IoT",
  "Main tasks of Robonomics architecture": "Principali compiti dell'architettura Robonomics",
  "Basic components of Robonomics architecture": "Componenti di base dell'architettura Robonomics",
  "A simple representation of Robonomics architecture": "Una semplice rappresentazione dell'architettura Robonomics",
  "Read chapter 2": "Leggi il capitolo 2",
  "We continue to update the white paper of Robonomics": "Il whitepaper di Robonomics è in continuo aggiornamento",
  "stay tuned for new parts on our website and in Discord": "restate sintonizzati sul nostro sito web e su Discord per le nuove parti",
  "Join our discord": "Unisciti al nostro discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Successivamente, vorremmo mostrarvi le aree pratiche dell'interazione uomo-macchina utilizzando le moderne tecnologie Internet. Passeremo dalla familiare architettura dei dispositivi IoT per lo scambio di informazioni tecniche attraverso i servizi cloud, all'organizzazione dell'interazione tecnico-economica attraverso una rete di fornitori decentralizzata e globalmente accessibile.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Per cominciare, occorre fare un'escursione nell'area che è chiaramente più correlata alla connessione in rete degli impianti automatizzati. Successivamente esamineremo le basi dell'Internet of Things, per evidenziarne i problemi e le sfide principali affrontate da chi crea sistemi IoT e verso la cui risoluzione si rivolge Robonomics.",
  "Overview of the state of the internet of things (IoT)": "Una panoramica sullo stato dell'internet of things (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "La questione sull'accessibilità alla rete dei dispositivi automatici, è stata discussa in tutto il pianeta dagli anni '60 e già a quel tempo sono stati fatti dei tentativi piuttosto seri per risolverlo. Ad esempio, il cibernetico sovietico Viktor Glushkov ha proposto e parzialmente implementato la raccolta automatica di informazioni sui volumi di produzione di un singolo impianto, come parte della progettazione del sistema informativo nazionale",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": ", negli anni ''60 e ''70. È noto che i distributori automatici di Coca-Cola fossero collegati ad ARPANET negli anni ''80, in modo che potessero segnalare la disponibilità di bevande e la loro temperatura.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "L''effettivo sviluppo dell''IoT sta avvenendo ora, grazie all''uso sempre più diffuso di tecnologie abilitanti. I principali fattori trainanti della rapida evoluzione delle applicazioni Internet of Things, sono i risultati dello sviluppo di molte aree: dalle comunicazioni wireless più ampia e i sistemi embedded, all''analisi dei cloud e all''apprendimento automatico. Il numero di dispositivi IoT è cresciuto costantemente negli ultimi 10 anni (con una previsione di 25 miliardi di unità entro il 2030) e questo ha spinto ricercatori e sviluppatori a creare nuove applicazioni IoT in vari settori come sanità, domotica, agroalimentare e protezione ambientale.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Noi siamo più interessati al processo di creazione di sistemi IoT e ai compiti  che sorgono in questo processo. Negli anni di ricerca sono state proposte molte architetture diverse e facendo una media, possiamo distinguere tre componenti fondamentali in un sistema IoT: dispositivi, infrastruttura di rete, macchine analitiche, di calcolo e di controllo.",
  "New challenges": "Nuove sfide",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Un'altra sfida recente per la creazione dell'IoT è stata il concetto di digital twin, una versione digitale di apparecchiature reali che ne copia le specifiche e i dati storici. Questo concetto dà il meglio di sé nelle aree in cui è necessario avere una specifica accurata e completa di un processo, ed essere in grado di prevederne lo sviluppo. L'Internet of things funge da principale integratore dei digital twin, ma questo compito è molto più profondo rispetto alla normale connettività dei dispositivi IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "In questo momento stiamo assistendo a un intero segmento della rete, pensato e conveniente non per le persone, ma per le macchine. L'Internet of Things non è più solo il meccanismo che connette un dispositivo alla rete, ma dei servizi creati e disponibili ad hoc per i dispositivi stessi. L'Internet of Things non solo connette l'utente e il dispositivo, ma aiuta anche i dispositivi a gestire le attività di fornitura di un servizio per la persona, in maniera autonoma.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Tali sistemi non hanno interfacce utente e sono generalmente utilizzati al livello più basso degli ecosistemi IoT per fornire funzionalità di base. Devono essere piccoli ed efficienti dal punto di vista energetico. Disporre di risorse informatiche e di comunicazione limitate. I gateway o i controller IoT fungono solitamente da ricevitori di segnale.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Questi sistemi fungono da collegamento tra i sistemi embedded accessibili localmente e l'Internet globale. Solitamente supportano più protocolli di comunicazione di sistemi embedded e trasferiscono la telemetria dai dispositivi al cloud e controllano i segnali all'indietro. Spesso questi dispositivi sono una versione più sofisticata del router WiFi, dotati di un computer a scheda singola per eseguire l'elaborazione primaria delle informazioni dai dispositivi senza uscire dalla rete locale.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Questa classe include automi complessi (come lo Spot della Boston Dynamics), che hanno una componente di controllo al livello di un computer completo con un processore ad alte prestazioni e una grande quantità di memoria. In questi casi, il robot è connesso a Internet senza altre soluzioni intermedie (sistemi edge). Il software necessario per accedere all'Internet of Things viene installato direttamente sul computer del sistema stand-alone. I dati vengono raccolti e parzialmente elaborati localmente, quindi trasmessi a Internet in modo simile a qualsiasi altro dispositivo di rete a tutti gli effetti.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Il compito principale dei provider IoT è fornire agli utenti l'accesso remoto a dati e analisi, nonché la gestione di dispositivi intelligenti su Internet. I criteri principali per misurare la qualità di un provider sono la sicurezza delle operazioni, la stabilità della connessione e la sua disponibilità da qualunque parte del mondo.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Lo schema standard per lavorare con un provider IoT è il seguente: installazione di software compatibile con il cloud smart device, impostazione di servizi di gestione lato cloud dopo la prima connessione riuscita con un dispositivo, connessione a vari tipi di servizi analitici.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Parlando di digital twin, va fatto notatre che a livello architettonico è richiesta la loro implementazione per non consentire all'utente di accedere direttamente ai dispositivi di controllo e modificarne lo stato. Tra le ragioni più ovvie del rifiuto, vi sono in primo luogo la presenza di requisiti e condizioni proprie nei dispositivi appena prima del lancio. In secondo luogo, se più dispositivi utente devono accedere a un'unica fonte di dati, fornire un controllo personalizzato a ciascun utente può essere critio. Infine, è estremamente utile mantenere disponibile l'ultimo stato effettivo del dispositivo, nel caso questo smettesse di operare. Di conseguenza, abbiamo una separazione fra il ciclo di scambio delle informazioni con l'utente e l'effettiva generazione di dati da parte dei sensori. Per illustrare questo principio, di seguito è riportato il processo di un utente che lavora con dispositivo IoT utilizzando un digital twin.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Di conseguenza, abbiamo una separazione fra il ciclo di scambio di informazioni con l'utente e l'effettiva generazione di dati da parte dei sensori. Per illustrare questo principio, di seguito è riportato il processo di un utente che lavora con un dispositivo IoT utilizzando il digital twin.",
  "IoT data flows in cloud services": "Flussi di dati IoT nei servizi cloud",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Valori di input per i cloud trigger. Ad esempio, il servizio cloud invia diverse notifiche all'utente in caso di segnalazione di un urto da parte di un sensore d'allarme per auto.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Output di dati per analisi complesse che non possono essere prodotte a livello edge. Ad esempio, durante l'elaborazione di video per il riconoscimento facciale in mezzo alla folla.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "La base per formare un digital twin del dispositivo al fine di creare un cast del suo stato. Ad esempio, su richiesta dell'utente nell'app mobile o sul sito web.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Un tipico sistema smart house offre un'ampia gamma di opzioni per il controllo del tuo spazio abitativo. Con il suo aiuto puoi controllare a distanza le serrature delle porte, impostando un accesso singolo o regolare alle stanze, per familiari e amici e per il personale addetto alla manutenzione o alle consegne. Con numerosi sensori e dispositivi di registrazione, il sistema è in grado di includere la registrazione video quando si attivano i sensori di movimento, prendere autonomamente decisioni per interrompere i flussi d'acqua quando viene rilevata una perdita nel sistema idrico, avviare un robot aspirapolvere programmato, fornendo un rapporto sulla pulizia nell'app utente, modificare la temperatura ambiente al valore ottimale in base alla propria programmazione.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Auto intelligenti. Fornendo all''elettronica di bordo dell''auto l''accesso a Internet mobile, l''utente ha accesso al controllo remoto di varie funzionalità dell''auto direttamente dal proprio smartphone: apertura delle porte, accensione del condizionatore, controllo dei fari. Se queste auto vengono utilizzate per il car sharing, è possibile creare una mappa interattiva della loro posizione indicandone lo stato, il carburante rimanente, e altro per i clienti del servizio.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Sistema di leasing per apparecchiature intelligenti. L'azienda installa manipolatori robotici sulla linea di trasporto, con un contratto a pagamento per il numero di operazioni o per il tempo del robot. I manipolatori forniscono regolarmente un registro delle operazioni eseguite, degli errori e degli avvisi. Sulla base di questi dati viene calcolato il canone di leasing, così come la manutenzione predittiva dei robot da parte del fornitore.",
  "Global availability": "Disponibilità globale",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "L'architettura client-server standard richiede la specifica degli endpoint durante il routing dei messaggi dai dispositivi IoT. Significa che durante la vita di uno smart device, la mancanza di connessione comporterà una limitazione nella capacità di controllare e interagire con il dispositivo.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Ad esempio, la guerra commerciale tra Cina e Stati Uniti è già una spada di Damocle che incombe su migliaia di consumatori di elettrodomestici intelligenti cinesi negli Stati Uniti e viceversa. In qualsiasi momento, il blocco dei server di Xiaomi da parte delle autorità statunitensi, potrebbe interessare gli utenti dei dispositivi che si connettono ai servizi cloud del produttore.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Trovandosi nelle immediate vicinanze di un dispositivo IoT, non è possibile controllarlo da un'app mobile se non è presente la connessione ai server, attraverso i quali viene fornita l'autenticazione dell'utente e raccolta la telemetria dai dispositivi stessi. In altre parole, il dispositivo è effettivamente controllato dal cloud e non dall'utente.",
  "Cybersecurity": "Cybersecurity",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Il motivo principale della scarsa sicurezza informatica nella maggior parte delle soluzioni IoT, deriva dall'eredità problematica dell'architettura client-server cloud. Ad esempio, l'architettura della smart house più comune in questo momento, è solitamente un hub IoT connesso a un servizio cloud. Pertanto, un classico sistema IoT è un elemento di controllo centrale esposto a molti attacchi esterni, come Dos attack (che portano il sistema al guasto), modifiche malevole, dirottamenti della sessione utente, ecc. Ma le forti minacce includono anche problemi non intenzionali come errori di progettazione, uso improprio o disastri naturali che possono causare il malfunzionamento dei server. Oltre a questo, un altro elemento da considerare è la necessità di fidarsi del cloud e delle persone che lo gestiscono.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "I server cloud service sono soggetti a tutti i tipici problemi di cybersecurity: i dispositivi appartenenti allo stesso sistema possono superare le centinaia o migliaia e allo stesso tempo, per loro natura, i dispositivi IoT hanno una potenza di calcolo inferiore, il che rende molto più difficile l''implementazione di firewall e antivirus. In tutto questo, il fattore più pericoloso è che i dispositivi IoT sono CPS funzionanti, quindi le minacce alla sicurezza informatica sono davvero pronte a manifestarsi a livello fisico.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Tutto ciò viene esasperato dalla portata delle soluzioni IoT, dalla quantità di sistemi. Il servizio cloud è sicuramente più sicuro rispetto ai dispositivi di basso livello, ma il consolidamento del controllo centralizzato su centinaia di migliaia di questi sistemi, rende qualsiasi violazione della sicurezza e perdita di dati un disastro enorme.",
  "Data privacy": "Privacy dei dati",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Il punto di privacy deve essere separato dalla sicurezza informatica, perché questo problema è specifico dei sistemi IoT. A causa della gran quantità e varietà di dispositivi, che sono molto più integrati nel mondo fisico rispetto ai soli computer e smartphone, la gamma di dati sensibili si moltiplica. Non si tratta più solo della posizione GPS, dei registri degli acquisti, delle transazioni finanziarie e delle foto, ma anche di una registrazione video permanente o di conversazioni, impronte vocali, condizioni di salute e persino un elenco delle abitudini di una persona. Tra i tipi di minacce legate alla privacy vi sono: identificazione delle informazioni, localizzazione e tracciamento, profilazione, inventory attack e data linking attack.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "La parte più inquietante è che gli utenti hanno poca o nessuna consapevolezza di rinunciare alla propria privacy perché non hanno quasi idea di quali dati vengono raccolti e di come vengono utilizzati. La minaccia alla privacy non proviene solo dagli intrusi, ma anche da organizzazioni e agenzie governative. I servizi cloud IoT richiedono in genere il massimo trasferimento di dati dai dispositivi e non ci sono modi per vietare o limitare questa raccolta ('Accetta i termini o vattene!'). Nonostante i dati raccolti siano un bene e abbiano un valore reale, alla persona da cui vengono collezionati non solo viene negato il diritto di disporne attivamente, ma non gli viene neanche concesso un compenso per la raccolta e l'utilizzo.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Basandosi sui risultati e sulle sfide delle piattaforme cloud, Robonomics mira a offrire al mercato IoT soluzioni Internet più sicure e avanzate in ogni fase della comunicazione uomo-macchina. Di seguito sono riportati i compiti principali a cui si rivolge Robonomics:",
  "Managing an IoT device using a decentralized cloud": "Gestione di un dispositivo iot mediante un cloud decentralizzato",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": " Le reti blockchain hanno la capacità di fornire il massimo grado di sicurezza nell'esecuzione di un dispositivo e ottenere la sua telemetria. L'interazione con il dispositivo può essere effettivamente descritta modificando lo stato del digital twin memorizzato nella blockchain e inviando informazioni su questi cambiamenti. Nel caso di una blockchain permissionless, possiamo parlare delle garanzie di disponibilità globale dei provider per l'IoT, nonché di un elevato livello di protezione dei dati del digital twin da modifiche indesiderate.",
  "Performing technical and economic transaction between people and machines": "Effettuare transazioni tecniche ed economiche tra persone e macchine",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Grazie al meccanismo delle criptovalute e degli smart contract, possiamo fornire l'accesso ai sistemi automatizzati direttamente ai mercati digitali. Ad esempio, Ethereum implementa già la maggior parte degli strumenti di base dell'attività economica, che possono essere utilizzati nel funzionamento di dispositivi autonomi. Le applicazioni create per l'interazione fra l'utente finale e il dispositivo IoT, saranno molto più efficaci se i suoi termini di servizio e di pagamento sono inseparabili dai parametri di avvio.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "I moderni progressi delle tecnologie Web3 possono risolvere il problema della privacy degli utenti. Con il Web3 non è necessario autenticarsi o richiedere la connessione a server specifici per accedere alla telemetria e controllare il dispositivo.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics è un cloud decentralizzato per i digital twin dei dispositivi IoT. Robonomics supporta il formato tecnico-economico per la comunicazione, oltre a fornire applicazioni private per gli utenti",
  "A human interface to access the system": "Un'interfaccia umana per accedere al sistema",
  "A communication protocol": "Un protocollo di comunicazione",
  "A machine interface": "Un'interfaccia macchina",
  "Human interface": "Interfaccia umana",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Proponemos el uso de aplicaciones descentralizadas (dapps) como la principal forma de conectar a los usuarios para controlar dispositivos inteligentes a través de Internet. Por lo tanto, podremos proporcionar la interfaz de usuario más segura (en términos de datos) para el sistema, que podrá funcionar simultáneamente en las condiciones de la red local de la ciudad y a través de una red global común.",
  "Communication protocol": "Protocollo di comunicazione",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Il suo ruolo è svolto dalla rete Robonomics, una specifica sviluppata dal project team che implementa una rete decentralizzata di provider che forniscono la trasmissione, l''elaborazione e l''archiviazione delle informazioni necessarie a far funzionare i dispositivi IoT. Si tratta infatti dell''implementazione di una funzione specifica node per reti IPFS, Ethereum e Polkadot.",
  "Machine interface": "Interfaccia macchina",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Di seguito è riportato un diagramma generale del ciclo completo di avvio del dispositivo utilizzando la piattaforma Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "L'applicazione decentralizzata dell'utente invia una richiesta per una funzione di controllo del dispositivo attraverso la rete Robonomics.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "Il Robonomics network fornisce la traduzione delle richieste utilizzando libP2P e cattura gli eventi nella blockchain di Ethereum o nella parachain di Robonomics.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Il controllo del dispositivo è fornito da una rete decentralizzata, che è garantita per memorizzare le informazioni necessarie a far funzionare il dispositivo IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "Il dispositivo IoT riceve in modo indipendente le informazioni da Ethereum e Polkadot sullo stato attuale del digital twin. Questo garantisce che il dispositivo possa essere avviato in sicurezza, solo dopo che sono stati stabiliti i parametri tecnici ed economici di avvio.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "A seguito dell'operazione, il dispositivo IoT pubblica un registro delle operazioni completate, che può essere utilizzato come prova del servizio fornito o per il debug degli errori.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Il log si trasforma in un report per l'utente e diventa disponibile sulla sua dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Costruire Dapp e Servizi Web per IoT sulla Parachain di Robonomics",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, architetto del software",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Ricordiamoci che una macchina automatica è l'esatto equivalente economico del lavoratore schiavo. Qualsiasi lavoratore che compete con uno schiavo deve accettare le conseguenze economiche del lavoratore schiavo.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "cibernetico",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "I robot sono come i bambini cresciuti, oggi possono già gestire denaro, entrare in rapporti legali, essere indipendenti.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Il futuro della stessa umanità dipenderà da come insegneremo ai robot a gestire le loro capacità.",
  "Robonomics tools": "Strumenti Robonomics",
  "Operate with digital twins of IoT devices": "Operare coi digital twins dei dispositivi iot",
  "The first tools of the robot economy: money for robots, contracts for robots": "I primi strumenti della robot economy: denaro e contratti per I robo",
  "Software for connecting devices to a decentralized cloud": "Software per connettere I dispositivi a dei cloud decentralizzati",
  "API library for custom IoT applications": "Libreria api per applicazioni iot personalizzate",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics contiene un set completo di strumenti per lo sviluppo di applicazioni IoT, sia dal punto di vista della robotica che dell'interfaccia utente. La comunicazione fra l'utente e il dispositivo, avviene utilizzando le principali tecnologie del Web3: IPFS, Ethereum e Polkadot. Pertanto, gli sviluppatori possono creare applicazioni moderne e sicure per Smart Cities e Industria 4.0.",
  "Robonomics Connectivity": "Connettività Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Per comodità degli sviluppatori, Robonomics contiene un set di software per la connettività: dispositivi IoT che utilizzano il protocollo HTTP/MQTT e sistemi robotici complessi che utilizzano il Robot Operating System (ROS).",
  "Connect a sensor": "Connettere un sensore",
  "to the Robonomics network": "alla rete di Robonomics",
  "Try": "Prova",
  "a simple prototyping tool": "un semplice strumento di prototipazione",
  "Start building your own cyber physical system with": "Inizia a costruire il tuo sistema cyber fisico con",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics supporta centinaia di robot out of the box",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Gli utenti della piattaforma possono collegare i robot compatibili con ROS all''economia digitale in pochi minuti. Per un elenco completo dei robot supportati, seguite il link",
  "Decentralized Cloud infrastructure for IoT": "Infrastruttura cloud decentralizzata per iot",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) è il servizio infrastrutturale di base per la robotica e l'IoT sulla parachain di Robonomics e IPFS.",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Dapp Robonomics",
  "economy of robots": "Economia dei robot",
  "Core RWS features available for IoT today": "Le funzionalità principali di rws disponibili oggi per iot",
  "RWS PubSub Message Broker": "Broker di messaggi pubsub RWS",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Usa una messaggistica illimitata su rete P2P basata sul protocollo IPFS",
  "RWS Data Blockchainization Service": "Servizio di rws data blockchainization",
  "RWS Robot Actions": "Azioni dei robot rws",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Accensione/spegnimento; avvia o arresta i tuoi dispositivi IoT sotto il controllo di un computer decentralizzato",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Nell'architettura tecnica, i digital twin IoT forniscono la visibilità e il monitoraggio delle cose e degli eventi correlati (ad esempio, utilizzando i dispositivi IoT per acquisire automaticamente l'origine di un prodotto) e la blockchain consente l'unica versione condivisa della verità sullo stato di queste cose, attraverso i loro cicli di vita e gli eventi aziendali associati",
  "from Gartner research": "dalla ricerca di Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "La Parachain di Robonomics offre l'opportunità di creare un modello di digital twin e aggiornarne lo stato ogni 6 secondi.",
  "Secure": "Sicuro",
  "Serverless": "Serverless",
  "Futuristic": "Futuristico",
  "IoT applications": "Applicazioni IoT",
  "Robonomics network vision": "La visione di Robonomics Network",
  "At the frontier of cybernetics and economics": "Alla frontiera fra la cibernetica e l'economia",
  "Build your IoT services on Robonomics platform": "Costruisci I tuoi servizi iot sulla piattaforma robonomica",
  "taking full advantage of decentralized architecture": "sfruttando appieno l'architettura decentralizzata",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics consente agli utenti di connettersi agli smart device utilizzandoapplicazioni decentralizzate (dapp), che non richiedono il trasferimento dei datiutente per l'autenticazione. La comunicazione avviene tramite una rete decentralizzatadi provider senza un punto di errore singolo e il dispositivo ottiene, in modoindipendente, informazioni dalla rete blockchain per l'esecuzione o la trasmissionedei dati in remoto. Pertanto, Robonomics fornisce un elevato livello di sicurezzainformatica del dispositivo e di privacy sui dati degli utenti in tutte le fasidella comunicazione, dall'applicazione utente al lancio dello smart device.",
  "From smart contracts to cross chain IoT platform": "Dagli smart contract alla piattaforma iot cross chain",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Il progetto Robonomics ha più di 6 anni. Abbiamo iniziato a prepararci per ilprimo esperimento che dimostra la comunicazione uomo-macchina nel 2015, utilizzandouna rete di provider decentralizzati e indipendenti, dai primi giorni della reteEthereum. All'inizio del 2021, il team del progetto è riuscito a creare un protocollodi comunicazione macchina tecno-economico, eseguito su Ethereum e IPFS. Completandolocon elementi di una piattaforma IoT basata su cloud, costruita su una parachainPolkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Come risultato, oggi disponiamo già di una piattaforma ibrida per la creazionedi applicazioni IoT futuristiche, che consentono l'interazione con i dispositivisotto il controllo di un computer decentralizzato globale.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "I creatori di Robonomics sono sperimentatori, ingegneri e scienziati, chesi preoccupano di capire la validità scientifica dell''approccio e avere chiarezzanel presentare i principi che dovrebbero costituire le basi dell''intera architetturadella soluzione software.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "Nei nostri articoli pubblicati fra il 2017 e il 2020, abbiamo presentato allacomunità scientifica molti concetti e soluzioni uniti intorno all'idea di roboteconomy, un sistema economico dove i dispositivi robotici agiscono come agentiindipendenti, in grado di svolgere attività economiche chiave precedentementeriservate all'umano. Potete leggere gli articoli scientifici a",
  "this link": "questo link",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Vorremmo giustificare l'emergere della robot economy e spiegare, in terminigenerici, perché riteniamo che questo concetto sia la risposta inevitabile e ovviaal funzionamento di sistemi robotici su larga scala nella nuova rivoluzione industriale.",
  "Move towards the factory of the future": "Muoversi verso l'industria del futuro",
  "Inspired by Ronald Coase": "Ispirato da Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Il premio Nobel per l'economia Ronald Coase, nel suo lavoro del 1937 'The Natureof the Firm', ha dimostrato al meglio la dicotomia <<gerarchia vs libero mercato>>e ha spiegato le ragioni dell'esistenza di organizzazioni come le imprese. Coasediscute l'impatto dei costi di transazione (il costo di raccolta ed elaborazionedelle informazioni), per prendere decisioni in merito alla conclusione di un contrattoe per monitorarne l'attuazione. L'azienda, con tutta la sua struttura gerarchicaextra-mercato, si configura come il metofo più efficiente per fornire il prodottotarget al consumatore, con i costi di transazione più bassi al momento, quandolo sforzo transazionale per creare lo stesso prodotto, attraverso più scambi dimercato tra individui, diventa molto più alto.Per visualizzare al meglio questoprocesso, guarda l'esempio illustrativo dell'acquisto di un'auto. Provate ad acquistareun'auto per componenti, poi calcolate quanto tempo e denaro impieghereste perassemblarla nel vostro garage. I rischi e la negoziazione dei prezzi d'acquistodei componenti, sono troppo elevati rispetto a una Model X standard di Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Tuttavia, questo non porta all''emergere di un''unica azienda al mondo cheproduca tutto. Gli stessi costi di transazione impongono anche delle restrizionialle dimensioni stesse delle imprese. Coase scrive:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...un''azienda tenderà ad espandersi fino a quando, i costi per l''organizzazionedi una transazione extra all''interno dell''impresa, non diventeranno uguali aicosti per eseguire la stessa transazione tramite uno scambio sul mercato aperto...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "In altre parole, più complessa è la gerarchia in un'impresa, maggiori sarannoi suoi costi interni, che a un certo punto risulteranno eccessivi rispetto alcosto di tornare al mercato. Per garantire che la crescita sia come un motore,gli imprenditori sono alla ricerca di metodi per ridurre questi costi",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "L'idea di ridurre i costi di transazione, attraverso la capacità di tutti ipartecipanti al processo aziendale (produzione, logistica, consumo) di unirsia un livello più stretto, è",
  "clearly correlates": "chiaramente correlata",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "ai problemi e alle sfide affrontate dai produttori di soluzioni automatizzate.Negli ultimi 50 anni, le operazioni standard per la maggior parte dei processiaziendali delle grandi imprese, sono state quasi completamente automatizzate.I produttori hanno il compito di creare una comunicazione sicura fra le partitotalmente automatizzate della catena di approvvigionamento, e questo fattoreimpedisce un'ulteriore riduzione dei costi di transazione attraverso l'automazione.Il desiderio di commercializzare prodotti o servizi più competitivi rispetto alleaziende parzialmente automatizzate,",
  "firms spurs the search for solutions to": "stimola la ricerca di soluzioni",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "a queste sfide. Sembra che ci stiamo dirigendo verso l'emergere delle robofirm-imprese nelle quali l'intero ciclo dei processi aziendali è completamente automatizzatoe non richiede la partecipazione umana, se non come beneficiari e consumatori.",
  "Get rid of transaction costs": "Elimina I costi di transazione",
  "Our future in smart cities": "Il nostro futuro nelle smart cities",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Il compito che i produttori di automazione devono affrontare oggi ha un nome specifico: la costruzione di sistemi cyber-fisici (abbreviati in CPS). Per",
  "definition,": "CPS",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "si intende una forte unificazione e integrazione reciproca, di molteplici processi computazionali, di networking e fisici.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "La creazione dei CPS è centrale per ogni idea descritta nella nuova (quarta)rivoluzione industriale. Pertanto, i CPS sono la pietra angolare della nostrafutura vita nelle Smart Cities e si manifestano ovunque. Alcuni esempi di sistemicyber-fisici del futuro sono: un pilota automatico Uber, i selfie coi droni ouna rete di stampanti 3D nelle stazioni della metropolitana",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "Un CPS è una struttura complessa di molti elementi connessi: dall''app sultelefono, si estende al controllo del drone in volo sulla città, per poi procederealla pubblicazione delle foto su Instagram, ma solo dopo un''elaborazione tramiteAI cloud.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "La cosa più importante nel processo di progettazione di un CPS, è trovare ungiusto equilibrio nel numero di elementi automatizzati all'interno della catenache fornisce il servizio all'utente. In altre parole, dov'è il limite nelle dimensionidel CPS? Per rispondere a questa domanda, dovremmo rivolgerci al famoso matematicoNorbert Wiener.",
  "Self-regulating systems": "Sistemi di autoregolazione",
  "Inspired by Norbert Wiener": "Ispirato da Norbert Wiener",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener parla della fattibilità dell'approccio scientifico interdisciplinare.Ad esempio, ha tracciato dei parallelismi fra i sistemi di controllo automatizzatie le sfide sul ridimensionamento e sull'aumento della complessità della societàumana.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "In altre parole, l'approccio cibernetico può essere applicato in egual misuraalla psicoterapia, alla biologia e alla navigazione automatizzata. Si basa sullafunzione del sistema, su come vengono controllate le singole azioni e su comei singoli nodi interagiscono fra loro.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Tenendo conto delle pubblicazioni di Ronald Coase e Norbert Wiener e seguendolo sviluppo dell'Industria 4.0, possiamo considerare l'utilizzo di un CPS comeun agente economico, durante la progettazione di servizi robotizzati. Per regolarele dimensioni del CPS e adattarci alle mutevoli esigenze degli individui, possiamoutilizzare i meccanismi del mercato.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Le Robofirm sono una rappresentazione ideale dei sistemi cyber-fisici. Sonounità abbastanza autonome, in grado di fornire servizi sia agli esseri umani chead altri robot in cambio di denaro. Pensiamo che l'economia robotica sia un insiemegenerale di CPS, che forniscono servizi e beni direttamente al mercato stesso.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Denaro per I robot",
  "Industry 1.0": "Industria 1.0",
  "Mechanization:": "Meccanizzazione:",
  "replacement of muscle power with steam energy.": "sostituzione della forza muscolare con energia a vapore.",
  "1784 y.": "1784 ",
  "Industry 2.0": "Industria 2.0",
  "Electrification:": "Elettrificazione:",
  "introduction of assembly-line production.": "introduzione della produzione su catena di montaggio.",
  "1870 y.": "1870",
  "Industry 3.0": "Industria 3.0",
  "Automation:": "Automazione:",
  "introduction of automated systems with CNC.": "introduzione di sistemi automatizzati con CNC.",
  "1969 y.": "1969",
  "Industry 4.0": "Industria 4.0",
  "Smart production:": "Produzione intelligente:",
  "development of cyber physical systems.": "sviluppo di sistemi cyber-fisici.",
  "Now": "Adesso",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "Nel mondo delle robofirm, risulta naturale fornire ai robot l'accesso a tutte quelle istituzioni sociali, che in passato erano utili solo agli esseri umani.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Le istituzioni sociali non appaiono perché siamo persone e fisiologicamenteuna persona non può vivere senza banche, contratti e altri strumenti della società.Ma solo perché una persona, ad un certo punto è entrata in un percorso di relazionisociali più complesse e ha fatto un passo importante verso l'accelerazione deiprocessi di ciò che ci circonda.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Denaro e contratti dovrebbero diventare disponibili per i robot, non perchéquesta sia la fantasia malata di alcuni fanatici dei robot che si sono dimenticatidi Skynet. Ma solo perché la nuova rivoluzione industriale si pone il compitodi costruire delle complesse catene automatizzate, i cui processi influenzerannolo scambio sia delle informazioni tecniche, che di quelle economiche e procederannoa una velocità inaccessibile all'uomo.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "I robot hanno bisogno di denaro, che sarà direttamente a loro disposizione perpoter eseguire operazioni in autonomia, alla velocità cui solo le macchine possonoprendere decisioni. E tutto questo unicamente per le persone che si vogliono goderela vita nella Smart City!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "E qui arriviamo direttamente al denaro elettronico: Bitcoin. Il fatto che Bitcoinpossa essere immagazzinato su un account, non secondo il principio di una banca,ma secondo quello dei contanti in un portafogli, lo rende la prima forma di denaroche un robot può gestire autonomamente. Allo stesso tempo, oggi possiamo già affermareche Bitcoin non è solo denaro elettronico, ma un vero e proprio istituto finanziarioglobale.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Di conseguenza: un evento non inventato da noi, ma che chiaramente rientranella nostra visione, fa di Bitcoin il primo denaro per i robot, o guardandoloancor più in profondità, è proprio quell''istituto sociale che contribuirà allaformazione delle robofirm.",
  "Smart contracts": "Smart contracts",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin è diventato il primo denaro disponibile per i robot. Nel frattempo però,non possiamo parlarne nella sua forma attuale come strumento di scambio tecnicoed economico a tutti gli effetti.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Ora abbiamo già gli smart contract, i mercati DeFi e un''infrastruttura decentralizzataper lo scambio di messaggi tra robot, che aprono alla possibilità per la razzaumana di creare una parte dell''economia completamente automatizzata: la roboteconomy.",
  "One of the great opportunity to build the economy of robots is": "'Una delle grandi opportunità per creare la robot economy, è la tecnologia di",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Con le sue funzionalità, i robot sono in grado non solo di scambiare denaro, ma di stipulare contratti fra loro e gli esseri umani.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Ma qual è lo scopo della comunicazione basata su contratto da macchina a macchina(m2m)? È un'ottima domanda! Torniamo ai CPS. Quando si parla di comunicazionidirette tra sensori, apparecchiature della macchina o qualsiasi altro elemento,si tratta sempre di collaborazione all'interno di un sistema regolamentato. Mase vogliamo che i servizi delle smart city siano attivi (o anche smart home inalcuni casi), dobbiamo stabilire una comunicazione con vari elementi di terzeparti.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Immaginiamo un servizio di consegna coi droni. Se un drone, ad esempio, è diproprietà di DHL, come può accedere ai magazzini di Amazon o accedere all'interospazio aereo della città? Sarà un monopolio? Questa è una grande sfida per molteiniziative della quarta rivoluzione industriale!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "La maggior parte delle aziende afferma di aver bisogno di diritti quasi completisull'ambiente circostante, perché non sa come impostare in modo sicuro lo scambiodi informazioni tecniche tra sistemi automatizzati al di fuori della propria strutturaaziendale interna. Allo stesso tempo, se osserviamo i processi in cui una personalavora, vediamo che la cooperazione di diverse società è stata lunga ed è esistitacon successo. Puoi facilmente ordinare la consegna porta a porta della merce acquistatasul sito di Amazon, e il corriere sarà in grado di guidare un'auto lungo le stradecittadine, ricevere un ordine al magazzino e portartelo.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Qual è la differenza? Nel primo caso non c'è modo per creare un rapporto contrattualefra macchine, mentre nel mondo delle persone i rapporti contrattuali esistonogià.",
  "Parachains": "Parachain di",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "La principale difficoltà che Robonomics deve affrontare oggi, è il costo elevatoper il lancio di un dispositivo IoT utilizzando la rete Ethereum. Bisogna infattipagare una commissione su ogni transazione, che in termini di dollari USA ha uncosto tra i $10 e i $100. Questo lo rende costoso per buona parte dei casi dell'economiareale, che si tratti di un viaggio in car-sharing, dell'affitto di una smart house,della consegna coi droni o della stampa 3D del tuo anime preferito su ordinazione.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Per correttezza, vorremmo far notare che esistono scenari redditizi anche con i costi di transazione della rete Ethereum tra 2018 - 2019. Come transazioni automatizzate di compensazione perle emissioni di CO2 o il trasferimento di un ordine dal sito web direttamente alla produzione. Tuttavia, per l'applicazione di massa delle tecnologie Web3 nel campo dell'IoT, è necessaria una riduzione del prezzo che il cloud addebita dal dispositivo connesso",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Alla ricerca di un'opportunità per ridurre i costi di interazione coi dispositiviIoT, gli sviluppatori di Robonomics hanno studiato sviluppi alternativi a Ethereum.La nostra scelta si è basata sull'architettura di",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": ", che ci avrebbe consentito di eseguire la nostra blockchain all''interno diuna rete comune, in cui la sicurezza è garantita da validatori indipendenti dalnostro progetto.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Reti Blockchain Eterogenee",
  "Homogeneous Shard Network": "Reti Shard Omogenee",
  "On-chain protocol control": "Protocollo di controllo on-chain",
  "Protection against the tyranny of the crowd": "Protezione contro la tirannia della folla",
  "Auction of bandwidth in the common network": "Asta di banda sulla rete comune",
  "Payment for gas by users": "Pagamento del gas da parte degli utenti",
  "Have you read this?": "Hai letto questi?",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Io, Robot",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "Antologia del Bicentenario",
  "Neuromancer": "Neuromante",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Domande aperte di teleologia",
  "and a treatise by L. von Mises": "e un trattato di L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "In conclusione, vorremmo porre domande che rimangono aperte da un punto di vista globale. Qual è l'obiettivo dei robot?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "La prasseologia ci ispira idee interessanti sul comportamento umano senza dipendenzadiretta dagli scopi. Questo ci dà l'opportunità di lavorare sui processi dell'economiadei robot in modo condizionale, come con una scatola nera, senza approfondiregli obiettivi finali. Allo stesso tempo, la teleologia pone una sfida per spiegarele cause.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Ci auguriamo che da qualche parte, nell'incrocio dei lavori di Mises e Wiener,si possa trovare un punto per un ulteriore sviluppo dell'economia robotica, nonsolo come protocollo di interazione fra persone e macchine di natura prasseologica,ma tenendo conto dell'aspetto teleologico nella creazione di elementi per la comunicazioneinterspecie.",
  "or": "o il",
  "Github": "Github",
  "Important news &amp; announcements": "Notizie importanti e annunci",
  "All posts": "Tutti i post",
  "R&D cases": "Casi di R&S",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Collaborazione con un promotore immobiliare a Cipro per monitorare la distribuzione giornaliera, il consumo e compensare eventuali eccessi di impronta di carbonio.",
  "This page is out of your space": "Questa pagina è fuori dal tuo spazio",
  "Check url once more or create an": "Controlla l'URL ancora una volta o crea un",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "segnalandoci che hai ricevuto un errore 404 (non dimenticare di menzionare l'URL corrente)",
  "Embedded iot systems": "Sistemi IoT incorporati",
  "Autonomous systems": "Sistemi autonomi",
  "Digital twins are the heart of the internet of things": "I gemelli digitali sono il cuore dell'internet delle cose",
  "\"Main tasks of robonomics architecture": "Principali compiti dell'architettura Robonomics",
  "No posts yet": "Ancora nessun post",
  "If you want to help us with translation": "Se vuoi aiutarci con la traduzione",
  "contact us at": "contattaci a",
  "send": "invia",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics è una piattaforma IoT al 100% open-source, sicura, economica e futuristica per la connessione di robot sotto il controllo di Polkadot ed Ethereum. Chiunque può creare servizi con Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Di seguito è riportato un elenco delle nostre applicazioni comprovate delle moderne tecnologie robotiche.",
  "By interest:": "Per interesse:",
  "Sort by progress:": "Ordina per progresso:",
  "Any progress": "Qualsiasi progresso",
  "Complete": "Completo",
  "Proceeding": "In corso",
  "Sort by time:": "Ordina per tempo:",
  "Recent": "Recente",
  "Earliest": "Più vecchio",
  "Show more": "Mostra altro",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Inserisci dati in IPFS e archivia gli hash in una Blockchain pubblica",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Cuore della tua applicazione IoT - Digital Twin su Blockchain",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Qui abbiamo raccolto una collezione di NFT coniati durante il nostro lungo viaggio nel mondo delle criptovalute, sia in modo indipendente che con grandi team. Questi token unici offrono la proprietà verificabile sulla blockchain e sono fantastici per abbellire il tuo account blockchain. Puoi fare offerte per alcuni di essi all'asta o persino coniare il tuo pezzo unico.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Durante la nostra campagna iniziale di crowdloan su Kusama, abbiamo preso la decisione di premiare i contributori dei nostri pionieri della criptovaluta non solo con token, ma anche con un colorato NFT. Questa carta ha un grande significato per noi e se qualcuno la possiede, sappiamo che è un fantastico sostenitore dei valori di Robonomics: libertà e decentralizzazione.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Siamo entusiasti di presentare la nostra serie speciale di asset digitali - Robonomics Crypto Girls, create dal team Robonomics Art&Science. Ogni NFT di questa collezione è una rappresentazione grafica unica della tecnologia utilizzata in Robonomics o costruita su Robonomics. I nostri talentuosi artisti hanno disegnato a mano ogni ragazza nello stile caratteristico di Robonomics. Puoi scegliere quella che ti risuona di più o collezionare l'intera serie! Acquistando questi NFT, non solo aggiungi un elegante aggiunta alla tua collezione, ma ci supporti anche nel continuare a innovare e implementare la connettività decentralizzata per i robot. Resta sintonizzato per nuovi aggiornamenti alla collezione!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. COLLEZIONI NFT SPOT STAGIONALI",
  "On demand minting": "Coniatura su richiesta",
  "SEASONAL SPOT NFT COLLECTIONS": "COLLEZIONI NFT SPOT STAGIONALI",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Queste collezioni stagionali di NFT rappresentano un asset digitale unico nel suo genere che cattura l'interazione unica tra l'utente e Spot all'interno della parachain di Robonomics. Gli utenti possono disegnare qualsiasi cosa sul browser e il robot replicherà i loro movimenti per creare un'immagine disegnata a mano. Una volta completata l'interazione, l'NFT viene coniato sul mercato Singular per l'account Polkadot dell'utente. Ora chiunque può interagire con un robot reale situato in un laboratorio in California per creare asset digitali personalizzati e unici che possono essere posseduti, acquistati e venduti come qualsiasi altro asset digitale.",
  "Create your NFT": "Crea il tuo NFT",
  "4. automated telescope collection": "4. collezione di telescopi automatizzati",
  "automated telescope collection": "collezione di telescopi automatizzati",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Situate nel deserto di Atacama, in Cile, un telescopio fisico può essere accessibile tramite un'app decentralizzata per catturare immagini in tempo reale di oggetti astronomici nello spazio profondo. Ogni utente con una connessione internet può accedervi con token $STRGZN, disponibili per l'acquisto nell'app tramite carta di credito. Seleziona un oggetto astronomico, invia un comando al telescopio per scattare una foto e attendi l'NFT coniato sulla piattaforma Singular. Si prega di notare che l'app è disponibile solo per l'uso dalle 23:00 alle 6:00 GMT-3 a causa degli orari di funzionamento del telescopio.",
  "Try yourself": "Provalo tu stesso",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "In collaborazione con Polkapets",
  "and": "e",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Come orgoglioso membro dell'ecosistema Polkadot, Robonomics ha partecipato a Polka Pets World. Insieme al team di Polka Pets, abbiamo coniato 1200 NFT con un concetto di design unico che mostra la nostra idea principale di connettività. Per dare vita a questa idea, abbiamo creato una personalità: un androide specializzato nell'aiutare gli umani a connettersi con qualsiasi entità robotica.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "Nel 2021, Robonomics ha iniziato l'impegno a supportare l'aggiunta dei pallet RMRK nel loro runtime, il che avrebbe comportato un'integrazione nativa con la logica NFT più avanzata al mondo. Per celebrare questo traguardo notevole, abbiamo lanciato un oggetto speciale compatibile con Kanaria: un NFT per bambini che può essere equipaggiato sul Kanaria bird di qualcuno e può fornire vantaggi nel metaverso di RMRK.",
  "RMRK Partnerships": "Partnership RMRK",
  "This page has moved to a": "Questa pagina è stata spostata su un",
  "Automatic redirecting": "Reindirizzamento automatico",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "Nel 1948 un professore di matematica al MIT, Norbert Wiener, pubblicò una delle opere più seminali \"Cybernetics: Or Control and Communication in the Animal and the Machine\". Utilizzò per la prima volta il termine \"cybernetics\" come meccanismi di autoregolazione e, quindi, questa pubblicazione è considerata una riconosciuta festa della Cibernetica.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "I grandi libri portano a grandi idee. Se cerchi ulteriori ispirazioni sulla comunicazione uomo-macchina, prova a leggere libri di fantascienza. Segna i libri che hai già letto e vedi cosa altro possiamo offrirti per ulteriori riflessioni.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "In effetti, l'economia delle persone è spesso associata alla coscienziosità nell'eseguire compiti all'interno del contratto, al desiderio delle parti di raggiungere un risultato, al comportamento opportunistico e altruistico dell'individuo nella società. Tutti questi principi sono difficili da applicare all'economia dei robot. Quali sono i motivi dell'economia dei robot? È una domanda aperta che dobbiamo studiare e discutere nella società per una migliore comprensione e applicazione dei robot.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Per iniziare suggeriamo di guardare il lavoro di Mises \"Human Action: A Treatise on Economics\" (approccio prasselogico) e il primo articolo di Norbert Wiener \"Behavior, Purpose and Teleology\" (visione teleologica).",
  "Establishing democracy with smart contracts": "Stabilire la democrazia con i contratti intelligenti",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Immaginiamo un piccolo ufficio con un team di 10-15 persone. Mentre tutti sono concentrati sulle loro scadenze per i compiti professionali principali, sembra che nessuno si preoccupi della manutenzione dello spazio dell'ufficio. La soluzione più comune per evitare di sprofondare nel caos è assumere individui esterni per il supporto. Un altro approccio è prendere l'iniziativa e imporre sanzioni a coloro che creano disordine o consumano le forniture senza rimpiazzarle. Tuttavia, è etico vivere sotto la tirannia nel nostro futuro mondo cripto-anarchico, in cui ci si aspetta che tutti siano responsabili e godano della libertà? Cerchiamo di creare una società più democratica utilizzando contratti intelligenti e la nuova generazione di tecnologie Internet (spesso indicate come Web3). Abbiamo bisogno di strumenti che ci aiutino a prendere decisioni insieme e poi assicurino che funzionino correttamente senza che gli esseri umani debbano essere direttamente coinvolti.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Chi ha bevuto tutto il caffè?!' o la tragedia dei beni comuni",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "C'è un concetto ampiamente discusso in economia, ecologia e altre scienze noto come 'tragedia dei beni comuni'. Questo si riferisce a uno scenario in cui gli individui che hanno accesso a una risorsa condivisa privilegiano i propri interessi, esaurendo alla fine la risorsa. Il caffè assomiglia molto a una tale risorsa, poiché si deteriora a causa del consumo incontrollato in ufficio. Tuttavia, allo stesso tempo, di solito nessun membro del team è incline a investire tempo e denaro per ottenere un pacchetto aggiuntivo di chicchi di caffè. Quindi, continuano a bere caffè senza ottenere nuove forniture.",
  "How to formulate the task in numbers.": "Come formulare il compito in numeri.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Assumendo un budget mensile per il caffè di $100, che è approssimativamente equivalente a 150 tazze per il nostro team di 10 persone, ciò lascia a ciascuna persona 1 tazza ogni 2 giorni. Ora, approfondiamo i dettagli tecnici. La domanda è: come possiamo dare vita a una macchina del caffè autonoma in ufficio?",
  "Step 1: automated coffee bean ordering": "Passo 1: ordinazione automatica di chicchi di caffè",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Abbiamo fatto un accordo con il barista, Nikita, che si trova vicino all'ufficio. Ci fornirà i chicchi di caffè dopo aver ricevuto un avviso dal bot. Il bot invia un messaggio quando il caffè sta per finire, specificando la quantità di caffè (in chilogrammi) necessaria per l'ordine e l'importo di pagamento corrispondente determinato dal team. Con questi dettagli, Nikita può selezionare il caffè secondo le sue preferenze.",
  "Step 2: automatic access to smart office.": "Passo 2: accesso automatico all'ufficio intelligente.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Contemporaneamente all'ordine, la macchina del caffè genera un codice QR. Nikita presenta poi questo codice QR alla telecamera per l'accesso all'ufficio.",
  "Step 3: distribution of coffee tokens to the team.": "Passo 3: distribuzione di gettoni di caffè al team.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Una volta che la telecamera locale scansiona il codice QR, il sistema di gestione intelligente della casa avvia un pagamento a Nikita e distribuisce nuovi gettoni di caffè tra i membri del team.",
  "Step 4: drink coffee!": "Passo 4: bere caffè!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Per ricevere una tazza di caffè fresca, un membro del team deve inviare un gettone di caffè all'indirizzo della macchina del caffè.",
  "Coffee beans delivery process:": "Processo di consegna dei chicchi di caffè:",
  "Unlock new possibilities with this concept": "Sblocca nuove possibilità con questo concetto",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Inoltre, una tale macchina del caffè automatizzata introduce varie dimensioni economiche e sociali. Diamo un'occhiata a queste:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "I programmatori possono depositare gettoni di caffè extra quando il consumo scende al di sotto del limite. Ciò crea un sistema trasparente per l'uso vario del caffè entro il limite.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "La macchina del caffè potrebbe mantenere un conto condiviso, consentendo ai membri dell'ufficio di contribuire fondi dai loro account personali per un'esperienza di caffè di qualità superiore la prossima volta.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Il team decide collettivamente la quantità di caffè che la macchina ordinerà ogni volta attraverso un voto DAO. Ciò offre libertà per affrontare la sfida con risorse limitate.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "I processi programmabili riducono l'influenza dei fattori umani e offrono anche una maggiore flessibilità nel personalizzare le impostazioni per team specifici.",
  "How we smarten up our coffee machine in real life": "Come rendiamo più intelligente la nostra macchina del caffè nella vita reale",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Per ottenere un controllo pratico della macchina del caffè, abbiamo integrato un computer a scheda singola, in particolare il Raspberry Pi 4, insieme a una macchina del caffè facilmente reperibile sul mercato che supportava la connessione GPIO. La nostra preferenza è stata il",
  "selected for its affordability and the convenience of its easily removable front panel.": "selezionato per la sua convenienza e la facilità di rimozione del pannello frontale.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Successivamente, abbiamo elaborato i dettagli operativi, in particolare riguardo ai token che gli utenti potevano inviare e all'algoritmo sottostante. Ecco il risultato:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Per gustare una tazza di delizioso caffè, gli utenti devono inviare una certa quantità di fondi (nel nostro caso, 1 token ACT di Statemine, id=3077) all'indirizzo della macchina del caffè da una parachain (Statemine). Successivamente, inizia il processo di versamento del caffè e successivamente viene pubblicato un registro delle azioni su",
  "via the Datalog function": "tramite la funzione Datalog",
  "When the concept extends beyond the office": "Quando il concetto si estende oltre l'ufficio",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Questo concetto offre numerose possibilità per espandere l'idea. È stato implementato con successo presso il Polkadot Web3 Hub durante il Forum Economico Mondiale del 2022 a Davos. I partecipanti hanno potuto effettuare ordini di caffè e specificare il tipo di caffè desiderato (ad esempio, espresso, americano, cappuccino) inviando una certa quantità di token. Condividiamo foto e video di questo evento:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "La nostra macchina del caffè blockchain che fa il caffè presso il Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "Fai da te o come costruire la tua macchina del caffè blockchain intelligente",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Puoi trovare un tutorial dettagliato e specifiche tecniche nel repository GitHub open-source. Tieni presente che puoi utilizzare qualsiasi macchina del caffè preferisci e quasi qualsiasi token a tua scelta per realizzare questo progetto nel tuo spazio.",
  "In a nutshell": "In poche parole",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Oggi è sempre più evidente che il consumo di energia è un importante contributore alle emissioni di carbonio, rendendo sempre più importante trovare modi per ridurre il nostro impatto ambientale. Gli uffici e gli edifici commerciali svolgono un ruolo significativo in questo consumo di energia. Gli ingegneri di Robonomics hanno installato un sistema nell'ufficio di BBF, una società immobiliare con sede a Cipro, per monitorare e raccogliere misurazioni dell'elettricità. Questo sistema fornisce anche un modo pratico per compensare l'impronta di carbonio.",
  "1. Monitoring surplus energy generation": "1. Monitoraggio della generazione di energia in eccesso",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "Nell'edificio dell'ufficio dell'azienda BBF sono state installate diverse pannelli solari e integrate nel sistema Solarweb, consentendo una facile raccolta di analisi. Il sistema fornisce dati sul consumo complessivo di elettricità dell'edificio e sull'elettricità generata dai pannelli solari. Tuttavia, una funzionalità cruciale mancante è la capacità di compensare l'impronta di carbonio derivante dall'elettricità consumata oltre quanto generato dai pannelli solari.",
  "2. Converting excess energy power to CO2 offset": "2. Conversione dell'energia in eccesso in compensazione CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Avere dati sul consumo totale di elettricità e sulla produzione di energia dei pannelli solari consente un calcolo semplice dell'impronta di carbonio. Si assume che l'elettricità dai pannelli solari abbia un'impronta di carbonio pari a 0, il che significa che è necessaria una compensazione solo per l'elettricità in eccesso consumata oltre quanto generato dai pannelli solari.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "È importante notare che le emissioni di CO2 differiscono da paese a paese. A Cipro, l'inquinamento medio è di 587 g/kWh, secondo Hannah Ritchie, Max Roser e Pablo Rosado (2022) - \"Energia\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Per compensare l'impronta di carbonio vengono utilizzati crediti di carbonio, con ogni credito che rappresenta 1 tonnellata di CO2. Questi crediti svolgono un ruolo vitale nel compensare l'impatto ambientale causato dal consumo di elettricità oltre il contributo dei pannelli solari.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Pertanto, armati di dati sul consumo di energia, sulla produzione di pannelli solari e sul coefficiente di Cipro, diventa facile determinare il numero di token necessari per compensare l'impronta di carbonio.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Per raggiungere questo obiettivo, abbiamo incorporato un Raspberry Pi, configurato Home Assistant per raccogliere dati analitici e sviluppato un'integrazione per compensare l'impronta. La dashboard energetica di Home Assistant mostra i seguenti dettagli:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Inoltre, la nostra integrazione migliora il sistema offrendo un comodo pannello di controllo per visualizzare le statistiche e attivare la compensazione:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Di seguito è riportato un esempio illustrativo di come avviene la compensazione dell'impronta di carbonio attraverso la nostra integrazione. Al termine con successo, la",
  "transaction": "transazione",
  "unfolds as follows:": "si svolge come segue:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Ridurre il consumo di energia in ufficio è altrettanto importante quanto compensare le emissioni di carbonio. Possiamo raggiungere questo obiettivo apportando piccoli cambiamenti come l'utilizzo di illuminazione e apparecchiature a basso consumo energetico e mantenendo gli elettrodomestici dell'ufficio in buone condizioni.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Il consumo di energia è una grande parte della nostra impronta di carbonio e le aziende devono fare la loro parte per essere più ecologiche. Avere un sistema che monitora il consumo di energia e aiuta a compensare le emissioni di carbonio può ridurre notevolmente l'impatto di un edificio per uffici sull'ambiente. Adottando l'approccio giusto, le aziende possono contribuire a un futuro più verde.",
  "The way forward": "La strada da seguire",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Strategia per trasformare la macchina del caffè in un dispositivo robotico autonomo",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "On the Way to Sovereign Home Automation": "Sulla strada per l'automazione domestica sovrana",
  "World Economic Forum Annual Meeting 2022": "World Economic Forum Annual Meeting 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Diventare una Parachain per le applicazioni IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (sponsorizzato da Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (ospitato da Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transizione verso la multinetwork - Ecco arrivare Polkadot",
  "The Rise of Robonomics Network": "L'ascesa della rete Robonomics",
  "Crypto Valley Conference 2018": "Conferenza Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Workshop del Parlamento europeo 'L'economia dei robot'",
  "Consensus 2018 conference": "Conferenza Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simposio su Blockchain per sistemi robotici presso il MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Scuola estiva Robonomics-2018 ospitata da Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Integrazione Fronius Solar.web con Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Uno dei nostri obiettivi nello sviluppo di questo caso è trasformare Robonomics in un middleware ROS 2. Ciò ci permetterà di utilizzare Robonomics su Substrate per creare un'applicazione che può eseguire ROS 2 direttamente dal browser!",
  "Eisenkoch, the robot chef": "Eisenkoch, lo chef robot",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Caso reale per il robot dotato di due ferri per waffle e cottura di 6 waffle contemporaneamente in 5-7 minuti.",
  "Blockchain-powered smart coffee machine": "Macchina del caffè intelligente alimentata da blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics coffee - è una macchina del caffè intelligente integrata in Robonomics Network. Questo progetto mira a mostrare il potenziale di Robonomics nella sfera IoT attraverso un esempio concreto.",
  "Water environmental inspector": "Ispettore ambientale dell'acqua",
  "Air monitoring network": "Rete di monitoraggio dell'aria",
  "Production quality control platform “Feecc”": "Piattaforma di controllo della qualità della produzione 'Feecc'",
  "Backup and archiving service for robotics companies": "Servizio di backup e archiviazione per aziende robotiche",
  "Public lab with Boston Dynamics Spot": "Laboratorio pubblico con Boston Dynamics Spot",
  "Autonomous telescope service": "Servizio di telescopio autonomo",
  "Smart home secure remote control and backup service": "Controllo remoto sicuro e servizio di backup per la casa intelligente",
  "Blockchain as quality control system for chemistry": "Blockchain come sistema di controllo della qualità per la chimica",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Riduzione effettiva delle emissioni di CO2 con certificati provati da blockchain",
  "Robot-artist Gaka-Chu": "Robot-artista Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Demo 'Ottieni il meteo del monte Fuji'",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "L'idea principale che gli autori di Robonomics hanno cercato di trasmettere in precedenza è l'evoluzione naturale, logica e apparentemente inevitabile dal livello attuale dell'economia verso servizi completamente automatizzati. I servizi automatizzati dovranno avere sia la capacità di parlare il linguaggio dell'economia umana che l'economia delle macchine per eseguire varie operazioni nel mondo circostante a una velocità non disponibile per gli esseri umani.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Lo sviluppo e l'applicazione dell'Internet delle cose hanno dimostrato che risolvere i problemi tipici non è sufficiente. Sono emersi concetti e principi completamente nuovi, basati su errori precedenti e carenze identificate, fino ad oggi. Questo approccio certamente conveniente nell'uso dei servizi cloud si è rivelato avere una serie di gravi carenze legate alla scalabilità, alla privacy e alla sicurezza. Nello sforzo di risolvere questi problemi, è stato proposto di avvicinare l'elaborazione dei dati, la logica e il calcolo al luogo immediato in cui vengono utilizzati. Così sono emersi i concetti di fog e edge computing, con sistemi intermedi tra il cloud e i dispositivi che assumono alcune delle funzioni del cloud. Pertanto, la creazione di sistemi edge è diventata una delle nuove sfide nella costruzione dell'Internet delle cose.",
  "the Robonomics Parachain portal": "il portale Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Gestione dell'offset delle emissioni di carbonio verificate dalla blockchain",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Le collaborazioni con progetti affini sono continuate. Robonomics e DAO IPCI hanno introdotto un servizio per la raccolta e l'analisi dei dati sensoriali -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "E cosa è così scientificamente interessante, prendendo come base l'idea delle restrizioni imposte dal mercato sulla dimensione dell'azienda, possiamo dire che il limite dell'aumento del CPS sarà sempre determinato dal mercato e non è richiesto nient'altro per questo.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Uno degli esempi dei nostri esperimenti: negoziare lo spazio stradale e i pagamenti per il diritto di passaggio per veicoli autonomi al fine di ridurre la congestione. Quello che una persona non farebbe assolutamente nel traffico, l'auto lo farà per te senza difficoltà: vuoi cambiare corsia, la tua auto e l'auto del tuo vicino scambiano offerte sul costo di tale operazione a una velocità di centinaia di messaggi al secondo, riveleranno un prezzo di equilibrio e così ti trovi già nella corsia successiva più veloce. Questo significa che ora sarà possibile 'caricare' il tuo viaggio con uber e renderlo più veloce.",
  "Robonomics White Paper": "Robonomics White Paper",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Qui puoi trovare e scaricare (completamente gratuito, ovviamente) il primo white paper di Robonomics, presentato nel maggio 2018. Nonostante molte cose siano cambiate da allora, i fondamenti di Robonomics sono ancora delineati in questo documento.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Un robot artista autonomo e autonomo",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Localizzazione e tracciamento cooperativo senza gradiente dei confini ambientali in movimento da parte di team di robot non olistici",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robot come servizio: dalle tecnologie cloud alle tecnologie di peering",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Monitoraggio ambientale affidabile mediante reti di sensori su imbarcazioni marine autonome e tecnologia dei registri distribuiti",
  "Digital Passport for Unmanned Vehicles": "Passaporto digitale per veicoli senza pilota",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics come piattaforma basata su blockchain per la gestione del traffico senza pilota di veicoli mobili",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Verso sistemi robotici multi-agente basati su blockchain: analisi, classificazione e applicazioni",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Servizi robotici per nuove città intelligenti basate su tecnologie decentralizzate",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protocollo per l'organizzazione di una rete di agenti autonomi decentralizzati nelle fabbriche utilizzando meccanismi di mercato",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Verso Robonomics basato su blockchain: convalida del comportamento degli agenti autonomi",
  "Transforming Climate Finance and Green Investment with Blockchains": "Trasformazione del finanziamento climatico e degli investimenti verdi con le blockchain",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: piattaforma per l'integrazione di sistemi cibernetici fisici nell'economia umana",
  "Blockchain based protocol for economical communication in industry 4.0": "Protocollo basato su blockchain per la comunicazione economica nell'industria 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics basato su blockchain come principio di creazione di fabbriche intelligenti",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Ecosistema blockchain per mercati del carbonio, attività ambientali, diritti e responsabilità: progettazione concettuale e implementazione",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Protocollo basato su blockchain di attività commerciali autonome per sistemi multi-agente composti da UAV",
  "English": "Inglese",
  "Russian": "Russo",
  "Chinese": "Cinese",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics è una piattaforma open-source che facilita sia servizi IoT semplici che robotica complessa, consentendo una comunicazione efficace tra agenti, che siano umani o robotici. Per integrare i robot in questo sistema, utilizziamo ROS. In questo articolo, vogliamo fornire una panoramica del nostro processo di integrazione di Robonomics in ROS 2.",
  "Why ROS 2 in Robonomics?": "Perché ROS 2 in Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, il sistema operativo per robot, è uno dei più antichi framework open-source per la robotica. È una collezione di librerie software e strumenti per far funzionare i robot. Ha tutto, dalle basi alle funzionalità avanzate e viene fornito con strumenti utili per i programmatori. È ampiamente utilizzato dalle università di tutto il mondo per l'insegnamento e la ricerca nella robotica, quindi è ben consolidato, funziona con molti tipi di robot e ha una grande comunità di sviluppatori.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Dal momento che ROS è stato avviato nel 2007, sono avvenuti cambiamenti significativi nel campo della robotica e all'interno della comunità ROS. In risposta a questi sviluppi, è stato introdotto ROS 2 con l'obiettivo di adattarsi a questi cambiamenti. Si basa sui punti di forza di ROS 1 affrontando le sue limitazioni. Abbiamo utilizzato ROS in Robonomics fin dall'inizio e ora è il momento di migrare a ROS 2.",
  "You might find this interesting": "Potresti trovare interessante questo",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Ci sono numerosi robot open-source e piattaforme robotiche complesse che supportano ROS. Ciò significa che puoi creare un impressionante sistema multi-robot per raggiungere i tuoi obiettivi specifici. Per",
  "the most current list of supported robots": "la lista più aggiornata dei robot supportati",
  "please visit the ROS website.": "visita il sito web di ROS.",
  "Research papers": "Articoli di ricerca",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Senza la ricerca accademica, lo sviluppo di sistemi complessi che possono essere integrati nella nostra vita quotidiana potrebbe perdere il suo scopo o addirittura comportare rischi. Dobbiamo riflettere attentamente sulla nostra direzione, sugli obiettivi e sulle possibili conseguenze. Le sfere in cui opera Robonomics, specificamente la robotica, le relazioni economiche e le tecnologie Web3, meritano di essere studiate individualmente, esplorando come possono essere integrate tra loro e valutando il loro impatto potenziale sulle nostre vite.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Vediamo come ROS viene utilizzato all'interno del framework Robonomics rappresentando l'intero sistema con Robonomics che agisce come diversi strati:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "Nel livello 'Interfaccia macchina', richiediamo strumenti per collegare in modo fluido i robot al software. ROS 2 fornisce un robusto set di strumenti per sviluppatori perfettamente adatti a questo compito.",
  "Robonomics packages for ROS and ROS 2": "Pacchetti Robonomics per ROS e ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "La creazione di un sistema multi-robotico spesso comporta la sfida di collegare dispositivi di vari fornitori, o addirittura dispositivi all'interno di un singolo fornitore, ognuno utilizzando protocolli diversi. Che si tratti di una configurazione per una casa intelligente o di una produzione automatizzata, la comunicazione efficace tra le macchine è cruciale. ROS (e, naturalmente, ROS 2) offre vari modi per affrontare questo problema. E se potessi personalizzare le attività mentre ROS gestisce la comunicazione tra i nodi?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Il team di Robonomics ha creato vari pacchetti per ROS per rendere i robot più intelligenti e gestire compiti specifici secondo necessità. Per vedere i compiti che abbiamo realizzato con ROS, visita la nostra pagina dei casi di R&S. Quasi ogni interazione con un robot si basa su ROS. Puoi trovare i nostri pacchetti Robonomics open-source per ROS su GitHub, ed ecco alcuni di essi:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Lo stack di comunicazione Robonomics contiene un insieme di pacchetti ROS per scopi di comunicazione economica.",
  "Robonomics' contribution in the ROS 2 community": "Il contributo di Robonomics nella comunità ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics combina la robotica con le tecnologie Web3 e miriamo a crescere in queste aree. Dall'introduzione di ROS 2, abbiamo identificato tre principali sfide che coinvolgono il supporto alla comunità ROS 2 e il miglioramento delle capacità di Robonomics:",
  "Creating ROS 2 tools for Rust:": "Creazione di strumenti ROS 2 per Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Questi strumenti permettono agli sviluppatori di scrivere applicazioni ROS 2 utilizzando Rust. Per scoprire di più su perché abbiamo scelto Rust e l'importanza di questo progetto per noi, puoi trovare",
  "additional details": "ulteriori dettagli",
  "Developing Robonomics Middleware for ROS 2:": "Sviluppo di Robonomics Middleware per ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Questo svolge un ruolo importante nell'assicurare un'integrazione senza soluzione di continuità di Robonomics in vari sistemi di robot multi-agente utilizzando ROS 2. Può facilitare l'integrazione dei robot nelle tecnologie blockchain Web 3 riducendo anche gli errori durante il processo di integrazione, risparmiando così tempo e costi.",
  "Creating a robotics lab with ROS 2:": "Creazione di un laboratorio di robotica con ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Man mano che ROS 2 guadagna popolarità nella comunità della robotica, siamo desiderosi di vedere più robot e hardware che lavorano con ROS 2. Il nostro obiettivo è collegarli all'ecosistema Web3 utilizzando Robonomics.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Questo caso è attualmente in corso; non perderti le notizie - iscriviti per gli aggiornamenti nella casella qui sotto",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "La 'Robonomics Coffee' è una macchina per il caffè intelligente integrata nella rete Robonomics. Questo progetto mira a illustrare il potenziale di Robonomics nella sfera dell'IoT attraverso un esempio concreto.",
  "logos and assets": "loghi e risorse",
  "Download the Robonomics logos here. We've got two options for your": "Scarica qui i loghi di Robonomics. Abbiamo due opzioni per le tue",
  "basic needs": "necessità di base",
  "and one designed for": "e una progettata per",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "token. Inoltre, scopri la palette di colori",
  "color palette": "ottimale",
  "for the distinguished Robonomics brand": "per il distintivo marchio Robonomics",
  "Robonomics logos": "Loghi di Robonomics",
  "Download all": "Scarica tutti i",
  "XRT logos": "loghi XRT",
  "Recommended color palette": "Palette di colori consigliata",
  "RWS logos": "Loghi RWS",
  "You are currently opted out. Click here to opt in.": "Attualmente hai scelto di non partecipare. Clicca qui per partecipare.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out completato; le tue visite a questo sito web non verranno registrate dallo strumento di analisi web. Tieni presente che se cancelli i tuoi cookie, elimini il cookie di opt-out o se cambi computer o browser web, dovrai eseguire nuovamente la procedura di opt-out.",
  "Please click below to opt in:": "Clicca qui sotto per partecipare:",
  "You are currently opted in. Click here to opt out.": "Attualmente hai scelto di partecipare. Clicca qui per non partecipare.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Puoi scegliere di non avere un numero di identificazione unico del cookie di analisi web assegnato al tuo computer per evitare l'aggregazione e l'analisi dei dati raccolti su questo sito web.",
  "To make that choice, please click below to receive an opt-out cookie": "Per fare questa scelta, clicca qui sotto per ricevere un cookie di opt-out",
  "Privacy Policy": "Informativa sulla privacy",
  "Robonomics Middleware Framework for ROS 2": "Robonomics Middleware Framework per ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Unire le tecnologie Web3 e i framework robotici",
  "Playing with Human-Machine Interaction through Ethereum": "Giocare con l'interazione uomo-macchina attraverso Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Queste informazioni di studio sono scadute. Per lezioni e workshop aggiornati visita la nostra",
  "academy": "accademia",
  "Home assistant themes": "Temi di Home Assistant",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Personalizza il tuo Home Assistant con i nostri temi gratuiti da utilizzare. Segui le istruzioni per l'installazione su",
  "Do you want": "Vuoi",
  "to dive even deeper?": "approfondire ulteriormente?",
  "Our": "Il nostro",
  "White Paper": "Libro bianco",
  "Science": "Scienza",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Pensiamo che leggere libri possa davvero aprire la mente. Che si tratti di idee semplici ma intelligenti o più complesse, i libri sono il modo migliore per far assorbire tutto al tuo cervello. Puoi prendere i nostri libri gratuitamente e dare un'occhiata alla nostra lista di letture consigliate per immergerti nel mondo emozionante della robotica!",
  "Download books about Robonomics": "Scarica libri su Robonomics",
  "Open your mind [list of recommendations]": "Apri la tua mente [elenco di raccomandazioni]",
  "Robonomics R&D": "Robonomics R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Economia dei robot",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Prendi il tuo merch con arte unica di Robonomics dipinta dalle nostre splendide ragazze. Abbiamo creato negozi sui più grandi mercati online per artisti, controlla e trova t-shirt, maglie a maniche lunghe, felpe, tende da doccia, cuscini, coperte e altre cose utili.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Abbiamo scelto il framework di robotica più noto chiamato Robot Operating System (ROS) come interfaccia standard per integrare qualsiasi sistema cibernetico-fisico compatibile. Robonomics supporta diversi utilizzi per ROS. L'implementazione di Robonomics per la rete Ethereum è sotto forma del pacchetto ROS robonomics_comm. Per l'architettura ROS 2, implementiamo il supporto per Robonomics come strato middleware (vedi «Robonomics come middleware ROS 2» per i dettagli). Quando l'uso di ROS è ridondante (ad esempio, quando si lavora con dispositivi IoT), è stato sviluppato un modulo di interfaccia Python robonomics-interface. Aiuta ad accedere alle funzioni di Robonomics in modo nativo e funziona sia con nodi locali e privati che con nodi remoti e pubblici.",
  "read our almanac": "leggi il nostro almanacco",
  "Begin your adventure in the world of cyberpunks": "Inizia la tua avventura nel mondo dei cyberpunks",
  "Pure open source": "Puro open source",
  "Local and Global Availability": "Disponibilità locale e globale",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Utilizzando open source, P2P e Web3, non c'è spazio per trucchi aziendali, garantendo la protezione dei tuoi dati personali. Tutte le informazioni sono memorizzate localmente o crittografate con la tua chiave personale nel cloud Web3.",
  "Interested in how the team reached this stage?": "Interessato a come il team ha raggiunto questa fase?",
  "The Robonomics Timeline": "La timeline di Robonomics",
  "can guide you through our journey": "può guidarti attraverso il nostro viaggio",
  "Device Design and Development": "Progettazione e sviluppo del dispositivo",
  "Smart devices": "Dispositivi intelligenti",
  "Wearable merch": "Merchandising indossabile",
  "Academy": "Accademia",
  "Wiki": "Wiki",
  "Science & White paper": "Scienza e white paper",
  "Tokenomics": "Tokenomics",
  "Cases": "Casi",
  "Brand assets": "Risorse del marchio",
  "Wallpapers": "Sfondi",
  "NFT": "NFT",
  "Blog": "Blog",
  "Contacts": "Contatti",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Incontra dispositivi intelligenti e hardware futuristici da un team autonomo con ampia esperienza in robotica, blockchain e IoT",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "Il trattamento dei dati è sempre una questione delicata. Ecco perché offriamo un modulo di connettività completamente open-source",
  "connectivity module": "che ti dà la libertà di scegliere quali server utilizzare per il trattamento. Niente cloud chiusi, niente codice opaco.",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Robonomics ha stabilito tre hub di Connessione per garantire una connessione stabile. Questa opzione è attivata per impostazione predefinita sulla stazione.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Puoi lanciare il tuo hub per ricevere dati dalla Stazione Civile Altruista e per ulteriori elaborazioni.",
  "Steps to set up your Connectivity": "Passaggi per configurare la tua Connessione",
  "Deploy Connectivity": "Implementa la Connessione",
  "Technical requirements:": "Requisiti tecnici:",
  "2 CPU cores;": "2 core CPU;",
  "4 GB RAM;": "4 GB di RAM;",
  "40 GB storage;": "40 GB di spazio di archiviazione;",
  "Static IP": "IP statico",
  "Than set up": "Quindi configurare",
  "and follow": "e seguire",
  "the instructions": "le istruzioni",
  "Connect a station to your connectivity": "Collega una stazione alla tua connettività",
  "Open your sensor settings by its IP.": "Apri le impostazioni del sensore tramite il suo IP.",
  "Go to APIs settings": "Vai alle impostazioni delle API",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Seleziona la casella di controllo per inviare i dati a un'API personalizzata e compila i campi corrispondenti (IP del server, porte, ecc.).",
  "Join with your setup to global map (optional)": "Unisciti alla tua configurazione alla mappa globale (opzionale)",
  "If you want to publish data to": "Se desideri pubblicare dati sulla",
  "the global map": "mappa globale",
  "you need to make two pull requests:": "devi effettuare due richieste di pull:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Aggiungi l'ID IPFS della tua connettività all'elenco degli agenti della mappa del sensore:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Aggiungi l'indirizzo della paracatena della tua connettività all'elenco degli agenti del server di archiviazione a lungo termine:",
  "Steps for launching your own map": "Passaggi per lanciare la tua mappa personale",
  "Deploy web interface": "Implementa l'interfaccia web",
  "Fork the map repository:": "Fai il fork del repository della mappa:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Modifica le impostazioni per personalizzare la tua mappa, inclusi il dominio, il provider, il punto di vista iniziale e il tuo ID IPFS di connettività per l'elenco degli agenti.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Implementa la tua versione dell'interfaccia web e inizia a ricevere dati in tempo reale dal tuo sensore.",
  "Full guide here:": "Guida completa qui:",
  "Launch long-term storage": "Avvia archiviazione a lungo termine",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Semplicemente raccogliere dati dai sensori non è sufficiente; è necessario elaborarli. Ottimizza un server per la raccolta dei dati del sensore basato sul software open-source node.js",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "e ottieni il tuo server funzionante per l'archiviazione a lungo termine dei dati della mappa.",
  "Static IP.": "Indirizzo IP statico.",
  "Steps for launching a storage:": "Passaggi per avviare un archivio:",
  "Fork the RoSeMAN repository:": "Fai il fork del repository RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Scegli la versione Docker o Node.js (richiesta la base di dati MongoDB).",
  "Add a parachain address of your Connectivity to agents list.": "Aggiungi un indirizzo di parachain della tua connettività all'elenco degli agenti.",
  "Run the project.": "Esegui il progetto.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "Il primo server per una casa intelligente costruito interamente su open-source - dalla CPU al cloud decentralizzato.",
  "Processor:": "Processore:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 con CPU RISC-V a 4 core, cache L2 da 2 MB, fino a 1,5 GHz, supporto ISA RV64GC",
  "GPU:": "GPU:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, fino a 600 MHz",
  "Memory:": "Memoria:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 GB LPDDR4 SDRAM, fino a 2800 Mbps",
  "Storage:": "Archiviazione:",
  "32 GB TF card (minimum)": "Scheda TF da 32 GB (minimo)",
  "Interfaces:": "Interfacce:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2 porte Ethernet Gigabit, 4 porte USB 3.0 Tipo-A, header GPIO a 40 pin, connettore M.2, presa eMMC, header ventola a 2 pin",
  "Power:": "Alimentazione:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5V DC tramite USB-C, fino a 30 W (minimo 3 A) o ingresso 5V tramite GPIO a 40 pin",
  "OS:": "OS:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Installazione di Home Assistant Core",
  "Robonomics Integration Installation": "Installazione dell'Integrazione di Robonomics",
  "Zigbee Devices in Zigbee2MQTT": "Dispositivi Zigbee in Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Aggiungi dominio RoSeMAN al provider remoto della mappa.",
  "All hardware": "Tutto l'hardware",
  "Use it": "Usalo",
  "Learn": "Impara",
  "Explore website": "Esplora il sito web",
  "Timeline since 2015": "Cronologia dal 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "Il team sta acquisendo nuove competenze nella progettazione e programmazione di dispositivi intelligenti fin dall'inizio.",
  "sensors.social": "sensori.social",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "È stato creato un network, dove operano i dispositivi di test sviluppati dagli ingegneri di Robonomics. È stata sviluppata anche una linea di dispositivi smart home basati su Tasmota Wi-Fi e, dal 2024, questa linea sta subendo la certificazione per il mercato dell'UE. Nell'autunno del 2024, il team del progetto presenterà una linea di dispositivi open-source alimentati dalle tecnologie Web3, con il nome \"Hardware for Cryptopunks\".",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Robonomics continua a crescere all'interno dell'ecosistema Polkadot. La parachain della rete Kusama è attiva da oltre due anni e, a partire dall'autunno del 2024, verrà lanciata una parachain anche sulla rete Polkadot. Sono state registrate più di 5 milioni di transazioni dai dispositivi degli utenti sulla rete. Il team sta continuando a esplorare le possibilità di integrare le loro implementazioni sia su Ethereum che su Polkadot.",
  "Robo Smart Devices:": "Dispositivi Smart Robo:",
  "Read books": "Leggere libri",
  "Robonomics merch": "Merchandise Robonomics",
  "Desktop": "Desktop",
  "Smartphone": "Smartphone",
  "our robo art wallpapers": "i nostri sfondi robo art",
  "Space monkey devcon 2024 special": "Space monkey devcon 2024 speciale",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Scarica questa immagine sul tuo dispositivo e unisciti alla nostra speciale ricerca Devcon 2024 in emozionanti località intorno a Bangkok!",
  "Free Wallpapers for you from our artists": "Sfondi gratuiti per te dai nostri artisti",
  "Hide your folder with secret wallpaper": "Nascondi la tua cartella con uno sfondo segreto",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "Abbiamo creato sfondi segreti solo per te! Scarica lo sfondo e le icone della cartella e le tue cartelle si fonderanno perfettamente nel tuo schermo Home, lasciando visibile solo bellissime opere d'arte.",
  "Desktop background": "Sfondo desktop",
  "Mac OS icons": "Icone Mac OS",
  "Windows icons": "Icone Windows",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "Outdoor sensor “Altruist“": "Sensore esterno “Altruist“",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Dispositivo non invasivo per l'installazione nei quadri elettrici con montaggio su guida DIN. Basato sul chip Espressif ESP32C6 con architettura RISC-V aperta.",
  "Sign up for updates": "Iscriviti per gli aggiornamenti",
  "Hardware for cyberpunks": "Hardware per cyber punk",
  "Tech Blog & Updates": "Blog tecnologico e aggiornamenti",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Condividi e accedi ai dati su rumore, polvere e temperatura provenienti da altri sensori indipendenti nelle vicinanze. Dimentica i server aziendali: questi dati vengono distribuiti in modo sicuro in tutto il mondo attraverso la tecnologia innovativa Web3.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Sperimenta il potere del vero DePIN (Decentralized Physical Infrastructure Network) — un movimento tecnologico rivoluzionario portato alla vita e prosperante da anni sul nostro",
  "decentralized sensor map": "mappa decentralizzata dei sensori",
  "3 ways to use it": "3 modi per usarlo",
  "Check open-source sensor firmware on GitHub": "Controlla il firmware open-source del sensore su GitHub",
  "Operate your own Data Server": "Gestisci il tuo server dati",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "dandoti la libertà di scegliere quali server utilizzare per l'elaborazione. Nuvole proprietarie, codice nascosto.",
  "Keep in mind, you can join the": "Ricorda, puoi unirti alla",
  "global decentralized sensor map": "mappa globale dei sensori decentralizzati",
  "even with a sensor connected through your own server!": "anche con un sensore collegato attraverso il tuo server!",
  "Run your own Interactive Map": "Gestisci la tua mappa interattiva",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Ti piace l'idea di una mappa decentralizzata ma vuoi personalizzarla con layout aggiuntivi e diventare amministratore di una nuova infrastruttura di sensori sovrana? Puoi distribuire",
  "your own version by forking": "la tua versione facendo il fork",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "del nostro codice open-source su GitHub (assicurati di controllare il tipo di licenza). Ricorda di utilizzare in modo responsabile le risorse open-source.",
  "Device Specifications": "Specifiche del dispositivo",
  "Input Voltage:": "Tensione di ingresso:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Hz",
  "Wireless protocol:": "Protocollo wireless:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Supporta Wi-Fi 6 a 2,4 GHz (802.11 b/g/n) e Bluetooth 5 (LE), Zigbee con antenna integrata",
  "Equipped with a high-performance": "Dotato di un processore RISC-V",
  "32-bit RISC-V processor": "a 32 bit ad alte prestazioni",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "con velocità di clock fino a 160 MHz, e un processore RISC-V a basso consumo energetico a 32 bit con velocità di clock fino a 20 MHz",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320KB ROM, 512KB di HP SRAM, 16KB LP SRAM e 4MB di memoria Flash",
  "USB-C": "USB-C",
  "for firmware development and updates": "per lo sviluppo e gli aggiornamenti del firmware",
  "PM sensor:": "Sensore PM:",
  "SDS011 laser PM2.5/PM10 sensor": "Sensore laser SDS011 PM2.5/PM10",
  "Supported sensors:": "Sensori supportati:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X, BME280, HTU21D; Sensore livello di rumore: I2S INMP441; Contatore Geiger: Radsens.",
  "Help & support": "Aiuto e supporto",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "Con la mappa decentralizzata di Robonomics puoi utilizzare la Connessione Robonomics o creare il tuo Servizio di Connessione.",
  "Your own Connectivity": "La tua Connessione",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Un assistente domestico intelligente di cui ti prenderai cura, anche quando sei lontano. Solo per sviluppatori.",
  "Robonomics open-source hardware": "Hardware open-source di Robonomics",
  "Open-source hardware": "Hardware open-source",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Sperimenta il potere del vero DePIN (Decentralized Physical Infrastructure Network) — un movimento tecnologico rivoluzionario portato alla vita e prosperante con Robonomics",
  "Home server with Web3 cloud": "Server domestico con cloud Web3",
  "Home server on RISC V": "Server domestico su RISC V",
  "Supports": "Supporta",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "Wi-Fi 6 da 2,4 GHz (802.11 b/g/n) e Bluetooth 5 (LE), con antenna integrata",
  "Built in": "Costruito in",
  "Onboard": "A bordo",
  "1.47inch LCD display, 172x320 resolution, 262K color": "Display LCD da 1,47 pollici, risoluzione 172x320, 262K colori",
  "Adapting": "Adattamento",
  "integrates": "integra",
  "full-speed USB-С port": "porta USB-С a piena velocità",
  "Onboard TF card slot": "Slot per scheda TF a bordo",
  "for external TF card storage of pictures or files": "per archiviazione esterna su scheda TF di immagini o file",
  "Supports accurate control": "Supporta il controllo accurato",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "come orologio flessibile e modalità di alimentazione multiple per realizzare un basso consumo energetico in diversi scenari",
  "Built-in RGB LED": "LED RGB integrato",
  "with clear acrylic sandwich panel for cool lighting effect": "con pannello sandwich in acrilico trasparente per un effetto luminoso interessante",
  "Battery Level Gauge": "Indicatore di livello della batteria",
  "Low-Power I2C Temperature sensor": "Sensore di temperatura I2C a basso consumo",
  "RV-3032-C7 Real-Time Clock Module": "Modulo di orologio in tempo reale RV-3032-C7",
  "Battery 180mA": "Batteria 180 mA",
  "Measuring Range:": "Protocollo wireless:",
  "0.1-80A": "IEEE 802.11b/g/n (Wi-Fi a 2,4 GHz)",
  "Wireless Protocol:": "CPU:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "ESP32-S3 MCU basato su sistema su chip (SoC) dual-core microprocessore (Xtensa 32-bit LX7), fino a 240 MHz",
  "CPU:": "448 KB ROM, 520 KB SRAM, 8 MB FLASH",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "per lo sviluppo e gli aggiornamenti",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "Per configurare il dispositivo, visita:",
  "for development and updates": "per lo sviluppo e gli aggiornamenti",
  "To configure the device, please visit:": "Per configurare il dispositivo, visita:",
  "multiple IO interfaces,": "interfacce IO multiple,",
  "Early bird price": "Prezzo Early bird",
  "Get updates about smart devices": "Ricevi aggiornamenti sui dispositivi intelligenti",
  "Receive regular emails from Robonomics": "Ricevi regolarmente email da Robonomics",
  "Thanks for your submission!": "Grazie per la tua candidatura!",
  "Not submitted": "Non inviato",
  "Notify me when available": "Avvisami quando disponibile",
  "Captcha is not verified. Please, check your internet connection": "Il Captcha non è verificato. Per favore, controlla la tua connessione internet",
  "Thanks for the submition!": "Grazie per la sottomissione!",
  "Submitting": "Sottomissione",
  "Submit": "Sottoporre",
  "Follow for latest news and important updates": "Segui per le ultime notizie e importanti aggiornamenti",
  "The best way to check open-source project": "Il modo migliore per controllare i progetti open-source",
  "Useful, serious, cute videos, teasers etc.": "Video utili, seri, carini, anteprime ecc.",
  "Chat for engineers and developers": "Chat per ingegneri e sviluppatori",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Chat non ufficiale per gli appassionati di criptovalute",
  "Use cases": "Casi d'uso",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Diventa un fornitore di dati ambientali per i tuoi amici e vicini della zona. Accedi a misurazioni veramente decentralizzate della qualità dell'aria, del rumore, della temperatura e di altre condizioni ambientali sulla mappa dei sensori.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "Il server per la casa intelligente più open-source, alimentato da RISC-V, con un cloud Web3 che sostituisce i server di Google sotto il cofano.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Dispositivi WI-FI MQTT intelligenti con firmware open-source Tasmota sulla scheda completamente compatibili con Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Collega la tua casa intelligente e l'abbigliamento intelligente all'Hikikomori per monitorare i dati dei sensori - proprio a portata di mano. Letteralmente.",
  "Coming in early 2025": "In arrivo all'inizio del 2025",
  "Rent in California, USA": "Affitto in California, USA",
  "Available by the Hour, Day, or Week": "Disponibile per l'ora, il giorno o la settimana",
  "Your name": "Il tuo nome",
  "Your comment": "Il tuo commento",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Cliccando su questo pulsante, accetti di ricevere un'email riguardante il noleggio del robot umanoide Unitree G1.",
  "We'll get in touch shortly!": "Ci metteremo in contatto a breve!",
  "Contact me": "Contattami",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Un sensore intelligente che raccoglie dati ambientali e li integra in una mappa di sensori decentralizzata.",
  "Smart Tamagotchi “Hikikomori“": "Smart Tamagotchi 'Hikikomori'",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Una scheda di sviluppo microcontroller progettata per integrarsi con i sistemi Web3. Può essere il tuo tamagotchi per la casa intelligente, un controller per videogiochi, uno strumento educativo - qualsiasi cosa tu progetti!",
  "Energy monitor with USB-C": "Monitoraggio energetico con USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Un dispositivo non invasivo progettato per il montaggio su guida DIN nei quadri elettrici, monitora il consumo e la generazione di elettricità.",
  "Smart devices from Robonomics": "Dispositivi intelligenti di Robonomics",
  "Our values": "I nostri valori",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "I nostri dispositivi sono progettati per la massima trasparenza. Ogni prodotto è dotato di processore RISC-V aperto, codice sorgente e schemi circuitali open-source, e istruzioni per gli aggiornamenti locali, senza necessità di connessioni cloud. Hai il potere di capire, personalizzare e fidarti della tua tecnologia fin dal principio",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "La combinazione di comunicazione P2P e cloud Web3 garantisce che i tuoi dispositivi saranno sempre connessi. Senza accesso a internet? Puoi comunque connetterti direttamente al dispositivo. Ti trasferisci in una nuova regione o vai in vacanza? I tuoi dispositivi rimarranno online e accessibili ovunque tu sia",
  "Privacy by design": "Privacy by design",
  "Trust the Code": "Fidati del Codice",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Totalmente open-source, senza algoritmi nascosti, senza sorveglianza aziendale. È trasparenza per il vero decentralista.",
  "Your data, your keys": "I tuoi dati, le tue chiavi",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Assumi il pieno controllo dei tuoi dati con il nostro modulo di connettività completamente open-source. Scegli tra Robonomics o archiviazione cloud Web3 sicura con la tua chiave personale - niente cloud chiusi, niente codice opaco.",
  "Always Connected, Always Secure": "Sempre connesso, sempre sicuro",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "La comunicazione locale P2P e il cloud Web3 garantiscono che il tuo sensore sia sempre accessibile, ovunque tu sia. Niente punti di fallimento centralizzati - solo una connessione pura e peer-to-peer.",
  "Join the Altruist Collective": "Unisciti al Collettivo Altruista",
  "Plug the device into the global,": "Collega il dispositivo al globale,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Condividi le tue informazioni ambientali con i tuoi vicini, la tua comunità o la tua rete decentralizzata.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Dotato di USB-C supporta WiFi e Zigbee. Registra i dati di consumo e generazione di elettricità nella rete Polkadot a intervalli di 10 minuti.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori funziona su una scheda di sviluppo microcontroller ESP32-C6, ha un display LCD, supporto Wi-Fi 6 e BLE 5.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori è adatto per lo sviluppo rapido di applicazioni IoT alimentate da Web3. Questo può essere il tuo tamagotchi per la casa intelligente, un controller per videogiochi, uno strumento educativo - qualsiasi cosa tu progetti!",
  "Unitree G1 Humanoid Robot": "Robot umanoide Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Noleggia il robot umanoide all'avanguardia per i tuoi progetti di ricerca, programmazione e intrattenimento.",
  "Hour": "Ora",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Noleggio in loco (Oakland, CA)",
  "Suitable for short tasks": "Adatto per compiti brevi",
  "No engineering support included": "Nessun supporto ingegneristico incluso",
  "Day": "Giorno",
  "$900": "$900",
  "Suitable for bigger tasks": "Adatto per compiti più grandi",
  "Basic engineering support included": "Supporto ingegneristico di base incluso",
  "Week+": "Settimana+",
  "On demand": "Su richiesta",
  "Delivery to your location": "Consegna presso la tua posizione",
  "Customized approach": "Approccio personalizzato",
  "Engineering support can be included": "Il supporto ingegneristico può essere incluso",
  "Enter the new era": "Entra nella nuova era",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "Il robot umanoide G1 con le sue caratteristiche innovative offre versatilità per le esigenze di ricerca, programmazione e intrattenimento. Il Unitree G1 include una mano dexterous di controllo di potenza, che gli consente di svolgere compiti delicati come la manipolazione di oggetti, la pressione di pulsanti e l'esecuzione di altre operazioni precise con vari oggetti.",
  "Tech specification": "Specifiche tecniche",
  "Height, Width and Thickness（Stand）": "Altezza, larghezza e spessore (supporto)",
  "1320x450x200mm": "1320x450x200mm",
  "Height, Width and Thickness（Fold）": "Altezza, larghezza e spessore (piegato)",
  "690x450x300mm": "690x450x300mm",
  "Weight (With Battery)": "Peso (con batteria)",
  "About 35kg": "Circa 35kg",
  "Arm Maximum Load": "Carico massimo del braccio",
  "About 2Kg": "Circa 2kg",
  "Cooling System": "Sistema di raffreddamento",
  "Local air cooling": "Raffreddamento locale ad aria",
  "Smart Battery (Quick Release)": "Batteria intelligente (rilascio rapido)",
  "9000mAh": "9000mAh",
  "Charger": "Caricatore",
  "54V 5A": "54V 5A",
  "Battery Life": "Durata della batteria",
  "About 2h": "Circa 2h",
  "Sensing Sensor": "Sensore di rilevamento",
  "Depth Camera+3D LiDAR": "Fotocamera a profondità + LiDAR 3D",
  "5W Speaker": "Altoparlante da 5W",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6, Bluetooth 5.2",
  "Manual Controller": "Controller manuale",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Prendi il controllo dei tuoi dati domestici intelligenti con un server domestico open-source su processore RISC-V e connettività Web3.",
  "Surveillance-free": "Libero da sorveglianza",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Nessun registro nascosto su server aziendali consentendo comunque un accesso remoto sicuro.",
  "No vendor lock-in": "Nessun blocco del fornitore",
  "Supports over 3000 integrations with devices from various manufacturers.": "Supporta oltre 3000 integrazioni con dispositivi di vari produttori.",
  "Open hardware": "Hardware aperto",
  "Open processor architecture and open-source code ensure a trustless system.": "L'architettura del processore aperto e il codice open-source garantiscono un sistema affidabile ed efficiente.",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Il nostro server domestico è alimentato da un processore RISC-V e presenta schemi di circuiti completamente trasparenti. RISC-V è un'architettura di processore aperta e modulare che viene fornita con una licenza BSD. A differenza di ARM proprietario, offre flessibilità per la personalizzazione senza restrizioni di licenza, rendendolo ideale per dispositivi e server IoT senza fiducia.",
  "Vendor agnostic smart home heart": "Cuore della casa intelligente indipendente dal fornitore",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "Il server viene preinstallato con Home Assistant, una piattaforma di automazione domestica open-source, che ti offre il pieno controllo della tua casa intelligente senza dover fare affidamento su servizi cloud di terze parti.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Il suo design modulare ti consente di aggiungere facilmente componenti, automazioni e integrazioni, supportando oltre 3.000 dispositivi di vari produttori senza vincoli di fornitore. Con supporto per i protocolli Zigbee e Wi-Fi, puoi collegare una vasta gamma di dispositivi, dai sensori di temperatura ai monitor di consumo energetico, tutti a un server locale.",
  "Designed for privacy": "Progettato per la privacy",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Il nostro server per la casa intelligente elimina l'interferenza aziendale, mantenendo i tuoi dati locali o crittografati con la tua chiave personale in uno storage Web3 decentralizzato. Goditi la completa privacy senza tracciamento, senza sorveglianza, solo un controllo sicuro e senza fiducia sulla tua casa intelligente.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "Con il controllo remoto crittografico di Robonomics Web3 cloud e P2P, ottieni accesso crittografico a tutte le funzioni della casa intelligente:",
  "Open and efficient hardware": "Hardware aperto ed efficiente",
  "hour": "ora",
  "hours": "ore",
  "day": "giorno",
  "days": "giorni",
  "week": "settimana",
  "weeks": "settimane",
  "on demand": "su richiesta",
  "Special offer": "Offerta speciale",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Ottieni l'accesso esclusivo a uno dei primi robot umanoidi disponibili commercialmente. Opzioni di noleggio flessibili per esigenze di ricerca, programmazione e intrattenimento.",
  "With the Altruist Outdoor Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data—encrypted, mapped, and shared across a distributed network.": "Con il sensore esterno Altruist, diventi una forza nel monitoraggio ambientale decentralizzato. Cattura dati su rumore, polvere e temperatura - criptati, mappati e condivisi su una rete distribuita.",
  "Access current device states remotely": "Accedi agli stati attuali dei dispositivi a distanza",
  "Control devices remotely via parachain or LibP2P": "Controlla i dispositivi a distanza tramite parachain o LibP2P",
  "Manage Home Assistant users": "Gestisci gli utenti di Home Assistant",
  "Back up and restore Home Assistant configurations": "Esegui il backup e il ripristino delle configurazioni di Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Archivia il gemello digitale della tua casa in un cloud sicuro e decentralizzato",
  "Books": "Libri",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "Nel 2022, il team di Robonomics ha iniziato a collaborare con altri team di parachain all'interno dell'ecosistema Polkadot per sfruttare i punti di forza unici di questa rete decentralizzata. Questa collaborazione ha portato al lancio di un servizio di backup e archiviazione dati progettato specificamente per le aziende di robotica.",
  "Digital markets for robots": "Mercati digitali per i robot",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "Lo sviluppo della robotica e dei sistemi automatizzati durante la Quarta Rivoluzione Industriale richiederà che i robot abbiano la capacità di ordinare servizi per la propria manutenzione.",
  "Tokenization of Data of IOT devices": "Tokenizzazione dei dati dei dispositivi IoT",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "La tokenizzazione dei dati provenienti dai dispositivi IoT (Internet delle cose) rappresenta una sviluppo rivoluzionario nell'economia digitale.",
  "Industrial zone management with capital": "Gestione della zona industriale con capitale",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "Questo caso esplora il ruolo delle fabbriche intelligenti nel rispondere agli spostamenti di capitale nei mercati moderni. Come parte della trasformazione Industria 4.0, introduce un protocollo di comunicazione decentralizzato che utilizza sistemi cibernetici-fisici per migliorare il coordinamento economico tra gli agenti industriali.",
  "Mars colonization, impossible without kusama": "Colonizzazione di Marte, impossibile senza kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Questo caso R&D esplora il ruolo dell'infrastruttura decentralizzata della rete Kusama nel supportare missioni interplanetarie, in particolare la colonizzazione di Marte.",
  "A decentralized system for negotiating road space": "Un sistema decentralizzato per negoziare lo spazio stradale",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Il nostro obiettivo era sviluppare un sistema decentralizzato per negoziare lo spazio stradale in cui i veicoli autonomi possono pagare per percorsi e autorizzazioni.",
  "Almanac": "Almanacco",
  "Robonomics' Approach": "Approccio di Robonomics",
  "Robonomics provides an alternative to centralized corporate-controlled cloud services. Instead of relying on such systems, it leverages public blockchain networks, such as Ethereum and Polkadot, to facilitate secure and autonomous transactions between robots and service providers.": "Robonomics offre un'alternativa ai servizi cloud centralizzati controllati dalle aziende. Invece di fare affidamento su tali sistemi, sfrutta reti blockchain pubbliche, come Ethereum e Polkadot, per facilitare transazioni sicure e autonome tra robot e fornitori di servizi.",
  "How Digital Markets for Robots Work": "Come funzionano i mercati digitali per i robot",
  "Key Benefits": "Benefici chiave",
  "Digital markets for robots represent a critical step toward supporting the next wave of automation and smart city infrastructure. Robonomics' decentralized approach ensures secure, scalable, and autonomous service management for robots.": "I mercati digitali per i robot rappresentano un passo critico per sostenere la prossima ondata di automazione e infrastrutture intelligenti delle città. L'approccio decentralizzato di Robonomics garantisce una gestione dei servizi sicura, scalabile e autonoma per i robot.",
  "Conclusion": "Conclusione",
  "Why Smart Factories Should Respond to Capital Changes": "Perché le fabbriche intelligenti dovrebbero rispondere ai cambiamenti di capitale",
  "A Decentralized Protocol for Economic Coordination": "Un protocollo decentralizzato per il coordinamento economico",
  "Balancing Production and Capital": "Bilanciamento della produzione e del capitale",
  "Technical Foundation": "Fondamento tecnico",
  "This R&D case presents how capital flows can act as economic signals for smart factories. By adopting Robonomics' decentralized protocol, industries can better manage production efficiency and stay aligned with the evolving standards of Industry 4.0.": "Questo caso R&D presenta come i flussi di capitale possano agire come segnali economici per le fabbriche intelligenti. Adottando il protocollo decentralizzato di Robonomics, le industrie possono gestire meglio l'efficienza produttiva e rimanere allineate agli standard in evoluzione dell'Industria 4.0.",
  "Exploring Kusama's Role in Space Exploration": "Esplorare il ruolo di Kusama nell'esplorazione spaziale",
  "The Mars Rover Experiment": "L'esperimento del Mars Rover",
  "Technical Implementation": "Implementazione tecnica",
  "Use Cases and Potential Impact": "Casi d'uso e impatto potenziale",
  "A fun video about the use of KUSAMA on Mars:": "Un divertente video sull'uso di KUSAMA su Marte:",
  "This R&D case demonstrates how the Kusama network can support scientific exploration, resource management, and data transparency for space missions. The decentralized architecture offers a promising foundation for the future of Mars colonization and beyond.": "Questo caso R&D dimostra come la rete Kusama possa supportare l'esplorazione scientifica, la gestione delle risorse e la trasparenza dei dati per le missioni spaziali. L'architettura decentralizzata offre una promettente base per il futuro della colonizzazione di Marte e oltre.",
  "The Challenge": "La sfida",
  "The Solution": "La soluzione",
  "Here is the project presentation during the MOBI GRAND CHALLENGE": "Ecco la presentazione del progetto durante il MOBI GRAND CHALLENGE",
  "We want to give special thanks to the Jetbrains Team’s Mobile Robot Algorithms Laboratory for giving us access to Duckietown.": "Vogliamo ringraziare specialmente il Mobile Robot Algorithms Laboratory del Team Jetbrains per averci dato accesso a Duckietown.",
  "Special Thanks": "Ringraziamenti speciali",
  "With robots generating enormous amounts of data—including videos, raw technical data, and logs—storage can become a significant challenge, especially at scale. This new service offers an affordable and secure solution to meet these needs.": "Con i robot che generano enormi quantità di dati, tra cui video, dati tecnici grezzi e log, lo storage può diventare una sfida significativa, specialmente su larga scala. Questo nuovo servizio offre una soluzione economica e sicura per soddisfare queste esigenze.",
  "Addressing the Challenge of Data Storage": "Affrontare la sfida dello storage dei dati",
  "Our Solution: A Decentralized Approach": "La nostra soluzione: un approccio decentralizzato",
  "Key Technology Behind the Service": "Tecnologia chiave dietro il servizio",
  "Why This Service Is Essential": "Perché questo servizio è essenziale",
  "Looking Ahead": "Guardando avanti",
  "For additional details about the collaboration between Robonomics and Crust Network and how decentralized storage is reshaping data management for robotics companies, visit the official": "Per ulteriori dettagli sulla collaborazione tra Robonomics e Crust Network e su come lo storage decentralizzato sta ridefinendo la gestione dei dati per le aziende di robotica, visita il",
  "blog": "blog",
  "Learn More About the Collaboration": "Scopri di più sulla collaborazione",
  "Send a request message and get the result from the autonomous agent. The resulting file is saved to IPFS and the resultant message requires a signature with a private key.": "Invia un messaggio di richiesta e ottieni il risultato dall'agente autonomo. Il file risultante viene salvato su IPFS e il messaggio risultante richiede una firma con una chiave privata.",
  "Overview": "Panoramica",
  "This case study explores how Robonomics Network facilitates decentralized data access using IoT devices and blockchain technology. By leveraging the Robonomics dApp connected to a weather sensor on Fuji Mountain, users can obtain real-time weather data securely and transparently.": "Questo studio di caso esplora come Robonomics Network facilita l'accesso decentralizzato ai dati utilizzando dispositivi IoT e tecnologia blockchain. Sfruttando l'applicazione Robonomics collegata a un sensore meteorologico sul Monte Fuji, gli utenti possono ottenere dati meteorologici in tempo reale in modo sicuro e trasparente.",
  "How does it work?": "Come funziona?",
  "Technical Insights": "Approfondimenti tecnici",
  "Here's a walkthrough video:": "Ecco un video illustrativo:",
  "This R&D case highlights the capabilities of decentralized technologies in real-world data collection and access. Robonomics Network empowers secure, verifiable data retrieval from IoT sensors, advancing the reliability of environmental monitoring solutions.": "Questo caso R&D mette in evidenza le capacità delle tecnologie decentralizzate nella raccolta e nell'accesso ai dati del mondo reale. Robonomics Network permette il recupero sicuro e verificabile dei dati dai sensori IoT, migliorando l'affidabilità delle soluzioni di monitoraggio ambientale.",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy. By leveraging blockchain technology, IoT devices can generate, verify, and tokenize data as units of value, creating a secure and transparent mechanism for digital asset creation.": "La tokenizzazione dei dati provenienti dai dispositivi IoT (Internet delle cose) rappresenta uno sviluppo rivoluzionario nell'economia digitale. Sfruttando la tecnologia blockchain, i dispositivi IoT possono generare, verificare e tokenizzare i dati come unità di valore, creando un meccanismo sicuro e trasparente per la creazione di asset digitali.",
  "Background": "Sfondo",
  "The Role of IoT Devices in Tokenization": "Il ruolo dei dispositivi IoT nella tokenizzazione",
  "Key Benefits of Tokenized IoT Data": "Principali benefici dei dati IoT tokenizzati",
  "Tokenizing IoT data through blockchain not only enhances data security and transparency but also paves the way for autonomous, machine-driven economies. This transformative approach creates a new generation of tokenized assets, unlocking immense potential for global innovation and economic growth.": "La tokenizzazione dei dati IoT tramite blockchain non solo migliora la sicurezza e la trasparenza dei dati, ma apre anche la strada a economie autonome e guidate da macchine. Questo approccio trasformativo crea una nuova generazione di asset tokenizzati, sbloccando un immenso potenziale per l'innovazione globale e la crescita economica.",
  "Last updated: February 03, 2025": "Ultimo aggiornamento: 3 febbraio 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Questa Informativa sulla privacy descrive le nostre politiche e procedure sulla raccolta, l'uso e la divulgazione delle tue informazioni quando utilizzi il Servizio e ti informa sui tuoi diritti in materia di privacy e su come la legge ti protegge.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Utilizziamo i Tuoi dati personali per fornire e migliorare il Servizio. Utilizzando il Servizio, accetti la raccolta e l'uso delle informazioni in conformità con questa Politica sulla privacy.",
  "Interpretation and Definitions": "Interpretazione e definizioni",
  "Interpretation": "Interpretazione",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Le parole la cui lettera iniziale è maiuscola hanno significati definiti nelle seguenti condizioni. Le seguenti definizioni avranno lo stesso significato indipendentemente dal fatto che appaiano al singolare o al plurale.",
  "Definitions": "Definizioni",
  "For the purposes of this Privacy Policy:": "Ai fini di questa Politica sulla privacy:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(detto anche \"il DAO\", \"Noi\", \"Noi\" o \"Nostro\" in questo Accordo) si riferisce all'organizzazione autonoma decentralizzata Robonomics Network, un operatore per il sito web",
  "(referred to as": "(detto",
  "Website": "Sito web",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "in questo Accordo). Ai fini del GDPR, il DAO è il Titolare del trattamento dei dati.",
  "Cookies": "Cookie",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "sono piccoli file che vengono inseriti sul Tuo computer, dispositivo mobile o su qualsiasi altro dispositivo da un sito web, contenenti i dettagli della Tua cronologia di navigazione su quel sito tra i suoi molteplici utilizzi. Ulteriori informazioni dettagliate sui cookie e su come funzionano possono essere trovate su:",
  "Country": "Paese",
  "refers to: Cyprus.": "si riferisce a: Cipro.",
  "Data Controller": "Titolare del trattamento",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "ai fini del GDPR (Regolamento generale sulla protezione dei dati), si riferisce al DAO come persona giuridica che da sola o congiuntamente ad altri determina le finalità e i mezzi del trattamento dei dati personali.",
  "Device": "Dispositivo",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "significa qualsiasi dispositivo che può accedere al Servizio come un computer, un cellulare o un tablet digitale.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "si riferisce al Regolamento generale sulla protezione dei dati dell'UE.",
  "Personal Data": "Dati personali",
  "is any information that relates to an identified or identifiable individual.": "sono tutte le informazioni che si riferiscono a un individuo identificato o identificabile.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Ai fini del GDPR, i Dati personali significano qualsiasi informazione relativa a Te come un nome, un numero di identificazione, dati di localizzazione, identificatore online o a uno o più fattori specifici dell'identità fisica, fisiologica, genetica, mentale, economica, culturale o sociale.",
  "Service": "Servizio",
  "refers to the Website": "si riferisce al Sito web",
  "Service Provider": "Fornitore del servizio",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "significa qualsiasi persona fisica o giuridica che elabora i dati per conto del DAO. Si riferisce a società terze o individui impiegati dal DAO per facilitare il Servizio, per fornire il Servizio per conto del DAO, per svolgere servizi correlati al Servizio o per assistere il DAO nell'analisi di come viene utilizzato il Servizio. Ai fini del GDPR, i Fornitori di servizi sono considerati Responsabili del trattamento dei dati.",
  "Usage Data": "Dati di utilizzo",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "si riferisce ai dati raccolti automaticamente, generati dall'uso del Servizio o dall'infrastruttura stessa del Servizio (ad esempio, la durata di una visita alla pagina).",
  "You": "Tu",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(detto anche \"Tuo\" in questo Accordo) significa l'individuo che accede o utilizza il Servizio, o il DAO, o un'altra entità giuridica per conto della quale tale individuo accede o utilizza il Servizio, a seconda dei casi.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Ai sensi del GDPR, Tu puoi essere definito Soggetto interessato o Utente poiché sei l'individuo che utilizza il Servizio.",
  "Collecting and Using Your Personal Data": "Raccolta e utilizzo dei Tuoi dati personali",
  "Types of Data Collected": "Tipi di dati raccolti",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Durante l'utilizzo del Nostro Servizio, potremmo chiederti di fornirci determinate informazioni personalmente identificabili che possono essere utilizzate per contattarti o identificarti. Le informazioni personalmente identificabili possono includere, ma non sono limitate a:",
  "Email address": "Indirizzo email",
  "First name and last name": "Nome e cognome",
  "Usage Data is collected automatically when using the Service.": "I Dati di utilizzo vengono raccolti automaticamente durante l'utilizzo del Servizio.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "I Dati di utilizzo possono includere informazioni come l'indirizzo IP del Tuo dispositivo (ad esempio, l'indirizzo IP), il tipo di browser, la versione del browser, le pagine del nostro Servizio che visiti, l'ora e la data della visita, il tempo trascorso su quelle pagine, identificatori univoci del dispositivo e altri dati diagnostici.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Quando accedi al Servizio tramite un dispositivo mobile, potremmo raccogliere automaticamente determinate informazioni, tra cui, ma non solo, il tipo di dispositivo mobile che utilizzi, il tuo ID univoco del dispositivo mobile, l'indirizzo IP del tuo dispositivo mobile, il sistema operativo mobile, il tipo di browser Internet mobile che utilizzi, identificatori univoci del dispositivo e altri dati diagnostici.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Potremmo anche raccogliere informazioni che il tuo browser invia ogni volta che visiti il nostro Servizio o quando accedi al Servizio tramite un dispositivo mobile.",
  "Cookies & Browser Storage": "Cookie e archiviazione del browser",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "I Siti web possono utilizzare i cookie. Utilizziamo i cookie e l'archiviazione del browser solo per impostazioni essenziali per migliorare la tua esperienza, non per il tracciamento. Questi aiutano a ricordare le tue preferenze, come le impostazioni della lingua o le scelte di consenso, in modo che non debba reimpostarle ogni volta che visiti il sito.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Non utilizziamo i cookie per il tracciamento o la pubblicità personalizzata. Puoi gestire o disabilitare i cookie nelle impostazioni del tuo browser, ma alcune funzionalità potrebbero non funzionare correttamente senza di essi.",
  "Matomo Analytics": "Analisi di Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Il nostro sito web potrebbe utilizzare Matomo, una piattaforma di analisi open-source, per raccogliere informazioni sull'utilizzo del sito web. Questo include dati anonimizzati come:",
  "Pages visited and navigation paths": "Pagine visitate e percorsi di navigazione",
  "Time spent on our website": "Tempo trascorso sul nostro sito web",
  "Whether you’re a returning or new visitor": "Se sei un visitatore che ritorna o nuovo",
  "Your device type (desktop, mobile, etc.)": "Il tipo di dispositivo che utilizzi (desktop, mobile, ecc.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Per proteggere la tua privacy, il tuo indirizzo IP viene anonimizzato prima di essere memorizzato. I dati che raccogliamo vengono utilizzati solo per migliorare il sito web e non vengono utilizzati per l'identificazione personale.",
  "Under Art. 6(1)(f) GDPR": "In base all'art. 6(1)(f) del GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "elaboriamo questi dati in base al nostro legittimo interesse nel migliorare i nostri servizi.",
  "Opt-Out Option": "Opzione di Opt-Out",
  "You can disable Matomo tracking at any time:": "Puoi disattivare il tracciamento di Matomo in qualsiasi momento:",
  "Use of Your Personal Data": "Utilizzo dei Tuoi Dati Personali",
  "The DAO may use Personal Data for the following purposes:": "Il DAO potrebbe utilizzare i Dati Personali per i seguenti scopi:",
  "To provide and maintain our Service": "Per fornire e mantenere il nostro Servizio",
  "including to monitor the usage of our Service.": "incluso il monitoraggio dell'utilizzo del nostro Servizio.",
  "For the performance of a contract": "Per l'esecuzione di un contratto",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "lo sviluppo, il rispetto e l'esecuzione del contratto di acquisto dei prodotti, articoli o servizi che hai acquistato o di qualsiasi altro contratto con Noi tramite il Servizio.",
  "To contact You": "Per contattarti",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Per contattarti tramite email, chiamate telefoniche, SMS o altre forme equivalenti di comunicazione elettronica, come le notifiche push di un'applicazione mobile riguardanti aggiornamenti o comunicazioni informative relative alle funzionalità, prodotti o servizi contrattati, compresi gli aggiornamenti sulla sicurezza, quando necessario o ragionevole per la loro implementazione.",
  "To provide You": "Per fornirti",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "notizie, offerte speciali e informazioni generali su altri beni, servizi ed eventi che offriamo e che sono simili a quelli che hai già acquistato o richiesto, a meno che tu non abbia scelto di non ricevere tali informazioni.",
  "To manage Your requests": "Per gestire le tue richieste",
  "To attend and manage Your requests to Us.": "Per gestire e soddisfare le tue richieste nei nostri confronti.",
  "For other purposes": "Per altri scopi",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Potremmo utilizzare le tue informazioni per altri scopi, come l'analisi dei dati, l'identificazione delle tendenze d'uso, la determinazione dell'efficacia delle nostre campagne promozionali e per valutare e migliorare il nostro Servizio, prodotti, servizi, marketing e la tua esperienza.",
  "We may share Your personal information in the following situations:": "Potremmo condividere le tue informazioni personali nelle seguenti situazioni:",
  "With Service Providers": "Con i Fornitori di Servizi",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Potremmo condividere le tue informazioni personali con i Fornitori di Servizi per monitorare e analizzare l'uso del nostro Servizio, per contattarti.",
  "With Your consent": "Con il tuo consenso",
  "We may disclose Your personal information for any other purpose with Your consent.": "Potremmo divulgare le tue informazioni personali per qualsiasi altro scopo con il tuo consenso.",
  "Retention of Your Personal Data": "Conservazione dei tuoi Dati Personali",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "Il DAO conserverà i tuoi Dati Personali solo per il tempo necessario ai fini stabiliti in questa Informativa sulla Privacy. Conserveremo e utilizzeremo i tuoi Dati Personali nella misura necessaria per adempiere ai nostri obblighi legali (ad esempio, se siamo tenuti a conservare i tuoi dati per rispettare le leggi applicabili), risolvere dispute e far rispettare i nostri accordi legali e le nostre politiche.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "Il DAO conserverà anche i Dati d'Uso per scopi di analisi interna. I Dati d'Uso sono generalmente conservati per un periodo di tempo più breve, tranne quando questi dati vengono utilizzati per rafforzare la sicurezza o migliorare la funzionalità del nostro Servizio, o siamo legalmente obbligati a conservare questi dati per periodi di tempo più lunghi.",
  "Security of Your Personal Data": "Sicurezza dei tuoi Dati Personali",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "La sicurezza dei tuoi Dati Personali è importante per Noi, ma ricorda che nessun metodo di trasmissione su Internet, o metodo di archiviazione elettronica è al 100% sicuro. Sebbene cerchiamo di utilizzare mezzi commercialmente accettabili per proteggere i tuoi Dati Personali, non possiamo garantirne la sicurezza assoluta.",
  "Detailed Information on the Processing of Your Personal Data": "Informazioni Dettagliate sul Trattamento dei tuoi Dati Personali",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Le tue informazioni, compresi i Dati Personali, sono trattate presso i fornitori di servizi del sito web del DAO e in qualsiasi altro luogo in cui si trovano le parti coinvolte nel trattamento. Ciò significa che queste informazioni possono essere trasferite a — e mantenute su — computer situati al di fuori del tuo stato, provincia, paese o altra giurisdizione governativa dove le leggi sulla protezione dei dati possono differire da quelle della tua giurisdizione.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Il tuo consenso a questa Informativa sulla Privacy seguito dalla tua presentazione di tali informazioni rappresenta la tua accettazione di tale trasferimento.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "Il DAO adotterà tutte le misure ragionevolmente necessarie per garantire che i tuoi dati siano trattati in modo sicuro e in conformità con questa Informativa sulla Privacy e nessun trasferimento dei tuoi Dati Personali avverrà a un'organizzazione o a un paese a meno che non siano presenti controlli adeguati, compresa la sicurezza dei tuoi dati e altre informazioni personali.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Si prega di notare che qualsiasi trasmissione di dati su Internet (ad esempio, la comunicazione via e-mail) non è generalmente sicura e non ci assumiamo alcuna responsabilità per i dati trasmessi a noi via Internet. Purtroppo, la protezione assoluta non è tecnicamente possibile. Queste informazioni non si applicano al sito web di terze parti e ai relativi collegamenti forniti sul nostro sito web. Il DAO non si assume alcuna responsabilità e responsabilità per questi.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "I Fornitori di Servizi che utilizziamo potrebbero avere accesso ai tuoi Dati Personali. Questi fornitori terzi raccolgono, memorizzano, utilizzano, elaborano e trasferiscono informazioni sulla tua attività sul nostro Servizio in conformità con le loro Politiche sulla Privacy.",
  "Email Marketing": "Email Marketing",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Potremmo utilizzare i tuoi Dati Personali per contattarti con newsletter, materiali di marketing o promozionali e altre informazioni che potrebbero interessarti. Puoi scegliere di non ricevere una o tutte queste comunicazioni da noi seguendo il link per annullare l'iscrizione o le istruzioni fornite in qualsiasi email che inviamo o contattandoci.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Possiamo utilizzare fornitori di servizi di email marketing per gestire e inviare email a te;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "La loro Informativa sulla privacy può essere visualizzata presso",
  "Usage, Performance and Miscellaneous": "Utilizzo, prestazioni e varie",
  "We may use third-party Service Providers to maintain and improve our Service.": "Possiamo utilizzare fornitori di servizi di terze parti per mantenere e migliorare il nostro servizio.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR Privacy",
  "Legal Basis for Processing Personal Data under GDPR": "Base giuridica per il trattamento dei dati personali ai sensi del GDPR",
  "We may process Personal Data under the following conditions:": "Possiamo trattare i dati personali nelle seguenti condizioni:",
  "Consent:": "Consenso:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Hai dato il tuo consenso al trattamento dei dati personali per uno o più scopi specifici.",
  "Performance of a contract:": "Esecuzione di un contratto:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "La comunicazione dei dati personali è necessaria per l'esecuzione di un accordo con te e/o per qualsiasi obbligo precontrattuale.",
  "Legal obligations:": "Obblighi legali:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Il trattamento dei dati personali è necessario per ottemperare a un obbligo legale al quale è soggetto il DAO.",
  "Vital interests:": "Interessi vitali:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Il trattamento dei dati personali è necessario per proteggere i tuoi interessi vitali o quelli di un'altra persona fisica.",
  "Public interests:": "Interessi pubblici:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Il trattamento dei dati personali è correlato a un compito svolto nell'interesse pubblico o nell'esercizio dell'autorità ufficiale conferita al DAO.",
  "Legitimate interests:": "Interessi legittimi:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Il trattamento dei dati personali è necessario per gli interessi legittimi perseguiti dal DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "In ogni caso, il DAO sarà lieto di aiutare a chiarire la base giuridica specifica che si applica al trattamento, e in particolare se la comunicazione dei dati personali è un requisito legale o contrattuale, o un requisito necessario per stipulare un contratto.",
  "Your Rights under the GDPR": "I tuoi diritti ai sensi del GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "Il DAO si impegna a rispettare la riservatezza dei tuoi dati personali e a garantire che tu possa esercitare i tuoi diritti.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "Hai il diritto ai sensi di questa Informativa sulla privacy, e per legge se ti trovi nell'UE, di:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Il diritto di accedere, aggiornare o cancellare le informazioni che abbiamo su di te. Quando possibile, puoi accedere, aggiornare o richiedere la cancellazione dei tuoi dati personali direttamente nella sezione delle impostazioni del tuo account. Se non sei in grado di eseguire queste azioni da solo, contattaci per assisterti. Questo ti consente anche di ricevere una copia dei dati personali che deteniamo su di te.",
  "Request correction of the Personal Data that We hold about You.": "Richiedere la correzione dei dati personali che deteniamo su di te.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "Hai il diritto di far correggere qualsiasi informazione incompleta o inaccurata che deteniamo su di te.",
  "Object to processing of Your Personal Data.": "Opporsi al trattamento dei tuoi dati personali.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Questo diritto esiste quando ci basiamo su un interesse legittimo come base giuridica per il nostro trattamento e c'è qualcosa nella tua situazione particolare che ti fa desiderare di opporsi al nostro trattamento dei tuoi dati personali su questa base. Hai anche il diritto di opporsi quando trattiamo i tuoi dati personali per scopi di marketing diretto.",
  "Request erasure of Your Personal Data.": "Richiedere la cancellazione dei tuoi dati personali.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "Hai il diritto di chiederci di cancellare o rimuovere i dati personali quando non vi è alcun motivo valido per continuare a trattarli.",
  "Request the transfer of Your Personal Data.": "Richiedere il trasferimento dei tuoi dati personali.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Ti forniremo, o a un terzo da te scelto, i tuoi dati personali in un formato strutturato, comunemente usato e leggibile da macchina. Si prega di notare che questo diritto si applica solo alle informazioni automatizzate per le quali hai inizialmente fornito il consenso per l'uso o dove abbiamo utilizzato le informazioni per stipulare un contratto con te.",
  "Withdraw Your consent.": "Revocare il tuo consenso.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "Hai il diritto di revocare il tuo consenso all'utilizzo dei tuoi dati personali. Se revoci il tuo consenso, potremmo non essere in grado di fornirti l'accesso a determinate funzionalità specifiche del servizio.",
  "Exercising of Your GDPR Data Protection Rights": "Esercizio dei tuoi diritti di protezione dei dati GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Puoi esercitare i tuoi diritti di accesso, rettifica, cancellazione e opposizione contattandoci. Si prega di notare che potremmo chiederti di verificare la tua identità prima di rispondere a tali richieste. Se fai una richiesta, faremo del nostro meglio per risponderti il prima possibile.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "Hai il diritto di presentare reclamo presso un'autorità di protezione dei dati riguardo alla nostra raccolta e utilizzo dei tuoi dati personali. Per ulteriori informazioni, se ti trovi nello Spazio economico europeo (SEE), contatta l'autorità locale di protezione dei dati nell'EEA.",
  "Children's Privacy": "Privacy dei bambini",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Il nostro servizio non è rivolto a persone di età inferiore ai 13 anni. Non raccogliamo consapevolmente informazioni personali identificabili da persone di età inferiore ai 13 anni. Se sei un genitore o un tutore e sei a conoscenza che tuo figlio ci ha fornito dati personali, ti preghiamo di contattarci. Se veniamo a conoscenza di aver raccolto dati personali da persone di età inferiore ai 13 anni senza verifica del consenso genitoriale, adotteremo misure per rimuovere tali informazioni dai nostri server.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Se dobbiamo fare affidamento sul consenso come base giuridica per il trattamento delle tue informazioni e il tuo paese richiede il consenso da parte di un genitore, potremmo richiedere il consenso del tuo genitore prima di raccogliere e utilizzare tali informazioni.",
  "Links to Other Websites": "Collegamenti ad altri siti web",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Il nostro servizio può contenere collegamenti ad altri siti web che non sono gestiti da noi. Se fai clic su un collegamento di terze parti, verrai indirizzato al sito di quella terza parte. Ti consigliamo vivamente di rivedere l'Informativa sulla privacy di ogni sito che visiti.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Non abbiamo alcun controllo e non assumiamo alcuna responsabilità per i contenuti, le politiche sulla privacy o le pratiche di qualsiasi sito o servizio di terze parti.",
  "Changes to this Privacy Policy": "Modifiche a questa Informativa sulla privacy",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Possiamo aggiornare la nostra Informativa sulla privacy di volta in volta. Ti avviseremo di eventuali modifiche pubblicando la nuova Informativa sulla privacy su questa pagina.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Ti faremo sapere tramite email e/o un avviso prominente sul nostro Servizio, prima che la modifica diventi effettiva e aggiorneremo la data di \"Ultimo aggiornamento\" in cima a questa Informativa sulla privacy.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Ti consigliamo di rivedere periodicamente questa Informativa sulla privacy per eventuali modifiche. Le modifiche a questa Informativa sulla privacy sono efficaci quando vengono pubblicate su questa pagina.",
  "Contact Us": "Contattaci",
  "If you have any questions about this Privacy Policy, You can contact us:": "Se hai domande su questa Informativa sulla privacy, puoi contattarci:",
  "By visiting this page on our website:": "Visitando questa pagina sul nostro sito web:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Questo Accordo è originariamente scritto in inglese. Questa traduzione automatica è fornita solo a scopo informativo.",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Cliccando sul pulsante “Invia” accetti di ricevere regolarmente email da Robonomics (non più di 1 al mese) e accetti di",
  "Request access to Your Personal Data.": "Richiedere l'accesso ai Tuoi Dati Personali.",
  "Aira is back": "Aira è tornata",
  "Transform your screen with our brand new wallpaper—download now!": "Trasforma il tuo schermo con il nostro nuovissimo sfondo - scarica ora!",
  "Outdoor sensor “ALTRUIST“": "Sensore esterno “ALTRUIST“",
  "Now Available!": "Ora disponibile!",
  "Worldwide Shipping": "Spedizione in tutto il mondo",
  "Open-Source Hardware & Software": "Hardware e software open-source",
  "Independent Decentralized Network Technologies": "Tecnologie di rete indipendenti e decentralizzate",
  "Colorful 3D-Printed Cases of Your Choice": "Custodie stampate in 3D colorate a tua scelta",
  "Order Now": "Ordina ora",
  "Altruist": "Altruista",
  "3 highlights for you": "3 punti salienti per te",
  "Our special wallpapers to commemorate the launch of the Outdoor sensor “Altruist“": "I nostri sfondi speciali per commemorare il lancio del sensore esterno “Altruist“"
}