{
  "What is Robonomics network?": "Robonomicsとは何か？",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomicsは、IoTアプリケーション向けのオープンソースプラットフォームです。私たちは、ユーザーアプリケーション、IoTサービス、複雑なロボット工学の間の原子トランザクションの形で技術的および経済的情報の交換を実装する新世代のインターネットテクノロジー（web3）をサポートします。",
  "Get started": "始めましょう",
  "Explore Robonomics": "Robonomicsを探る",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomicsは、誰もが利用できるIoT市場向けのオープンソーステクノロジーです。詳細については、エグゼクティブサマリーをお読みください",
  "Get XRT": "XRTを入手する",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRTは、イーサリアムとRobonomicsのパラチェーン上でIoTデバイスを制御できるようにするユーティリティトークンです。",
  "Use a Dapp": "Dappを使用する",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "IoTデバイスを管理するための分散型アプリケーションのベータ版をご覧ください",
  "Start building": "開発を始める",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Robonomics WIKIのチュートリアルと実用に役立つ実験を通じてRobonomicsを学びます",
  "Robonomics objectives": "Robonomicsの目的",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "クラウドプラットフォームの成果に基づいて、Robonomicsはヒューマンマシン通信のすべての段階で、IoT市場により安全でより高度なインターネットソリューションを提供することを目指しています。Robonomicsが開発されている主なタスクは次のとおりです。",
  "IoT device management with a decentralized cloud": "分散型クラウドによるIoTデバイス管理",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "ブロックチェーンネットワークには、デバイスの起動とテレメトリの受信に最高レベルのセキュリティを確保するためのすべてのパラメータがあります。デバイスとの相互インタラクションは、ブロックチェーンネットワークに格納されているデジタルツインの状態を変更し、これらの変更に関する情報を物理デバイスに配信することで実際に記述されます。パーミッションレスブロックチェーンを使用する場合、プロバイダーのグローバルな可用性と、不要な変更からのデジタルツインを高レベルでデータ保護が保証できます。",
  "Techno-economic transactions between humans and machines": "人間と機械の間の技術経済的トランザクション",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "自動化されたシステムが暗号通貨とスマートコントラクトを介してデジタル市場に直接アクセスするという点で、制度上の成果を語ることができます。たとえば、イーサリアムはすでに経済活動の基本的なツールのほとんどを実装しています。エンドユーザーとIoTデバイスを接続するために今日作成されたアプリケーションは、支払いと利用規約がデバイスの起動パラメーターから切り離せないものであれば、はるかに効果的なものになるでしょう。",
  "Serverless IoT applications for users": "ユーザー向けのサーバーレスIoTアプリケーション",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "現代のアプリケーションのユーザーのプライバシーの問題によって、企業がweb3の分野で最新の進歩を利用できないようになってはなりません。テレメトリにアクセスしてデバイスを制御するために、認証したり、特定のサーバーへの接続を要求したりする必要はありません。.",
  "Learn with Robonomics": "Robonomics 学ぶ",
  "Introduction course": "イントロダクション コース",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Web3技術とRobonomicsツールによる、現代のIoTアプリケーション構築に伴う問題と可能な解決策について掘り下げます。",
  "Boston dynamics spot software developing": "Boston Dynamics Spotソフトウェア開発",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Spot SDK教育プログラムを紹介することをうれしく思います！私たちの目標は、SpotのSDKに慣れてもらい、私たちのラボでボストンダイナミクスのSpotロボットをリモートで使用してスキルをテストできるようにすることです.",
  "Sovereign smart home with robonomics and home assistant": "RobonomicsとHome Assistantによる主権スマートホーム",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "このコースでは、独自のスマートホームを構築するために必要なすべての手順を学びます。その主な利点は、ユーザーデータの安全性/プライバシーです。",
  "Shop": "ショップ",
  "Science papers": "科学論文",
  "Books": "文献",
  "Logo and assets": "ロゴとアセット",
  "Blog": "ブログ",
  "Ambassador program": "アンバサダープログラム",
  "Contacts": "連絡先",
  "White Paper 2022": "ホワイトペーパー 2022",
  "Timeline": "タイムライン",
  "Tokenomics": "トークンエコノミクス",
  "Parachain": "Parachain",
  "User (D)App": "(D)App ユーザー",
  "Function request": "機能のリクエスト",
  "Report": "レポート",
  "Control": "コントロール",
  "Log": "ログ",
  "IoT Device": "IoTデバイス",
  "Decentralized application": "分散型アプリケーション",
  "Digital twin": "デジタルツイン",
  "IoT / Smart device": "IoT/スマートデバイス",
  "Robonomics tokenomics": "トークノミクスROBONOMICS",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "は、イーサリアムネットワークとポルカドットエコシステムのRobonomicsパラチェーン上のIoTデバイスを制御するためのユーティリティトークンです。",
  "Be aware of scammers": "詐欺師に注意してください",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "XRTを交換するためには、よく知られた市場のみを使用してください。トークンを買ったり売ったりする場合でも、プライベートメッセージであなたに与えられたアカウントにトークンを送信しないでください。Robonomicsトークンに関する「大きな声明」が届いた場合（詐欺師はしばしばエアドロップの発表などを利用することがあります）、公式の更新情報を確認するためにWebサイト（https://robonomics.network/）または",
  "for official updates. Be careful, be safe.": "をチェックしてください。注意して安全に行動してください.",
  "XRT in Ethereum": "イーサリアム上のXRT",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "ロボノミクスプロジェクトを2015年から2018年まで実装するにあたり、プロジェクトチームは、Robonomics Networkによる有用な機能の提供、すなわちIoTデバイスのロボットサービスモデルに基づく起動と、Ethereumのガス手数料をRobonomicsプロバイダーに返済するための接続点を見つける必要がありました。各個々のスマートデバイスのサービス提供の責任のライフサイクルについて考える必要がありました。Robonomicsの初期の研究開発の結果、チームは、各作成されたロボットサービススマートコントラクトに報酬を与えるための新しいトークンのマイニングメカニズムを考案しました。このモデルは、Ethereumの大幅な改良があれば、Robonomicsの将来においても有効です。",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "この記事では、Ethereumエコシステム内のXRTチームの歴史的背景と長期的な計画について説明します。",
  "Etherscan profile": "プロフィールEtherscan",
  "View token smart contract and transactions in Ethereum network here.": "イーサリアムネットワーク上でトークンスマートコントラクトとトランザクションを表示するにはこちらをご覧ください。",
  "Coingecko markets": "市場Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "ここでは、XRTの取引にCEXとDEX市場があります。",
  "XRT In Polkadot": "ポルカドットにおけるXRT",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "イーサリアムからポルカドットに移行するにあたり、トークノミクスの「スケーリングアップ」が必要です。ポルカドットエコシステムのパラチェーンはスマートコントラクトの相当品ではなく、全体のネットワークの一部をリースする完全にプログラム可能なブロックチェーンです。",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "ポルカドットとクサマパラチェーンの実際の支払いは、オークションで勝つために十分な数量のネイティブリレーチェーントークン（DOT / KSM）を長期間ボンディングすることです。ロボノミクスパラチェーンのXRTは、スロットの更新とステークホルダーへの報酬をサポートしています。IoTサブスクリプションの活性化に基づくXRTの燃焼メカニズムは、インフレーションを最小限に抑えるように設計されており、需要が増加した場合にはゼロになります。",
  "Learn more": "当社のネットワークアーキテクトからのTwitterスレッドで詳細を学びましょう",
  "in Twitter thread from our network architect.": ".",
  "Usage:": "使用法:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRTは、パラチェーン上でトランザクションを実行するための手数料の支払いや、デバイスまたはユーザーのIoTトランザクションの優先処理を保証するIoTサブスクリプションの購入に使用することができます。",
  "Rewards:": "報酬:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "一年を通じて、パラチェーンは少量のXRTを発行し、パラチェーンコレーターをインセンティブとします。",
  "The parameter of the total reward": "コレーターへの総報酬パラメータは、",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "トークン保有者のオンチェーン投票によって決定され、住民投票を行うことで変更することができます。",
  "Use XRT": "使用するXRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "当社の分散型アプリケーションでIoTサブスクリプションを購入してください。中央集権的な企業が監視することなく、ブロックチェーンを介してスマートデバイスを制御できます。",
  "Subscan profile": "プロフィールSubscan",
  "View token statistics on top of Polkadot ecosystem.": "Polkadotエコシステムのトップにあるトークン統計を表示してください。",
  "Other questions": "その他の質問",
  "What is RWS?": "RWSとは何ですか？",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "【コア機能の開発中】エンジニアのために、コア開発チームは異なるRobonomicsの使用モデルを作成しようとしており、その第一歩は、ライフタイムサブスクリプショントークンであるRWSトークンの発行です。各RWSトークンは、Robonomicsパラチェーンを介してあなたのIoTデバイスから/への1秒あたり（tps）のトランザクションを提供します。RWSトークンをアクティブにして、実行前の予測可能なレイテンシーで「無料のガス」トランザクションを実行してください。RWSトークンを非アクティブにして、DEXで取引してください。",
  "What is AIRA/AIR ID?": "AIRA/AIR IDとは何ですか？",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRTトークンは2017年に、Ethereum上のさらなるRobonomicsインフラストラクチャーの自律的な一部として配布されました。2019年にRobonomicsがEthereum上で成功裏に開始された後、AIRAトークンは",
  "ambix smart contract": "Ambix-Smart-Contract",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "ラクトを介してプロジェクトの作成されたインフラストラクチャーに接続され、Pre-XRTからERC-20 XRTへの自律的かつ独立したスワッププロセスが保証されました.",
  "The task": "Robonomicsトークンの役割は、",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "ブロックチェーンインフラストラクチャでのスマートシティとIndustry 4.0のメンテナンスのための分散型ネットワークの運営を確保することです。この目標を達成するためには、トークンエコノミーはネットワークの実装に対するインセンティブを反映する必要があります。",
  "Token distribution": "トークンの配布",
  "Try our Dapp": "私たちのDappを試してみてください",
  "In addition": "さらに",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "異なる独立したチームが提供するツールを使用して、Polkadot（Kusama）およびEthereumコミュニティ内でXRTを操作することができます。",
  "Within the Kusama network, you have the capability use": "Kusamaネットワーク内では、",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "Robonomicsパラチェーンと他のパラチェーンとの間の通信を、さまざまな分散型アプリケーション（dApps）を使用して行うことができます。",
  "Within the Ethereum network you can use decentralized application powered by the": "Ethereumネットワーク内では、",
  "Attention please": "分散型アプリケーションを使用することができます。",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "ご注意ください",
  "announced": "ブリッジトランザクションのためにThe Multichainサービスを利用していた場合は、現時点では使用を控えてください。",
  "on the official Twitter of The Multichain.": "公式Twitterの発表によると、それが",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "分散型アプリケーション（dapp）は、ブロックチェーン内で動作します。オープンソースで、データはIPFSとGithubで提供されます。これらの技術により、アプリケーションの安全性と透明性を同時に確保することができます。私たちの開発者は、ロボノミクスのアプリケーションの開発と、あなた自身のアプリケーションを構築する際に使用できるライブラリの開発の両方に取り組んでいます。",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "デジタルツインは、Robonomics Web Services (RWS) が提供するツールの1つです。それは、現実世界の機器のデジタル版であり、その技術的特性をすべてコピーします。これにより、分散型アプリケーションをユーザーのコマンドにより迅速に対応することができます。",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "obonomicsを使用することで、Zigbeeスマートデバイスの幅広い範囲を自動化および制御することができます。これにより、家庭/オフィスのさまざまな側面を制御することができます。また、ROSベースのロボット工学に使用して、より複雑な産業タスクを実行することもできます。",
  "Do Androids Dream of Electric Sheep?": "アンドロイドは電気羊の夢を見るか？",
  "Sleeping Mew Space": "眠るミュウの宇宙",
  "Are you ready for Mars?": "火星の準備はできていますか？",
  "Shiva Robot": "シヴァ・ロボット",
  "Space Travelers": "宇宙旅行者",
  "Retro Astronaut": "レトロ宇宙飛行士",
  "New Newton": " ニュートン",
  "Want emails from robonomics": "ロボノミクスからのメールを受け取りたいです。",
  "Adding you to our special list...": "私たちの特別リストに追加します...",
  "Nice, you are in the list": "いいですね、リストに入っていますね。",
  "Something went  wrong. Try again later": "何か問題が発生しました。後でもう一度お試しください。",
  "Your email": "あなたのメール",
  "Community & Contacts": "コミュニティ＆連絡先",
  "Get latest updates": "最新情報を入手する",
  "Tell us something if you want": "何かお知らせがあれば教えてください",
  "Submit": "送信",
  "Something went  wrong :( Try again later": "何か問題が発生しました :( 後でもう一度お試しください",
  "Robonomics art shop": "アートショップROBONOMICSs",
  "Welcome to our brand new online shop on": "robonomics.threadless.com上の当社の新しいオンラインショップへようこそ！",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "私たちのショップでは、ロボット工学、テクノロジー、芸術への愛を表現した衣服、アクセサリー、ホームデコレーションなどのアイテムを取り扱っています。私たちRobonomicsアーティストが手がけたユニークなデザインのTシャツ、長袖シャツ、フード付きシャツ、シャワーカーテン、枕、ブランケットなど、他にも使いやすい製品が豊富です。生産と発送はThreadlessのフェローが担当しており、安心してお買い物をお楽しみいただけます。",
  "Shop now on threadless": "Threadlessで今すぐショッピングをお楽しみください",
  "alternative shop": "代替店舗",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "年が始まったばかりで、大きな成果がありました。Robonomicsは第20パラチェーンスロットオークションに勝利し、Kusamaネットワーク上のID 2048",
  "officially became": "を持つ公式のパラチェーンになりました",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": " Tローンチ、データログ、DigitalTwin、責任機能、IoTサブスクリプションは、エコシステムのすべてのユーザーが利用できるようになりました。このプロジェクトのこの段階に関する詳細を提供するため、コアチームは ",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "の最初の章を公開しました。Substrate上のRobonomics 2.0はXCMメッセージをサポートしてリリースされ、Crust ShadowやDarwiniaなどの他のパラチェーンとHRMPチャンネルを開始しました。彼らの機能は非常に役立つものです。",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "同時に、IoT市場に当社のプロトコルを紹介する戦略を展開しました。IoT機器の実験から、中央集権型クラウドサービスプロバイダーに依存しない主権を持つスマートホームのコンセプトに至りました。Home Assistant自動化システムとの",
  "integration": "統合を",
  "with the Home Assistant automation system, and also designed our own": "開発し、また、独自の",
  "IoT gateway": "IoTゲートウェイ",
  "for connecting smart devices.": "を設計して、スマートデバイスを接続することができるようにしました。",
  "We have launched two big initiatives in order to increase community engagement —": "私たちはコミュニティエンゲージメントを高めるために2つの大きなイニシアチブ、",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "を立ち上げました。さらに、Robonomicsコミュニティが初めてガバナンスメカニズムを試すことができるように、",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "が秋に開催されました。最近、RobonomicsチームはDAO IPCIプロジェクトがスマートビルディングのカーボンオフセットサービスを提供するためのパラチェーンスロットを取得するのを手助けしました。",
  "In 2021, our": "2021年、",
  "main focus": "私たちの主な焦点は",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "、IoTアプリケーションがKusamaネットワーク上の私たちのパラチェーンを介して使用できるように、プロジェクトの準備に移行しました。Substrate上のRobonomics 1.0がリリースされ、センサーをパラチェーンに接続してテレメトリーデータを送信するテストや、デジタルツイン機能の開発を行っています。年の中頃には、ネットワークのフルサイクルをテストするために、",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "という独自のリレーチェーンを作成し、Robonomicsパラチェーンを統合しました（Kusamaリレーチェーンに移行する前に）。Kusamaでパラチェーンスロットを取得することに注力しており、複数のクラウドローンキャンペーンを組織しました。",
  "There have been two big changes for the community. First, we launched the": "コミュニティには2つの大きな変化がありました。まず、",
  "Robonomics Grant Program": "грантовую программу Robonomics",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "を開始しました。これにより、Web3、ロボット工学、IoTプロジェクトがR＆Dタスクの資金援助を受けることができます。今年末までに、4つのアクティブなプロジェクトがプログラムに参加しました。さらに、チームは",
  "Exodus process": "Exodusプロセスを",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "開始し、Ethereumトークン保有者がXRTトークンをパラチェーンに移動できるようにしました。",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "コラボレーションの中で、Boston Dynamics SpotがMerkleBotに素晴らしい姿を見せたことが挙げられます。",
  "rental remote control system": "ためにレンタル用のリモコンシステ",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "ムが開発されました。また、Robonomicsエンジニアのチームによって形成された個人プロジェクトであるMulti-Agent Systems社についてもお知らせします。彼らはコーヒーショップオーナー向けに料理タスクを行うロボットワッフルメーカーEisenkochを開発しました。",
  "There came a time when the existing limitations of Ethereum": "イーサリアムの現存する制限（特に、スケーラビリティの低さ、トランザクションの低速性、非常に高いコスト）",
  "began to stand out clearly": "が明確になってきた時期",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "が訪れました。ETH2.0へのアップグレードはこの状況を改善することを意図していましたが、このアップグレードは何度も延期されました。私たちはイーサリアムネットワークを離れたくありませんでしたが、現状では私たちのユースケースを実装することが困難であることに気づき、代替ネットワークを探し始めました。シャードブロックチェーンエコシステムのPolkadotがこの代替となりました。私たちは、Substrateフレームワークを実験し、Robonomicsの主要な機能を移行し、自社のテストネットを展開することから始めました。この段階の終わりまでに、私たちはRococoテストネット上にパラチェーンを展開し、Kusamaネットワークでスロットを取得する準備を始めました。",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "IoTシステムの学習を続ける中で、Robonomicsの主要な機能であるIoTのための分散型クラウドの機能を特定し、ユーザーに付加価値を提供することができることがわかりました。このアイデアは",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "の基礎となりました。 RWSのインフラストラクチャは、一般的な集中型クラウドのすべての機能を担当していますが、グローバルな可用性、セキュリティ、プライバシーの標準的な問題はありません。さらに、IoTのパラチェーンサブスクリプションのアイデアを考案し、サブスクリプション保有者が各トランザクションごとに料金を支払わずにブロックチェーンネットワークを利用できるようにしました。 IoTサブスクリプションの最初の実験は、RWSトークンの発行でした。これにより、所有者はブロックごとに1つのトランザクションを送信できます。さらに、スマートデバイスの制御用ハードウェアキット（DAOSコンセプト）の開発に向けて最初のステップを踏み出しました。",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "もちろん、Ethereum上のRobonomicsのサポートは止まっていません。Robonomics通信スタックは",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "の最終版になりました。XRTトークンはいくつかの取引所（特にUniswap DEX）で取引が開始され、流動性インセンティブプログラムが開始されました。",
  "The team actively developed ways to interact with the community. The first version of our": "ムは積極的にコミュニティとの交流方法を開発しています。",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "サイトとRobonomics Wikiの最初のバージョンがリリースされました。より透明性と便利なプロジェクト管理のために、 ",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "の使用を開始しました。また、プロジェクトへの新参者のために、",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "を2019年に開催しました。",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "志を同じくするプロジェクトとの協力も継続しました。RobonomicsとDAO IPCIは、感覚データの収集と分析のためのサービスである ",
  "Robonomics became the foundation for the": "を紹介しました。Robonomicsは、ロボット装置のスマートリースシステムを開発している",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "プロジェクトの基盤となりました。",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "自律エージェントが信頼性のある技術的・経済的運用を確保するためには、環境が必要であることが理解されています。私たちは数年間、ロボットエージェントがサービスを提供するための分散型プロバイダーネットワークを作成するためのプロトコルを開発してきました。ネットワークのメンテナンスおよびEthereumとROSの間の通信スタックのためのツールが開発されました。2018年には",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "とRobonomics Networkのアルファ版がEthereumメインネット上で開始されました。XRTトークン生成イベントの活発な準備が続けられ、最初の暗号通貨の冬により、そのイベントは2019年春に実現しました。",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "この時期から、RobonomicsはIndustry 4.0に関連するユースケース、スマートファクトリー、スマートシティ、スマートホームなど、ダイナミックに開発されるようになり、それに伴いIoT世界にも特に注目するようになりました。チームはイノベーションを追求し、いくつかの大規模でユニークなR&Dデモを発表しています.",
  "sensor network": "民間センサーネットワーク, 環境モニタリング",
  "a water drone": "めの水中ドローン",
  "for environmental monitoring (supported by a sensor systems manufacturer": "センサーシステムメーカーの",
  "a smart factory model": "がサポートスマートファクトリーモデル",
  "a self-employed": "自律型",
  "robot artist Gaka-chu": "ロボットアーティスト「Gaka-chu」",
  "and a": "そして",
  "drone traffic management system": "ドローン交通管理システムなどです",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomicsは、web3技術とIoTデバイスを使用して環境資産管理を行うDAO IPCIプロジェクトと協力を始めました.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "これは活発なR&D期間であり、p2p技術がロボットには以前利用できなかった機能を持つタスクの範囲を特定しました。Ethereumコンピュータ、IPFSファイルストレージ、Robot Operating System（ROS）を組み合わせることで、任意のデバイ",
  "autonomous intelligent robot agent": "スが自律型知能ロボットエージェント",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "になる可能性があることがわかりました。これにより、Robot-as-a-Serviceのコンセプトとロボット経済の道が開かれました.",
  "Our publications in scientific journals of this period are available in the": "当時の科学ジャーナルに掲載された当社の出版物は、",
  "Papers section": "ペーパーセクショ ンで入手可能です",
  "We have collected all R&D projects over the years in the": "私たちは、多年にわたって行ってきたすべての研究開発プロジェクト ",
  "a handy book": "を便利な書籍にま とめました",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "すべては、Ethereumがまだメインネットを開始したばかりの時に、創設者たちに思い浮かんだアイデアから始まりました。ロボットが暗号通貨でクライアントのタスクを実行し、そのロジックはスマートコントラクトによって制御されるとしたらどうでしょうか",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "アイデアをテストするために、私たちはEthereumコンピュータによって制御されるドローンを使用して、ユーザーが支払いトランザクションを完了した後、指定されたGPS座標を達成するデモを作成しました。",
  "The demo is available on": "デモは",
  "YouTube": "YouTube で利用可能です",
  "Infrastructure && tech development timeline": "インフラストラクチャー＆テック開発タイムライン",
  "Notable events": "注目すべきイベント",
  "World Economic Forum Annual Meeting 2022": "世界経済フォーラム年次総会2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "主権ホームオートメーションへの道のり",
  "Becoming a Parachain for IoT Applications": "IoTアプリケーション用のパラチェーンになる方法",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "RobonomicsによるスポンサーIROS2021",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021（Robonomics主催）",
  "Transition to Multinetwork — Along Came Polkadot": "マルチネットワークへの移行 - ポルカドットが現れた",
  "The Rise of Robonomics Network": "ロボノミクスネットワークの台頭",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop 'The Economy of Robots'": "欧州議会ワークショップ「ロボットの経済」",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MITメディアラボでのロボットシステムのためのブロックチェーンに関するシンポジウム",
  "Robonomics-2018 summer school hosted by Robonomics team.": "ロボノミクスチーム主催のRobonomics-2018サマースクール",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Web3テクノロジーとロボットフレームワークを結びつける",
  "Playing with Human-Machine Interaction through Ethereum": " イーサリアムを通じた人間と機械の相互作用の操作",
  "Robonomics whitepaper 2022 welcome guide": "ようこそガイドRobonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "私たちは、EthereumとIPFSの上で実行される技術経済的なマシンコミュニケーションプロトコルを開発し、Polkadotパラチェーンに基づくクラウドベースのIoTプラットフォームの要素を補完しています。今日、私たちはすでに未来志向のIoTアプリケーションを作成するためのハイブリッドプラットフォームを持っています。これにより、グローバルな分散型コンピュータの管理下にあるデバイスとの相互作用が可能になります。Robonomicsプラットフォームを使用して安全でサーバーレスな未来志向のIoTアプリケーションを作成する前に、理論に少し立ち入ってみましょう...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomicsのホワイトペーパーの最初の2章がすでにユーザーに利用可能です。",
  "Chapter 1.": "第1章.",
  "At the intersection of cybernetics and economics": "サイバネティックスと経済の交差点にて",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "私たちは、ロボット装置が人間に保留されていた主要な経済活動を実行できる独立したエージェントとして機能する経済システムを提示しました。この章では、ロボット経済の重要性について説明し、将来的に経済の完全自動化サービスへと変化する可能性がある人々の生活の重要な一部になることができます。",
  "In this chapter you will learn": "この章では、あなたは学ぶことができます。",
  "Ronald Coase and The Nature of the Firm": "ロナルド・コースと企業の本質",
  "CPS - cyber-physical system": "CPS - サイバーフィジカルシステム",
  "Norbert Wiener and the search for patterns in living and machine": "ノーバート・ウィーナーと生物および機械のパターンの探求",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "第四次産業革命、ロボットのためのお金、そしてビットコイン",
  "Ethereum Smart Contracts": "スマートコントラクトEthereum",
  "Polkadot Parachains": "Polkadotパラチェーン",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "テレオロジーに関するオープンな問題とミーゼスの著作",
  "Read chapter 1": "第1章を読んでください",
  "Chapter 2.": "第2章",
  "Robonomics architecture": "Robonomicsアーキテクチャ",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "第2章では、IoTデバイスから分散型で世界的にアクセス可能なプロバイダーネットワークまで、現代のインターネット技術を使った人間と機械の相互作用について読みます。IoTの基礎を見て、IoTシステムの開発者が直面する問題や主な課題を強調し、Robonomicsが狙う解決策について考えます。",
  "Overview of the state of the Internet of Things (IoT)": "インターネット・オブ・シングス（IoT）の現状概要",
  "Classification of IoT devices": "IoTデバイスの分類",
  "Embedded IoT systems": "組み込みIoTシステム",
  "Edge-systems: IoT gateways and controllers": "エッジシステム：IoTゲートウェイとコントローラー",
  "Autonomous Systems": "自律システム",
  "Internet of Things providers": "インターネット・オブ・シングスのプロバイダー",
  "Digital twins are the heart of the Internet of Things": "デジタルツインは、インターネット・オブ・シングスの中心です",
  "IoT data flows in cloud service": "クラウドサービスにおけるIoTデータフロー",
  "Popular examples of IoT solutions": "IoTソリューションの人気のある例",
  "Current problems of building IoT solutions": "IoTソリューションを構築する上での現在の問題点",
  "Main tasks of Robonomics architecture": "Robonomicsアーキテクチャの主なタスク",
  "Basic components of Robonomics architecture": "Robonomicsアーキテクチャの基本コンポーネント",
  "A simple representation of Robonomics architecture": "ロボノミクスアーキテクチャのシンプルな表現",
  "Read chapter 2": "第2章を読んでください",
  "We continue to update the white paper of Robonomics": "Robonomicsのホワイトペーパーを更新し続けています",
  "stay tuned for new parts on our website and in Discord": "ウェブサイトとDiscordで、新しいパーツをお楽しみに。",
  "Join our discord": "ディスコードに参加してください",
  "Robonomics logos and usage": "Robonomicsのロゴと使用方法",
  "We have put together Robonomics logos and guidelines to show how you may use it": "私たちは、Robonomicsのロゴ、カラー、アセット、ガイドラインをまとめました。これらを使用する方法を示します",
  "Download Robonomics logo": "ロボノミクスのロゴをダウンロードしてください",
  "Download RWS logo": "RWSのロゴをダウンロードする",
  "Download wiki logo": "WIKIのロゴをダウンロードしてください",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "これらの許可されたロゴを使用して、Robonomics、RWS、またはRobonomics Wikiへのリンクを作成してください",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Robonomicsのロゴを使用して、自分がRobonomicsと統合されていることを他の人に知らせることができます",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Robonomicsの技術や統合プロジェクトに関するブログ投稿、記事、スライドには許可されたロゴを使用してください",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Robonomicsのロゴは許可されたもの以外は変更しないでください。色、寸法、他の言葉やデザイン要素との組み合わせも変更しないでください",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Robonomicsのロゴや名前を使用する際には、Robonomics DAOの承認が得られていない場合、あなたがRobonomicsであるかのように、あなたの提供やプロジェクトがRobonomicsによるものであるかのように、またはRobonomicsがあなたやあなたの提供やプロジェクトを支持しているかのように示唆する方法は使用しないでください",
  "Robonomics Color pallet": "Robonomicsのカラーパレット",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "私たちがインタフェース、印刷、およびその他のビジュアルで使用するこれらの色を使用して、 </br> Robonomicsについて説明するスライド、ポスト用バナーなどを作成してください。",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "RobonomicsパラチェーンでIoT向けのDapps && Webサービスを構築",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, ソフトウェアアーキテクト",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "自動機械は、奴隷労働とまさに経済的に同等であることを忘れないでください。奴隷労働と競合するあらゆる労働は奴隷労働の経済的影響を受け入れなければなりません。",
  "Norbert Wiener": "Norbrt Wiener",
  "cybernetics": "サイバネティックス",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "今日ロボットは成長した子供のようなものです。ロボットはすでにお金を管理し、法律関連に参入し、自立することができます。",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "人類の未来自体は、ロボットにその能力を処理する方法を教えるかどうかにかかっています。",
  "Robonomics tools": "Robonomicsツール",
  "Operate with digital twins of IoT devices": "IoTデバイスのデジタルツインで動作",
  "The first tools of the robot economy: money for robots, contracts for robots": "ロボット経済の最初のツール：ロボットのためのお金、ロボットのための契約",
  "Software for connecting devices to a decentralized cloud": "デバイスを分散型クラウドに接続するためのソフトウェア",
  "API library for custom IoT applications": "カスタムIoTアプリケーション用のAPIライブラリ",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomicsには、ロボット工学とユーザーインターフェイスの両方の側面でIoTアプリケーションを開発するための完全なツールが含まれています。ユーザーとデバイス間の通信は、Web3の世界で最も成功しているテクノロジーであるIPFS、Ethereum、およびPolkadotを使用して行われます。これらによって、開発者はスマートシティやインダストリー4.0用の最新の安全なアプリケーションを作成できます。",
  "Robonomics Connectivity": "Robonomicsに接続する方法",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "開発者の便宜のため、Robonomicsには（1）HTTP/MQTTプロトコルを使用するIoTデバイス、（2）Robot Operating System（ROS）を使用する複雑なロボットシステムを接続するための一連のソフトウェアが含まれています。",
  "Connect a sensor": "センサーをRobonomicsネットワークに接続",
  "to the Robonomics network": "します",
  "Try": "試してみてください",
  "a simple prototyping tool": "- をお試しください。シンプルなプロトタイピングツールです。",
  "Start building your own cyber physical system with": "を使用して独自のサイバーフィジカルシステムの構築を 開始します",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomicsに含まれるもの",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "プラットフォームユーザーは、ROS互換ロボットを数分でデジタルエコノミーに接続できます。サポートされているロボットの完全なリストについては、次をご覧ください",
  "Decentralized Cloud infrastructure for IoT": "IoT向けの分散型クラウドインフラストラクチャ",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services（RWS）は、Robonomics ParachainとIPFSに加えて、ロボット工学とIoTの基本的なインフラストラクチャサービスです",
  "Robonomics web services (RWS)": "Robonomics webサービス(rws)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "ロボットの経済",
  "Core RWS features available for IoT today": "今日のIoTで利用可能なコアRWS機能",
  "RWS PubSub Message Broker": "PubSubメッセージブローカー",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "IPFSプロトコルに基づくp2pネットワーク上で無制限のメッセージングを使用します",
  "RWS Data Blockchainization Service": "データブロックチェーン化サービス。",
  "RWS Robot Actions": "ロボットアクション。",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "オン/オフを切り替えます。分散型コンピューターの制御下でIoTデバイスを起動または停止します",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "IoTアプリケーションの中心部 - ブロックチェーン上のデジタルツイン",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "技術アーキテクチャでは、IoTデジタルツインはモノと関連イベントの可視性と監視を提供し（たとえば、IoTデバイスを使用して製品の起源を自動的にキャプチャします）、ブロックチェーンは、これらのモノのライフサイクルと関連するビジネスイベントの状態についての真実を共有される単一のバージョンで提供することを可能にします",
  "from Gartner research": "ガートナーの調査より",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachainは、デジタルツインのモデルを作成し、6秒ごとにその状態を更新する機会を提供します。",
  "App Store for Robotics - Robonomics Marketplace": "ロボット工学向けのApp Store - Robonomicsマーケットプレイス",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "Tに接続された製品や機器を設計および製造する企業は、デジタルツインの提供など、採用の障壁を低くするために、独自の配信モデルを介してデジタルツインを提供するだけでなく、マーケットプレイスを介して柔軟なデジタルツイン配信モデルを採用する必要があります",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry": "開発されたデジタルツインモデルは、貴社がIoT業界に提供する追加サービスと直接リンクできます",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service": "何百社ものお客様に提供プロセスを便利でシンプルにするために、ロボットマーケットプレイス向けのサービスのセクションを追加しました。デジタルツインモデル+会社の自動化サービスの実装されたバンドルの最初の例をご覧ください",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "ロボットやユーザー向けのサービスのアイデアはありますか？次に、RobonomicsプラットフォームでIoTアプリケーションを構築するためのステップバイステップの手順に進みます。",
  "or": "や"
}