{
  "What is Robonomics network?": "Robonomicsとは何か？",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomicsは、IoTアプリケーション向けのオープンソースプラットフォームです。私たちは、ユーザーアプリケーション、IoTサービス、複雑なロボット工学の間の原子トランザクションの形で技術的および経済的情報の交換を実装する新世代のインターネットテクノロジー（web3）をサポートします。",
  "Get started": "始めましょう",
  "Explore Robonomics": "Robonomicsを探る",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomicsは、誰もが利用できるIoT市場向けのオープンソーステクノロジーです。詳細については、エグゼクティブサマリーをお読みください",
  "Get XRT": "XRTを入手する",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRTは、イーサリアムとRobonomicsのパラチェーン上でIoTデバイスを制御できるようにするユーティリティトークンです。",
  "Use a Dapp": "Dappを使用する",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "IoTデバイスを管理するための分散型アプリケーションのベータ版をご覧ください",
  "Start building": "開発を始める",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Robonomics WIKIのチュートリアルと実用に役立つ実験を通じてRobonomicsを学びます",
  "Robonomics objectives": "Robonomicsの目的",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "クラウドプラットフォームの成果に基づいて、Robonomicsはヒューマンマシン通信のすべての段階で、IoT市場により安全でより高度なインターネットソリューションを提供することを目指しています。Robonomicsが開発されている主なタスクは次のとおりです。",
  "IoT device management with a decentralized cloud": "分散型クラウドによるIoTデバイス管理",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "ブロックチェーンネットワークには、デバイスの起動とテレメトリの受信に最高レベルのセキュリティを確保するためのすべてのパラメータがあります。デバイスとの相互インタラクションは、ブロックチェーンネットワークに格納されているデジタルツインの状態を変更し、これらの変更に関する情報を物理デバイスに配信することで実際に記述されます。パーミッションレスブロックチェーンを使用する場合、プロバイダーのグローバルな可用性と、不要な変更からのデジタルツインを高レベルでデータ保護が保証できます。",
  "Techno-economic transactions between humans and machines": "人間と機械の間の技術経済的トランザクション",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "自動化されたシステムが暗号通貨とスマートコントラクトを介してデジタル市場に直接アクセスするという点で、制度上の成果を語ることができます。たとえば、イーサリアムはすでに経済活動の基本的なツールのほとんどを実装しています。エンドユーザーとIoTデバイスを接続するために今日作成されたアプリケーションは、支払いと利用規約がデバイスの起動パラメーターから切り離せないものであれば、はるかに効果的なものになるでしょう。",
  "Serverless IoT applications for users": "ユーザー向けのサーバーレスIoTアプリケーション",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "現代のアプリケーションのユーザーのプライバシーの問題によって、企業がweb3の分野で最新の進歩を利用できないようになってはなりません。テレメトリにアクセスしてデバイスを制御するために、認証したり、特定のサーバーへの接続を要求したりする必要はありません。.",
  "Learn with Robonomics": "Robonomics 学ぶ",
  "Introduction course": "イントロダクション コース",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Web3技術とRobonomicsツールによる、現代のIoTアプリケーション構築に伴う問題と可能な解決策について掘り下げます。",
  "Boston dynamics spot software developing": "Boston Dynamics Spotソフトウェア開発",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Spot SDK教育プログラムを紹介することをうれしく思います！私たちの目標は、SpotのSDKに慣れてもらい、私たちのラボでボストンダイナミクスのSpotロボットをリモートで使用してスキルをテストできるようにすることです.",
  "Sovereign smart home with robonomics and home assistant": "RobonomicsとHome Assistantによる主権スマートホーム",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "このコースでは、独自のスマートホームを構築するために必要なすべての手順を学びます。その主な利点は、ユーザーデータの安全性/プライバシーです。",
  "Shop": "ショップ",
  "Science papers": "科学論文",
  "Books": "文献",
  "Logo and assets": "ロゴとアセット",
  "Blog": "ブログ",
  "Ambassador program": "アンバサダープログラム",
  "Contacts": "連絡先",
  "White Paper 2022": "ホワイトペーパー 2022",
  "Timeline": "タイムライン",
  "Tokenomics": "トークンエコノミクス",
  "Parachain": "Parachain",
  "User (D)App": "(D)App ユーザー",
  "Function request": "機能のリクエスト",
  "Report": "レポート",
  "Control": "コントロール",
  "Log": "ログ",
  "IoT Device": "IoTデバイス",
  "Decentralized application": "分散型アプリケーション",
  "Digital twin": "デジタルツイン",
  "IoT / Smart device": "IoT/スマートデバイス",
  "Robonomics tokenomics": "トークノミクスROBONOMICS",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "は、イーサリアムネットワークとポルカドットエコシステムのRobonomicsパラチェーン上のIoTデバイスを制御するためのユーティリティトークンです。",
  "Be aware of scammers": "詐欺師に注意してください",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "XRTを交換するためには、よく知られた市場のみを使用してください。トークンを買ったり売ったりする場合でも、プライベートメッセージであなたに与えられたアカウントにトークンを送信しないでください。Robonomicsトークンに関する「大きな声明」が届いた場合（詐欺師はしばしばエアドロップの発表などを利用することがあります）、公式の更新情報を確認するためにWebサイト（https://robonomics.network/）または",
  "for official updates. Be careful, be safe.": "をチェックしてください。注意して安全に行動してください.",
  "XRT in Ethereum": "イーサリアム上のXRT",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "ロボノミクスプロジェクトを2015年から2018年まで実装するにあたり、プロジェクトチームは、Robonomics Networkによる有用な機能の提供、すなわちIoTデバイスのロボットサービスモデルに基づく起動と、Ethereumのガス手数料をRobonomicsプロバイダーに返済するための接続点を見つける必要がありました。各個々のスマートデバイスのサービス提供の責任のライフサイクルについて考える必要がありました。Robonomicsの初期の研究開発の結果、チームは、各作成されたロボットサービススマートコントラクトに報酬を与えるための新しいトークンのマイニングメカニズムを考案しました。このモデルは、Ethereumの大幅な改良があれば、Robonomicsの将来においても有効です。",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "この記事では、Ethereumエコシステム内のXRTチームの歴史的背景と長期的な計画について説明します。",
  "Etherscan profile": "プロフィールEtherscan",
  "View token smart contract and transactions in Ethereum network here.": "イーサリアムネットワーク上でトークンスマートコントラクトとトランザクションを表示するにはこちらをご覧ください。",
  "Coingecko markets": "市場Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "ここでは、XRTの取引にCEXとDEX市場があります。",
  "XRT In Polkadot": "ポルカドットにおけるXRT",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "イーサリアムからポルカドットに移行するにあたり、トークノミクスの「スケーリングアップ」が必要です。ポルカドットエコシステムのパラチェーンはスマートコントラクトの相当品ではなく、全体のネットワークの一部をリースする完全にプログラム可能なブロックチェーンです。",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "ポルカドットとクサマパラチェーンの実際の支払いは、オークションで勝つために十分な数量のネイティブリレーチェーントークン（DOT / KSM）を長期間ボンディングすることです。ロボノミクスパラチェーンのXRTは、スロットの更新とステークホルダーへの報酬をサポートしています。IoTサブスクリプションの活性化に基づくXRTの燃焼メカニズムは、インフレーションを最小限に抑えるように設計されており、需要が増加した場合にはゼロになります。",
  "Learn more": "当社のネットワークアーキテクトからのTwitterスレッドで詳細を学びましょう",
  "in Twitter thread from our network architect.": ".",
  "Usage:": "使用法:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRTは、パラチェーン上でトランザクションを実行するための手数料の支払いや、デバイスまたはユーザーのIoTトランザクションの優先処理を保証するIoTサブスクリプションの購入に使用することができます。",
  "Rewards:": "報酬:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "一年を通じて、パラチェーンは少量のXRTを発行し、パラチェーンコレーターをインセンティブとします。",
  "The parameter of the total reward": "コレーターへの総報酬パラメータは、",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "トークン保有者のオンチェーン投票によって決定され、住民投票を行うことで変更することができます。",
  "Use XRT": "使用するXRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "当社の分散型アプリケーションでIoTサブスクリプションを購入してください。中央集権的な企業が監視することなく、ブロックチェーンを介してスマートデバイスを制御できます。",
  "Subscan profile": "プロフィールSubscan",
  "View token statistics on top of Polkadot ecosystem.": "Polkadotエコシステムのトップにあるトークン統計を表示してください。",
  "Other questions": "その他の質問",
  "What is RWS?": "RWSとは何ですか？",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "【コア機能の開発中】エンジニアのために、コア開発チームは異なるRobonomicsの使用モデルを作成しようとしており、その第一歩は、ライフタイムサブスクリプショントークンであるRWSトークンの発行です。各RWSトークンは、Robonomicsパラチェーンを介してあなたのIoTデバイスから/への1秒あたり（tps）のトランザクションを提供します。RWSトークンをアクティブにして、実行前の予測可能なレイテンシーで「無料のガス」トランザクションを実行してください。RWSトークンを非アクティブにして、DEXで取引してください。",
  "What is AIRA/AIR ID?": "AIRA/AIR IDとは何ですか？",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRTトークンは2017年に、Ethereum上のさらなるRobonomicsインフラストラクチャーの自律的な一部として配布されました。2019年にRobonomicsがEthereum上で成功裏に開始された後、AIRAトークンは",
  "ambix smart contract": "Ambix-Smart-Contract",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "ラクトを介してプロジェクトの作成されたインフラストラクチャーに接続され、Pre-XRTからERC-20 XRTへの自律的かつ独立したスワッププロセスが保証されました.",
  "The task": "Robonomicsトークンの役割は、",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "ブロックチェーンインフラストラクチャでのスマートシティとIndustry 4.0のメンテナンスのための分散型ネットワークの運営を確保することです。この目標を達成するためには、トークンエコノミーはネットワークの実装に対するインセンティブを反映する必要があります。",
  "Token distribution": "トークンの配布",
  "Try our Dapp": "私たちのDappを試してみてください",
  "In addition": "さらに",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "異なる独立したチームが提供するツールを使用して、Polkadot（Kusama）およびEthereumコミュニティ内でXRTを操作することができます。",
  "Within the Kusama network, you have the capability use": "Kusamaネットワーク内では、",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "Robonomicsパラチェーンと他のパラチェーンとの間の通信を、さまざまな分散型アプリケーション（dApps）を使用して行うことができます。",
  "Within the Ethereum network you can use decentralized application powered by the": "Ethereumネットワーク内では、",
  "Attention please": "分散型アプリケーションを使用することができます。",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "ご注意ください",
  "announced": "ブリッジトランザクションのためにThe Multichainサービスを利用していた場合は、現時点では使用を控えてください。",
  "on the official Twitter of The Multichain.": "公式Twitterの発表によると、それが",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "分散型アプリケーション（dapp）は、ブロックチェーン内で動作します。オープンソースで、データはIPFSとGithubで提供されます。これらの技術により、アプリケーションの安全性と透明性を同時に確保することができます。私たちの開発者は、ロボノミクスのアプリケーションの開発と、あなた自身のアプリケーションを構築する際に使用できるライブラリの開発の両方に取り組んでいます。",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "デジタルツインは、Robonomics Web Services (RWS) が提供するツールの1つです。それは、現実世界の機器のデジタル版であり、その技術的特性をすべてコピーします。これにより、分散型アプリケーションをユーザーのコマンドにより迅速に対応することができます。",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "obonomicsを使用することで、Zigbeeスマートデバイスの幅広い範囲を自動化および制御することができます。これにより、家庭/オフィスのさまざまな側面を制御することができます。また、ROSベースのロボット工学に使用して、より複雑な産業タスクを実行することもできます。",
  "Do Androids Dream of Electric Sheep?": "アンドロイドは電気羊の夢を見るか？",
  "Want emails from robonomics": "ロボノミクスからのメールを受け取りたいです。",
  "Adding you to our special list...": "私たちの特別リストに追加します...",
  "Nice, you are in the list": "いいですね、リストに入っていますね。",
  "Something went  wrong. Try again later": "何か問題が発生しました。後でもう一度お試しください。",
  "Your email": "あなたのメール",
  "Community & Contacts": "コミュニティ＆連絡先",
  "Get latest updates": "最新情報を入手する",
  "Tell us something if you want": "何かお知らせがあれば教えてください",
  "Submit": "送信",
  "Something went  wrong :( Try again later": "何か問題が発生しました :( 後でもう一度お試しください",
  "Robonomics art shop": "アートショップROBONOMICSs",
  "Welcome to our brand new online shop on": "上の当社の新しいオンラインショップへようこそ",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "私たちのショップでは、ロボット工学、テクノロジー、芸術への愛を表現した衣服、アクセサリー、ホームデコレーションなどのアイテムを取り扱っています。私たちRobonomicsアーティストが手がけたユニークなデザインのTシャツ、長袖シャツ、フード付きシャツ、シャワーカーテン、枕、ブランケットなど、他にも使いやすい製品が豊富です。生産と発送はThreadlessのフェローが担当しており、安心してお買い物をお楽しみいただけます。",
  "Shop now on threadless": "Threadlessで今すぐショッピングをお楽しみください",
  "alternative shop": "代替店舗",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "年が始まったばかりで、大きな成果がありました。Robonomicsは第20パラチェーンスロットオークションに勝利し、Kusamaネットワーク上のID 2048",
  "officially became": "を持つ公式のパラチェーンになりました",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": " Tローンチ、データログ、DigitalTwin、責任機能、IoTサブスクリプションは、エコシステムのすべてのユーザーが利用できるようになりました。このプロジェクトのこの段階に関する詳細を提供するため、コアチームは ",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "の最初の章を公開しました。Substrate上のRobonomics 2.0はXCMメッセージをサポートしてリリースされ、Crust ShadowやDarwiniaなどの他のパラチェーンとHRMPチャンネルを開始しました。彼らの機能は非常に役立つものです。",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "同時に、IoT市場に当社のプロトコルを紹介する戦略を展開しました。IoT機器の実験から、中央集権型クラウドサービスプロバイダーに依存しない主権を持つスマートホームのコンセプトに至りました。Home Assistant自動化システムとの",
  "integration": "統合を",
  "with the Home Assistant automation system, and also designed our own": "開発し、また、独自の",
  "IoT gateway": "IoTゲートウェイ",
  "for connecting smart devices.": "を設計して、スマートデバイスを接続することができるようにしました。",
  "We have launched two big initiatives in order to increase community engagement —": "私たちはコミュニティエンゲージメントを高めるために2つの大きなイニシアチブ、",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "を立ち上げました。さらに、Robonomicsコミュニティが初めてガバナンスメカニズムを試すことができるように、",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "が秋に開催されました。最近、RobonomicsチームはDAO IPCIプロジェクトがスマートビルディングのカーボンオフセットサービスを提供するためのパラチェーンスロットを取得するのを手助けしました。",
  "In 2021, our": "2021年、",
  "main focus": "私たちの主な焦点は",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "、IoTアプリケーションがKusamaネットワーク上の私たちのパラチェーンを介して使用できるように、プロジェクトの準備に移行しました。Substrate上のRobonomics 1.0がリリースされ、センサーをパラチェーンに接続してテレメトリーデータを送信するテストや、デジタルツイン機能の開発を行っています。年の中頃には、ネットワークのフルサイクルをテストするために、",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "という独自のリレーチェーンを作成し、Robonomicsパラチェーンを統合しました（Kusamaリレーチェーンに移行する前に）。Kusamaでパラチェーンスロットを取得することに注力しており、複数のクラウドローンキャンペーンを組織しました。",
  "There have been two big changes for the community. First, we launched the": "コミュニティには2つの大きな変化がありました。まず、",
  "Robonomics Grant Program": "ロボノミクス助成プログラム",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "を開始しました。これにより、Web3、ロボット工学、IoTプロジェクトがR＆Dタスクの資金援助を受けることができます。今年末までに、4つのアクティブなプロジェクトがプログラムに参加しました。さらに、チームは",
  "Exodus process": "Exodusプロセスを",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "開始し、Ethereumトークン保有者がXRTトークンをパラチェーンに移動できるようにしました。",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "コラボレーションの中で、Boston Dynamics SpotがMerkleBotに素晴らしい姿を見せたことが挙げられます。",
  "rental remote control system": "ためにレンタル用のリモコンシステ",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "ムが開発されました。また、Robonomicsエンジニアのチームによって形成された個人プロジェクトであるMulti-Agent Systems社についてもお知らせします。彼らはコーヒーショップオーナー向けに料理タスクを行うロボットワッフルメーカーEisenkochを開発しました。",
  "There came a time when the existing limitations of Ethereum": "イーサリアムの現存する制限（特に、スケーラビリティの低さ、トランザクションの低速性、非常に高いコスト）",
  "began to stand out clearly": "が明確になってきた時期",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "が訪れました。ETH2.0へのアップグレードはこの状況を改善することを意図していましたが、このアップグレードは何度も延期されました。私たちはイーサリアムネットワークを離れたくありませんでしたが、現状では私たちのユースケースを実装することが困難であることに気づき、代替ネットワークを探し始めました。シャードブロックチェーンエコシステムのPolkadotがこの代替となりました。私たちは、Substrateフレームワークを実験し、Robonomicsの主要な機能を移行し、自社のテストネットを展開することから始めました。この段階の終わりまでに、私たちはRococoテストネット上にパラチェーンを展開し、Kusamaネットワークでスロットを取得する準備を始めました。",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "IoTシステムの学習を続ける中で、Robonomicsの主要な機能であるIoTのための分散型クラウドの機能を特定し、ユーザーに付加価値を提供することができることがわかりました。このアイデアは",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "の基礎となりました。 RWSのインフラストラクチャは、一般的な集中型クラウドのすべての機能を担当していますが、グローバルな可用性、セキュリティ、プライバシーの標準的な問題はありません。さらに、IoTのパラチェーンサブスクリプションのアイデアを考案し、サブスクリプション保有者が各トランザクションごとに料金を支払わずにブロックチェーンネットワークを利用できるようにしました。 IoTサブスクリプションの最初の実験は、RWSトークンの発行でした。これにより、所有者はブロックごとに1つのトランザクションを送信できます。さらに、スマートデバイスの制御用ハードウェアキット（DAOSコンセプト）の開発に向けて最初のステップを踏み出しました。",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "もちろん、Ethereum上のRobonomicsのサポートは止まっていません。Robonomics通信スタックは",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "の最終版になりました。XRTトークンはいくつかの取引所（特にUniswap DEX）で取引が開始され、流動性インセンティブプログラムが開始されました。",
  "The team actively developed ways to interact with the community. The first version of our": "ムは積極的にコミュニティとの交流方法を開発しています。",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "サイトとRobonomics Wikiの最初のバージョンがリリースされました。より透明性と便利なプロジェクト管理のために、 ",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "の使用を開始しました。また、プロジェクトへの新参者のために、",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "を2019年に開催しました。",
  "Robonomics became the foundation for the": "を紹介しました。Robonomicsは、ロボット装置のスマートリースシステムを開発している",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "プロジェクトの基盤となりました。",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "自律エージェントが信頼性のある技術的・経済的運用を確保するためには、環境が必要であることが理解されています。私たちは数年間、ロボットエージェントがサービスを提供するための分散型プロバイダーネットワークを作成するためのプロトコルを開発してきました。ネットワークのメンテナンスおよびEthereumとROSの間の通信スタックのためのツールが開発されました。2018年には",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "とRobonomics Networkのアルファ版がEthereumメインネット上で開始されました。XRTトークン生成イベントの活発な準備が続けられ、最初の暗号通貨の冬により、そのイベントは2019年春に実現しました。",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "この時期から、RobonomicsはIndustry 4.0に関連するユースケース、スマートファクトリー、スマートシティ、スマートホームなど、ダイナミックに開発されるようになり、それに伴いIoT世界にも特に注目するようになりました。チームはイノベーションを追求し、いくつかの大規模でユニークなR&Dデモを発表しています.",
  "sensor network": "民間センサーネットワーク, 環境モニタリング",
  "a water drone": "めの水中ドローン",
  "for environmental monitoring (supported by a sensor systems manufacturer": "センサーシステムメーカーの",
  "a smart factory model": "がサポートスマートファクトリーモデル",
  "a self-employed": "自律型",
  "robot artist Gaka-chu": "ロボットアーティスト「Gaka-chu」",
  "and a": "そして",
  "drone traffic management system": "ドローン交通管理システムなどです",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomicsは、web3技術とIoTデバイスを使用して環境資産管理を行うDAO IPCIプロジェクトと協力を始めました.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "これは活発なR&D期間であり、p2p技術がロボットには以前利用できなかった機能を持つタスクの範囲を特定しました。Ethereumコンピュータ、IPFSファイルストレージ、Robot Operating System（ROS）を組み合わせることで、任意のデバイ",
  "autonomous intelligent robot agent": "スが自律型知能ロボットエージェント",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "になる可能性があることがわかりました。これにより、Robot-as-a-Serviceのコンセプトとロボット経済の道が開かれました.",
  "Our publications in scientific journals of this period are available in the": "当時の科学ジャーナルに掲載された当社の出版物は、",
  "Papers section": "ペーパーセクショ ンで入手可能です",
  "We have collected all R&D projects over the years in the": "私たちは、多年にわたって行ってきたすべての研究開発プロジェクト ",
  "a handy book": "を便利な書籍にま とめました",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "すべては、Ethereumがまだメインネットを開始したばかりの時に、創設者たちに思い浮かんだアイデアから始まりました。ロボットが暗号通貨でクライアントのタスクを実行し、そのロジックはスマートコントラクトによって制御されるとしたらどうでしょうか",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "アイデアをテストするために、私たちはEthereumコンピュータによって制御されるドローンを使用して、ユーザーが支払いトランザクションを完了した後、指定されたGPS座標を達成するデモを作成しました。",
  "The demo is available on": "デモは",
  "YouTube": "YouTube で利用可能です",
  "Infrastructure && tech development timeline": "インフラストラクチャー＆テック開発タイムライン",
  "Notable events": "注目すべきイベント",
  "Robonomics whitepaper 2022 welcome guide": "ようこそガイドRobonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "私たちは、EthereumとIPFSの上で実行される技術経済的なマシンコミュニケーションプロトコルを開発し、Polkadotパラチェーンに基づくクラウドベースのIoTプラットフォームの要素を補完しています。今日、私たちはすでに未来志向のIoTアプリケーションを作成するためのハイブリッドプラットフォームを持っています。これにより、グローバルな分散型コンピュータの管理下にあるデバイスとの相互作用が可能になります。Robonomicsプラットフォームを使用して安全でサーバーレスな未来志向のIoTアプリケーションを作成する前に、理論に少し立ち入ってみましょう...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomicsのホワイトペーパーの最初の2章がすでにユーザーに利用可能です。",
  "Chapter 1.": "第1章.",
  "At the intersection of cybernetics and economics": "サイバネティックスと経済の交差点にて",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "私たちは、ロボット装置が人間に保留されていた主要な経済活動を実行できる独立したエージェントとして機能する経済システムを提示しました。この章では、ロボット経済の重要性について説明し、将来的に経済の完全自動化サービスへと変化する可能性がある人々の生活の重要な一部になることができます。",
  "In this chapter you will learn": "この章では、あなたは学ぶことができます。",
  "Ronald Coase and The Nature of the Firm": "ロナルド・コースと企業の本質",
  "CPS - cyber-physical system": "CPS - サイバーフィジカルシステム",
  "Norbert Wiener and the search for patterns in living and machine": "ノーバート・ウィーナーと生物および機械のパターンの探求",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "第四次産業革命、ロボットのためのお金、そしてビットコイン",
  "Ethereum Smart Contracts": "スマートコントラクトEthereum",
  "Polkadot Parachains": "Polkadotパラチェーン",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "テレオロジーに関するオープンな問題とミーゼスの著作",
  "Read chapter 1": "第1章を読んでください",
  "Chapter 2.": "第2章",
  "Robonomics architecture": "Robonomicsアーキテクチャ",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "第2章では、IoTデバイスから分散型で世界的にアクセス可能なプロバイダーネットワークまで、現代のインターネット技術を使った人間と機械の相互作用について読みます。IoTの基礎を見て、IoTシステムの開発者が直面する問題や主な課題を強調し、Robonomicsが狙う解決策について考えます。",
  "Overview of the state of the Internet of Things (IoT)": "インターネット・オブ・シングス（IoT）の現状概要",
  "Classification of IoT devices": "IoTデバイスの分類",
  "Embedded IoT systems": "組み込みIoTシステム",
  "Edge-systems: IoT gateways and controllers": "エッジシステム：IoTゲートウェイとコントローラー",
  "Autonomous Systems": "自律システム",
  "Internet of Things providers": "インターネット・オブ・シングスのプロバイダー",
  "Digital twins are the heart of the Internet of Things": "デジタルツインは、インターネット・オブ・シングスの中心です",
  "IoT data flows in cloud service": "クラウドサービスにおけるIoTデータフロー",
  "Popular examples of IoT solutions": "IoTソリューションの人気のある例",
  "Current problems of building IoT solutions": "IoTソリューションを構築する上での現在の問題点",
  "Main tasks of Robonomics architecture": "Robonomicsアーキテクチャの主なタスク",
  "Basic components of Robonomics architecture": "Robonomicsアーキテクチャの基本コンポーネント",
  "A simple representation of Robonomics architecture": "ロボノミクスアーキテクチャのシンプルな表現",
  "Read chapter 2": "第2章を読んでください",
  "We continue to update the white paper of Robonomics": "Robonomicsのホワイトペーパーを更新し続けています",
  "stay tuned for new parts on our website and in Discord": "ウェブサイトとDiscordで、新しいパーツをお楽しみに。",
  "Join our discord": "ディスコードに参加してください",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "RobonomicsパラチェーンでIoT向けのDapps && Webサービスを構築",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, ソフトウェアアーキテクト",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "自動機械は、奴隷労働とまさに経済的に同等であることを忘れないでください。奴隷労働と競合するあらゆる労働は奴隷労働の経済的影響を受け入れなければなりません。",
  "Norbert Wiener": "Norbrt Wiener",
  "cybernetics": "サイバネティックス",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "今日ロボットは成長した子供のようなものです。ロボットはすでにお金を管理し、法律関連に参入し、自立することができます。",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "人類の未来自体は、ロボットにその能力を処理する方法を教えるかどうかにかかっています。",
  "Robonomics tools": "Robonomicsツール",
  "Operate with digital twins of IoT devices": "IoTデバイスのデジタルツインで動作",
  "The first tools of the robot economy: money for robots, contracts for robots": "ロボット経済の最初のツール：ロボットのためのお金、ロボットのための契約",
  "Software for connecting devices to a decentralized cloud": "デバイスを分散型クラウドに接続するためのソフトウェア",
  "API library for custom IoT applications": "カスタムIoTアプリケーション用のAPIライブラリ",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomicsには、ロボット工学とユーザーインターフェイスの両方の側面でIoTアプリケーションを開発するための完全なツールが含まれています。ユーザーとデバイス間の通信は、Web3の世界で最も成功しているテクノロジーであるIPFS、Ethereum、およびPolkadotを使用して行われます。これらによって、開発者はスマートシティやインダストリー4.0用の最新の安全なアプリケーションを作成できます。",
  "Robonomics Connectivity": "Robonomicsに接続する方法",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "開発者の便宜のため、Robonomicsには（1）HTTP/MQTTプロトコルを使用するIoTデバイス、（2）Robot Operating System（ROS）を使用する複雑なロボットシステムを接続するための一連のソフトウェアが含まれています。",
  "Connect a sensor": "センサーをRobonomicsネットワークに接続",
  "to the Robonomics network": "します",
  "Try": "試してみてください",
  "a simple prototyping tool": "- をお試しください。シンプルなプロトタイピングツールです。",
  "Start building your own cyber physical system with": "を使用して独自のサイバーフィジカルシステムの構築を 開始します",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomicsに含まれるもの",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "プラットフォームユーザーは、ROS互換ロボットを数分でデジタルエコノミーに接続できます。サポートされているロボットの完全なリストについては、次をご覧ください",
  "Decentralized Cloud infrastructure for IoT": "IoT向けの分散型クラウドインフラストラクチャ",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services（RWS）は、Robonomics ParachainとIPFSに加えて、ロボット工学とIoTの基本的なインフラストラクチャサービスです",
  "Robonomics web services (RWS)": "Robonomics webサービス(rws)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "ロボットの経済",
  "Core RWS features available for IoT today": "今日のIoTで利用可能なコアRWS機能",
  "RWS PubSub Message Broker": "PubSubメッセージブローカー",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "IPFSプロトコルに基づくp2pネットワーク上で無制限のメッセージングを使用します",
  "RWS Data Blockchainization Service": "データブロックチェーン化サービス。",
  "RWS Robot Actions": "ロボットアクション。",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "オン/オフを切り替えます。分散型コンピューターの制御下でIoTデバイスを起動または停止します",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "IoTアプリケーションの中心部 - ブロックチェーン上のデジタルツイン",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "技術アーキテクチャでは、IoTデジタルツインはモノと関連イベントの可視性と監視を提供し（たとえば、IoTデバイスを使用して製品の起源を自動的にキャプチャします）、ブロックチェーンは、これらのモノのライフサイクルと関連するビジネスイベントの状態についての真実を共有される単一のバージョンで提供することを可能にします",
  "from Gartner research": "ガートナーの調査より",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachainは、デジタルツインのモデルを作成し、6秒ごとにその状態を更新する機会を提供します。",
  "App Store for Robotics - Robonomics Marketplace": "ロボット工学向けのApp Store - Robonomicsマーケットプレイス",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "Tに接続された製品や機器を設計および製造する企業は、デジタルツインの提供など、採用の障壁を低くするために、独自の配信モデルを介してデジタルツインを提供するだけでなく、マーケットプレイスを介して柔軟なデジタルツイン配信モデルを採用する必要があります",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "ロボットやユーザー向けのサービスのアイデアはありますか？次に、RobonomicsプラットフォームでIoTアプリケーションを構築するためのステップバイステップの手順に進みます。",
  "or": "や",
  "Wallpapers": "壁紙",
  "Cases": "ケース",
  "Wiki": "ウィキ",
  "Academy": "アカデミー",
  "Github": "Github",
  "Dapp": "Dapp",
  "Robonomics is 100% open-source.": "Robonomicsは100％オープンソースです。",
  "Anyone can contribute to": "誰でも貢献できます",
  "the code base": "コードベースを構築する",
  "build services with Robonomics": "Robonomicsでサービスを構築する",
  "Translation was executed by AI so there may be some inaccuracies": "翻訳はAIによって実行されたため、いくつかの不正確さがあるもしれません",
  "Inform us": "私たちに知らせてください",
  "please": "お手数ですが",
  "if you find any": "見つけた場合は",
  "Additional icons for the wallpaper:": "壁紙用の追加のアイコン：",
  "Important news &amp; announcements": "重要なニュースと発表",
  "All posts": "すべての投稿",
  "I agree to receive emails": "メールを受け取ることに同意します",
  "Send": "送信",
  "Thanks, your application has been sent!": "ありがとうございます、申請が送信されました！",
  "R&D cases": "R＆Dケース",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "キプロスの不動産開発業者との協力による日々の配布、消費、および余剰の炭素排出量の追跡。",
  "I agree to receive email communications from Robonomics": "Robonomicsからのメールコミュニケーションに同意します",
  "This page is out of your space": "このページはあなたのスペース外です",
  "Check url once more or create an": "URLをもう一度確認するか、",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "404エラーを受け取ったことを",
  "Latest update": "現在のURLを忘れずに伝えてください",
  "For all passionate about Robonomics and inspired by web3.": "最新のアップデート",
  "Overview of the state of the internet of things (IoT)": "インターネット・オブ・シングス（IoT）の状態の概要",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "自動デバイスのネットワークアクセシビリティの問題は、60年代以来、世界中で議論されており、その当時からかなりの試みが行われてきました。例えば、ソビエトのサイバネティシストであるヴィクトル・グルシュコフは、60年代と70年代の「OGAS」国家情報システムの一環として、個々の工場の生産量に関する情報の自動収集を提案し、一部実装しました。1980年代には、コカ・コーラの自動販売機がARPANETに接続され、機械が飲み物の入手可能性と温度を報告できるようになりました。",
  "OGAS": "しかし、実際のIoTの開発は、広範な技術の使用により、現在進行中です。インターネット・オブ・シングスアプリケーションの急速な進化の主な要因は、さまざまな範囲の無線通信から組み込みデバイス、クラウド分析、機械学習までの多くの分野の開発結果です。過去10年間、IoTデバイスの数は着実に増加しており（2030年までに250億台の予測）、これにより研究者や開発者は、医療、ホームオートメーション、農業ビジネス、環境保護などのさまざまな分で新しいIoTアプリケーションを作成することに駆り立てられました。",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "私たちは、IoTシステムの構築プロセスとこのプロセスで生じる課題により関心があります。研究の数年間にわたり、さまざまなアーキテクチャが提案され、それらを平均化することで、IoTシステムの3つの基本コンポーネントを区別することができます：デバイス、ネットワークインフラストラクチャ、分析、コンピューティング、制御マシン。",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "新たな課題",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "インターネット・オブ・シングスの開発と適用により、典型的な問題の解決だけでは十分ではないことが示されました。以前のミスと特定の欠点に基づく、完全に新しい概念と原則が現在までに登場しました。この便利なアプローチは、スケーラビリティ、プライバシー、セキュリティに関連するいくつかの重要な欠点を持っていることが明らかになりました。これらの問題を解決するために、データ処理、ロジック、計算を使用する場所に近づけることが提案されました。その結果、フォグコンピューティングとエッジコンピューティングの概念が生まれ、クラウドとデバイス間に中間システムが一部のクラウドの機能を引き継ぐようになりました。したがって、エッジシステムの作成は、インターネット・オブ・シングスの構築の新たな課題の1つとなりました。",
  "New challenges": "インターネット・オブ・シングスの構築におけるもう1つの最近の課題は、デジタルツインの概念です。デジタルツインは、実際の機器の仕様と履歴データをコピーするデジタルバージョンです。この概念は、プロセスの正確で完全な仕様が必要であり、その開発を予測できる必要がある領域で最も優れています。インターネット・オブ・シングスは、デジタルツインの主要な統合者として機能しますが、このタスクは通常のIoTデバイスの接続よりもはるかに深いものです。",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "組み込みIoTシステム",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "このようなシステムにはユーザーインターフェースがなく、通常はIoTエコシステムの最下位レベルで基本機能を提供するために使用されます。省エネで小型である必要があります。計算および通信リソースが制限されています。IoTゲートウェイまたはコントローラは通常、組み込みシステムの複数の通信プロトコルをサポートし、デバイスからクラウドへの遠隔測定データの転送と制御信号の送信を行います。これらのデバイスは、WiFiルーターのより高度なバージョンであり、ローカルネットワークを離れずにデバイスからの情報の基本処理を実行するためにシングルボードコンピュータが搭載されています。",
  "Embedded iot systems": "自律システム",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "このクラスには、高性能プロセッサと大量のメモリを備えたフルコンピュータレベルの制御コンポーネントを持つ複雑なオートマトン（例：ボストンダイナミクスのスポット）が含まれます。この場合、ロボットは追加の中間ソリューション（エッジシステム）なしでインターネットに接続されます。インターネット・オブ・シングスへのアクセスのための必要なソフトウェアは、スタンドアロンシステムのコンピュータに直接インストールされます。データはローカルで収集および一部処理され、その後、完全なネットワークデバイスと同様にインターネットにブロードキャストされます。",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "IoTプロバイダの主な仕事は、ユーザーに対してデータと分析へのリモートアクセス、およびスマートデバイスのインターネット上での管理を提供することです。プロバイダの品質の主な基準は、操作のセキュリティ、接続の安定性、および世界中のどこからでもプロバイダにアクセスできることです。",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "IoTプロバイダーとの作業の標準的な手順には、クラウドスマートデバイスと互換性のあるソフトウェアのインストール、デバイスの最初の成功した接続後にクラウド側の管理サービスの設定、さまざまな種類の分析サービスの接続が含まれます。",
  "Digital twins are the heart of the internet of things": "デジタルツインはインターネット・オブ・シングスの中心です",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "デジタルツインについて話すとき、アーキテクチャ的には、ユーザーにデバイスの制御と状態の変更への直接アクセスを与えない実装が必要であることに注意する必要があります。拒否の最も明白な理由は、まず、デバイスの起動直前に独自の要件と条件が存在することです。第二に、複数のユーザーデバイスが単一のデータソースにアクセスする必要がある場合、各ユーザーに個別の制御を与えることが重要になる可能性があります。最後に、デバイスの最後の実際の状態を保持しておくことは非常に便利です。",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "その結果、ユーザーとセンサーによる実際のデータの生成との情報交換ループが分離されます。この原則を説明するために、以下にデジタルツインを使用したIoTデバイスのユーザー作業のプロセスが示されています。",
  "IoT data flows in cloud services": "IoTデータはクラウドサービスにフローします",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "クラウドトリガーの入力値。たとえば、クラウドサービスは車の警報センサーからの報告に応じて、さまざまな通知をユーザーに送信します。",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "エッジレベルで生成できない複雑な分析のための出力データ。たとえば、人々の中で顔認識のためのビデオを処理する場合です。",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "デバイスのデジタルツインを形成するための基盤。たとえば、ユーザーの要求に応じて、モバイルアプリやウェブサイトでのキャストの状態を作成します。",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "典型的なスマートホームシステムは、生活空間を制御するためのさまざまなオプションを提供します。それによって、ドアロックをリモートで制御したり、家族や友人への一時的または定期的なアクセスを設定したり、メンテナンスや配達員のために部屋を制御したりすることができます。多数のセンサーや記録デバイスを備えたシステムは、モーションセンサーのトリガー時にビデオ録画を含めることができ、水システムの漏れが検出された場合には自動的に水供給を停止し、予定されたロボット掃除機を起動し、クリーニングレポートをユーザーアプリに提供し、スケジュールに応じて部屋の温度を最適な値に変更することができます。",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "スマートカー。車のオンボードエレクトロニクスにモバイルインターネットへのアクセスを供することで、ユーザーはスマートフォンから直接さまざまな車の機能をリモートで制御することができます。ドアの開閉、エアコンのオン・オフ、ヘッドライトの制御などです。このような車がカーシェアリングに使用される場合、クライアント向けに車の位置、状態、残りの燃料などを示すインタラクティブな地図を作成することができます。",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "スマート機器リースシステム。企業は契約に基づいてコンベアラインにロボットマニピュレータを設置します。ロボットは定期的に実行された操作、エラーや警告のログを提供します。ロボットのリース料金は、これに基づいて計算されます。ベンダーによる予測保守も含まれます。",
  "Global availability": "グローバルな利用可能性",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "標準的なクライアントサーバーアーキテクチャでは、IoTデバイスからのメッセージのルーティング時にエンドポイントを指定する必要があります。したがって、スマートデバイスの寿命中に接続がない場合、制御やデバイスとの相互作用の能力が制限されることを意味します。",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "たとえば、中国とアメリカの貿易戦争は、すでにアメリカの中国製スート家電の数千人の消費者とその逆にとってダモクレスの剣です。いつでも、米国当局によるシャオミサーバーのブロックは、メーカーのクラウドサービスに接続するデバイスのユーザーに影響を与える可能性があります。",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "IoTデバイスのすぐ近くにいる場合、モバイルアプリから制御することはできません。ユーザーの認証やデバイスからの遠隔収集を提供するサーバーへの接続がない場合、実際にはデバイスはユーザーではなくクラウドによって制御されます。",
  "Cybersecurity": "サイバーセキュリティ",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "ほとんどのIoTソリューションの低いセキュリティの最も重要な理由は、クラウドクライアントサーバーアーキテクチャの問題の遺産に由来しています。たとえば、現在最も一般的なスマートホームアーキテクチャは、通常、クラウドサービスに接続されたIoTハブです。したがって、典型的なIoTシステムは、複数の外部システムに接続された中央制御要素です。クラウドサービスは低レベルのデバイスよりも安全ですが、このようなシステムの数十万にわたる集中制御は、セキュリティの侵害や漏洩を大規模な災害にしす。",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "クラウドサービスのサーバーは、ネットワーク攻撃、DoS攻撃（システムの障害）、悪意のある変更、ユーザーセッションの乗っ取りなど、すべての典型的なサイバーセキュリティの問題にさらされます。しかし、設計上のエラーや誤用、サーバーの障害を引き起こす自然災害などの意図しない問題も重大な脅威です。また、もう一つ確かに重要なポイントは、クラウドとそれを維持する人々への信頼性の必要性です。",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "これらすべては、IoTソリューションの規模によって悪化しています。 IoTシステムの数。確かに、クラウドサービスは低レベルのデバイスよりも安全ですが、数十万ものこのようなシステムの集中制御の統合により、セキュリティ侵害や情報漏洩が規模な災害となります。",
  "Data privacy": "データプライバシー",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "プライバシーポイントはサイバーセキュリティとは別に分ける必要があります。なぜなら、この問題はIoTシステムに特有のものだからです。コンピュータやスマートフォンだけでなく、物理的な世界により統合された多種多様なデバイスタイプの数が多いため、プライベートデータの種類の範囲が増えています。GPSの位置情報、ショッピング記録、金融取引、写真だけでなく、ビデオや会話の永久記録、音声プリント、健康状態、さらには個人の習慣のリストなどです。プライバシーに関連する脅威の種類には、情報の特定、位置特定と追跡、プロファイリング、在庫攻撃、データリンク攻撃などがあります。",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "最も不気味なのは、ユーザーが自分のプライバシーを犠牲にしていることにほとんど気づいていないことです。なぜなら、収集されているデータやその使用方法がほとんどわからないからです。プライバシーへの脅威は、侵入者だけでなく、組織や政府機関からも増大しています。クラウドIoTサービスでは通常、デバイスからの最大データ転送が必要であり、データ転送を禁止または制限する方法はありません（「利用規約を受け入れるか、失せろ」）。さらに、収集されたデータは資産であり、実際の価値があるにもかかわらず、収集されたデータの所有者はそのデータを積極的に処分する権利を否定されるだけでなく、自分自身のデータの収集と使用に対するいかなる補償も受けられません。",
  "\"Main tasks of robonomics architecture": "「ロボノミクスアーキテクチャの主なタスク",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "クラウドプラットフォームの成果と課題を基に、Robonomicsは人間と機械のコミュニケーションの各段階で、より安全で高度なインターネットソリューションをIoT市場に提供することを目指しています。以下に、Robonomicsが目指す主なタスクを示します。",
  "Managing an IoT device using a decentralized cloud": "分散型クラウドを使用したIoTデバイスの管理",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "ブロックチェーンネットワークは、デバイスの実行とそのテレメトリの取得に最高のセキュリティを提供するためのすべての機能を備えています。デバイスとのやり取りは、ブロックチェーンネットワークに格納されたデジタルツインの状態を変更し、その変更に関する情報を送信することで実際に説明することができます。許可なしのブロックチェーンの場合、IoTのプロバイダのグローバルな可用性の保証やデジタルツインデータの不要な変更からの高いレベルの保護について話すことができます。",
  "Performing technical and economic transaction between people and machines": "人と機械の間の技術的および経済的なトランザクションの実行",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "暗号通貨とスマートコントラクトの仕組みにより、自動化システムへのアクセスを直接デジタルマーケットに提供することができます。たとえば、Ethereumはすでに自律デバイスの運用に使用できる基本的な経済活動ツールのほとんどを実装しています。エンドユーザーとIoTデバイスの間の相互作用のために作成されたアプリケーションは、デバイスの起動パラメータとサービスおよび支払い条件が切り離せない場合、はるかに効果的になります。",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Web3テクノロジーの最新の進歩により、ユーザープライバシーの問題を解決することができます。Web3では、テレメトリにアクセスし、デバイスを制御するために特定のサーバーに認証する必要はありません。",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomicsは、IoTデバイスのデジタルツインのための分散型クラウドです。Robonomicsは、技術経済的な形式のコミュニケーションをサポートし、ユーザーにはプライベートアプリケーションを提供します",
  "A human interface to access the system": "システムへのヒューマンインターフェース",
  "A communication protocol": "通信プロトコル",
  "A machine interface": "マシンインターフェース",
  "Human interface": "ヒューマンインターフェース",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "私たちは、ユーザーをインターネットを介してスマートデバイスを制御するための主要な方法として分散型アプリケーション（dapps）の使用を提案しています。これにより、ローカルシティネットワークの条件と共通のグローバルネットワークの条件で同時に動作するシステムへの（データの観点での）最も安全なユーザーインターフェースを提供することができます。",
  "Communication protocol": "通信プロトコル",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "その役割を果たすのは、プロジェクトチームによって開発されたRobonomicsネットワークであり、IoTデバイスの実行に必要な情報の伝送、処理、および保存を提供するプロバイダの分散ネットワークを実装しています。実際には、IPFS、Ethereum、およびPolkadotネットワークのための機能固有のノードの実装です。",
  "Machine interface": "マシンインターフェース",
  "We have chosen the most well-known robotics framework called Robot Operating System Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "互換性のあるサイバーフィジカルシステムを統合するための準インターフェースとして、最もよく知られているロボットフレームワークであるRobot Operating System Robot Operating System（ROS）を選択しました。RobonomicsはROSのいくつかの使用方法をサポートしています。Ethereumネットワーク用のRobonomicsの実装はROSパッケージrobonomics_commの形で行われています。ROS 2アーキテクチャの場合、Robonomicsをミドルウェアレイヤーとしてサポートする実装が行われています（詳細については、「Robonomics as ROS 2 Middleware」を参照）。ROSの使用が不要な場合（たとえば、IoTデバイスとの作業時）、Pythonのrobonomics-interfaceモジュールが開発されています。これにより、Robonomicsの機能にネイティブにアクセスし、ローカルおよびプライベートなノードとリモートおよびパブリックなノードの両方で動作することができます。",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "以下は、Robonomicsプラットフォームを使用した完全なデバイスの起動サイクルの一般的なダイアグラムです。",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "ユーザーの分散型アプリケーションは、Robonomicsネットワークを介してデバイス制御機能のリクエストを送信します。",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "Robonomicsネットワークは、libp2pを使用してリクエストの翻訳を提供し、EthereumブロックチェーンまたはRobonomicsパラチェーンでイベントをキャプチャします。",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "デバイスの制御は、必要な情報を保存することが保証されている分散型ネットワークによって提供されます。",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "IoTデバイスは、EthereumおよびPolkadotネットワークからデジタルツインの現在の状態に関する情報を独立して受信します。これにより、技術的および経済的な起動パラメータが解決された後にのみ、デバイスを安全に起動できます。",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "操作の結果、IoTデバイスは完了した操作のログを公開し、提供されたサービスの証拠またはデバッグエラーのために使用できます。",
  "The log is transformed into a report for the user and becomes available in his dapp.": "ログはユーザーのためにレポートに変換され、彼のdappで利用できるようになります。",
  "No posts yet": "まだ投稿はありません",
  "If you want to help us with translation": "翻訳のお手伝いをしたい場合は",
  "contact us at": "お問い合わせください",
  "send": "送信",
  "Our library": "私たちのライブラリ",
  "Free E-Books": "無料の電子書籍",
  "Our recommendations": "私たちのおすすめ",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "ロボット工学に関与し、インスピレーションを受け、自己教育を深め、その背後にある経済を理解するために、これらの本をお勧めします。他のソースからこれらの本をダウンロードまたは購入することができます。",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomicsは、PolkadotとEthereumの制御下でロボットを接続するための100％オープンソース、安全、費用効果の高い、未来志向のIoTプラットフォームです。誰でもRobonomicsを使用してサービスを構築することができます。",
  "Below a list of our  proven applications of modern robotics technologies.": "以下は、現代のロボット技術の実証済みの応用例のリストです。",
  "By interest:": "興味による：",
  "Sort by progress:": "進捗でソート：",
  "Any progress": "進捗なし",
  "Complete": "完了",
  "Proceeding": "進行中",
  "Sort by time:": "時間でソート：",
  "Recent": "最新",
  "Earliest": "最も古い",
  "Show more": "もっと表示",
  "Robonomics token": "Robonomicsトークン",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "データをIPFSに入れ、ハッシュをパブリックブロックチェーンに保存する",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry.": "開発されたデジタルツインモデルは、お客様の会社がIoT業界向けに提供する追加サービスと直接リンクすることができます。",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service.": "数百の顧客にとって配送プロセスを便利で簡単にするために、ロボットマーケットプレイスのサービスセクションを追加しました。デジタルツインモデル+会社の自動化サービスの実装例を最初にご覧ください。",
  "Robonomics nfts": "Robonomics NFT",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "ここでは、私たちの広範な暗号通貨の旅で作成されたNFTのコレクションをまとめました。これらのユニークなトークンは、ブロックチェーン上で所有権を検証し、ブロックチェーンアカウントを飾る素晴らしいスワッグです。一部のトークンに入札することもできますし、独自のユニークな作品を作成することもできます。",
  "Robonomics Pioneer": "Robonomicsパイオニア",
  "1. Robonomics Pioneer": "1. Robonomicsパイオニア",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "初期のKusamaクラウドローンキャンペーン中、私たちはトークンだけでなく、私たちの暗号通貨のパイオニアへの貢献者にもカラフルなNFTを贈呈することを決定しました。このカードは私たちにとって大きな意味を持っており、誰かが所有している場合、彼らがRobonomicsの価値、自由、分散化の素晴らしいサポーターであることを知っています。",
  "Robonomics crypto girls": "Robonomicsクリプトガールズ",
  "2. Robonomics crypto girls": "2. Robonomicsクリプトガールズ",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "私たちは、Robonomics Art＆Scienceチームが作成した特別なデジタルアセットシリーズ、Robonomicsクリプトガールズを紹介することを喜んでいますこのコレクションの各NFTは、Robonomicsで使用される技術またはRobonomicsの上に構築された技術のユニークなグラフィカルな表現です。私たちの才能あるアーティストが、シグネチャーのRobonomicsスタイルで各ガールを手描きしました。共感するものを選ぶか、シリーズ全体をコレクションすることができます！これらのNFTを購入することで、コレクションにおしゃれなアイテムを追加するだけでなく、ロボットの分散接続を革新し続ける私たちをサポートすることもできます。コレクションへの新しい追加にご期待ください！",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. 季節ごとのスポットNFTコレクション",
  "On demand minting": "オンデマンドミンティング",
  "SEASONAL SPOT NFT COLLECTIONS": "季節ごとのスポットNFTコレクション",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "これらの季節ごとのNFTコレクションは、ユーザーとRobonomicsパラチェーン内のSpotとの間のユニークな相互作用を捉えたワンオブアカインドのデジタルアセットです。ユーザーはブラウザ上で何かを描くことができ、ロボットはその動きを再現して手描きのイメージを作成します。インタラクションが完了すると、NFTがユーザーのPolkadotアカウントにSingularマーケットプレイスミントされます。これにより、カリフォルニアの研究所にある実際のロボットと対話して、所有、購入、販売が可能な個別のデジタルアセットを作成することができます。",
  "Create your NFT": "NFTを作成する",
  "4. automated telescope collection": "4. 自動望遠鏡コレクション",
  "automated telescope collection": "自動望遠鏡コレクション",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "アタカマ砂漠、チリに位置する物理的な望遠鏡は、分散型アプリを通じてアクセスでき、宇宙空間の天体のリアルタイム画像をキャプチャすることができます。インターネット接続を持つすべてのユーザーは、クレジットカードを使用してアプリ内で購入できる$STRGZNトークンを使用してアクセスできます。天体を選択し、望遠鏡に写真を撮るように命令し、Singularプラットフォーム上でミントされたNFTを待ちます。なお、望遠鏡の稼働時間により、このアプリはGMT-3の午後11時から午前6時までしか利用できません。",
  "Try yourself": "自分自身で試してみてください",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "Polkapetsとのコラボレーション",
  "and": "および",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "ポルカドットエコシステムの誇り高いメンバーとして、RobonomicsはPolka Pets Worldに参加しました。Polka Petsチームと協力して、私たちはコネクティビティの核心的なアイデアを示すユニークなデザインコンセプトを特徴とするNFTを1200個ミントしました。このアイデアを具現化するために、私たちは人間がどんなロボットエンティティとも接続できるようにするための専門家であるアンドロイドのパーソナリティを作りました。",
  "6. Mecha Arm Jetpack": "6. メカアームジェットパック",
  "Mecha Arm Jetpack": "メカアームジェットパック",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "2021年、RobonomicsはRMRKのパレットをランタイムにサポートすることを約束し、世界最先端のNFTロジックとのネイティブ統合を実現しました。この素晴らしいマイルストーンを祝うために、私たちは特別なカナリア互換アイテムを発売しました。これは子供のNFTであり、カナリアの鳥に装備することができ、RMRKのメタバースで利点を提供するかもしれません。",
  "RMRK Partnerships": "RMRKパートナーシップ",
  "This page has moved to a": "このページは次のリンクに移動しました",
  "Automatic redirecting": "自動リダイレクト",
  "Libelium": "Libelium",
  "Secure": "セキュア",
  "Serverless": "サーバーレス",
  "Futuristic": "未来志向",
  "IoT applications": "IoTアプリケーション",
  "Robonomics network vision": "Robonomicsネットワークのビジョン",
  "At the frontier of cybernetics and economics": "サイバネティクスと経済学の最前線",
  "Build your IoT services on Robonomics platform": "Robonomicsプラットフォーム上でIoTサービスを構築し、分散アーキテクチャの利点を最大限に活用することができます。ユーザーデータの転送を必要としない分散型アプリケーション（dapp）を使用して、ユーザーはスマートデバイスに接続することができます。通信は単一障害点を持たないプロバイダーの分散ネットワークを介して行われ、デバイスはブロックチェーンネットワークから情報を独立して取得して実行したり、データをリモートで送信したりします。したがって、Robonomicsはユーザーアプリケーションからスマートデバイの起動までのすべての通信段階で、高いレベルのデバイスセキュリティとユーザーデータのプライバシーを提供します。",
  "taking full advantage of decentralized architecture": "スマートコントラクトからクロスチェーンのIoTプラットフォームへ",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomicsプロジェクトは6年以上前に始まりました。私たちは2015年から、Ethereumネットワークの初期の日々から、独立した分散型プロバイダーネットワークを使用した人間と機械のコミュニケーションを実証する最初の実験の準備を始めました。2021年初頭までに、プロジェクトチームはEthereumとIPFSの上で動作するテクノ経済的な機械コミュニケーションプロトコルを作成し、Polkadotパラチェーンに基づくクラウドベースのIoTプラットフォームの要素を補完しました。",
  "From smart contracts to cross chain IoT platform": "その結果、今日、私たちはすでに大規模なロボットシステムの機能に不可欠で明らかな答えである未来志向のIoTアプリケーションを作成するためのハイブリッドプラットフォームを持っています。このプラットフォームでは、グローバルな分散型コンピュータの制御下にあるデバイスとの相互作用が可能です。",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Robonomicsの創造者は、実験者、エンジニア、科学者であり、ソフトウェアソリューションのアーキテクチャの基礎を形成する原則を明確にするために科学的な妥当性を理解しようとする人々です。2017年から2020年までの私たちの記事では、ロボット経済というアイデアを中心に、多くのコンセプトと解決策を科学コミュニティに提案しました。ロボットデバイスが以前は人間にしかできなかった主要な経済活動を独立したエージェントとして実行する経済システムです。科学的な記事は、このリンクで読むことができます",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "ロボット経済の出現を正当化し、新たな産業革命の大規模なロボットシステムの機能に対する必然的で明白な答えであるという理由を一般的な用語で説明したいと思います。",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "未来の工場に向けて進む",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "ロナルド・コースに触発されて",
  "this link": "経済学のノーベル賞受賞者であるロナルド・コースは、1937年の著書「企業の本質」で、「階層 vs 自由市場」という二分法を最もよく示し、組織の存在の理由、特に企業の存在の理由を説明しました。コースは、契約の締結に関する意思決定とその履行の監視におけるトランザクションコスト（報の収集と処理のコスト）の影響について議論しています。トランザクションの努力が個人間の市場での複数の取引を通じて同じ製品を作成するためのトランザクションコストが非常に高くなる時点で、消費者に対して最も効率的な方法でターゲット製品を提供するために、すべての階層的な市場外の構造を持つ企業が形成されます。このプロセスを最もよく視覚化するために、車の購入の具体例を見てみましょう。部品ごとに車を購入し、すべてのコンポーネントを自分のガレージで組み立てるためにどれだけのお金と時間を費やすかを計算してみてください。部品を購入するリスクと交渉コストは、テスラの完成品であるModel Xを購入する場合と比べて高すぎます。",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "それにもかかわらず、これによって世界で唯一のすべての製品を生産する企業が出現するわけではありません。ポイントは、同じ取引コストが企業の規模にも制約を課しているということです。コースは次のように書いています：",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "「...企業は、業内での追加の取引の組織コストがオープンマーケットでの同じ取引の実施コストと等しくなるまで拡大しようとする傾向がある...」",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "言い換えれば、企業内の階層が複雑であるほど、内部コストが大きくなり、ある時点で市場への戻りのコストと比較して過剰になることがわかります。したがって、成長を確保するために、起業家はこれらのコストを削減する方法を探しています。",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "ビジネスプロセス（生産、物流、消費）のすべての参加者がより密接なレベルで結集することによって取引コストを削減するというアイデアは、自動化ソリューションの製造業者が直面する問題や課題と明らかに関連しています。過去50年間、大企業のほとんどのビジネスプロセスの標準的な運用はほぼ完全に自動化されてきました。製造業者は実質的にはサプライチェーンの完全に自動化された部分間の安全な通信の構築という課題に取り組んでおり、この課題は自動化を通じた取引コストのさらなる削減を抑制しています。部分的に自動化された企業と比較してより競争力のある製品やサービスを市場に提供するという欲は、これらの課題への解決策の探求を促しています。すべてが完全に自動化され、受益者や消費者以外の人間の参加を必要としない組織であるロボ企業の出現に向かってすべてが進んでいるようです。",
  "clearly correlates": "取引コストを排除する",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "スマートシティにおける私たちの未来",
  "firms spurs the search for solutions to": "自動化製造業者が今日直面している課題には、具体的な名前があります-サイバーフィジカルシステム（CPS）の構築です。",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "定義によれば、CPSは複数の計算、ネットワーキング、物理プロセスの強力な統合と相互統合です。",
  "Get rid of transaction costs": "CPSの構築の課題は、新しい（第4の）産業革命で説明されるアイデアにおいて中心的な位置を占めています。したがって、CPSはスマートシティにおける私たちの将来の生活の基盤であり、どこにでも現れます。将来のサイバーフィジカルシステムの例には、Uberの自動操縦、ドローンのセルフィー、メトロ駅の3Dプリンターネットワークなどがあります。",
  "Our future in smart cities": "CPSは多くの接続された要素からなる複雑な構造です：電話のアプリから始まり、都市上空でドローンを制御し、最終的にはクラウドAIによる処理後にInstagramに写真投稿します。",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "CPSの設計プロセスで最も重要なことは、サービスユーザーの供給チェーンにおける自動化要素の十分な数と過剰な数の間の微妙なバランスを見つけることです。言い換えれば、CPSのサイズ制限はどこにあるのでしょうか？この質問に答えるために、有名な数学者ノーバート・ワイナーに目を向ける必要があります。",
  "definition,": "自己調整システム",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "ノーバート・ワイナーのインスピレーション",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "1948年、MITの数学教授であるノーバート・ワイナーは、「サイバネティックス：動物と機械の制御と通信」という最も画期的な著作の1つを出版しました。彼は「サイバネティックス」という用語を初めて自己調整メカニズムとして使用し、この出版物は認識されたサイバネティックの誕生日とされています。",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "ノーバート・ワイナーは、学際的な科学的アプローチの生存性について語っています。たとえば、自動制御システムと人間社会のスケーリングと複雑さの増大の課題の類似点を引き合いに出しました。",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "つまり、サイバネティックアプローチは心理療法、生物学、自動化ナビゲーションに等しく適用きます。それはシステムの機能に基づき、個々のアクションがどのように制御され、個々のノードが互いにどのように相互作用するかに基づいています。",
  "Self-regulating systems": "ロナルド・コースとノーバート・ワイナーの著作を考慮に入れ、産業4.0の発展に続いて、ロボット化されたサービスの設計においてCPSを経済主体として利用することができます。CPSのサイズを規制し、個人の変化するニーズに適応するために、市場メカニズムを使用することができます。",
  "Inspired by Norbert Wiener": "そして科学的に興味深いのは、企業の規模に市場が課す制約という考えを基にすると、CPSの拡大の限界は常に市場によって決定されると言えることです。それ以外には何も必要ありません。",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "ロボ企業はサイバーフィジカルシステムの理想的な表現です。彼らはお金のために人間だけでなく他のロボットにもサービスを提供するかなり自律的なユニットです。その結果、ロボット経済は私たちにとって市場に直接サービスと商品を提供するCPSの一般的なセットのように見えます。",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "ビットコイン",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "ロボットのためのお金",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "産業1.0",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "1784年",
  "Bitcoin": "産業2.0",
  "Money for robots": "電化：組み立てライン生産の導入。",
  "Industry 1.0": "1870年",
  "Mechanization:": "産業3.0",
  "replacement of muscle power with steam energy.": "自動化：CNCを備えた自動化システムの導入。",
  "1784 y.": "1969年",
  "Industry 2.0": "産業4.0",
  "Electrification:": "スマート生産：サイバーフィジカルシステムの開発。",
  "introduction of assembly-line production.": "今",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "ロボファームの世界では、以前は人間だけが必要としていた社会機関へのロボットへのアクセスを提供することが自然であることがわかりました。",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "社会機関は、人々が銀行、契約、およびその他の社会の手段なしでは生活できないために生じるではありません。それらは、ある時点で人が社会のより複雑な関係の道に踏み出し、周囲のプロセスを加速する重要な一歩を踏み出したために生じます。",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "お金と契約は、ロボットが利用できるようになるべきです。それは、ロボットファンがSkynetが何であるかを忘れた病的な幻想であるためではありません。しかし、新しい産業革命は、技術情報と経済情報の両方の交換に影響を与え、人間には到達できない速度で進行する複雑な自動化チェーンの構築を目指しています。",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "ロボットは、人間のいない状態での、機械だけが意思決定を行う速度で操作を実行できるようにするために、直接利用できるお金が必要です。そして、これはすべて、人間がスマートシティで人生を楽しむためだけです！",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "そして、ここで私たちはスムーズに最初の電子現金であるBitcoinに移行します。Bitcoinは、銀行ではなく財布のような原則でアカウントに保存できるという事実により、ロボットが独立して管理できる最初のお金となります。正確には自律的に。同時に、今日私たちはすでにBitcoinが単なる電子現金ではなく、真にグローバルな金融機関であると言えます。",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "結果として、私たちが考えたものではないが、私たちのビジョンに明確に合致する出来事により、Bitcoinはロボットの最初のお金、またはさらに深く見れば、ロボットファームの形成を助ける社会機関となります。",
  "Smart contracts": "スマートコントラクト",
  "Ethereum": "イーサリアム",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoinはロボットに利用可能な最初のお金となりました。しかし、現行の形態のBitcoinは、完全な技術的および経済的な交換ツールとしては話せません。",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "今や私たちはすでにスマートコントラクト、DeFi市場、おびロボット間のメッセージ交換のための分散型インフラストラクチャを持っています。これにより、人類は人間の経済の完全に自動化された部分であるロボット経済を作り出す可能性が開かれます。",
  "One of the great opportunity to build the economy of robots is": "ロボット経済を構築するための大きな機会の一つは、技術です。イーサリアムの機能により、ロボットはお金だけでなく、人間と自身の間で契約を結ぶこともできます。",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "しかし、マシン間（m2m）契約ベースのコミュニケーションの意味は何でしょうか？それは素晴らしい質問です！CPSに戻りましょう。センサー、機械装置、またはその他の要素間の直接の通信について話すとき、私たちはまだ1つの規制されたシステム内での協力について話しています。しかし、スマートシティのサービスが生きている（あるいは場合によってはスマートホーム）ことを望む場合、さまざまな第三者要素との通信を確立する必要があります。",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "ドローン配送サービスを想像してみましょう。たとえば、ドローンがDHLの所有物である場合、それはAmazonの倉庫にアクセスしたり、都市の全ての上空にアクセスしたりすることがでるでしょうか？それは独占になるのでしょうか？これは、多くの第4次産業革命のイニシアチブにとって大きな課題です！",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "ほとんどの企業は、自社の内部企業構造の外部で自動化システム間の技術情報の安全な交換をどのように確立すればよいのかわからないため、自社の周囲にほぼ完全な権限が必要だと言っています。同時に、人が働くプロセスを見ると、異なる企業の協力が長く成功して存在していることがわかります。Amazonのウェブサイトで購入した商品をドア・トゥ・ドアで簡単に注文することができ、配達員は都市の道路を車で走行し、倉庫で注文を受け取り、あなたに届けることができます。",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "違いは何でしょうか？最初の場合、機械間の契約関係を構築する方法はありません。2番目の場合、人間の世界では既に契約関係が存在しています。",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "パラチェーン",
  "Parachains": "ポルカドット",
  "Polkadot": "Robonomicsが今日直面している主な困難は、Ethereumを使用してIoTデバイスを起動するための高い価格です。Ethereumでは、1つのトランザクションごとに10ドルから100ドルの範囲で手数料を支払う必要があります。これは、カーシェアリングの旅行、スマートアパートメントの賃貸、ドローン配送、またはお気に入りのアニメヒーローの3Dプリントなど、実際の経済の多くの場合にはかなり高価です。",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "公正を期すために、2018年から2019年のEthereumネットワークにおいても取引手数料による利益を得るシナリオが存在することをご注意いただきたいと思います。例えば、自動的な炭素排出量オフセット取引やウェブサイトから直接製造への注文の転送どです。しかし、IoTの分野でのweb3テクノロジーの大規模な適用には、クラウドが接続されたデバイスから請求する価格の削減が必要です。",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "IoTデバイスとの相互作用のコストを削減する機会を探して、Robonomicsの開発者はEthereumの代替開発を研究しました。私たちの選択は、私たちのプロジェクトとは独立したバリデータによってセキュリティが確保される共通のネットワーク内で、独自のブロックチェーンを実行することを可能にするアーキテクチャに落ち着きました。",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "Ethereum 2.0",
  "Ethereum 2.0": "異種ブロックチェーンネットワーク",
  "Heterogeneous Blockchain Network": "同種シャードネットワーク",
  "Homogeneous Shard Network": "オンチェーンプロトコル制御",
  "On-chain protocol control": "群衆の専制に対する保護",
  "Protection against the tyranny of the crowd": "共通ネットワークでの帯域幅のオークション",
  "Auction of bandwidth in the common network": "ユーザーによるガスの支払い",
  "Payment for gas by users": "これを読みましたか？",
  "Have you read this?": "素晴らしい本は素晴らしいアイデアにつながります。人間と機械のコミュニケーションについてのさらなるインスピレーションを求めるなら、SF小説を読んでみてください。既に読んだ本をチェックし、さらなる考察のために私たちが提供できるものを見てください。",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "フィリップ・K・デック",
  "Philip K. Dick": "オートファック",
  "Autofac": "アイ,ロボット",
  "I, Robot": "アイザック・アシモフ",
  "Isaac Asimov": "二百年目の男",
  "The Bicentennial Man": "ニューロマンサー",
  "Neuromancer": "ウィリアム・ギブソン",
  "William Gibson": "マリオネット社",
  "Marionettes, Inc.": "レイ・ブラッドベリ",
  "Ray Bradbury": "テレオロジーのオープンな問題",
  "Open questions of teleology": "およびL.フォン・ミーゼスによる論文",
  "and a treatise by L. von Mises": "最後に、グローバルな視点から未解決の問題に触れたいと思います。ロボットの目標は何でしょうか？",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "実際、人々の経済は契約の枠組み内でのタスクの誠実さ、当事者の結果の達成への意欲、個人の社会的な利他的行動との関連がしばしばあります。これらの原則は、ロボット経済には適用が難しいものです。ロボット経済の動機は何でしょうか？これは社会で研究し、議論する必要があるオープンな問いです。",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "まずはミーゼスの著書「人間の行為：経済学に関する論文」（行為論的アプローチ）と、Norbert Wienerの初期の論文「行動、目的、テレオロジー」（目的論的な視点）を見てみることを提案します。",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "行為論は、目的に直接依存しない人間の行動についての興味深いアイデアを私たちに与えます。これにより、究極の目標に深入りせずに、ロット経済のプロセスに取り組む機会が得られます。一方、目的論は原因を説明するという課題を提起します。",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "私たちは、ミーゼスとウィーナーの著作の交差点で、人間と機械の間の相互種間コミュニケーションの目的論的要素を考慮に入れたロボット経済のさらなる発展のためのポイントを見つけることができると期待しています。それは単なる行為論的な性質の人間と機械の相互作用のプロトコルではなく、目的論的な要素を取り入れたものです。",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Robonomicsの壁紙",
  "Robonomics wallpapers": "通常の壁紙",
  "Regular wallpapers": "携帯電話用壁紙",
  "Wallpapers for phones": "隠し壁紙",
  "Hidden wallpapers": "このページは翻訳が必要かもしれません",
  "This page may need translation": "重要なニュースと発表",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "次に、現代のインターネット技術を使用した人間と機械の相互作用の実用的な領域をご紹介します。私たちは、技術情報の交換を通じた既存のIoTデバイスアーキテクチャから、分散型で世界中からアクセス可能なプロバイダのネットワークを介した技術経済的な相互作用の組織へと移行します。",
  "Autonomous systems": "自律システム",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "このクラスには、高性能プロセッサと大量のメモリを備えたフルコンピュータレベルの制御コンポーネントを持つ複雑なオートマトン（例：ボストンダイナミクスのスポット）が含まれます。このような場合、ロボットは追加の中間ソリューション（エッジシステム）なしでインターネットに接続されます。インターネット・オブ・シングスへのアクセスに必要なソフトウェアは、スタンドアロンシステムのコンピュータに直接インストールされます。データはローカルで収集および一部処理され、その後、完全なネットワークデバイスと同様にインターネットにブロードキャストされます。",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "IoTプロバイダの主な仕事は、ユーザーに対してデータと分析のリモートアクセス、およびスマートデバイスのインターネット上での管理を提供することです。プロバイダの品質の主な基準は、操作のセキュリティ、接続の安定性、および世界中のどこからでものプロバイダの利用可能性です。",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "私たちは、ロボット経済の出現を正当化し、新たな産業命の大規模なロボットシステムの機能に対する必然的かつ明白な解答であると考える理由を一般的な用語で説明したいと思います。",
  "Move towards the factory of the future": "未来の工場への移行",
  "Inspired by Ronald Coase": "ロナルド・コースに触発されて",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "経済学のノーベル賞受賞者であるロナルド・コースは、彼の1937年の著作「企業の本質」で、階層vs自由市場の二分法を最もよく示し、組織、特に企業の存在理由を説明しました。コースは、契約の締結やその履行の監視に関する意思決定を行うための取引コスト（情報の収集と処理のコスト）の影響について議論しています。企業は、その階層的な非市場構造を持つことで、同じ製品を個人間の複数の取引で作成するための取引努力が高くなる時点で、その瞬間において、最も効率的な方法で消費者に目標の製品を最低の取引コストで提供するために形成されます。このプロセスを最もよく視覚化するために、車の購入の具体例を見てみましょう。部品ごとに車を購入し、すべてのコンポーネントを自分のガレージで組み立てるためにどれだけのお金と時間を費やすか計算してみてください。部品の購入に伴うリスクと交渉コストは、テスラの完成品であるModel Xと比較してあまりにも高いです。",
  "1870 y.": "1870年",
  "Industry 3.0": "産業3.0",
  "Automation:": "自動化：",
  "introduction of automated systems with CNC.": "CNCを備えた自動化システムの導入。",
  "1969 y.": "1969年",
  "Industry 4.0": "産業4.0",
  "Smart production:": "スマート生産：",
  "development of cyber physical systems.": "サイバーフィジカルシステムの開発。",
  "Now": "現在",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Robonomicsが今日直面している主な困難は、Ethereumを使用してIoTデバイスを起動するための高価格です。Ethereumでは、各トランザクションに対して10ドルから100ドルの範囲で手数料を支払う必要があります。これは、カーシェアリングの旅行、スマートアパートの賃貸、ドローンの配達、お気に入りのアニメヒーローの3Dプリントなど、実際の経済においてほとんどの場合にとってはかなり高価です。",
  "Establishing democracy with smart contracts": "スマートコントラクトによる民主主義の確立",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "10〜15人の小規模なオフィスを想像してみましょう。みんなが自分のメインの仕事の締め切りに集中している間、オフィススペースの維持に誰も気を配っていないようです。混乱に陥るのを避けるための最も一般的な解決策は、サポートのために第三者を雇うことです。別のアプローチは、混乱を引き起こす人や補充せずに供給を使い果たす人に罰則を課すことです。しかし、将来の暗号アナーキストの世界で専制政治の下で生活することは倫理的でしょうか？誰もが責任を持ち、自由を楽しむことが期待される世界で、専制政治の下で生活することは倫理的でしょうか？スマートコントラクトと新世代のインターネット技術（Web3とも呼ばれる）を使用して、より民主的な社会を作り出すために努力しましょう。一緒に意思決定を行い、それが適切に機能することを確認するためのツールが必要です。",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'コーヒーを飲んだのは誰？！'または共有資源の悲劇",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "経済学、生態学、および他の科学で広く議論されている概念である「共有資源の悲劇」というものがあります。これは、共有資源にアクセス権を持つ個人が自分の利を優先し、結果として資源を使い果たすシナリオを指します。コーヒーはオフィスでの無制限な消費によって劣化するため、このような資源に類似しています。しかし、通常、チームメンバーの誰もが追加のコーヒー豆を手に入れるために自分の時間とお金を投資する気はありません。そのため、彼らは新しい供給を得ることなくコーヒーを飲み続けます。",
  "How to formulate the task in numbers.": "数値でタスクを定式化する方法",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "月間のコーヒー予算を100ドルと仮定します。これは、10人のチームにとって約150杯に相当します。これにより、各人は2日ごとに1杯のコーヒーを持つことができます。さて、技術的な詳細に入ってみましょう。問題は次のとおりです。オフィスで自律型のコーヒーマシンをどのように実現できるでしょうか。",
  "Step 1: automated coffee bean ordering": "ステップ1：自動コーヒー豆の注文",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "オフィスの近くに位置するバリスタのニキータとの取り決めをしました。ボットからアラートを受け取ると、彼はコーヒー豆を供給します。ボットはコーヒーが不足していることを知らせ、注文に必要なコーヒーの量（キログラム単位）とチームによって決定された対応する支払い金額を指定します。これらの詳細に基づいて、ニキータは好みに応じてコーヒーを選ぶことができます。",
  "Step 2: automatic access to smart office.": "ステップ2：スマートオフィスへの自動アクセス",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "注文と同時に、コーヒーマシンはQRコードを生成します。その後、ニキータはオフィスの入り口のカメラにこのQRコードを提示します。",
  "Step 3: distribution of coffee tokens to the team.": "ステップ3：チームへのコーヒートークンの配布",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "ローカルカメラがQRコードをスキャンすると、スマートホーム管理システムはニキータへの支払いを開始し、チームメンバーに新しいコーヒートークンを配布します。",
  "Step 4: drink coffee!": "ステップ4：コーヒーを飲む！",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "新鮮なコーヒーを受け取るためには、チームメンバーはコーヒーマシンのアドレスにコーヒートークンを送る必要があります。",
  "Coffee beans delivery process:": "コーヒー豆の配送プロセス：",
  "Unlock new possibilities with this concept": "このコンセプトで新たな可能性を開放する",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "さらに、このような自動コーヒーマシンはさまざまな経済的および社会的側面を導入します。以下にそれらを見てみましょう：",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "開発者は、消費が制限以下になった場合に追加のコーヒートークンを預けることができます。これにより、制限内でのさまざまなコーヒーの使用に対する透明性のあるシステムが作成されます。",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "コーヒーマシンは共有アカウントを維持することができ、オフィスメンバーが個人のアカウントから資金を提供して次回の高品質なコーヒーエクスペリエンスを実現できます。",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "チームはDAOの投票を通じて、コーヒーマシンが毎回注文するコーヒーの数量を決定します。これにより、限られたリソースで課題に取り組む自由が得られます。",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "プログラム可能なプロセスは人間の要素の影響を減らし、特定のチームに合わせて設定を柔軟に調整することができます。",
  "How we smarten up our coffee machine in real life": "現実の生活でコーヒーマシンをスマート化する方法",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "コーヒーマシンの実際の制御を実現するために、Raspberry Pi 4などのシングルボードコンピュータと、GPIO接続をサポートする一般的に入手可能な大衆向けコーヒーマシンを統合しました。私たちの選択は、手頃な価格と取り外し可能なフロントパネルの利便性のために選ばれました。",
  "selected for its affordability and the convenience of its easily removable front panel.": "次に、ユーザーが送信できるトークンと基になるアルゴリズムに関する操作の詳細を詰めました以下にその結果を示します：",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "美味しいコーヒーを楽しむために、ユーザーはパラチェーン（Statemine）からコーヒーマシンのアドレスに一定額の資金（私たちの場合、1つのStatemineのトークンACT、id=3077）を送る必要があります。その後、コーヒーが注がれ始め、アクションログが後で公開されます。",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "コンセプトがオフィスを超えて広がるとき",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "このコンセプトは、アイデアを拡大するための多くの可能性を提供しています。それは、2022年のダボスでの世界経済フォーラムでPolkadot Web3 Hubで成功裏に実施されました。参加者は、一定量のトークンを送信することで、コーヒーオーダーをすることができ、希望するコーヒータイプ（エスプレッソ、アメリカーノ、カプチーノなど）を指定することができました。このイベントから写真やビデオを共有しましょう。",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "私たちのブロックチェーンコーヒーメーカーがPolkadot Web3 Hubでコーヒーを作っています",
  "DIY or how to build your own smart blockchain coffee machine": "DIYまたはスマートブロックチェーンコーヒーマシンの作り方",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "詳細なチュートリアルと技術仕様はオープンソースのGitHubリポジトリで見つけることができます。お好みのコーヒーマシンとほぼ任意のトークンを使用して、このプロジェクトを自分のスペースで実現することができることを忘れないでください。",
  "In a nutshell": "要するに",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "現在、エネルギー消費が炭素排出量の主要な要因であることがますます明確になっており、環境への影響を軽減する方法を見つけることがますます重要になっています。オフィスや商業ビルは、このエネルギー消費において重要な役割を果たしています。Robonomicsのエンジニアは、キプロスの不動産開発会社であるBBFのオフィスにシステムを設置し、電力の計測と収集を行っています。このシステムは、炭素排出量のオフセットの実用的な方法も提供しています。",
  "1. Monitoring surplus energy generation": "1. 余剰エネルギーの監視",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "BBF社のオフィスビルには、いくつかの太陽光パネルが設置され、Solarwebシステムに統合されています。これにより、分析データの簡単な収集が可能になります。システムは、建物全体の電力消費量と太陽光パネルによって生成された電力に関するデータを提供します。ただし、重要な欠落機能として、太陽光パネルが生成した電力を超えて消費された電力による炭素排出量をオフセットする機能がありません。",
  "2. Converting excess energy power to CO2 offset": "2. 余剰エネルギーをCO2オフセットに変換する",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "総電力消費量と太陽光パネルの電力生産に関するデータがあれば、炭素排出量の簡単な計算が可能です。太陽光パネルからの電力は炭素排出量が0とされているため、太陽光パネルが生成した電力を超える余剰電力に対してのみ補償が必要です。",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "特に、CO2排出量は国によって異なります。キプロスでは、Hannah Ritchie、Max Roser、Pablo Rosado（2022年）の「エネルギー」によると、平均汚染度は587 g/kWhです。",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "炭素排出量をオフセットするためには、炭素クレジットが利用されます。各クレジトは1トンのCO2を表し、太陽光パネルの貢献を超える電力消費による環境への影響を補償するために重要な役割を果たします。",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "したがって、エネルギー消費、太陽光パネルの生産、キプロス係数のデータを持っていれば、炭素排出量のオフセットに必要なトークンの数を簡単に決定することができます。",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "これを実現するために、Raspberry Piを組み込み、Home Assistantを設定して分析データを収集し、フットプリントの補償のための統合を開発しました。Home Assistantのエネルギーダッシュボードでは、次の詳細が表示されます。",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "さらに、私たちの統合は、統計情報を表示し、補償をトリガーするための便利なコントロールパネルを提供することで、システムを強化しています。",
  "Robot and electrics sheep artboard": "ロボットと電子羊のアートボード",
  "Robot and apple artboard": "ロボットとリンゴのアートボード",
  "Robot and cosmonaut artboard": "ロボットと宇宙飛行士のアートボード",
  "Robot and cat artboard": "ロボットと猫のアートボード",
  "Space travelers artboard": "宇宙旅行者のアートボード",
  "Coloured astronaut artboard": "カラフルな宇宙飛行士のアートボード",
  "Black and white astronaut artboard": "白黒の宇宙飛行士のアーボード",
  "icons for macos": "macOS用のアイコン",
  "icons for windows": "Windows用のアイコン",
  "Sleeping Mew Space": "スリーピングミュースペース",
  "Are you ready for Mars?": "火星の準備はできていますか？",
  "Shiva Robot": "シヴァロボット",
  "Space Travelers": "宇宙旅行者",
  "Retro Astronaut": "レトロな宇宙飛行士",
  "New Newton": "ニュートンの新しい",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov、Sergey Lonshakov、Vitaly Bulatov、Babak Kia Montazam、James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman、Enrica Zereik、Aleksandr Kapitonov、Fabio Bonsignorio、Alisher Khasanov、Aziza Oripova、Sergey Lonshakov、Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko、Aleksandr Kapitonov、Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov；Ivan Berman；Vadim Manaenko；Vyacheslav Rzhevskiy；Vitaly Bulatov；Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev、Alexander Kolotov、Ruslan Rezin、Konstantin Danilov、Manuel Mazzara、Subham Chakraborty、Alexey Kashevnik、Andrey Chechulin、Aleksandr Kapitonov、Vladimir Jotsov、Andon Topalov、Nikola Shakev、Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov、Sergey Lonshakov、Ivan Berman、Eduardo Castelló Ferrer、Fabio P Bonsignorio、Vitaly Bulatov、Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov、Ivan Berman、Sergey Lonshakov、Aleksandr Krupenkin、Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov；Ruslan Rezin；Ilya Afanasyev；Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov、Aleksandr Krupenkin、Aleksandr Kapitonov、Evgeny Radchenko、Alisher Khassanov、Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov、Ivan Berman、Sergey Lonshakov、Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov、Ivan Berman、Vitaly Bulatov、Sergey Lonshakov、Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich、Sergey Lonshakov、Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov、Sergey Lonshakov、Aleksandr Krupenkin、Ivan Berman",
  "The latest Robonomics news here.": "最新のRobonomicsニュースはこちら。",
  "Follow us": "フォローする",
  "Video tutorials, screencasts, interviews, events.": "ビデオチュートリアル、スクリーンキャスト、インタビュー、イベント。",
  "Watch videos": "動画を見る",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "私たちやコミュニティとチャットしてください。質問や提案について自由に話し合ってください。",
  "Join chat": "チャットに参加する",
  "Medium Blog": "Mediumブログ",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "Robonomics、Ethereum、Polkadotネットワーク、グリーンマーケット、ロボット工学、およびRobonomicsに関連するすべてについての私たちの過去、現在、未来のビジョン。",
  "Read": "読む",
  "Telegram chat": "Telegramチャット",
  "Local communities & news. You are welcome!": "ローカルコミュニティとニュース。お気軽にご参加ください！",
  "Updated use cases for connected robots within web3 technologies.": "Web3テクノロジー内の接続されたロボットの最新のユースケース。",
  "17 use cases for connected robots within Polkadot and Ethereum.": "PolkadotとEthereum内の接続されたロボットのための17のユースケース。",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "ここでは、サイバーフィジカルシステムのアイデア、製造のスケーリングへの支援方法、およびロボットの責任について説明しています。",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "ここでの基準は、自動化された世界で生活するためには自由経済原則だけで十分であるということです。ロボットは私たちの友達になることができ、それを快適で信頼性のあるものにするために中央集権は必要ありません。",
  "On the Way to Sovereign Home Automation": "主権的なホームオーメーションへの道",
  "World Economic Forum Annual Meeting 2022": "世界経済フォーラム年次総会2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "IoTアプリケーションのためのパラチェーンになること",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021（Robonomics主催）",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021（Robonomics主催）",
  "Transition to Multinetwork — Along Came Polkadot": "マルチネットワークへの移行-ポルカドットがやってきた",
  "The Rise of Robonomics Network": "Robonomics Networkの台頭",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop ‘The Economy of Robots’": "欧州議会ワークショップ「ロボットの経済」",
  "Consensus 2018 conference": "Consensus 2018カンファレンス",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MITメディアラボでのブロックチェーンに関するシンポジウム",
  "Robonomics-2018 summer school hosted by Robonomics.": "Robonomics-2018夏季学校（Robonomics主催）",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Web3テクノロジーとロボットフレームワークの結びつけ",
  "Playing with Human-Machine Interaction through Ethereum": "イーサリアムを通じた人間と機械の相互作用の実験",
  "Fronius Solar.web integration with Home Assistant": "Fronius Solar.webとHome Assistantの統合",
  "RUST for ROS2": "ROS2のためのRUST",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "このケースを開発する際の目標の一つは、RobonomicsをROS 2ミドルウェアに変えることです。これにより、ブラウザから直接ROS 2を実行できるdappを作成することができます。",
  "Eisenkoch, the robot chef": "ロボットシェフEisenkoch",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "2つのワッフルアイロンを装備し、5-7分で6つのワッフルを焼くロボットの実際のケース",
  "Blockchain-powered smart coffee machine": "ブロックチェーンを活用したスマートコーヒーシン",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics Networkに統合されたスマートコーヒーマシン。このプロジェクトは、実際の例を通じてRobonomicsのIoT領域でのポテンシャルを示すことを目指しています。",
  "Water environmental inspector": "水環境検査官",
  "Air monitoring network": "空気モニタリングネットワーク",
  "Production quality control platform “Feecc”": "製造品質管理プラットフォーム「Feecc」",
  "Backup and archiving service for robotics companies": "ロボット企業向けのバックアップおよびアーカイブサービス",
  "Public lab with Boston Dynamics Spot": "ボストンダイナミクスのSpotを使用したパブリックラボ",
  "Autonomous telescope service": "自律望遠鏡サービス",
  "Smart home secure remote control and backup service": "スマートホームの安全なリモートコントロールおよびバックアップサービス",
  "Blockchain as quality control system for chemistry": "化学の品質管理システムとしてのブロックチェーン",
  "Real CO2 emissions reduction with blockchain-proven certificates": "ブロックチェーンによる証明書を用いた実際のCO2排出削減",
  "Robot-artist Gaka-Chu": "ロボットアーティストGaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "デモ「富士山の天気を知る」",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Robonomicsの作者たちが伝えようとした主なアイデアは、現在の経済レベルから完全に自動化されたサービスへの自然で論理的であり、 seemingly inevitableな進化です。自動化されたサービスは、人間の経済の言語を話す能力と、世界中でさまざまな操作を行うための機械独自の経済を持つ必要があります。これは人間には利用できない速度で行われます。",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "インターネット・オブ・シングスの開発と適用により、典型的な問題の解決だけでは十分ではないことが示されました。以前のミスと特定の欠点に基づいた、完全に新しい概念と原則が現在に至るまでに生まれました。この便利なアプローチは、スケーラビリティ、プライバシー、セキュリティに関連するいくつかの重要な欠点を持っていることがわかりました。これらの問題を解決するために、データ処理、ロジック、計算を使用する場所の近くに持ってくることが提案されました。したがって、フォグとエッジコンピューティングの概念が生まれ、クラウドとデバイスの間に中間システムが導入され、クラウドの一部の機能を引き継ぎました。したがって、エッジシステムの作成は、インターネット・オブ・シングスの構築における新たな課題の1つとなりました。",
  "the Robonomics Parachain portal": "Robonomics Parachainポータル",
  "3. Managing blockchain-verified carbon footprint offset": "3. ブロックチェーンで検証された炭素排出量オフセットの管理",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "同様のプロジェクトとの協力も続きました。RobonomicsとDAO IPCIは、センサーデータの収集と分析のためのサービスを導入しました。",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "そして科学的に興味深いのは、企業の規模に市場が課す制限のアイデアを基にすると、CPSの増加の限界は常に市場によって決定されると言えることです。これには他に何も必要ありません。",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "私たちの実験の一つの例は、渋滞を減らすために自律型車両の道路スペースと優先通行権の支払いを交渉することです。人間が交通で絶対にしないことを、車は困難なく行います。車線を変更したい場合、あなたの車と隣人の車は、その操作のコストに関するオファーを数百回のメッセージの速度で交換し、均衡価格を明らかにします。そして、あなたはすでに次の速い車線にいます。これは、今ではuberで乗車を「充電」し、より速くすることができるようになりました。",
  "Important news and announcements": "重要なニュースと発表",
  "Robonomics White Paper": "Robonomicsホワイトペーパー",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "ここでは、2018年5月に発表された非常に初期のRobonomicsホワイトペーパーを無料でダウンロードできます。その後も多くの進化がありましたが、Robonomicsの基本原則はこの論文でまだ概説されています。",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu：自営業自律型ロボットアーティスト",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "非ノロノミックロボットのチームによる移動環境境界の協力的な勾配フリーローカリゼーションとトラッキング",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "ロボットサービス：クラウドからピアリング技術へ",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "分散台帳技術を用いた群れる自律型海洋船舶による信頼性のある環境モニタリング",
  "Digital Passport for Unmanned Vehicles": "無人車両のデジタルパスポート",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "無人車両の交通管理のためのブロックチェーンベースのRobonomicsプラットフォーム",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "ブロックチェーンベースのマルチエージェントロボットシステムに向けて：分析、分類、応用",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "分散型技術に基づく新しいパラダイムのスマートシティ向けロボットサービス",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "市場メカニズムを利用した工場内の分散型自律エージェントネットワークの組織化のためのプロトコル",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "ブロックチェーンベースのRobonomicsに向けて：自律エージェントの行動検証",
  "Transforming Climate Finance and Green Investment with Blockchains": "ブロックチェーンを活用した気候ファイナンスとグリーン投資の変革",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics：サイバーフィジカルシステムを人間の経済に統合するプラットフォーム",
  "Blockchain based protocol for economical communication in industry 4.0": "産業4.0における経済的コミュニケーションのためのブロックチェーンベースのプロトル",
  "Robonomics based on blockchain as a principle of creating smart factories": "スマート工場の作成原則としてのブロックチェーンベースのRobonomics",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "炭素市場、環境資産、権利、負債のためのブロックチェーンエコシステム：コンセプト設計と実装",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "UAVからなるマルチエージェントシステムのための自律ビジネス活動のブロックチェーンベースのプロトコル",
  "English": "英語",
  "Russian": "ロシア語",
  "Chinese": "中国語",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomicsは、シンプルなIoTサービスと複雑なロボット技術の両方を容易にするオープンソースプラットフォームです。人間またはロボットであるエージェント間の効果的なコミュニケーションを実現します。このシステムにロボットを統合するために、私たちはROSを利用しています。本記事では、RobonomicsをROS 2に統合するためのプロセスの概要を提供することを目指しています。",
  "Why ROS 2 in Robonomics?": "RobonomicsでROS 2を使用する理由",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ロボットオペレーティングシステム（ROS）は、ロボット工学のための最も古いオープンソースフレームワークの1つです。これは、ロボットが動作するためのソフトウェアライブラリとツールのコレクションです。基本的な機能から高度な機能まで備えており、プログラマーに便利なツールが付属しています。世界中の大学でロボット工学の教育や研究に広く使用されており、確立されており、さまざまな種類のロボットと連携し、開発者の大きなコミュニティがあります。",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "ROSは2007年に開始されて以来、ロボット工学の分野やROSコミュニティ内で重要な変化がありました。これらの変化に対応するために、ROS 2が導入され、ROS 1の強みを活かしながらその制約に対処しています。私たちはRobonomicsでROSを最初から利用してきましたが、今度はROS 2に移行する時期です。",
  "You might find this interesting": "これは興味深いかもしれません",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "多くの種類のロボットをサポートするオープンソースのロボットや複雑なロボットプラットフォームが数多くあります。これにより、特定の目標を達成するための印象的なマルチロボットシステムを作成することができます。のために",
  "the most current list of supported robots": "サポートされているロボットの最新リスト",
  "please visit the ROS website.": "ROSのウェブサイトをご覧ください。",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Robonomicsフレームワーク内でROSがどのように使用されているかを見てみましょう。Robonomicsは異なるレイヤーとして機能し、システム全体を描写します。",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "「マシンインターフェース」レイヤーでは、ロボットとソフトウェアをシームレスに接続するためのツールが必要です。ROS 2は、このタスクに完璧に適した堅牢な開発者ツールを提供しています。",
  "Robonomics packages for ROS and ROS 2": "ROSとROS 2のためのRobonomicsパッケージ",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "マルチロボットシステムの構築には、さまざまなベンダーのデバイスを接続するという課題がよくあります。また、同じベンダー内のデバイスでも、異なるプロトコルを使用する場合もあります。スマートホームのセットアップや自動化製造など、マシン間の効果的なコミュニケーションは重要です。ROS（そしてもちろんROS 2）は、これを解決するためのさまざまなモードを提供しています。ROSがノード間の通信を管理する一方で、タスクをカスタマイズできたらどうでしょうか？",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Robonomicsチームは、ロボットをよりスマートにし、必要に応じて特定のタスクを処理するために、ROS用のさまざまなパッケージを作成しました。ROSで達成したタスクについては、R＆Dケースページをご覧ください。ロボットとのほぼすべてのインタラクションはROSに依存しています。GitHubで公開されているオープンソースのRobonomicsパッケージをROSで見つけることができます。以下にくつかの例を示します。",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Robonomics通信スタックには、経済的な通信目的のためのROSパッケージが含まれています。",
  "Robonomics' contribution in the ROS 2 community": "ROS 2コミュニティへのRobonomicsの貢献",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomicsは、ロボット工学とWeb3技術を組み合わせ、これらの領域で成長を目指しています。ROS 2の導入以来、ROS 2コミュニティをサポートし、Robonomicsの機能を向上させるために3つの主要な課題を特定しました。",
  "Creating ROS 2 tools for Rust:": "Rust向けのROS 2ツールの作成：",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "これらのツールにより、開発者はRustを使用してROS 2アプリケーションを作成することができます。Rustを選んだ理由やこのプロジェクトの重要性については、詳細をご覧いただけます。",
  "additional details": "さらなる詳細",
  "Developing Robonomics Middleware for ROS 2:": "ROS 2向けのRobonomicsミドルウェアの開発：",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "これは、RobonomicsをROS 2を使用したさまざまなマルチエージェントロボットシステムにシームレスに統合するために重要な役割を果たします。これにより、ロボットをWeb 3ブロックチェーン技術に統合する際のエラーを減らし、時間とコストを節約することができます. ",
  "Creating a robotics lab with ROS 2:": "ROS 2を使用したロボティクスラボの作成： ",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "ROS 2がロボティクスコミュニティで人気を集めるにれて、ROS 2と連携するロボットやハードウェアが増えることを期待しています。私たちの目標は、Robonomicsを使用してそれらをWeb3エコシステムに接続することです。 ",
  "Research papers": "研究論文",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "日常生活に統合できる複雑なシステムの進歩は、学術研究なしでは目的を失ったり、リスクをもたらす可能性があります。私たちは方向性、目標、潜在的な影響を慎重に考慮する必要があります。Robonomicsが活動する領域、具体的にはロボティクス、経済関係、Web3技術は、個別に研究する価値があります。それらがどのように統合され、私たちの生活にどのような影響を与えるかを探求する必要があります。",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "このケースは現在進行中です。ニュースを見逃さないでください — 下のボックスで更新を購読してください",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "「Robonomics Coffee」は、Robonomics Networkに統合されたスマートコーヒーマシンです。このプロジェクトは、実世界の例を通じてRobonomicsのIoT領域での潜在能力を示すことを目指しています。」",
  "We invite you to contribute to the development and promotion of Robonomics in the international arena for cooperation.": "私たちは、国際的な協力のためにRobonomicsの開発と普及に貢献していただくことをお願いします。",
  "Learn": "学ぶ",
  "Theory & practice from Robonomics": "Robonomicsからの理論と実践",
  "Make content": "コンテンツを作成する",
  "Documentation, instructions, tutorials, Localization, scientific papers": "ドキュメンテーション、手順、チュートリアル、ローカライゼーション、科学論文",
  "Communicate": "コミュニケーションする",
  "Online and offline (meetups, conferences, social networks, collaborations)": "オンラインおよびオフライン（ミートアップ、カンファレンス、ソーシャルネットワーク、共同作業）",
  "Get rewards": "報酬を得る",
  "XRT reward every month, extra bonuses and gifts for top 5 ambassadors": "毎月のXRT報酬、トップ5のアンバサダーには追加のボーナスとギフトを提供",
  "Get your role, ambassador": "あなたの役割、アンバサダーを手に入れる",
  "How to become an ambassador?": "アンバサダーになる方法は？",
  "Tell us more about you": "あなたについてもっと教えてください",
  "Fill out the questionnaire": "アンケートに記入する",
  "Start": "始める",
  "Wait for your invitation to the special Discord chat for ambassadors": "アンバサダー用の特別なDiscordチャットへの招待を待つ",
  "The number of participants in the program is limited": "プログラムへの参加者数には制限があります",
  "For content makers": "コンテンツ作成者向け",
  "What you may do:": "あなたができること：",
  "1) work with technical documentation, instructions and tutorials;": "1）技術文書、手順、チュートリアルとの作業；",
  "2) translate content into your native language;": "2）コンテンツを母国語に翻訳する；",
  "3) make scientific papers based on Robonomics technologies;": "3）Robonomics技術に基づいた科学論文を作成する；",
  "4) popularize ideas of Robonomics.": "4）Robonomicsのアイデアを広める。",
  "How:": "方法：",
  "1) make pull requests on GitHub for": "1）ウェブサイト、ウィキのためにGitHubでプルリクエストを作成する；",
  "website": "ウェブサイト",
  "wiki": "ウィキ",
  "2) discuss what we need to translate in ambassador chat;": "2）アンバサダーチャットで翻訳が必要なものを議論する； ",
  "3) create video and text content, try to make it unique for your followers;": "3）ビデオやテキストコンテンツを作成し、フォロワーにとってユニークなものにする； ",
  "4) share progress with other ambassadors and team.": "4）他のアンバサダーやチームと進捗を共有する",
  "For community helpers": "ミュニティヘルパー向け",
  "1) organize local offline meetups and hackathons based on Robonomics technologies;": "1）Robonomics技術を基にした地域のオフラインミートアップやハッカソンを組織する；",
  "2) participate in thematic conferences on behalf of Robonomics;": " 2）Robonomicsを代表してテーマに沿ったカンファレンスに参加する； ",
  "3) work online with community: online meetups and hackathons, chat administration, forum moderation, various social networks;": "3）オンラインでコミュニティと協力する：オンラインミートアップやハッカソン、チャットの管理、フォーラムのモデレーション、さまざまなソーシャルネットワーク；",
  "4) communicate with other projects for collaboration.": "4）他のプロジェクトとの協力のためにコミュニケーションする",
  "1) make your suggestion in ambassador’s chat;": " 1）アンバサダーチャットで提案をする；",
  "2) get merchandise if needed for offline events;": " 2）オフラインイベントのために必要な場合は商品を入手する；",
  "3) share progress with other ambassadors and team.": "3）他のアンバサダーやチームと進捗を共有する。",
  "Get all our support and visual materials in ambassador’s chat": "アンバサダーチャットでの全面的なサポートとビジュアル資料を入手する",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": " まず、自動化システムのネットワーク接続に最も関連する領域について見学を行う必要があります。その後、IoTの基礎を見て、IoTシステムの作成者が直面する問題と主な課題を明らかにし、それらの解決策に焦点を当てます。Robonomicsはその解決策を目指しています。",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "コーヒーマシンを自律型のロボットデバイスに変えるための戦略 ",
  "via the Datalog function": "Datalog機能を介して ",
  "When the concept extends beyond the office": "コンセプトがオフィスを超えるとき  ",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "以下は、私たちの統合を通じて炭素排出量のオフセットがどのように行われるかを示す具体例です。成功した場合、   は次のように展開されます：",
  "transaction": "トランザクション ",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "エネルギー消費は私たちの炭素排出量の大部分を占めており、企業は環境にやさしい取り組みをする必要があります。エネルギー使用を追跡し、炭素排出量を補償するのに役立つシステムを持つことで、オフィスビルの環境への影響を大幅に減らすことができます。適切なアプローチを採用することで、企業はより環境にやさしい未来に貢献することができます。",
  "unfolds as follows:": "次のように展開します",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": " オフィスでのエネルギー使用の削減は、炭素排出量の補償と同じくらい重要です。エネルギー効率の良い照明や機器の使用、オフィス機器の適切なメンテナンスなど、小さな変更を行うことでこれを実現することができます。",
  "The way forward": "進むべき道",
  "logos and assets": "ロゴとアセット",
  "Download the Robonomics logos here. We've got two options for your": "こちらからRobonomicsのロゴをダウンロードしてください。2つのオプションがあります。",
  "basic needs": "基本的なニーズ",
  "and one designed for": "そしてXRTトークン向けにデザインされたものがあります。さらに、優れたRobonomicsブランドのための最適な",
  "XRT": "カラーパレット",
  "token. Additionally, discover the optimal": "を見つけてください。",
  "color palette": "Robonomicsロゴ",
  "for the distinguished Robonomics brand": "すべての",
  "Robonomics logos": "XRTロゴ",
  "Download all": "をダウンロードする",
  "XRT logos": "推奨カラーパレット",
  "Recommended color palette": "おすすめのカラーパレット"
}