{
  "What is Robonomics network?": "O que é a rede robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "A Robonomics é uma plataforma de código aberto para aplicações IoT. Oferecemos suporte a uma nova geração de tecnologias da internet (Web3) que implementam a troca de informações técnicas e econômicas na forma de transações atômicas entre aplicações do usuário, serviços da Internet e robótica complexa.",
  "Serverless IoT applications for users": "Aplicativos de IoT sem servidor para usuários",
  "Timeline": "Cronologia",
  "User (D)App": "Usuário (D)App",
  "Function request": "Solicitação de função",
  "Report": "Relatório",
  "Control": "Controle",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Aplicação descentralizada",
  "Digital twin": "Gêmeos digitais",
  "IoT / Smart device": "Dispositivo IoT / inteligente ",
  "Robonomics tokenomics": "Tokenomia da Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "é o token de utilidade que tornará possível controlar dispositivos IoT no topo da rede Ethereum e na parachain Robonomics no ecossistema Polkadot.",
  "The task": "A tarefa",
  "Be aware of scammers": "Esteja atento aos golpistas",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "por favor, use apenas mercados bem conhecidos para trocar XRT. Não envie seus tokens para contas que lhe são fornecidas em mensagens privadas, qualquer que seja a transação que você gostaria de realizar (comprar ou vender tokens). Se você recebeu alguma 'mensagem estrondosa' sobre o token da Robonomics (os golpistas costumam usar algo como anúncio de airdrop), por favor, verifique este website (https://robonomics.network/) ou nosso ",
  "for official updates. Be careful, be safe.": "para atualizações oficiais. Tenha cuidado, esteja a salvo.",
  "XRT in Ethereum": "XRT na Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Ao implementar o projeto Robonomics em 2015 - 2018, a equipe do projeto precisava encontrar uma conexão entre o fornecimento de uma função útil pela Rede Robonomics, ou seja, o lançamento de dispositivos IoT de acordo com o modelo robot-as-a-service, e o reembolso dos custos para os provedores da Robonomics pelas taxas de gás na Ethereum. Precisávamos pensar no ciclo de vida da responsabilidade de cada dispositivo inteligente individual para realizar um serviço. Como resultado do início da P&D na Robonomics, a equipe criou um mecanismo para minerar novos tokens para recompensar cada contrato inteligente de robot-as-a-service. Este modelo continua viável para o futuro da Robonomics na Ethereum, mas somente com melhorias significativas na Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Leia isto para conhecer o histórico e os planos de longo prazo da equipe para o XRT no ecossistema Ethereum.",
  "Etherscan profile": "Perfil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Veja o contrato inteligente do token e as transações na rede Ethereum aqui.",
  "Coingecko markets": "Mercados na Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Aqui você pode encontrar os mercados CEX e DEX para negociar XRT.",
  "XRT In Polkadot": "XRT na Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Mudando da Ethereum para a Polkadot, precisamos fazer uma 'escalada' na tokenomia. As parachains no ecossistema Polkadot não são o equivalente a um contrato inteligente, mas são uma blockchain totalmente programável que aluga um segmento da rede geral.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "O pagamento real por parte das parachains Polkadot e Kusama é a união a longo prazo de tokens nativos da Relay chain (DOT / KSM) em quantidade suficiente para ganhar um dos leilões. O XRT na parachain Robonomics auxilia na renovação do slot e recompensa às partes interessadas. O mecanismo de queima dos XRT subjacente à ativação de assinaturas IoT é projetado para reduzir a inflação ao mínimo e, em caso de aumento de juros, a zero.",
  "Learn more": "Saiba mais",
  "in Twitter thread from our network architect.": "no Twitter do nosso arquiteto de rede.",
  "Usage:": "Utilização:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT pode ser usado tanto para pagar taxas pela realização de transações na parachain quanto para comprar uma assinatura IoT que garanta o processamento prioritário de dispositivos ou transações IoT do usuário.",
  "Rewards:": "Recompensas:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Ao longo do ano, a parachain emite uma pequena quantidade de XRT para incentivar os coletores (collators) da parachain.",
  "The parameter of the total reward": "O parâmetro da recompensa total",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "para os coletores durante o ano é determinado pela votação on-chain dos detentores de tokens, e pode ser alterado através da realização de um referendo.",
  "Use XRT": "Utilizar XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Compre a assinatura IoT em nosso aplicativo descentralizado. Controle seus dispositivos inteligentes via blockchain sem que nenhuma corporação centralizada observe.",
  "Subscan profile": "Perfil Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Visualize estatísticas do token no topo do ecossistema Polkadot.",
  "Other questions": "Outras perguntas",
  "What is RWS?": "O que é RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Em desenvolvimento da funcionalidade principal] Para engenheiros, a equipe do Core Dev tentará fazer diferentes modelos de uso da Robonomics e o primeiro passo desta forma é lançar o token de assinatura vitalício - o token RWS. Cada token RWS lhe dará 1 transação por segundo (tps) de/para seu dispositivo IoT por meio da Parachain Robonomics. Ative seu token RWS e faça transações 'grátis' com pré-execução e latência previsíveis. Desative o token RWS e negocie-o em uma DEX.",
  "What is AIRA/AIR ID?": "O que é AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Um token pré-XRT distribuído em 2017 como parte autônoma da futura infra-estrutura da Robonomics na Ethereum. Após o lançamento bem-sucedido da Robonomics na Ethereum em 2019, os tokens AIRA foram conectados à infra-estrutura criada do projeto através de",
  "ambix smart contract": "um contrato inteligente ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "que garantiu um processo autônomo e independente de troca do pré-XRT para o XRT  ERC-20.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "do token da Robonomics é garantir a operação de uma rede descentralizada para a manutenção de Cidades Inteligentes e Indústria 4.0 na infraestrutura blockchain. Para atingir este objetivo, a economia do token precisa refletir os incentivos para a implementação da rede.",
  "Token distribution": "Distribuição de tokens",
  "Try our Dapp": "Experimente nosso Dapp",
  "In addition": "Além disso",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "você pode operar XRT dentro de blockchains usando ferramentas fornecidas por diferentes equipes independentes nas comunidades Polkadot (Kusama) e Ethereum.",
  "Within the Kusama network, you have the capability use": "Dentro da rede Kusama, você tem a capacidade de usar",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "comunicação entre a parachain Robonomics e outras parachains usando várias aplicações descentralizadas (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Dentro da rede Ethereum, você pode usar aplicativos descentralizados alimentados pelo",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "A aplicação descentralizada (dapp) funciona dentro da Blockchain. É de fonte aberta e os seus dados são servidos em IPFS e Github. Estas tecnoligias permitem que a aplicação seja segura e transparente ao mesmo tempo. Os nossos criadores estão a trabalhar tanto no desenvolvimento da aplicação Robonomics como nas bibliotecas que pode utilizar na construção da sua própria dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "O Gêmeo Digital (Digital Twin) é um dos instrumentos fornecidos pela Robonomics Web Services (RWS). Ele atua como uma versão digital do equipamento do mundo real e copia todas as suas características técnicas. Ele permite tornar um aplicativo descentralizado mais responsivo aos comandos do usuário.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Você pode usar a Robonomics com uma ampla gama de dispositivos inteligentes Zigbee para automatizar e controlar vários aspectos de sua casa/escritório ou usá-la com robótica baseada em ROS para tarefas industriais mais complexas.",
  "Do Androids Dream of Electric Sheep?": "Os Andróides Sonham com Ovelhas Elétricas?",
  "Your email": "Seu email",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "O ano começou com uma grande conquista - a Robonomics venceu o 20º leilão de slots de parachain e",
  "officially became": "tornou-se oficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "uma parachain com a ID 2048 na rede Kusama. As funções de lançamento, registro de dados (datalog), Gêmeo Digital (DigitalTwin), responsabilidade (liability) e assinaturas IoT estão disponíveis para todos os usuários do ecossistema. Para fornecer detalhes para esta fase do projeto, a equipe principal publicou os primeiros capítulos do",
  "Robonomics Whitepaper 2.0.": "Whitepaper 2.0 da Robonomics",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "A Robonomics 2.0 em Substrate foi lançada com suporte para mensagens XCM, e começamos a abrir canais HRMP com outras parachains (como Crust, Shadow e Darwinia), cuja funcionalidade é extremamente útil para nós.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Ao mesmo tempo, revelamos uma estratégia para introduzir o mercado de IOT em nosso protocolo. Nossas experiências com equipamentos de IoT nos levaram ao conceito de uma casa inteligente soberana, que é independente dos provedores de serviços de nuvem centralizados. Desenvolvemos nossa",
  "integration": "integração",
  "with the Home Assistant automation system, and also designed our own": "com o sistema de automação Home Assistant, e também projetamos nosso próprio",
  "IoT gateway": "gateway IoT",
  "for connecting smart devices.": "para conectar dispositivos inteligentes.",
  "We have launched two big initiatives in order to increase community engagement —": "Lançamos duas grandes iniciativas para aumentar o envolvimento da comunidade —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "o Programa de Embaixadores da Robonomics",
  "Additionally,": "Além disso, o ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "foi realizado no outono, para que a comunidade Robonomics pudesse experimentar nossos mecanismos de governança pela primeira vez. Recentemente, a equipe da Robonomics ajudou o projeto DAO IPCI a obter um slot de parachain, para apresentar o serviço de compensação de carbono para edifícios inteligentes.",
  "In 2021, our": "Em 2021, nosso",
  "main focus": "foco principal",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "mudou para preparar o projeto para que os aplicativos de IoT pudessem ser usados por meio de nossa parachain na rede Kusama. A Robonomics 1.0 em Substrate foi lançada e estamos testando a conexão de sensores na parachain para enviar seus dados de telemetria, além de desenvolver a funcionalidade de gêmeo digital. Na metade do ano, decidimos testar o ciclo completo de nossa rede e criamos nossa própria relay chain chamada",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "à qual a parachain Robonomics foi integrada (antes de ser migrada para a relay chain Kusama). Houve muito foco em conseguir uma vaga de parachain na Kusama, para a qual organizamos várias campanhas de crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Houve duas grandes mudanças para a comunidade. Em primeiro lugar, lançamos o",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "que permite que projetos Web3, de robótica e IoT recebam financiamento para tarefas de P&D (Pesquisa e desenvolvimento). Até o final do ano, quatro projetos ativos participavam do programa. Em segundo lugar, a equipe iniciou o",
  "Exodus process": "processo Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "permitindo que os detentores de tokens na Ethereum transferissem seus tokens XRT para a parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Entre as colaborações, podemos recordar a notável aparição do Boston Dynamics Spot da MerkleBot, para a qual foi desenvolvido um",
  "rental remote control system": "sistema de controle remoto de aluguel",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Também gostaríamos de informá-lo sobre a empresa Multi-Agent Systems, que é um projeto pessoal formado por uma equipe de engenheiros da Robonomics. Eles desenvolveram um robô chamado Eisenkoch, que prepara waffles em uma cafeteria.",
  "There came a time when the existing limitations of Ethereum": "Chegou um momento em que as limitações existentes da Ethereum",
  "began to stand out clearly": "começaram a se destacar claramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(em particular, baixa escalabilidade, baixa velocidade e custo de transações muito alto). A atualização para a ETH2.0 deveria corrigir a situação, mas esta atualização foi repetidamente adiada. Embora não quiséssemos sair da rede Ethereum, percebemos que na situação atual era difícil implementar nossos casos de uso e começamos a procurar uma rede alternativa. O ecossistema de blockchain fragmentada de Polkadot se tornou essa alternativa. Começamos experimentando o framework Substrate para migrar os principais recursos da Robonomics e implantar nossa própria rede de teste. No final desta etapa, implantamos nossa parachain na rede de teste Rococó e começamos a nos preparar para obter um slot na rede Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando a estudar os sistemas de IoT, identificamos a principal funcionalidade da Robonomics, que pode agregar valor aos usuários - a função de nuvem descentralizada para IoT. Esta ideia formou a base da ",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "A infra-estrutura RWS assumiu todas as funções de uma nuvem centralizada típica, mas sem os problemas padrão de disponibilidade global, segurança e privacidade. Além disso, tivemos a ideia de assinaturas IoT da parachain que permitem que os titulares de assinaturas usem a rede blockchain sem precisar pagar uma taxa por cada transação. O primeiro experimento com as assinaturas IoT foi a emissão do token RWS, que permite que seu proprietário envie 1 transação por bloco. Além disso, começamos a dar os primeiros passos para desenvolver nosso próprio kit de hardware para o controle de dispositivos inteligentes (o conceito DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Naturalmente, o apoio à Robonomics na Ethereum não parou. A pilha de comunicação da Robonomics foi finalizada para a versão",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "O token XRT começou a ser negociado em várias bolsas (em particular, na DEX Uniswap), e o programa de incentivo à liquidez foi lançado.",
  "The team actively developed ways to interact with the community. The first version of our": "A equipe desenvolveu ativamente formas de interagir com a comunidade. A primeira versão de nosso site",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "e Robonomics Wiki foi lançada. Para uma gestão de projetos mais transparente e conveniente, começamos a utilizar a",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Hospedamos a ",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "em 2019 para os recém-chegados ao projeto.",
  "Robonomics became the foundation for the": "A Robonomics se tornou a base do projeto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "que está desenvolvendo um sistema para o leasing inteligente de equipamentos robóticos.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Entendemos que os agentes autônomos precisavam de um ambiente que garantisse suas operações técnicas e econômicas confiáveis. Por vários anos, tínhamos desenvolvido um protocolo para criar uma rede descentralizada de fornecedores que ajudassem os agentes robóticos a fornecer seus serviços. Foram desenvolvidas ferramentas para a manutenção da rede e para a pilha de comunicação entre Ethereum e o ROS (Sistema Operacional de Robôs). Em 2018 publicamos o",
  "Robonomics Whitepaper": "Whitepaper da Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "e a versão alfa da Rede Robonomics foi lançada na rede principal da Ethereum. Os preparativos ativos para o evento da geração de tokens XRT (que acabou acontecendo na primavera de 2019 devido ao primeiro inverno criptográfico) continuaram.",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "A partir deste período, a Robonomics começou a desenvolver dinamicamente casos de uso relacionados à Indústria 4.0 - fábricas inteligentes, cidades inteligentes e residências inteligentes - e isto trouxe nossa atenção para o mundo da IoT. Em busca de inovação, a equipe apresentou várias demonstrações grandes e únicas de P&D: uma",
  "sensor network": "rede de sensores civis",
  "a water drone": "un drone aquático",
  "for environmental monitoring (supported by a sensor systems manufacturer": "para monitoramento ambiental (apoiado por um fabricante de sistemas de sensores",
  "a smart factory model": "um modelo de fábrica inteligente",
  "a self-employed": "um",
  "robot artist Gaka-chu": "artista robô autônomo, Gaka-chu",
  "and a": "e",
  "drone traffic management system": "um sistema de gerenciamento de tráfego de drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "A Robonomics iniciou a cooperação com o projeto DAO IPCI no gerenciamento de ativos ambientais usando tecnologias Web3 e dispositivos de IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Este foi um período ativo de P&D durante o qual identificamos uma série de tarefas, nas quais as tecnologias P2P têm capacidades que antes não estavam disponíveis para robótica. Combinando o computador Ethereum, armazenamento de arquivos IPFS e o ROS, percebemos que qualquer dispositivo poderia potencialmente se tornar um",
  "autonomous intelligent robot agent": "agente robótico inteligente autônomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Por sua vez, isto nos abriu o caminho para os conceitos de Robot-as-a-Service e economia dos robôs.",
  "Our publications in scientific journals of this period are available in the": "Nossas publicações em periódicos científicos deste período estão disponíveis na seção",
  "Papers section": "Papers (Artigos)",
  "We have collected all R&D projects over the years in the": "Reunimos todos os projetos de P&D ao longo dos anos em um ",
  "a handy book": "livro prático",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tudo começou com uma ideia que surgiu dos fundadores, quando a Ethereum tinha acabado de lançar sua rede principal. E se um robô realizar uma tarefa para um cliente em troca de criptmoedas, e sua lógica for controlada por um contrato inteligente?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Para testar a ideia, fizemos uma demonstração na qual foi lançado um drone controlado por um computador Ethereum para alcançar as coordenadas GPS especificadas, depois que o usuário completou uma transação de pagamento.",
  "The demo is available on": "A demonstração está disponível no",
  "YouTube": "YouTube",
  "Notable events": "Eventos importantes",
  "Robonomics whitepaper 2022 welcome guide": "Guia de boas-vindas do Robonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Desenvolvemos um protocolo técnico-econômico de comunicação de máquina rodando no topo da Ethereum e do IPFS, e o complementamos com elementos de uma plataforma IoT baseada em nuvem e em parachain de Polkadot. Hoje, já temos uma plataforma híbrida para a criação de aplicações IoT futuristas. Ela proporciona interação com dispositivos sob o controle de um computador global descentralizado. Antes de começarmos a criar aplicações IoT seguras, sem servidores e futuristas usando a plataforma Robonomics, vamos nos aprofundar um pouco na teoria...",
  "Chapter 1.": "Capítulo 1.",
  "At the intersection of cybernetics and economics": "Na interseção entre cibernética e economia",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Apresentamos um sistema econômico no qual os dispositivos robóticos atuam como agentes independentes capazes de realizar atividades econômicas importantes, anteriormente reservadas aos seres humanos. Neste capítulo, falaremos sobre a relevância da economia robótica, que pode se tornar uma parte importante da vida das pessoas e transformar o nível atual da economia em serviços totalmente automatizados no futuro.",
  "In this chapter you will learn": "Neste capítulo você aprenderá",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase e a Natureza da Firma",
  "CPS - cyber-physical system": "CPS - sistema ciber físico",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener e a busca por padrões em coisas vivas e nas máquinas",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "A Quarta Revolução Industrial, Dinheiro para Robôs e Bitcoin",
  "Ethereum Smart Contracts": "Smart Contracts Ethereum",
  "Polkadot Parachains": "Parachains Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Perguntas abertas sobre teleologia e o trabalho de Mises",
  "Read chapter 1": "Leia o capítulo 1",
  "Chapter 2.": "Capítulo 2.",
  "Robonomics architecture": "Arquitetura da Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "No segundo capítulo, você lerá sobre a interação homem-máquina usando a moderna tecnologia da Internet - desde dispositivos IoT até uma rede de provedores descentralizada e globalmente acessível. Analisaremos o básico da Internet das Coisas para destacar os problemas e os principais desafios enfrentados pelos criadores dos sistemas de IoT e para a solução da qual Robonomics se propõe.",
  "Overview of the state of the Internet of Things (IoT)": "Visão geral do estado da Internet das Coisas (IoT)",
  "Classification of IoT devices": "Classificação dos dispositivos IoT",
  "Embedded IoT systems": "Sistemas IoT integrados",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: Gateways e controladores IoT",
  "Autonomous Systems": "Sistemas Autônomos",
  "Internet of Things providers": "Provedores de Internet das Coisas",
  "Digital twins are the heart of the Internet of Things": "Gêmeos digitais são o coração da Internet das Coisas",
  "IoT data flows in cloud service": "Fluxos de dados IoT no serviço em nuvem",
  "Popular examples of IoT solutions": "Popular examples of IoT solutions",
  "Current problems of building IoT solutions": "Problemas atuais na construção de soluções IoT",
  "Main tasks of Robonomics architecture": "Principais tarefas da arquitetura Robonomics",
  "Basic components of Robonomics architecture": "Componentes básicos da arquitetura Robonomics",
  "A simple representation of Robonomics architecture": "Uma representação simples da arquitetura Robonomics",
  "Read chapter 2": "Leia o capítulo 2",
  "We continue to update the white paper of Robonomics": "Continuamos atualizando o Whitepaper da Robonomics,",
  "stay tuned for new parts on our website and in Discord": "acompanhe nosso site e Discord para ficar informado sobre novas atualizações",
  "Join our discord": "Junte-se ao nosso discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "A seguir, gostaríamos de mostrar a você as áreas práticas de interação homem-máquina usando a moderna tecnologia da Internet. Passaremos da arquitetura familiar de dispositivos IoT de troca de informações técnicas por meio de serviços em nuvem para a organização da interação técnico-econômica por meio de uma rede de provedores descentralizada e globalmente acessível.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Para começar, precisamos fazer uma excursão pela área mais claramente relacionada à conexão de rede de sistemas automatizados. Em seguida, abordaremos os fundamentos da Internet das Coisas para destacar os problemas e principais desafios enfrentados pelos criadores de sistemas IoT e para a solução que a Robonomics se propõe.",
  "Overview of the state of the internet of things (IoT)": "Visão geral do estado da internet das coisas (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "A questão da acessibilidade da rede de dispositivos automáticos tem sido discutida em todo o planeta desde os anos 60, e já naquela época foram feitas tentativas bastante sérias para resolvê-lo. Por exemplo, o ciberneticista soviético Viktor Glushkov propôs e implementou parcialmente a coleta automatizada de informações sobre os volumes de produção de uma planta individual como parte do projeto do sistema nacional de informações",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "nos anos 60 e 70. É amplamente conhecido como a máquina de venda automática da Coca-Cola foi conectada à ARPANET na década de 1980 para que as máquinas pudessem informar a disponibilidade de bebidas e sua temperatura.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Mas ainda assim, o desenvolvimento real da IoT está acontecendo hoje, devido ao uso generalizado de tecnologias facilitadoras. Os principais impulsionadores da rápida evolução dos aplicativos da Internet das Coisas são os resultados do desenvolvimento de muitas áreas – desde comunicações sem fio de várias faixas e dispositivos incorporados, até análise de nuvem e aprendizado de máquina. O número de dispositivos IoT vem crescendo de forma constante nos últimos 10 anos (com previsão de 25 bilhões de unidades até 2030), e isso tem estimulado pesquisadores e desenvolvedores a criar novos aplicativos IoT em diversas áreas, como saúde, automação residencial, agronegócio, proteção ambiental.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Estamos mais interessados no processo de construção de sistemas IoT e nas tarefas que surgem nesse processo. Ao longo dos anos de pesquisa, muitas arquiteturas   diferentes foram propostas e, calculando a média delas, podemos distinguir três componentes básicos de um sistema IoT: dispositivos, infraestrutura de rede, máquinas analíticas, computacionais e de controle.",
  "New challenges": "Novos desafios",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Outro desafio recente para a construção de IoT tem sido o conceito de gêmeo digital – uma versão digital de um equipamento real que copia suas especificações e dados históricos. Este conceito é melhor em áreas onde é necessário ter uma especificação precisa e completa de um processo e ser capaz de prever seu desenvolvimento. A Internet das Coisas atua como o principal integrador de gêmeos digitais, mas essa tarefa é muito mais profunda do que a conectividade usual dos dispositivos IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Neste momento, estamos testemunhando um segmento inteiro da rede, projetado e conveniente não para pessoas, mas para máquinas. A Internet das Coisas não é mais apenas a mecânica de conectar um dispositivo à rede, mas mais serviços, criados e disponibilizados especificamente para os dispositivos. A Internet das Coisas não apenas conecta o usuário e o dispositivo, mas também ajuda os dispositivos a lidar com as tarefas de prestação de um serviço para a pessoa, mas de forma autônoma.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Esses sistemas não têm interfaces de usuário e são normalmente usados no nível mais baixo dos ecossistemas de IoT para fornecer funcionalidades básicas. Tem que ser energeticamente eficiente e pequeno. Ter recursos de computação e comunicação limitados. Os gateways ou controladores de IoT geralmente atuam como receptores de sinal.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Esses sistemas atuam como um elo entre sistemas embarcados localmente acessíveis e a Internet global. Eles normalmente suportam vários protocolos de comunicação de sistemas incorporados e transferem a telemetria dos dispositivos para a nuvem e controlam os sinais para trás. Muitas vezes, esses dispositivos são uma versão mais sofisticada do roteador WiFi, equipado com um computador de placa única para realizar o processamento primário das informações dos dispositivos sem sair da rede local.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Essa classe inclui autômatos complexos (como o Spot da Boston Dynamics), que possuem um componente de controle no nível de um computador completo com processador de alto desempenho e grande quantidade de memória. Nesses casos, o robô está conectado à Internet sem soluções intermediárias adicionais (sistemas edge). O software necessário para acessar a Internet das Coisas é instalado diretamente no computador do sistema autônomo. Os dados são coletados e parcialmente processados localmente e, em seguida, transmitidos para a Internet de forma semelhante a qualquer dispositivo de rede completo.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "O principal trabalho dos provedores de IoT é fornecer aos usuários acesso remoto a dados e análises, bem como o gerenciamento de dispositivos inteligentes pela Internet. Os principais critérios para a qualidade do provedor são a segurança das operações, estabilidade da conexão e disponibilidade do provedor em qualquer lugar do mundo.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "O esquema padrão para trabalhar com um provedor de IoT inclui: instalação de software compatível com o dispositivo inteligente em nuvem, configuração de serviços de gerenciamento do lado da nuvem após a primeira conexão bem-sucedida de um dispositivo, conexão de vários tipos de serviços analíticos.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Falando em gêmeos digitais, deve-se notar que arquitetonicamente sua implementação é necessária; como uma recusa em dar ao usuário acesso direto aos dispositivos de controle e alterar seus estados. Das razões mais óbvias para a rejeição estão, em primeiro lugar, a presença de seus próprios requisitos e condições nos dispositivos pouco antes do lançamento. Em segundo lugar, se vários dispositivos de usuário precisarem acessar uma única fonte de dados, pode ser fundamental fornecer controle personalizado a cada usuário. Por fim, é extremamente útil manter disponível o último estado real do dispositivo caso ele fique fora de operação.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Como resultado, temos uma separação entre o fluxo de troca de informações com o usuário e a geração real de dados reais pelos sensores. Para ilustrar este princípio, abaixo está o processo do usuário que trabalha com um dispositivo IoT usando um gêmeo digital.",
  "IoT data flows in cloud services": "Fluxos de dados da IoT em serviços de nuvem",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Valores de entrada para cloud triggers. Por exemplo, o serviço de nuvem envia várias notificações ao usuário no caso de um relatório de um sensor de alarme de carro sobre uma batida.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Dados de saída para análises complexas que não podem ser produzidas no nível de edge. Por exemplo, ao processar vídeo para reconhecimento facial em uma multidão.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "A base para formar um gêmeo digital do dispositivo para criar um elenco de seu estado. Por exemplo, a pedido do usuário no aplicativo móvel ou no site.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Um tipico sistema doméstico inteligente oferece uma ampla gama de opções para controlar seu espaço de vida. Com sua ajuda, você pode controlar remotamente as fechaduras das portas, configurando acesso único ou regular à sala para a família e amigos e para pessoal de manutenção ou entrega. Com inúmeros sensores e dispositivos de gravação, o sistema é capaz de incluir gravação de vídeo ao acionar sensores de movimento, tomar decisões de forma autônoma para desligar o abastecimento de água quando for detectado um vazamento no sistema de água, iniciar um robô aspirador programado, fornecendo um relatório de limpeza para o aplicativo do usuário, alterar a temperatura ambiente para o valor ideal, dependendo da sua programação.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Carros inteligentes. Fornecendo a eletrônica de bordo do carro com acesso à Internet móvel, o usuário tem acesso ao controle remoto de diversas funções do carro diretamente de seu smartphone: abrir portas, ligar o ar condicionado, controlar os faróis. Se esses carros forem usados para carsharing (compartilhamento de carros), você poderá criar um mapa interativo da localização dos carros com seu status, o combustível restante etc. para os clientes deste serviço.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Sistema inteligente de locação de equipamentos. A empresa instala manipuladores robóticos na linha de transporte mediante contrato com pagamento pelo número de operações ou pelo tempo do robô. Os manipuladores fornecem regularmente um registro das operações realizadas, erros e avisos. A taxa de locação do robô é calculada com base nisso, bem como a manutenção preditiva do fornecedor dos robôs.",
  "Global availability": "Disponibilidade global",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "A arquitetura cliente-servidor padrão requer a especificação de endpoints ao rotear mensagens de dispositivos IoT. Assim, durante a vida útil de um dispositivo inteligente, a falta de conexão significará uma limitação na capacidade de controlar e interagir com o dispositivo.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Por exemplo, a guerra comercial entre a China e os Estados Unidos já é uma espada de Dâmocles pairando sobre milhares de consumidores de aparelhos inteligentes chineses nos Estados Unidos e vice-versa. A qualquer momento, o bloqueio de servidores da Xiaomi pelas autoridades norte-americanas pode afetar usuários de dispositivos que se conectam aos serviços em nuvem do fabricante.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Estando nas imediações de um dispositivo IoT, você não pode controlá-lo a partir de um aplicativo móvel se não houver conexão com os servidores, por meio dos quais são fornecidas a autenticação do usuário e a coleta de telemetria dos próprios dispositivos. Ou seja, o dispositivo é realmente controlado pela nuvem, não pelo usuário.",
  "Cybersecurity": "Cibersegurança",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "A razão mais importante para a baixa segurança cibernética da maioria das soluções de IoT decorre do legado problemático da arquitetura cliente-servidor em nuvem. Por exemplo, a arquitetura de casa inteligente mais comum atualmente é geralmente um hub IoT, conectado a um serviço de nuvem. Assim, um sistema IoT típico é um elemento de controle central conectado a vários ataques de rede externa, ataques DoS (conduzindo o sistema à falha), modificações maliciosas, sequestro de sessão do usuário, etc. ou desastres naturais que causam falhas nos servidores. Também outro ponto definitivamente importante é a necessidade, em princípio, de confiar na nuvem e nas pessoas que a mantêm.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Os servidores de serviços em nuvem estão sujeitos a todos os problemas típicos de segurança cibernética: os dispositivos pertencentes ao mesmo sistema podem ultrapassar centenas ou milhares e, ao mesmo tempo, por sua natureza, os dispositivos IoT têm menos poder de computação, o que dificulta muito a implantação de firewalls e antivírus para eles. Infelizmente, o fator mais pernicioso é o fato de que os dispositivos IoT estão funcionando CPSs, então as ameaças à segurança cibernética estão realmente prontas para se manifestar no nível físico.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Tudo isso é exacerbado pela escala das soluções de IoT. O número de sistemas IoT. Certamente, o serviço de nuvem é mais seguro do que os dispositivos de baixo nível, mas a consolidação do controle centralizado sobre centenas de milhares desses sistemas torna qualquer violação de segurança e vazamento um grande desastre.",
  "Data privacy": "Privacidade de dados",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "O ponto de privacidade precisa ser separado da segurança cibernética, pois esse problema é específico dos sistemas IoT. Devido ao grande número e variados tipos de dispositivos que estão muito mais integrados ao mundo físico do que apenas computadores e smartphones, a gama de tipos de dados privados é multiplicada. Não é mais apenas localização por GPS, registros de compras, transações financeiras e fotos, mas também um registro permanente de vídeos e conversas, impressões de voz, condições de saúde e até uma lista de hábitos de uma pessoa. Entre os tipos de ameaças relacionadas à privacidade estão: identificação de informações, localização e rastreamento, profiling, ataque de inventário, ataque de vinculação de dados.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "A parte mais assustadora é que os usuários têm pouca ou nenhuma consciência de que estão abrindo mão de sua privacidade porque quase não têm ideia de quais dados estão sendo coletados e como estão sendo usados. A ameaça à privacidade cresce não apenas de invasores, mas também de organizações e agências governamentais justamente por causa disso. Os serviços de IoT em nuvem normalmente exigem transferência máxima de dados dos dispositivos e não há maneiras de proibir ou restringir a transferência de dados («Aceite os termos ou vá embora»). Além disso, apesar de os dados coletados serem um ativo e terem valor real, a pessoa de quem são coletados não apenas é negado o direito de dispor ativamente desses dados, mas também é negado qualquer compensação pela coleta e uso de seus próprios dados.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Com base nas conquistas e desafios das plataformas em nuvem, a Robonomics visa oferecer ao mercado de IoT soluções de Internet mais seguras e avançadas em todas as etapas da comunicação homem-máquina. Abaixo estão as principais tarefas para as quais a Robonomics se destina:",
  "Managing an IoT device using a decentralized cloud": "Gerenciando um dispositivo iot usando uma nuvem descentralizada",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "As redes Blockchain têm todos os recursos para fornecer o mais alto grau de segurança para executar um dispositivo e obter sua telemetria. A interação com o dispositivo pode ser descrita alterando o estado do gêmeo digital armazenado na rede blockchain e enviando informações sobre essas alterações. No caso de uma blockchain não permissionada, podemos falar sobre as garantias de disponibilidade global de provedores para IoT, bem como um alto nível de proteção de dados de gêmeos digitais contra alterações indesejadas.",
  "Performing technical and economic transaction between people and machines": "Realizando transação técnica e econômica entre pessoas e máquinas",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Graças ao mecanismo de criptomoedas e smart contracts, podemos fornecer acesso a sistemas automatizados diretamente aos mercados digitais. Por exemplo, a Ethereum já implementa a maioria das ferramentas básicas da atividade econômica que podem ser utilizadas na operação de dispositivos autônomos. Os aplicativos criados para a interação entre o usuário final e o dispositivo IoT serão muito mais eficazes se os termos de serviço e pagamento forem indissociáveis dos parâmetros de lançamento do dispositivo.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Os avanços modernos na tecnologia Web3 podem resolver a questão da privacidade do usuário. Com A Web3 não há necessidade de autenticar ou exigir conexão com servidores específicos para acessar a telemetria e controlar o dispositivo.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics é uma nuvem descentralizada para gêmeos digitais de dispositivos IoT. Robonomics suporta o formato tecnoeconômico para comunicação, além de fornecer aplicativos privados para usuários",
  "A human interface to access the system": "Uma interface humana para acessar o sistema",
  "A communication protocol": "Um protocolo de comunicação",
  "A machine interface": "Uma interface de máquina",
  "Human interface": "Interface humana",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Propomos o uso de aplicativos descentralizados (dapps) como a principal forma de conectar usuários para controlar dispositivos inteligentes pela Internet. Assim, poderemos fornecer a interface de usuário mais segura (em termos de dados) ao sistema, que poderá funcionar simultaneamente nas condições da rede local da cidade e por meio de uma rede global comum.",
  "Communication protocol": "Protocolo de comunicação",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Seu papel é desempenhado pela rede Robonomics, uma especificação desenvolvida pela equipe do projeto que implementa uma rede descentralizada de provedores que fornecem a transmissão, processamento e armazenamento de informações necessárias para executar dispositivos IoT. Na verdade, é uma implementação de um nó de função específica para redes IPFS, Ethereum, e Polkadot.",
  "Machine interface": "Interface da máquina",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Aqui está um diagrama geral do ciclo completo de inicialização do dispositivo usando a plataforma Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "O aplicativo descentralizado do usuário envia uma solicitação para uma função de controle do dispositivo por meio da rede Robonomics.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "A rede Robonomics fornece tradução de solicitações usando libP2P e captura eventos na blockchain Ethereum ou parachain Robonomics.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "O controle do dispositivo é fornecido por uma rede descentralizada, que garante o armazenamento das informações necessárias para a execução do dispositivo IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "O dispositivo IoT recebe independentemente informações das redes Ethereum e Polkadot sobre o estado atual do gêmeo digital. Isso garante que o dispositivo possa ser iniciado com segurança somente após os parâmetros técnicos e econômicos de inicialização terem sido estabelecidos.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Como resultado da operação, o dispositivo IoT publica um log de operações concluídas, que pode ser usado como evidência do serviço prestado ou para depuração de erros.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "O log é transformado em relatório para o usuário e fica disponível em seu dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Construindo DApps & Web Services para IoT na Parachain Robonomics",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, arquiteto de software",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Devemos lembrar que a máquina automática é o equivalente econômico exato do trabalho escravo. Qualquer trabalho que concorra com o trabalho escravo deve aceitar as consequências econômicas do trabalho escravo.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "ciberneticista",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Os robôs são como crianças maduras hoje - eles já podem administrar dinheiro, e entrar em relações jurídicas, ser independentes.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "O futuro da própria humanidade depende de como ensinamos os robôs a controlar suas capacidades.",
  "Robonomics tools": "Ferramentas Robonomics",
  "Operate with digital twins of IoT devices": "Operar com gêmeos digitais de dispositivos IoT",
  "The first tools of the robot economy: money for robots, contracts for robots": "As primeiras ferramentas da economia dos robôs: dinheiro para robôs, contratos para robôs",
  "Software for connecting devices to a decentralized cloud": "Software para conectar dispositivos a uma nuvem descentralizada",
  "API library for custom IoT applications": "Biblioteca API para aplicações IoT personalizadas",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "A Robonomics possui um conjunto completo de ferramentas para o desenvolvimento de aplicações IOT, tanto no lado da robótica quanto no da interface do usuário. A comunicação entre o usuário e o dispositivo acontece utilizando as tecnologias de maior sucesso do mundo Web3 - IPFS, Ethereum, e Polkadot. Assim, os desenvolvedores podem criar aplicações modernas e seguras para Cidades Inteligentes e para a Indústria 4.0.",
  "Robonomics Connectivity": "Conectividade Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Para a conveniência dos desenvolvedores, a Robonomics contém um conjunto de softwares para conexões: dispositivos IoT usando o protocolo HTTP/MQTT, sistemas robóticos complexos usando o Robot Operating System (ROS).",
  "Connect a sensor": "Conecte um sensor",
  "to the Robonomics network": "à rede Robonomis",
  "Try": "Experimente",
  "a simple prototyping tool": "uma ferramenta simples de prototipagem",
  "Start building your own cyber physical system with": "Comece construir seu próprio sistema físico cibernético com o",
  "Aira OS": "Sistema Operacional Aira",
  "Robonomics Supports Hundreds of Robots Out of the Box": "A Robonomics Suporta Centenas de Robôs Exclusivos",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Os usuários da plataforma podem conectar robôs compatíveis com ROS à economia digital em questão de minutos. Para uma lista completa de robôs compatíveis, por favor, siga o link",
  "Decentralized Cloud infrastructure for IoT": "Infraestrutura de nuvem descentralizada para IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) é o serviço básico de infraestrutura para Robótica e IoT na Parachain Robonomics e IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Dapp Robonomics",
  "economy of robots": "Economia dos robôs",
  "Core RWS features available for IoT today": "Principais recursos RWS disponíveis para IoT hoje",
  "RWS PubSub Message Broker": "RWS Intermediário de mensagens PubSub",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Use mensagens ilimitadas através de uma rede P2P baseada no protocolo IPFS",
  "RWS Data Blockchainization Service": "RWS Serviço de blockchainização de dados",
  "RWS Robot Actions": "RWS Atividades de robô",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Ligar / desligar; inicie ou pare seus dispositivos IoT sob o controle de um computador descentralizado",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "O Coração de Sua Aplicação IoT - Gêmeos Digitais na Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Na arquitetura técnica, os gêmeos digitais IoT fornecem visibilidade e monitoramento das coisas e eventos relacionados (por exemplo, usando dispositivos IoT para obter automaticamente a origem de um produto), e a blockchain permite a versão única compartilhada da verdade sobre o estado dessas coisas ao longo de seus ciclos de vida e eventos comerciais associados",
  "from Gartner research": "da pesquisa de Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "A Parachain Robonomics oferece a oportunidade de criar um modelo de gêmeo digital e atualizar seu estado a cada 6 segundos.",
  "Secure": "Secure",
  "Serverless": "Sem Servidor",
  "Futuristic": "Futuristas",
  "IoT applications": "Aplicações IoT ",
  "Robonomics network vision": "Visão da rede Robonomics",
  "At the frontier of cybernetics and economics": "Na fronteira da cibernética e da economia",
  "Build your IoT services on Robonomics platform": "Construa seus serviços iot na plataforma robonomics",
  "taking full advantage of decentralized architecture": "aproveitando ao máximo a arquitetura descentralizada",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "A Robonomics permite que os usuários se conectem a dispositivos inteligentesusando aplicativos descentralizados (dapp) que não exigem a transferência de dadosdo usuário para autenticação. A comunicação ocorre por meio de uma rede descentralizadade provedores sem um único ponto de falha, e o dispositivo obtém informações deforma independente da rede da blockchain para executar ou transmitir dados remotamente.Assim, a Robonomics fornece um alto nível de segurança cibernética do dispositivoe privacidade dos dados do usuário em todas as etapas da comunicação, desde oaplicativo do usuário até o lançamento do dispositivo inteligente.",
  "From smart contracts to cross chain IoT platform": "De smart contracts a plataforma iot cross chain",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "O projeto Robonomics tem mais de 6 anos. Começamos a nos preparar para o primeiroexperimento demonstrando a comunicação homem-máquina usando uma rede de provedoresdescentralizada independente em 2015, desde os primeiros dias da rede Ethereum.No início de 2021, a equipe do projeto conseguiu criar um protocolo de comunicaçãode máquina tecnoeconômico executado em Ethereum e IPFS e complementá-lo com elementosde uma plataforma de IoT baseada em nuvem com base em parachain na Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Como resultado, hoje já temos uma plataforma híbrida para criar aplicativosIoT futuristas que permitem a interação com dispositivos sob o controle de umcomputador global descentralizado.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Os criadores da Robonomics são experimentadores, engenheiros e cientistas quese preocupam em entender a validade científica da abordagem e obter clareza naapresentação dos princípios que devem formar a base de toda a arquitetura da soluçãode software.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "Em nossos artigos entre 2017 e 2020, apresentamos à comunidade científica muitosconceitos e soluções unidos em torno da ideia da economia robótica, um sistemaeconômico no qual dispositivos robóticos atuam como agentes independentes capazesde realizar atividades econômicas fundamentais, antes reservadas aos humanos.Você pode ler os artigos científicos",
  "this link": "neste link",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Gostaríamos de justificar o surgimento da economia robótica e explicar em termosgerais por que acreditamos que esse conceito é a resposta inevitável e óbvia parao funcionamento dos sistemas robóticos de grande escala na nova revolução industrial.",
  "Move towards the factory of the future": "Rumo à fábrica do futuro",
  "Inspired by Ronald Coase": "Inspirado por Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "O Prêmio Nobel de Economia Ronald Coase em seu trabalho de 1937 “The Natureof the Firm” demonstrou melhor  a dicotomia “hierarquia vs livre mercado” e deuuma explicação das razões da existência das organizações, em particular as empresas.Coase discute o impacto dos custos de transação (o custo de coleta e processamentode informações) para tomar decisões sobre a celebração de um contrato e monitorarsua implementação. A empresa, com toda sua estrutura hierárquica extramercado,se constitui como a forma mais eficiente de fornecer ao consumidor o produto alvocom os menores custos de transação no momento, momento em que o esforço transacionalpara criar o mesmo produto por meio de múltiplas trocas no mercado entre os indivíduostorna-se muito maior. Para visualizar melhor esse processo, veja o exemplo ilustrativoda compra de um carro. Tente comprar um carro pelas peças e calcule quanto dinheiroe tempo você gastará apenas para montar todos os componentes em sua garagem. Osriscos e custos de negociação da compra de peças são muito altos em comparaçãocom o Model X da Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "No entanto, isso não leva ao surgimento da única empresa do mundo para a produçãode tudo. A questão é que os mesmos custos de transação também impõem restriçõesao tamanho das empresas. Coase escreve:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...uma empresa tenderá a se expandir até que os custos de organizar uma transaçãoextra dentro da empresa se tornem iguais aos custos de realizar a mesma transaçãopor meio de uma troca no mercado aberto...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Em outras palavras, quanto mais complexa a hierarquia dentro da empresa, maioressão os custos internos e, em algum momento, tornam-se excessivos em relação aoscustos de retorno ao mercado. Por isso, para garantir seu crescimento como umdos impulsionadores, os empreendedores buscam formas de reduzir esses custos.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "A ideia de reduzir os custos de transação através da capacidade de todos osparticipantes no processo de negócios (produção, logística, consumo) se uniremem um nível mais próximo se",
  "clearly correlates": "correlaciona claramente",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "com os problemas e desafios enfrentados pelos fabricantes de soluções de automação.Nos últimos 50 anos, as operações padrão/regulares da maioria dos processos denegócios de grandes empresas foram quase totalmente automatizadas. Os fabricantesficam essencialmente com a tarefa de construir uma comunicação segura entre aspartes totalmente automatizadas da cadeia de suprimentos, e essa tarefa é um fatorque impede uma maior redução dos custos de transação por meio da automação. Odesejo de comercializar produtos ou serviços mais competitivos em relação às empresasparcialmente automatizadas",
  "firms spurs the search for solutions to": "estimula a busca de soluções",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "para esses desafios. Parece que tudo está caminhando para o surgimento das empresasrobotizadas – organizações em que todo o ciclo de processos de negócios é totalmenteautomatizado e não requer participação humana, exceto como beneficiários e consumidores.",
  "Get rid of transaction costs": "Livre-se dos custos de transação",
  "Our future in smart cities": "Nosso futuro em cidades inteligentes",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "A tarefa que os fabricantes de automação enfrentam hoje tem um nome específico- a construção de sistemas ciber-físicos (Construction of cyber-physical systemsou CPS). Por",
  "definition,": "definição,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "um CPS é uma forte unificação e integração mútua de vários processos computacionais, de rede e físicos.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "As tarefas de construção do CPS são centrais para qualquer ideia descrita nanova (quarta) revolução industrial. Portanto, o CPS é a pedra angular de nossavida futura nas Cidades Inteligentes, manifestando-se em todos os lugares. Exemplosde sistemas ciberfísicos do futuro são: piloto automático Uber, selfies de drones,rede de impressoras 3D em estações de metrô.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "O CPS é uma estrutura complexa com muitos elementos conectados: do aplicativono telefone, ele se estende ao controle do drone em voo sobre a cidade e depoispublica as fotos resultantes no Instagram, mas somente após o processamento pelaIA na nuvem.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "A coisa mais importante no processo de design do CPS é encontrar a linha tênueentre o número suficiente e excessivo de elementos automatizados na cadeia desuprimentos do usuário do serviço. Em outras palavras, onde está o limite de tamanhodo CPS? Para responder a esta pergunta, devemos recorrer ao famoso matemáticoNorbert Wiener.",
  "Self-regulating systems": "Sistemas auto-reguláveis",
  "Inspired by Norbert Wiener": "Inspirado por Norbert Wiener",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener fala sobre a viabilidade da abordagem interdisciplinar da ciência.Por exemplo, ele traçou os paralelos entre os sistemas de controle automatizadose os desafios de dimensionamento e aumento da complexidade da sociedade humana.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Assim, em outras palavras, a abordagem cibernética pode ser aplicada igualmenteà psicoterapia, biologia e navegação automatizada. É baseado na função do sistema,como as ações individuais são controladas e como os nós individuais interagementre si.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Levando em conta as publicações de Ronald Coase e Norbert Wiener, acompanhandoo desenvolvimento da Indústria 4.0, podemos considerar o uso do CPS como um agenteeconômico, ao projetar serviços robotizados. Para regular o tamanho do CPS e seadaptar às necessidades de mudança dos indivíduos, podemos usar o mecanismo demercado.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Empresas robotizadas são uma representação ideal para sistemas ciber-físicos.Eles são uma unidade bastante autônoma capaz de fornecer serviços a humanos eoutros robôs por dinheiro. Como resultado, a economia robótica nos parece serum conjunto geral de CPSs que fornecem serviços e bens diretamente ao mercado.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Dinheiro para robôs",
  "Industry 1.0": "Indústria 1.0",
  "Mechanization:": "Mecanização:",
  "replacement of muscle power with steam energy.": "substituição da força muscular pela energia do vapor.",
  "1784 y.": "Ano de 1784.",
  "Industry 2.0": "Indústria 2.0",
  "Electrification:": "Eletrificação:",
  "introduction of assembly-line production.": "introdução da produção em linha de montagem.",
  "1870 y.": "Ano de 1870.",
  "Industry 3.0": "Indústria 3.0",
  "Automation:": "Automação",
  "introduction of automated systems with CNC.": "introdução de sistemas automatizados com CNC.",
  "1969 y.": "Ano de 1969.",
  "Industry 4.0": "Indústria 4.0",
  "Smart production:": "Produção inteligente:",
  "development of cyber physical systems.": "desenvolvimento de sistemas físicos cibernéticos.",
  "Now": "Atualmente",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "No mundo das empresas robóticas, é natural fornecer aos robôs acesso a instituições sociais que antes eram necessárias apenas para humanos.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "As instituições sociais não aparecem porque somos pessoas e fisiologicamenteuma pessoa não pode viver sem bancos, contratos e outros instrumentos da sociedade.Mas só porque uma pessoa, em algum momento, entrou no caminho das relações maiscomplexas da sociedade e deu um passo importante para acelerar os processos daquelesque nos cercam.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Dinheiro e contratos devem estar disponíveis para robôs, não porque isso sejauma fantasia doentia de fãs de robôs que esqueceram o que é a Skynet. Mas apenasporque a nova revolução industrial se propõe a construir cadeias automatizadascomplexas, cujos processos afetarão a troca de informações técnicas e econômicas,e também prosseguirão em uma velocidade inacessível aos humanos",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Os robôs precisam de dinheiro que esteja diretamente disponível para eles parapoder realizar operações sem uma pessoa na velocidade com que apenas as máquinaspodem tomar decisões. E tudo isso é apenas para uma pessoa aproveitar a vida naCidade Inteligente!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "E aqui chegamos sem problemas ao primeiro dinheiro eletrônico - Bitcoin. O fatode que o Bitcoin pode ser armazenado em sua conta no princípio de não ser um banco,mas dinheiro em sua carteira torna o primeiro dinheiro que o robô pode gerenciarde forma independente, mais precisamente de forma autônoma. Ao mesmo tempo, hojejá podemos dizer que o Bitcoin não é apenas dinheiro eletrônico, mas uma instituiçãofinanceira verdadeiramente global.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Como resultado: um evento não inventado por nós, mas claramente enquadradoem nossa visão, faz do Bitcoin o primeiro dinheiro para robôs, ou, se olharmosainda mais fundo, é justamente essa instituição social que ajudará na formaçãode empresas robóticas.",
  "Smart contracts": "Smart contracts",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin se tornou o primeiro dinheiro disponível para robôs. Enquanto isso,não podemos falar sobre o Bitcoin em sua forma atual como uma ferramenta paratroca técnica e econômica completa.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Agora já temos contratos inteligentes, mercados DeFi e uma infraestrutura descentralizadapara troca de mensagens entre robôs que abrem a possibilidade para a humanidadecriar uma parte totalmente automatizada da economia humana - a economia robótica.",
  "One of the great opportunity to build the economy of robots is": "Uma das grandes oportunidades para construir a economia dos robôs é a tecnologia da",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Com a funcionalidades da Ethereum, os robôs são capazes não apenas de trocar dinheiro, mas de firmar contratos com humanos e entre si.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Mas qual é o objetivo da comunicação baseada em contrato máquina a máquina (m2m)?Essa é uma ótima pergunta! Voltemos ao CPS. Quando falamos de comunicações diretasentre sensores, equipamentos de máquinas ou quaisquer outros elementos, aindafalamos de colaboração dentro de um sistema regulado. Mas se queremos que os serviçosde cidades inteligentes estejam vivos (ou até mesmo casas inteligentes em algunscasos), precisamos estabelecer comunicação com vários elementos de terceiros.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Vamos imaginar o serviço de entrega por drones. Se um drone, por exemplo, épropriedade da DHL, como ela pode acessar os armazéns da Amazon ou acessar todoo espaço aéreo da cidade? Será um monopólio? Este é um grande desafio para muitasiniciativas da 4ª revolução industrial!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "A maioria das corporações diz que precisa de direitos quase completos sobreseus arredores porque não sabe como configurar com segurança a troca de informaçõestécnicas entre sistemas automatizados fora de sua própria estrutura corporativainterna. Ao mesmo tempo, se você observar os processos em que uma pessoa trabalha,veremos que a cooperação de diferentes corporações é longa e existe com sucesso.Você pode facilmente solicitar a entrega porta a porta de mercadorias compradasno site da Amazon, e o correio poderá dirigir um carro pelas estradas da cidade,receber um pedido no armazém e trazê-lo para você.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Qual é a diferença? No primeiro caso não há como construir uma relação contratualentre máquinas, e no segundo caso, no mundo das pessoas, já existem relações contratuais.",
  "Parachains": "Parachains da",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "A principal dificuldade que a Robonomics enfrenta hoje é o alto preço para lançarum dispositivo IoT usando a Ethereum. Na Ethereum você tem que pagar uma comissãosobre cada transação em termos de dólares americanos, na faixa de US$ 10 a US$100. É bastante caro para a maioria dos casos da economia real, seja uma viagemde compartilhamento de carro, aluguel de um apartamento inteligente, entrega pordrones ou ordenar a impressão em 3D de seu herói anime favorito.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Por justiça, gostaríamos de observar que existem cenários lucrativos mesmo comas taxas de transação na rede Ethereum de 2018 - 2019. Por exemplo, transaçõesautomatizadas de compensação de pegada de carbono ou transferência do pedido dosite diretamente para a produção. Mas ainda assim, para a aplicação em massa dastecnologias Web3 no campo da IoT, é necessária uma redução no preço que a nuvemcobra do dispositivo conectado.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Procurando uma oportunidade para reduzir o custo de interação com um dispositivoIoT, os desenvolvedores da Robonomics estudaram desenvolvimentos alternativosao Ethereum. Nossa escolha se baseou na arquitetura da",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": ", que nos permitiria rodar nossa própria blockchain, dentro de uma rede comum, na qual a segurança é garantida por validadores independentes do nosso projeto.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Rede Blockchain Heterogênea",
  "Homogeneous Shard Network": "Rede de Shards Homogêneos",
  "On-chain protocol control": "Controle de protocolo on-chain",
  "Protection against the tyranny of the crowd": "Proteção contra a tirania da multidão",
  "Auction of bandwidth in the common network": "Leilão de largura de banda na rede comum",
  "Payment for gas by users": "Pagamento de gas pelos usuários",
  "Have you read this?": "Você leu isso?",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Eu, Robô",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "O Homem Bicentenario",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Questões abertas de teleologia",
  "and a treatise by L. von Mises": "e um tratado de L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Para concluir, gostaríamos de mencionar questões que permanecem em aberto de um ponto de vista global. Qual é o objetivo dos robôs?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "A praxeologia nos inspira com ideias interessantes sobre o comportamento humanosem dependência direta dos propósitos. Isso nos dá a oportunidade de trabalharnos processos da economia robótica condicionalmente como com uma caixa preta semnos aprofundarmos nos objetivos finais. Ao mesmo tempo, a teleologia representaum desafio para explicar as causas.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Esperamos que em algum lugar na junção dos trabalhos de Mises e Wiener, possaser encontrado um ponto para um maior desenvolvimento da economia robótica, nãoapenas como um protocolo de interação entre pessoas e máquinas de natureza praxeológica,mas levando em conta o elementos da construção de comunicação interespécies.",
  "or": "ou",
  "Github": "Github",
  "Important news &amp; announcements": "Notícias importantes e anúncios",
  "All posts": "Todas as postagens",
  "R&D cases": "Casos de P&D",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Colaboração com desenvolvedor imobiliário em Chipre para rastrear a distribuição diária, consumo e compensação de qualquer excesso de pegada de carbono.",
  "This page is out of your space": "Esta página está fora do seu espaço",
  "Check url once more or create an": "Verifique a URL novamente ou crie um",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "nos informando que você recebeu um erro 404 (não se esqueça de mencionar a URL atual)",
  "Embedded iot systems": "Sistemas embarcados de IoT",
  "Autonomous systems": "Sistemas autônomos",
  "Digital twins are the heart of the internet of things": "Digital twins são o coração da internet das coisas",
  "\"Main tasks of robonomics architecture": "Principais tarefas da arquitetura da Robonomics",
  "No posts yet": "Nenhuma postagem ainda",
  "If you want to help us with translation": "Se você quiser nos ajudar com a tradução",
  "contact us at": "entre em contato conosco em",
  "send": "envie",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics é uma plataforma de IoT 100% de código aberto, segura, econômica e futurista para conectar robótica sob controle de Polkadot e Ethereum. Qualquer pessoa pode construir serviços com Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Abaixo está uma lista de nossas aplicações comprovadas de tecnologias modernas de robótica.",
  "By interest:": "Por interesse:",
  "Sort by progress:": "Ordenar por progresso:",
  "Any progress": "Qualquer progresso",
  "Complete": "Completo",
  "Proceeding": "Em andamento",
  "Sort by time:": "Ordenar por tempo:",
  "Recent": "Mais recente",
  "Earliest": "Mais antigo",
  "Show more": "Mostrar mais",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Coloque dados no IPFS e armazene hashes em uma Blockchain pública",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Aqui, reunimos uma coleção de NFTs criados durante nossa extensa jornada criptográfica, tanto de forma independente quanto com grandes equipes. Esses tokens únicos oferecem propriedade verificável na blockchain e são ótimos para enfeitar sua conta de blockchain. Você pode dar lances em alguns deles em leilão ou até mesmo criar sua própria peça única.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Durante nossa campanha inicial de crowdloan Kusama, decidimos recompensar os contribuidores pioneiros de nossa criptomoeda com mais do que apenas tokens - também lhes presenteamos com um NFT colorido. Este cartão tem um grande significado para nós e, se alguém o possui, sabemos que eles são um fantástico apoiador dos valores da Robonomics: liberdade e descentralização.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Estamos animados em apresentar nossa série especial de ativos digitais - Robonomics Crypto Girls, criadas pela equipe Robonomics Art&Science. Cada NFT desta coleção é uma representação gráfica única da tecnologia usada na Robonomics ou construída em cima dos casos de uso da Robonomics. Nossos talentosos artistas desenharam cada garota no estilo característico da Robonomics. Você pode escolher aquela que mais ressoa com você ou colecionar a série inteira! Ao comprar esses NFTs, você não está apenas adicionando um complemento elegante à sua coleção, mas também nos apoiando continuamente na inovação e implementação da conectividade descentralizada para robôs. Fique atento para novas adições à coleção!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. COLEÇÕES DE NFTS SAZONAIS",
  "On demand minting": "Mintagem sob demanda",
  "SEASONAL SPOT NFT COLLECTIONS": "COLEÇÕES DE NFTS SAZONAIS",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Essas coleções sazonais de NFTs representam um ativo digital único que captura a interação única entre o usuário e o Spot dentro da parachain da Robonomics. Os usuários podem desenhar qualquer coisa no navegador e o robô replicará seus movimentos para criar uma imagem desenhada à mão. Uma vez que a interação estiver completa, o NFT é mintado na Singular marketplace para a conta Polkadot do usuário. Agora, qualquer pessoa pode interagir com um robô real localizado em um laboratório na Califórnia para criar ativos digitais personalizados e únicos que podem ser possuídos, comprados e vendidos como qualquer outro ativo digital.",
  "Create your NFT": "Crie seu NFT",
  "4. automated telescope collection": "4. coleção de telescópios automatizados",
  "automated telescope collection": "coleção de telescópios automatizados",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Localizado no Deserto do Atacama, no Chile, um telescópio físico pode ser acessado por meio de um aplicativo descentralizado para capturar imagens em tempo real de objetos astronômicos no espaço profundo. Qualquer usuário com conexão à internet pode acessá-lo com tokens $STRGZN, que estão disponíveis para compra no aplicativo usando um cartão de crédito. Selecione um objeto astronômico, envie um comando para o telescópio tirar uma foto e aguarde o NFT mintado na plataforma Singular. Observe que o aplicativo só está disponível para uso das 23h às 6h GMT-3 devido ao horário de funcionamento do telescópio.",
  "Try yourself": "Experimente você mesmo",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "Em colaboração com Polkapets",
  "and": "e",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Como membro orgulhoso do ecossistema Polkadot, a Robonomics participou do Polka Pets World. Juntamente com a equipe Polka Pets, mintamos 1200 NFTs com um conceito de design único que mostra nossa ideia central de conectividade. Para dar vida a essa ideia, criamos uma personalidade: um androide especializado em ajudar os humanos a se conectarem com qualquer entidade robótica.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "Em 2021, a Robonomics começou a apoiar a adição dos paletes da RMRK em sua runtime, o que resultaria em integração nativa com a lógica de NFT mais avançada do mundo. Para celebrar essa conquista notável, lançamos um item especial compatível com Kanaria - um NFT infantil que pode ser equipado no seu pássaro Kanaria e pode fornecer vantagens no metaverso da RMRK.",
  "RMRK Partnerships": "Parcerias RMRK",
  "This page has moved to a": "Esta página foi movida para um",
  "Automatic redirecting": "Redirecionamento automático",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "Em 1948, um professor de matemática do MIT, Norbert Wiener, publicou uma das obras mais seminais \"Cibernética: Ou Controle e Comunicação no Animal e na Máquina\". Ele utilizou o termo \"cibernética\" pela primeira vez para se referir a mecanismos de autorregulação e, por isso, essa publicação é considerada o aniversário reconhecido da Cibernética.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Grandes livros levam a grandes ideias. Se você está em busca de mais inspiração sobre comunicação entre humanos e máquinas, tente ler livros de ficção científica. Marque os livros que você já leu e veja o que mais podemos oferecer para reflexão adicional.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Na verdade, a economia das pessoas muitas vezes está associada à consciência de realizar tarefas dentro do contrato, ao desejo das partes de alcançar um resultado, ao comportamento oportunista e altruísta do indivíduo na sociedade. Todos esses princípios são difíceis de aplicar à economia dos robôs. Quais são os motivos da economia dos robôs? É uma pergunta em aberto que precisamos pesquisar e discutir na sociedade para melhor compreensão e aplicação dos robôs.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Para começar, sugerimos dar uma olhada no trabalho de Mises \"Ação Humana: Um Tratado de Economia\" (abordagem praxeológica) e no artigo inicial de Norbert Wiener \"Comportamento, Propósito e Teleologia\" (visão teleológica).",
  "Establishing democracy with smart contracts": "Estabelecendo democracia com contratos inteligentes",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Vamos imaginar um pequeno escritório com uma equipe de 10 a 15 pessoas. Enquanto todos estão focados em seus prazos para suas principais tarefas profissionais, ninguém parece se importar com a manutenção do espaço do escritório. A solução mais comum para evitar o caos é contratar indivíduos terceirizados para oferecer suporte. Outra abordagem é tomar a iniciativa e impor penalidades àqueles que bagunçam ou esgotam os suprimentos sem repô-los. No entanto, é ético viver sob tirania em nosso futuro mundo cripto-anarquista, onde se espera que todos sejam responsáveis e desfrutem da liberdade? Vamos nos esforçar para criar uma sociedade mais democrática usando contratos inteligentes e a nova geração de tecnologias da Internet (frequentemente referidas como Web3). Precisamos de ferramentas que possam nos ajudar a tomar decisões juntos e garantir que funcionem corretamente sem que os humanos precisem se envolver diretamente.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Quem bebeu todo o café?!' ou a tragédia dos comuns",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Existe um conceito amplamente discutido em economia, ecologia e outras ciências conhecido como 'tragédia dos comuns'. Isso se refere a um cenário em que indivíduos que têm acesso a um recurso compartilhado priorizam seus próprios interesses, esgotando assim o recurso. O café se assemelha muito a esse recurso, pois se deteriora devido ao consumo descontrolado no escritório. No entanto, ao mesmo tempo, geralmente nenhum dos membros da equipe está inclinado a investir seu tempo e dinheiro na obtenção de um pacote adicional de grãos de café. Então, eles continuam bebendo café sem obter novos suprimentos.",
  "How to formulate the task in numbers.": "Como formular a tarefa em números.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Supondo um orçamento mensal de café de $100, o que é aproximadamente equivalente a 150 xícaras para nossa equipe de 10 pessoas, isso deixa cada pessoa com 1 xícara a cada 2 dias. Agora, vamos nos aprofundar nos detalhes técnicos. A pergunta é: como podemos dar vida a uma máquina de café autônoma no escritório?",
  "Step 1: automated coffee bean ordering": "Passo 1: pedido automatizado de grãos de café",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Fizemos um acordo com o barista, Nikita, que está localizado perto do escritório. Ele nos fornecerá grãos de café ao receber um alerta do robô. O robô envia uma mensagem quando o café está acabando, especificando a quantidade de café (em quilogramas) necessária para o pedido e o valor correspondente determinado pela equipe. Com esses detalhes, Nikita pode selecionar o café de acordo com sua preferência.",
  "Step 2: automatic access to smart office.": "Passo 2: acesso automático ao escritório inteligente.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Simultaneamente ao pedido, a máquina de café gera um código QR. Nikita então apresenta este código QR à câmera para entrada no escritório.",
  "Step 3: distribution of coffee tokens to the team.": "Passo 3: distribuição de tokens de café para a equipe.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Uma vez que a câmera local lê o código QR, o sistema de gerenciamento residencial inteligente inicia um pagamento para Nikita e distribui novos tokens de café entre os membros da equipe.",
  "Step 4: drink coffee!": "Passo 4: beba café!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Para receber uma xícara de café fresca, um membro da equipe precisa enviar um token de café para o endereço da máquina de café.",
  "Coffee beans delivery process:": "Processo de entrega de grãos de café:",
  "Unlock new possibilities with this concept": "Desbloqueie novas possibilidades com este conceito",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Além disso, uma máquina de café automatizada introduz várias dimensões econômicas e sociais. Vamos dar uma olhada nelas:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Os desenvolvedores podem depositar tokens de café extras quando o consumo fica abaixo do limite. Isso cria um sistema transparente para o uso variado de café dentro do limite.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "A máquina de café poderia manter uma conta compartilhada, permitindo que os membros do escritório contribuam com fundos de suas contas pessoais para uma experiência de café de maior qualidade da próxima vez.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "A equipe decide coletivamente a quantidade de café que a máquina irá pedir a cada vez por meio de uma votação DAO. Isso proporciona liberdade para lidar com o desafio com recursos limitados.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Processos programáveis reduzem a influência de fatores humanos e também oferecem maior flexibilidade na personalização das configurações para equipes específicas.",
  "How we smarten up our coffee machine in real life": "Como tornamos nossa máquina de café mais inteligente na vida real",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Para obter controle prático da máquina de café, integramos um computador de placa única, especificamente o Raspberry Pi 4, juntamente com uma máquina de café de mercado de massa comumente disponível que suportava conexão GPIO. Nossa preferência foi o",
  "selected for its affordability and the convenience of its easily removable front panel.": "selecionado por sua acessibilidade e pela conveniência de seu painel frontal facilmente removível.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Em seguida, trabalhamos nos detalhes operacionais, especificamente em relação aos tokens que os usuários poderiam enviar e ao algoritmo subjacente. Aqui está o resultado:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Para desfrutar de uma xícara de café deliciosa, os usuários precisam enviar uma certa quantia de fundos (em nosso caso, 1 token ACT da Statemine, id=3077) para o endereço da máquina de café de uma parachain (Statemine). Em seguida, o processo de despejo de café começa e um registro de ação é posteriormente publicado em",
  "via the Datalog function": "por meio da função Datalog",
  "When the concept extends beyond the office": "Quando o conceito se estende além do escritório",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Este conceito oferece inúmeras possibilidades para expandir a ideia. Foi implementado com sucesso no Polkadot Web3 Hub durante o Fórum Econômico Mundial de 2022 em Davos. Os participantes puderam fazer pedidos de café e especificar o tipo de café desejado (por exemplo, espresso, americano, cappuccino) enviando uma certa quantidade de tokens. Vamos compartilhar fotos e vídeos deste evento:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Nossa máquina de café blockchain fazendo café no Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "Faça você mesmo ou como construir sua própria máquina de café blockchain inteligente",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Você pode encontrar um tutorial detalhado e especificações técnicas no repositório GitHub de código aberto. Tenha em mente que você pode usar qualquer máquina de café que preferir e quase qualquer token de sua escolha para dar vida a este projeto em seu próprio espaço.",
  "In a nutshell": "Em poucas palavras",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Hoje em dia, está cada vez mais claro que o consumo de energia é um grande contribuinte para as pegadas de carbono, tornando cada vez mais importante encontrar maneiras de reduzir nosso impacto ambiental. Escritórios e edifícios comerciais desempenham um papel significativo nesse consumo de energia. Os engenheiros da Robonomics instalaram um sistema no escritório da BBF, uma empresa imobiliária sediada em Chipre, para rastrear e coletar medições de eletricidade. Esse sistema também oferece uma maneira prática de compensar a pegada de carbono.",
  "1. Monitoring surplus energy generation": "1. Monitorando a geração de energia excedente",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "No prédio do escritório da empresa BBF, vários painéis solares foram instalados e integrados ao sistema Solarweb, permitindo a fácil coleta de análises. O sistema fornece dados sobre o consumo geral de eletricidade do prédio e a eletricidade gerada pelos painéis solares. No entanto, uma característica crucial que está faltando é a capacidade de compensar a pegada de carbono resultante da eletricidade consumida além do que é gerado pelos painéis solares.",
  "2. Converting excess energy power to CO2 offset": "2. Convertendo o excesso de energia em compensação de CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Ter dados sobre o consumo total de eletricidade e a produção de eletricidade dos painéis solares permite um cálculo direto da pegada de carbono. Assume-se que a eletricidade dos painéis solares tem uma pegada de carbono de 0, o que significa que a compensação é necessária apenas para a eletricidade excedente consumida além do que os painéis solares geraram.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "É importante ressaltar que as emissões de CO2 variam entre os países. Em Chipre, a poluição média é de 587 g/kWh, de acordo com Hannah Ritchie, Max Roser e Pablo Rosado (2022) - \"Energia\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Para compensar a pegada de carbono, são utilizados créditos de carbono, sendo que cada crédito representa 1 tonelada de CO2. Esses créditos desempenham um papel vital na compensação do impacto ambiental causado pelo consumo de eletricidade além da contribuição dos painéis solares.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Assim, munidos de dados sobre o consumo de energia, produção de painéis solares e o coeficiente de Chipre, torna-se fácil determinar o número de tokens necessários para compensar a pegada de carbono.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Para alcançar isso, incorporamos um Raspberry Pi, configuramos o Home Assistant para coletar dados analíticos e desenvolvemos uma integração para compensar a pegada. O painel de energia do Home Assistant mostra os seguintes detalhes:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Além disso, nossa integração aprimora o sistema oferecendo um painel de controle conveniente para visualizar estatísticas e acionar a compensação:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Abaixo está um exemplo ilustrativo de como ocorre a compensação da pegada de carbono por meio de nossa integração. Após a conclusão bem-sucedida, a",
  "transaction": "transação",
  "unfolds as follows:": "se desenrola da seguinte forma:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Reduzir o consumo de energia no escritório é tão importante quanto compensar as emissões de carbono. Podemos alcançar isso fazendo pequenas mudanças, como usar iluminação e eletrodomésticos eficientes em termos de energia e manter os equipamentos de escritório bem conservados.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "O consumo de energia é uma grande parte de nossa pegada de carbono, e as empresas devem fazer sua parte para serem mais ecologicamente corretas. Ter um sistema que rastreia o uso de energia e ajuda a compensar as emissões de carbono pode reduzir significativamente o impacto de um prédio de escritórios no meio ambiente. Ao adotar a abordagem correta, as empresas podem contribuir para um futuro mais verde.",
  "The way forward": "O caminho a seguir",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Estratégia para transformar a máquina de café em um dispositivo robótico autônomo",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "On the Way to Sovereign Home Automation": "A caminho da automação residencial soberana",
  "World Economic Forum Annual Meeting 2022": "Reunião Anual do Fórum Econômico Mundial 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Tornando-se uma Parachain para Aplicações de IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (patrocinado pela Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Escola de Inverno Robonomics 2021 (hospedada pela Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transição para Multirrede - Surgiu o Polkadot",
  "The Rise of Robonomics Network": "A Ascensão da Rede Robonomics",
  "Crypto Valley Conference 2018": "Conferência Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Workshop do Parlamento Europeu 'A Economia dos Robôs'",
  "Consensus 2018 conference": "Conferência Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simpósio sobre Blockchain para Sistemas Robóticos no MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Escola de Verão Robonomics-2018 hospedada pela Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Integração Fronius Solar.web com o Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Um de nossos objetivos no desenvolvimento deste caso é transformar a Robonomics em Middleware ROS 2. Isso nos permitirá usar a Robonomics no Substrate para criar um dapp que pode executar o ROS 2 diretamente do navegador!",
  "Eisenkoch, the robot chef": "Eisenkoch, o chef robô",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Caso real para o robô equipado com duas máquinas de waffle e assando 6 waffles ao mesmo tempo em 5-7 minutos.",
  "Blockchain-powered smart coffee machine": "Máquina de café inteligente alimentada por blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Café Robonomics - é uma máquina de café inteligente integrada à Rede Robonomics. Este projeto tem como objetivo mostrar o potencial da Robonomics na esfera da IoT por meio de um exemplo do mundo real.",
  "Water environmental inspector": "Inspetor ambiental de água",
  "Air monitoring network": "Rede de monitoramento do ar",
  "Production quality control platform “Feecc”": "Plataforma de controle de qualidade de produção “Feecc”",
  "Backup and archiving service for robotics companies": "Serviço de backup e arquivamento para empresas de robótica",
  "Public lab with Boston Dynamics Spot": "Laboratório público com Boston Dynamics Spot",
  "Autonomous telescope service": "Serviço de telescópio autônomo",
  "Smart home secure remote control and backup service": "Controle remoto seguro e serviço de backup para casa inteligente",
  "Blockchain as quality control system for chemistry": "Blockchain como sistema de controle de qualidade para química",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Redução real de emissões de CO2 com certificados comprovados por blockchain",
  "Robot-artist Gaka-Chu": "Robô-artista Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Demonstração “Obtenha o clima do Monte Fuji”",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "A ideia principal que os autores do Robonomics tentaram transmitir antes - é a evolução natural, lógica e aparentemente inevitável do nível atual da economia para serviços totalmente automatizados. Os serviços automatizados precisarão ter tanto a capacidade de falar a linguagem da economia humana quanto a economia das máquinas para realizar várias operações no mundo ao seu redor em uma velocidade não disponível para os humanos.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "O desenvolvimento e aplicação da Internet das Coisas mostrou que resolver problemas típicos não é suficiente. Novos conceitos e princípios completamente novos, baseados em erros anteriores e deficiências identificadas, surgiram até os dias atuais. Essa abordagem certamente conveniente de usar serviços em nuvem acabou tendo uma série de deficiências críticas relacionadas à escalabilidade, privacidade e segurança. Na tentativa de resolver esses problemas, propôs-se aproximar o processamento de dados, lógica e computação do local imediato onde são usados. Assim, surgiram os conceitos de computação em névoa e borda, com sistemas intermediários entre a nuvem e os dispositivos assumindo algumas das funções da nuvem. Portanto, a criação de sistemas de borda tornou-se um dos novos desafios na construção da Internet das Coisas.",
  "the Robonomics Parachain portal": "o portal Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Gerenciando a compensação de pegada de carbono verificada em blockchain",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "As colaborações com projetos afins também continuaram. Robonomics e DAO IPCI introduziram um serviço para coleta e análise de dados sensoriais -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "E o que é cientificamente interessante, tomando como base a ideia das restrições impostas pelo mercado ao tamanho da empresa, podemos dizer que o limite do aumento em CPS será sempre determinado pelo mercado e nada mais é necessário para isso.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Um dos exemplos de nossos experimentos: negociação de espaço na estrada e pagamentos de direito de passagem para veículos autônomos para reduzir o congestionamento. O que uma pessoa absolutamente não faria no trânsito, o carro fará por você sem dificuldades: você quer mudar de faixa, seu carro e o carro do seu vizinho trocam ofertas sobre o custo dessa operação a uma taxa de centenas de mensagens por segundo, eles revelarão um preço de equilíbrio e assim você já está na próxima faixa de movimento mais rápido. Isso significa que agora será possível \"carregar\" sua viagem com a Uber e torná-la mais rápida.",
  "Robonomics White Paper": "Robonomics White Paper",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Aqui, você pode encontrar e baixar (completamente grátis, é claro) o primeiro white paper do Robonomics, que foi introduzido em maio de 2018. Embora muito tenha evoluído desde então, os fundamentos do Robonomics ainda estão delineados neste documento.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Um Robô Artista Autônomo Autônomo",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Localização Cooperativa e Rastreamento de Limites Ambientais em Movimento por Equipes de Robôs Não-Holonômicos",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robô como um Serviço: Das Tecnologias em Nuvem para Tecnologias de Peer-to-Peer",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Monitoramento Ambiental Confiável por Meio de Redes de Sensores em Embarcações Marinhas Autônomas e Tecnologia de Livro-Razão Distribuído",
  "Digital Passport for Unmanned Vehicles": "Passaporte Digital para Veículos Não Tripulados",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics como uma Plataforma Baseada em Blockchain para Gerenciamento de Tráfego Não Tripulado de Veículos Móveis",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Rumo a Sistemas Robóticos Multi-Agentes Baseados em Blockchain: Análise, Classificação e Aplicações",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Serviços Robóticos para Cidades Inteligentes de Novo Paradigma Baseadas em Tecnologias Descentralizadas",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protocolo para Organização de uma Rede de Agentes Autônomos Descentralizados em Fábricas Usando Mecanismos de Mercado",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Rumo a Robonomics Baseado em Blockchain: Validação de Comportamento de Agentes Autônomos",
  "Transforming Climate Finance and Green Investment with Blockchains": "Transformando o Financiamento Climático e o Investimento Verde com Blockchains",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: plataforma para integração de sistemas ciberfísicos na economia humana",
  "Blockchain based protocol for economical communication in industry 4.0": "Protocolo baseado em blockchain para comunicação econômica na indústria 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics baseado em blockchain como princípio de criação de fábricas inteligentes",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Ecossistema de blockchain para mercados de carbono, ativos ambientais, direitos e responsabilidades: Conceito de design e implementação",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Protocolo baseado em blockchain de atividade empresarial autônoma para sistemas multi-agentes compostos por UAVs",
  "English": "Inglês",
  "Russian": "Russo",
  "Chinese": "Chinês",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics é uma plataforma de código aberto que facilita tanto serviços simples de IoT quanto robótica complexa, permitindo uma comunicação eficaz entre agentes, sejam eles humanos ou robóticos. Para integrar robôs a este sistema, utilizamos o ROS. Neste artigo, temos como objetivo fornecer uma visão geral do nosso processo de integração do Robonomics ao ROS 2.",
  "Why ROS 2 in Robonomics?": "Por que o ROS 2 no Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, o Sistema Operacional de Robôs, é uma das mais antigas estruturas de código aberto para robótica. É uma coleção de bibliotecas de software e ferramentas para fazer robôs funcionarem. Possui desde o básico até recursos avançados e vem com ferramentas úteis para programadores. É amplamente utilizado por universidades em todo o mundo para ensino e pesquisa em robótica, portanto, é bem estabelecido, funciona com muitos tipos de robôs e possui uma grande comunidade de desenvolvedores.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Desde que o ROS foi iniciado em 2007, ocorreram mudanças significativas no campo da robótica e dentro da comunidade ROS. Em resposta a esses desenvolvimentos, o ROS 2 foi introduzido com o objetivo de se adaptar a essas mudanças. Ele se baseia nos pontos fortes do ROS 1, ao mesmo tempo em que aborda suas limitações. Estamos utilizando o ROS no Robonomics desde o início e agora é hora de migrarmos para o ROS 2.",
  "You might find this interesting": "Você pode achar isso interessante",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Existem inúmeros robôs de código aberto e plataformas robóticas complexas que suportam o ROS. Isso significa que você pode criar um impressionante sistema multi-robô para alcançar seus objetivos específicos. Para",
  "the most current list of supported robots": "a lista mais atualizada de robôs suportados,",
  "please visit the ROS website.": "visite o site do ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Vamos ver como o ROS é usado dentro do framework Robonomics, retratando todo o sistema com o Robonomics atuando como diferentes camadas:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "Na camada 'Interface de Máquina', precisamos de ferramentas para conectar perfeitamente robôs com software. O ROS 2 fornece um conjunto robusto de ferramentas de desenvolvimento perfeitamente adequadas para essa tarefa.",
  "Robonomics packages for ROS and ROS 2": "Pacotes Robonomics para ROS e ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "A construção de um sistema multi-robótico muitas vezes envolve o desafio de conectar dispositivos de vários fornecedores, ou até mesmo dispositivos dentro de um único fornecedor, cada um usando protocolos diferentes. Seja para uma configuração de casa inteligente ou fabricação automatizada, a comunicação efetiva entre suas máquinas é crucial. O ROS (e, é claro, o ROS 2) oferece vários modos para lidar com isso. E se você pudesse personalizar tarefas enquanto o ROS gerencia a comunicação entre os nós?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "A equipe Robonomics criou vários pacotes para o ROS para tornar os robôs mais inteligentes e lidar com tarefas específicas conforme necessário. Para ver as tarefas que realizamos com o ROS, confira nossa página de casos de P&D. Quase toda interação com um robô depende do ROS. Você pode encontrar nossos pacotes Robonomics de código aberto para o ROS no GitHub, e aqui estão alguns deles:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "A pilha de comunicação Robonomics contém um conjunto de pacotes ROS para fins de comunicação econômica.",
  "Robonomics' contribution in the ROS 2 community": "A contribuição da Robonomics na comunidade ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "A Robonomics combina Robótica com tecnologias Web3, e nosso objetivo é crescer nessas áreas. Desde a introdução do ROS 2, identificamos três principais desafios que envolvem o suporte à comunidade ROS 2 e a melhoria das capacidades da Robonomics:",
  "Creating ROS 2 tools for Rust:": "Criando ferramentas ROS 2 para Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Essas ferramentas capacitam os desenvolvedores a escrever aplicativos ROS 2 usando Rust. Para descobrir mais sobre por que escolhemos Rust e a importância deste projeto para nós, você pode encontrar",
  "additional details": "detalhes adicionais",
  "Developing Robonomics Middleware for ROS 2:": "Desenvolvendo o Middleware Robonomics para ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Isso desempenha um papel importante na garantia da integração perfeita da Robonomics em vários sistemas de robótica multiagente usando o ROS 2. Ele pode facilitar a integração de robôs em tecnologias de blockchain Web 3, reduzindo erros durante o processo de integração, economizando tempo e custos.",
  "Creating a robotics lab with ROS 2:": "Criando um laboratório de robótica com ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "À medida que o ROS 2 ganha popularidade na comunidade de robótica, estamos ansiosos para ver mais robôs e hardware trabalhando com o ROS 2. Nosso objetivo é conectá-los ao ecossistema Web3 usando a Robonomics.",
  "Research papers": "Artigos de pesquisa",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Sem pesquisa acadêmica, o avanço de sistemas complexos que podem ser integrados em nossa vida diária pode perder seu propósito ou até mesmo representar riscos. Devemos contemplar cuidadosamente nossa direção, objetivos e consequências potenciais. As esferas em que a Robonomics opera, especificamente Robótica, Relações Econômicas e tecnologias Web3, valem a pena ser estudadas individualmente, explorando como elas podem ser integradas entre si e avaliando seu impacto potencial em nossas vidas.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Este caso está atualmente em andamento; não perca as notícias - inscreva-se para receber atualizações na caixa abaixo",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "A 'Robonomics Coffee' é uma máquina de café inteligente integrada à Rede Robonomics. Este projeto tem como objetivo ilustrar o potencial da Robonomics na esfera da IoT através de um exemplo do mundo real.",
  "logos and assets": "logotipos e ativos",
  "Download the Robonomics logos here. We've got two options for your": "Baixe os logotipos do Robonomics aqui. Temos duas opções para suas",
  "basic needs": "necessidades básicas",
  "and one designed for": "e uma projetada para",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "token. Além disso, descubra a paleta de",
  "color palette": "cores ideal",
  "for the distinguished Robonomics brand": "para a distinta marca Robonomics",
  "Robonomics logos": "Logotipos do Robonomics",
  "Download all": "Baixe todos os",
  "XRT logos": "logotipos do XRT",
  "Recommended color palette": "Paleta de cores recomendada",
  "RWS logos": "Logotipos RWS",
  "You are currently opted out. Click here to opt in.": "Você está atualmente optado por sair. Clique aqui para optar por entrar.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out completo; suas visitas a este site não serão registradas pela ferramenta de análise da Web. Note que se você limpar seus cookies, excluir o cookie de opt-out ou se trocar de computador ou navegador da Web, será necessário realizar o procedimento de opt-out novamente.",
  "Please click below to opt in:": "Por favor, clique abaixo para optar por entrar:",
  "You are currently opted in. Click here to opt out.": "Você está atualmente optado por entrar. Clique aqui para optar por sair.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Você pode optar por não ter um número de identificação de cookie de análise da web exclusivo atribuído ao seu computador para evitar a agregação e análise de dados coletados neste site.",
  "To make that choice, please click below to receive an opt-out cookie": "Para fazer essa escolha, clique abaixo para receber um cookie de opt-out.",
  "Privacy Policy": "Política de Privacidade",
  "Robonomics Middleware Framework for ROS 2": "Estrutura intermediária Robonomics para ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Unindo tecnologias Web3 e estruturas robóticas",
  "Playing with Human-Machine Interaction through Ethereum": "Brincando com a interação humano-máquina através do Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Esta informação de estudo expirou. Para aulas e workshops atualizados, visite nossa",
  "academy": "academia",
  "Home assistant themes": "Temas do Home Assistant",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Personalize o seu Home Assistant com os nossos temas gratuitos para usar. Siga as instruções de instalação em",
  "Do you want": "Quer",
  "to dive even deeper?": "mergulhar ainda mais fundo?",
  "Our": "Nosso",
  "White Paper": "White Paper",
  "Science": "Ciência",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Achamos que ler livros pode realmente abrir sua mente. Sejam ideias simples mas inteligentes ou mais complexas, os livros são a melhor maneira para o seu cérebro absorver tudo. Você pode pegar nossos livros de graça e conferir nossa lista de leituras recomendadas para mergulhar no emocionante mundo da robótica!",
  "Download books about Robonomics": "Baixe livros sobre Robonomics",
  "Open your mind [list of recommendations]": "Abra sua mente [lista de recomendações]",
  "Robonomics R&D": "Robonomics P&D",
  "R&D 18-28": "P&D 18-28",
  "R&D 1-17": "P&D 1-17",
  "Robot economics": "Economia de robôs",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Pegue sua mercadoria com arte única Robonomics pintada por nossas lindas garotas. Criamos lojas nos maiores mercados online para artistas, confira e encontre camisetas, mangas compridas, moletons, cortinas de chuveiro, travesseiros, cobertores e outros itens úteis.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Escolhemos o framework de robótica mais conhecido chamado Robot Operating System (ROS) como a interface padrão para integrar qualquer sistema ciberfísico compatível. Robonomics suporta vários usos para o ROS. A implementação do Robonomics para a rede Ethereum está na forma do pacote ROS robonomics_comm. Para a arquitetura ROS 2, implementamos suporte para Robonomics como uma camada de middleware (consulte «Robonomics como Middleware ROS 2» para detalhes). Quando o uso do ROS é redundante (por exemplo, ao trabalhar com dispositivos IoT), foi desenvolvido um módulo de interface Python robonomics. Ele ajuda a acessar as funções do Robonomics nativamente e funciona tanto com nós locais e privados quanto com nós remotos e públicos.",
  "read our almanac": "leia nosso almanaque",
  "Begin your adventure in the world of cyberpunks": "Comece sua aventura no mundo dos cyberpunks",
  "Pure open source": "Puro Código Aberto",
  "Local and Global Availability": "Disponibilidade Local e Global",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Ao utilizar código aberto, P2P e Web3, não há espaço para truques corporativos, garantindo que seus dados pessoais estejam protegidos. Todas as informações são armazenadas localmente ou criptografadas com sua chave pessoal na nuvem Web3.",
  "Interested in how the team reached this stage?": "Interessado em como a equipe chegou a esta etapa?",
  "The Robonomics Timeline": "A Linha do Tempo Robonomics",
  "can guide you through our journey": "pode guiá-lo através de nossa jornada",
  "Device Design and Development": "Design e Desenvolvimento de Dispositivos",
  "Smart devices": "Dispositivos inteligentes",
  "Wearable merch": "Mercadorias vestíveis",
  "Academy": "Academia",
  "Wiki": "Wiki",
  "Science & White paper": "Ciência e White paper",
  "Tokenomics": "Tokenomics",
  "Cases": "Casos",
  "Brand assets": "Ativos da marca",
  "Wallpapers": "Papéis de parede",
  "NFT": "NFT",
  "Blog": "Blog",
  "Contacts": "Contatos",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Torne-se um provedor de dados ambientais para seus amigos e vizinhos na área. Acesse medições verdadeiramente descentralizadas de qualidade do ar, ruído, temperatura e outras condições ambientais no mapa de sensores.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "O servidor doméstico inteligente mais de código aberto, alimentado por RISC-V, com uma nuvem Web3 substituindo os servidores do Google sob o capô.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Dispositivos WI-FI MQTT inteligentes com firmware de código aberto Tasmota na placa totalmente compatíveis com o Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Conecte sua casa inteligente e roupas inteligentes ao Hikikomori para monitorar dados do sensor - literalmente ao alcance de suas mãos.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Conheça dispositivos inteligentes e hardware futurista de uma equipe autônoma com ampla experiência em robótica, blockchain e IoT",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "O processamento de dados é sempre uma questão sensível. É por isso que oferecemos um módulo de conectividade totalmente de código aberto",
  "connectivity module": "dando-lhe a liberdade de escolher quais servidores usar para processamento. Sem nuvens fechadas, sem código opaco.",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Robonomics estabeleceu três hubs de Conectividade para garantir uma conexão estável. Esta opção é ativada por padrão na estação.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Você pode lançar seu próprio hub para receber dados da Estação Civil Altruista e processá-los posteriormente.",
  "Steps to set up your Connectivity": "Passos para configurar sua Conectividade",
  "Deploy Connectivity": "Implantar Conectividade",
  "Technical requirements:": "Requisitos técnicos:",
  "2 CPU cores;": "2 núcleos de CPU;",
  "4 GB RAM;": "4 GB de RAM;",
  "40 GB storage;": "40 GB de armazenamento;",
  "Static IP": "IP estático",
  "Than set up": "Em seguida, configurar",
  "and follow": "e seguir",
  "the instructions": "as instruções",
  "Connect a station to your connectivity": "Conecte uma estação à sua conectividade",
  "Open your sensor settings by its IP.": "Abra as configurações do seu sensor pelo seu IP.",
  "Go to APIs settings": "Vá para as configurações de APIs",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Marque a caixa de seleção para enviar dados para API personalizada e preencha os campos correspondentes (IP do servidor, portas, etc.).",
  "Join with your setup to global map (optional)": "Junte-se à sua configuração ao mapa global (opcional)",
  "If you want to publish data to": "Se você deseja publicar dados para",
  "the global map": "o mapa global",
  "you need to make two pull requests:": "você precisa fazer duas solicitações de pull:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Adicione o ID IPFS da sua Conectividade à lista de agentes do mapa de sensores:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Adicione o endereço da parachain da sua Conectividade à lista de agentes do modelo do servidor de armazenamento de longo prazo:",
  "Steps for launching your own map": "Passos para lançar seu próprio mapa",
  "Deploy web interface": "Implantar interface web",
  "Fork the map repository:": "Fazer fork do repositório do mapa:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Editar as configurações para personalizar seu mapa, incluindo o domínio, provedor, ponto de vista inicial e seu ID de IPFS de conectividade para a lista de agentes.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Implante sua própria versão da interface web e comece a receber dados em tempo real de seu sensor.",
  "Full guide here:": "Guia completo aqui:",
  "Launch long-term storage": "Iniciar armazenamento de longo prazo",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Simplesmente coletar dados dos sensores não é suficiente; eles precisam ser processados. Ajuste um servidor para coletar dados dos sensores com base no software node.js de código aberto",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "e tenha seu próprio servidor funcionando para armazenamento de dados de mapas a longo prazo.",
  "Static IP.": "IP estático.",
  "Steps for launching a storage:": "Passos para iniciar um armazenamento:",
  "Fork the RoSeMAN repository:": "Faça um fork do repositório RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Escolha a versão Docker ou Node.js (banco de dados MongoDB necessário).",
  "Add a parachain address of your Connectivity to agents list.": "Adicione um endereço de parachain da sua Conectividade à lista de agentes.",
  "Run the project.": "Execute o projeto.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "O primeiro servidor para uma casa inteligente construído inteiramente em código aberto — desde a CPU até a nuvem descentralizada.",
  "Processor:": "Processador:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 com CPU RISC-V de 4 núcleos, 2 MB de cache L2, até 1,5 GHz, suporte ISA RV64GC",
  "GPU:": "GPU:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, até 600 MHz",
  "Memory:": "Memória:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 GB LPDDR4 SDRAM, até 2800 Mbps",
  "Storage:": "Armazenamento:",
  "32 GB TF card (minimum)": "Cartão TF de 32 GB (mínimo)",
  "Interfaces:": "Interfaces:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2x portas Ethernet Gigabit, 4x portas USB 3.0 Tipo-A, cabeçalho GPIO de 40 pinos, conector M.2, soquete eMMC, cabeçalho de ventilador de 2 pinos",
  "Power:": "Energia:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5V DC via USB-C, até 30 W (mínimo 3 A) ou entrada de 5V via GPIO de 40 pinos",
  "OS:": "SO:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Instalação do Home Assistant Core",
  "Robonomics Integration Installation": "Instalação da Integração Robonomics",
  "Zigbee Devices in Zigbee2MQTT": "Dispositivos Zigbee no Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Adicionar domínio RoSeMAN ao provedor remoto de mapas.",
  "All hardware": "Todo o hardware",
  "Use it": "Usar",
  "Learn": "Aprender",
  "Explore website": "Explorar o site",
  "Timeline since 2015": "Linha do tempo desde 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "A equipe está adquirindo novas habilidades em projetar e programar dispositivos inteligentes do zero. Os sensores sociais",
  "sensors.social": "sensores sociais",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "rede, onde dispositivos de teste desenvolvidos por engenheiros da Robonomics operam, foi criada. Uma linha de dispositivos domésticos inteligentes baseados em Tasmota Wi-Fi também foi desenvolvida e, desde o verão de 2024, esta linha está passando por certificação para o mercado da UE. No outono de 2024, a equipe do projeto irá introduzir uma linha de dispositivos de código aberto alimentados por tecnologias Web3, sob o nome \"Hardware for Cryptopunks.\"",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Robonomics continua a crescer dentro do ecossistema Polkadot. A parachain da rede Kusama está em funcionamento há mais de dois anos e, a partir do outono de 2024, uma parachain também será lançada na rede Polkadot. Mais de 5 milhões de transações de dispositivos de usuários foram registradas na rede. A equipe continua a explorar possibilidades de integrar suas implementações em ambas Ethereum e Polkadot.",
  "Robo Smart Devices:": "Dispositivos Inteligentes Robo:",
  "Read books": "Ler livros",
  "Robonomics merch": "Mercadorias da Robonomics",
  "Desktop": "Desktop",
  "Smartphone": "Smartphone",
  "our robo art wallpapers": "nossos papéis de parede de robô artístico",
  "Space monkey devcon 2024 special": "Espaço macaco devcon 2024 especial",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Baixe esta imagem para o seu dispositivo e participe da nossa busca especial Devcon 2024 em locais emocionantes ao redor de Bangkok!",
  "Free Wallpapers for you from our artists": "Papéis de parede gratuitos para você de nossos artistas",
  "Hide your folder with secret wallpaper": "Oculte sua pasta com papel de parede secreto",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "Criamos papéis de parede secretos apenas para você! Baixe o plano de fundo e os ícones da pasta, e suas pastas se misturarão perfeitamente à sua tela inicial, deixando apenas belas obras de arte visíveis.",
  "Desktop background": "Plano de fundo do desktop",
  "Mac OS icons": "Ícones do Mac OS",
  "Windows icons": "Ícones do Windows",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Um dispositivo não invasivo para instalação em painéis elétricos com montagem em trilho DIN. Construído no chip Espressif ESP32C6 com arquitetura RISC-V aberta.",
  "Sign up for updates": "Inscreva-se para receber atualizações",
  "Hardware for cyberpunks": "Hardware para cyberpunks",
  "Tech Blog & Updates": "Blog de Tecnologia e Atualizações",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Compartilhe e acesse dados de ruído, poeira e temperatura de outros sensores independentes próximos. Esqueça os servidores corporativos - esses dados são distribuídos de forma segura em todo o mundo através da inovadora tecnologia Web3.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Experimente o poder do verdadeiro DePIN (Rede de Infraestrutura Física Descentralizada) - um movimento tecnológico revolucionário que ganhou vida e prospera há anos em nosso",
  "decentralized sensor map": "mapa de sensores descentralizado",
  "3 ways to use it": "3 maneiras de usá-lo",
  "Check open-source sensor firmware on GitHub": "Verifique o firmware do sensor de código aberto no GitHub",
  "Operate your own Data Server": "Opere seu próprio Servidor de Dados",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "dando a você a liberdade de escolher quais servidores usar para processamento. Sem nuvens proprietárias, sem código oculto.",
  "Keep in mind, you can join the": "Lembre-se, você pode se juntar ao",
  "global decentralized sensor map": "mapa global de sensores descentralizados",
  "even with a sensor connected through your own server!": "mesmo com um sensor conectado através do seu próprio servidor!",
  "Run your own Interactive Map": "Execute seu próprio Mapa Interativo",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Ame a ideia de um mapa descentralizado, mas quer personalizá-lo com layouts extras e se tornar um administrador de uma nova infraestrutura de sensores soberanos? Você pode implantar",
  "your own version by forking": "sua própria versão bifurcando",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "nosso código de código aberto no GitHub (certifique-se de verificar o tipo de licença). Lembre-se de usar recursos de código aberto de forma responsável.",
  "Device Specifications": "Especificações do Dispositivo",
  "Input Voltage:": "Tensão de Entrada:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Hz",
  "Wireless protocol:": "Protocolo sem fio:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Suporta Wi-Fi 6 de 2,4 GHz (802.11 b/g/n) e Bluetooth 5 (LE), Zigbee com antena embutida",
  "Equipped with a high-performance": "Equipado com um processador RISC-V de alto desempenho",
  "32-bit RISC-V processor": "de 32 bits",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "com velocidade de clock de até 160 MHz, e um processador RISC-V de baixo consumo de 32 bits com velocidade de clock de até 20MHz",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320KB ROM, 512KB de HP SRAM, 16KB LP SRAM e 4MB de memória Flash",
  "USB-C": "USB-C",
  "for firmware development and updates": "para desenvolvimento e atualizações de firmware",
  "PM sensor:": "Sensor de PM:",
  "SDS011 laser PM2.5/PM10 sensor": "Sensor de PM2.5/PM10 a laser SDS011",
  "Supported sensors:": "Sensores suportados:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X, BME280, HTU21D; Sensor de Nível de Ruído: I2S INMP441; Contador Geiger: Radsens.",
  "Help & support": "Ajuda e suporte",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "Com o mapa descentralizado da Robonomics, você pode usar a Conectividade da Robonomics ou criar seu próprio Serviço de Conectividade.",
  "Your own Connectivity": "Sua própria Conectividade",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Um assistente doméstico inteligente que você vai gostar de cuidar, mesmo quando estiver longe. Apenas desenvolvedores.",
  "Robonomics open-source hardware": "Hardware de código aberto da Robonomics",
  "Open-source hardware": "Hardware de código aberto",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Experimente o poder do verdadeiro DePIN (Rede de Infraestrutura Física Descentralizada) - um movimento tecnológico revolucionário que ganhou vida e prospera com a Robonomics",
  "Home server with Web3 cloud": "Servidor doméstico com nuvem Web3",
  "Home server on RISC V": "Servidor doméstico em RISC V",
  "Supports": "Suporta",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "Wi-Fi 6 de 2,4GHz (802.11 b/g/n) e Bluetooth 5 (LE), com antena embutida",
  "Built in": "Construído em",
  "Onboard": "A bordo",
  "1.47inch LCD display, 172x320 resolution, 262K color": "Tela LCD de 1,47 polegadas, resolução de 172x320, 262 mil cores",
  "Adapting": "Adaptando",
  "integrates": "integra",
  "full-speed USB-С port": "porta USB-С de alta velocidade",
  "Onboard TF card slot": "Slot para cartão TF a bordo",
  "for external TF card storage of pictures or files": "para armazenamento externo de cartão TF de imagens ou arquivos",
  "Supports accurate control": "Suporta controle preciso",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "como relógio flexível e múltiplos modos de energia para realizar baixo consumo de energia em diferentes cenários",
  "Built-in RGB LED": "LED RGB embutido",
  "with clear acrylic sandwich panel for cool lighting effect": "com painel de acrílico transparente para efeito de iluminação legal",
  "Battery Level Gauge": "Indicador de Nível de Bateria",
  "Low-Power I2C Temperature sensor": "Sensor de Temperatura I2C de Baixa Potência",
  "RV-3032-C7 Real-Time Clock Module": "Módulo de Relógio em Tempo Real RV-3032-C7",
  "Battery 180mA": "Bateria 180mA",
  "Measuring Range:": "Para configurar o dispositivo, visite:",
  "0.1-80A": "0.1-80A",
  "Wireless Protocol:": "Protocolo sem fio:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (Wi-Fi de 2,4 GHz)",
  "CPU:": "CPU:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "ESP32-S3 MCU baseado em sistema em um chip (SoC) processador micro de núcleo duplo (Xtensa 32 bits LX7), até 240 MHz",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 KB ROM, 520 KB SRAM, 8 MB FLASH",
  "for development and updates": "para desenvolvimento e atualizações",
  "To configure the device, please visit:": "Para configurar o dispositivo, visite:",
  "multiple IO interfaces,": "múltiplas interfaces de E/S,",
  "Get updates about smart devices": "Receba atualizações sobre dispositivos inteligentes",
  "Receive regular emails from Robonomics": "Receba e-mails regulares da Robonomics",
  "Thanks for your submission!": "Obrigado pela sua inscrição!",
  "Not submitted": "Não enviado",
  "Notify me when available": "Me avise quando estiver disponível",
  "Captcha is not verified. Please, check your internet connection": "Captcha não verificado. Por favor, verifique sua conexão com a internet",
  "Thanks for the submition!": "Obrigado pela submissão!",
  "Submitting": "Submetendo",
  "Submit": "Submeter",
  "Follow for latest news and important updates": "Siga para as últimas notícias e atualizações importantes",
  "The best way to check open-source project": "A melhor maneira de verificar projetos de código aberto",
  "Useful, serious, cute videos, teasers etc.": "Vídeos úteis, sérios, fofos, teasers etc.",
  "Chat for engineers and developers": "Chat para engenheiros e desenvolvedores",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Chat não oficial para colegas de criptomoeda",
  "Rent in California, USA": "Aluguel na Califórnia, EUA",
  "Available by the Hour, Day, or Week": "Disponível por hora, dia ou semana",
  "Your name": "Seu nome",
  "Your comment": "Seu comentário",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Ao clicar neste botão, você concorda em receber um e-mail sobre o aluguel do Robô Humanóide Unitree G1.",
  "We'll get in touch shortly!": "Entraremos em contato em breve!",
  "Contact me": "Contate-me",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Um sensor inteligente que coleta dados ambientais e os integra em um mapa de sensores descentralizado.",
  "Smart Tamagotchi “Hikikomori“": "Smart Tamagotchi “Hikikomori“",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Uma placa de desenvolvimento de microcontrolador projetada para integrar com sistemas Web3. Pode ser seu tamagotchi de casa inteligente, um controle de jogos, uma ferramenta educacional - qualquer coisa que você projetar!",
  "Energy monitor with USB-C": "Monitor de energia com USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Um dispositivo não invasivo projetado para montagem em trilho DIN em painéis elétricos, rastreia o consumo e geração de eletricidade.",
  "Smart devices from Robonomics": "Dispositivos inteligentes da Robonomics",
  "Our values": "Nossos valores",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Nossos dispositivos são projetados para total transparência. Cada produto vem com processador RISC-V aberto, código aberto e esquemas de circuito, e instruções de atualização local - sem necessidade de conexões em nuvem. Você tem o poder de entender, personalizar e confiar em sua tecnologia desde o início",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "A combinação de comunicação P2P e nuvem Web3 garante que seus dispositivos estejam sempre conectados. Sem acesso à internet? Você ainda pode se conectar diretamente ao dispositivo. Mudando para uma nova região ou indo de férias? Seus dispositivos permanecerão online e acessíveis onde quer que você esteja",
  "Privacy by design": "Privacidade por design",
  "Trust the Code": "Confie no Código",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Totalmente de código aberto, sem algoritmos ocultos, sem vigilância corporativa. É transparência para o verdadeiro descentralista.",
  "Your data, your keys": "Seus dados, suas chaves",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Tenha total controle de seus dados com nosso módulo de conectividade totalmente de código aberto. Escolha entre Robonomics ou armazenamento em nuvem Web3 seguro com sua chave pessoal - sem nuvens fechadas, sem código opaco.",
  "Always Connected, Always Secure": "Sempre Conectado, Sempre Seguro",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "Comunicação local P2P e nuvem Web3 garantem que seu sensor esteja sempre acessível, não importa onde você esteja. Sem pontos de falha centralizados - apenas conexão pura e peer-to-peer.",
  "Join the Altruist Collective": "Junte-se ao Coletivo Altruista",
  "Plug the device into the global,": "Conecte o dispositivo globalmente,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Compartilhe suas informações ambientais com seus vizinhos, sua comunidade ou sua rede descentralizada.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Equipado com USB-C suporta WiFi e Zigbee. Registra dados de consumo e geração de eletricidade na rede Polkadot em intervalos de 10 minutos.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori é executado em uma placa de desenvolvimento de microcontrolador ESP32-C6, possui uma tela LCD, suporte Wi-Fi 6 e BLE 5.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori é adequado para o rápido desenvolvimento de aplicativos IoT alimentados por Web3. Isso pode ser seu tamagotchi de casa inteligente, um controle de jogos, uma ferramenta educacional - qualquer coisa que você projetar!",
  "Unitree G1 Humanoid Robot": "Robô Humanóide Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Alugue o robô humanóide de ponta para seus projetos de pesquisa, programação e entretenimento.",
  "Hour": "Hora",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Aluguel no local (Oakland, CA)",
  "Suitable for short tasks": "Adequado para tarefas curtas",
  "No engineering support included": "Sem suporte de engenharia incluído",
  "Day": "Dia",
  "$900": "$900",
  "Suitable for bigger tasks": "Adequado para tarefas maiores",
  "Basic engineering support included": "Suporte básico de engenharia incluído",
  "Week+": "Semana+",
  "On demand": "Sob demanda",
  "Delivery to your location": "Entrega para sua localização",
  "Customized approach": "Abordagem personalizada",
  "Engineering support can be included": "Suporte de engenharia pode ser incluído",
  "Enter the new era": "Entre na nova era",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "O robô humanóide G1 com seus recursos inovadores oferece versatilidade para necessidades de pesquisa, programação e entretenimento. O Unitree G1 inclui uma Mão Dextrous de Controle de Potência, permitindo que ele realize tarefas delicadas como manusear objetos, pressionar botões e realizar outras operações precisas com vários itens.",
  "Tech specification": "Especificações técnicas",
  "Height, Width and Thickness（Stand）": "Altura, Largura e Espessura (Suporte)",
  "1320x450x200mm": "1320x450x200mm",
  "Height, Width and Thickness（Fold）": "Altura, Largura e Espessura (Dobrado)",
  "690x450x300mm": "690x450x300mm",
  "Weight (With Battery)": "Peso (Com Bateria)",
  "About 35kg": "Aproximadamente 35kg",
  "Arm Maximum Load": "Carga Máxima do Braço",
  "About 2Kg": "Aproximadamente 2Kg",
  "Cooling System": "Sistema de Refrigeração",
  "Local air cooling": "Refrigeração local do ar",
  "Smart Battery (Quick Release)": "Bateria Inteligente (Liberação Rápida)",
  "9000mAh": "9000mAh",
  "Charger": "Carregador",
  "54V 5A": "54V 5A",
  "Battery Life": "Vida Útil da Bateria",
  "About 2h": "Aproximadamente 2h",
  "Sensing Sensor": "Sensor de Detecção",
  "Depth Camera+3D LiDAR": "Câmera de Profundidade + LiDAR 3D",
  "5W Speaker": "Alto-falante de 5W",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6, Bluetooth 5.2",
  "Manual Controller": "Controlador Manual",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Assuma o controle de seus dados de casa inteligente com servidor doméstico de código aberto em processador RISC-V e conectividade Web3.",
  "Surveillance-free": "Livre de vigilância",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Sem registros de dados ocultos em servidores corporativos, permitindo ainda acesso remoto seguro.",
  "No vendor lock-in": "Sem bloqueio de fornecedor",
  "Supports over 3000 integrations with devices from various manufacturers.": "Suporta mais de 3000 integrações com dispositivos de vários fabricantes.",
  "Open hardware": "Hardware aberto",
  "Open processor architecture and open-source code ensure a trustless system.": "Arquitetura de processador aberto e código aberto garantem um sistema sem confiança.",
  "Open and efficient hardware": "Hardware aberto e eficiente",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "O nosso Servidor Doméstico é alimentado por um processador RISC-V e apresenta esquemáticos de placa de circuito totalmente transparentes. RISC-V é uma arquitetura de processador aberta e modular que vem com uma licença BSD. Ao contrário do ARM proprietário, oferece flexibilidade para personalização sem restrições de licenciamento, tornando-o ideal para dispositivos e servidores IoT sem confiança.",
  "Vendor agnostic smart home heart": "Coração de casa inteligente agnóstico de fornecedor",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "O servidor vem pré-instalado com o Home Assistant, uma plataforma de automação residencial de código aberto, dando-lhe controle total da sua casa inteligente sem depender de serviços de nuvem de terceiros.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "O seu design modular permite-lhe adicionar facilmente componentes, automações e integrações, suportando mais de 3.000 dispositivos de vários fabricantes sem bloqueio de fornecedor. Com suporte para os protocolos Zigbee e Wi-Fi, pode ligar uma vasta gama de dispositivos, desde sensores de temperatura até monitores de consumo de energia, tudo para um servidor local.",
  "Designed for privacy": "Projetado para privacidade",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "O nosso servidor de casa inteligente elimina a interferência corporativa, mantendo os seus dados locais ou encriptados com a sua chave pessoal em armazenamento descentralizado Web3. Desfrute de privacidade completa sem rastreamento, sem vigilância - apenas controlo seguro e sem confiança sobre a sua casa inteligente.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "Com o controlo remoto P2P e em nuvem Web3 da Robonomics, obtém acesso criptográfico a todas as funções da casa inteligente:",
  "hour": "hora",
  "hours": "horas",
  "day": "dia",
  "days": "dias",
  "week": "semana",
  "weeks": "semanas",
  "on demand": "a pedido",
  "Special offer": "Oferta especial",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Tenha acesso exclusivo a um dos primeiros robôs humanoides comercialmente disponíveis. Opções de aluguel flexíveis para necessidades de pesquisa, programação e entretenimento.",
  "Access current device states remotely": "Acesse estados atuais dos dispositivos remotamente",
  "Control devices remotely via parachain or LibP2P": "Controle dispositivos remotamente via parachain ou LibP2P",
  "Manage Home Assistant users": "Gerencie usuários do Home Assistant",
  "Back up and restore Home Assistant configurations": "Faça backup e restaure configurações do Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Armazene o gêmeo digital de sua casa em uma nuvem segura e descentralizada",
  "Books": "Livros",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "Em 2022, a equipe da Robonomics começou a colaborar com outras equipes de parachain dentro do ecossistema Polkadot para aproveitar as forças únicas desta rede descentralizada. Essa colaboração resultou no lançamento de um Serviço de Backup e Arquivamento de Dados projetado especificamente para empresas de robótica.",
  "Digital markets for robots": "Mercados digitais para robôs",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "O desenvolvimento de robótica e sistemas automatizados durante a Quarta Revolução Industrial exigirá que os robôs tenham a capacidade de solicitar serviços para sua própria manutenção.",
  "Tokenization of Data of IOT devices": "Tokenização de dados de dispositivos IOT",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "A tokenização de dados de dispositivos IoT (Internet das Coisas) representa um desenvolvimento inovador na economia digital.",
  "Industrial zone management with capital": "Gestão de zona industrial com capital",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "Este caso explora o papel das fábricas inteligentes na resposta às mudanças de capital nos mercados modernos. Como parte da transformação da Indústria 4.0, ele introduz um protocolo de comunicação descentralizado usando sistemas ciberfísicos para melhorar a coordenação econômica entre agentes industriais.",
  "Mars colonization, impossible without kusama": "Colonização de Marte, impossível sem kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Este caso de P&D explora o papel da infraestrutura descentralizada da rede Kusama no suporte a missões interplanetárias, especialmente a colonização de Marte.",
  "A decentralized system for negotiating road space": "Um sistema descentralizado para negociar espaço rodoviário",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Nosso objetivo era desenvolver um sistema descentralizado para negociar espaço rodoviário onde veículos autônomos possam pagar por rotas e permissões.",
  "Almanac": "Almanaque",
  "Robonomics' Approach": "Abordagem da Robonomics",
  "Robonomics provides an alternative to centralized corporate-controlled cloud services. Instead of relying on such systems, it leverages public blockchain networks, such as Ethereum and Polkadot, to facilitate secure and autonomous transactions between robots and service providers.": "A Robonomics oferece uma alternativa aos serviços em nuvem centralizados controlados por corporações. Em vez de depender desses sistemas, ela aproveita redes blockchain públicas, como Ethereum e Polkadot, para facilitar transações seguras e autônomas entre robôs e provedores de serviços.",
  "How Digital Markets for Robots Work": "Como funcionam os mercados digitais para robôs",
  "Key Benefits": "Benefícios principais",
  "Digital markets for robots represent a critical step toward supporting the next wave of automation and smart city infrastructure. Robonomics' decentralized approach ensures secure, scalable, and autonomous service management for robots.": "Os mercados digitais para robôs representam um passo crítico para apoiar a próxima onda de automação e infraestrutura de cidades inteligentes. A abordagem descentralizada da Robonomics garante gerenciamento de serviços seguro, escalável e autônomo para robôs.",
  "Conclusion": "Conclusão",
  "Why Smart Factories Should Respond to Capital Changes": "Por que as fábricas inteligentes devem responder às mudanças de capital",
  "A Decentralized Protocol for Economic Coordination": "Um protocolo descentralizado para coordenação econômica",
  "Balancing Production and Capital": "Equilibrando Produção e Capital",
  "Technical Foundation": "Fundação técnica",
  "This R&D case presents how capital flows can act as economic signals for smart factories. By adopting Robonomics' decentralized protocol, industries can better manage production efficiency and stay aligned with the evolving standards of Industry 4.0.": "Este caso de P&D apresenta como os fluxos de capital podem atuar como sinais econômicos para fábricas inteligentes. Ao adotar o protocolo descentralizado da Robonomics, as indústrias podem gerenciar melhor a eficiência de produção e permanecer alinhadas com os padrões em evolução da Indústria 4.0.",
  "Exploring Kusama's Role in Space Exploration": "Explorando o papel da Kusama na exploração espacial",
  "The Mars Rover Experiment": "O Experimento do Rover de Marte",
  "Technical Implementation": "Implementação técnica",
  "Use Cases and Potential Impact": "Casos de uso e impacto potencial",
  "A fun video about the use of KUSAMA on Mars:": "Um vídeo divertido sobre o uso do KUSAMA em Marte:",
  "This R&D case demonstrates how the Kusama network can support scientific exploration, resource management, and data transparency for space missions. The decentralized architecture offers a promising foundation for the future of Mars colonization and beyond.": "Este caso de P&D demonstra como a rede Kusama pode apoiar exploração científica, gerenciamento de recursos e transparência de dados para missões espaciais. A arquitetura descentralizada oferece uma base promissora para o futuro da colonização de Marte e além.",
  "The Challenge": "O Desafio",
  "The Solution": "A Solução",
  "Here is the project presentation during the MOBI GRAND CHALLENGE": "Aqui está a apresentação do projeto durante o MOBI GRAND CHALLENGE",
  "We want to give special thanks to the Jetbrains Team’s Mobile Robot Algorithms Laboratory for giving us access to Duckietown.": "Queremos agradecer especialmente à Equipe de Algoritmos de Robôs Móveis da Jetbrains por nos dar acesso ao Duckietown.",
  "Special Thanks": "Agradecimentos Especiais",
  "With robots generating enormous amounts of data—including videos, raw technical data, and logs—storage can become a significant challenge, especially at scale. This new service offers an affordable and secure solution to meet these needs.": "Com robôs gerando enormes quantidades de dados - incluindo vídeos, dados técnicos brutos e logs - o armazenamento pode se tornar um desafio significativo, especialmente em escala. Este novo serviço oferece uma solução acessível e segura para atender a essas necessidades.",
  "Addressing the Challenge of Data Storage": "Abordando o Desafio do Armazenamento de Dados",
  "Our Solution: A Decentralized Approach": "Nossa Solução: Uma Abordagem Descentralizada",
  "Key Technology Behind the Service": "Tecnologia-chave por trás do serviço",
  "Why This Service Is Essential": "Por que este serviço é essencial",
  "Looking Ahead": "Olhando para o futuro",
  "For additional details about the collaboration between Robonomics and Crust Network and how decentralized storage is reshaping data management for robotics companies, visit the official": "Para mais detalhes sobre a colaboração entre Robonomics e Crust Network e como o armazenamento descentralizado está remodelando a gestão de dados para empresas de robótica, visite o",
  "blog": "blog",
  "Learn More About the Collaboration": "Saiba mais sobre a colaboração",
  "Send a request message and get the result from the autonomous agent. The resulting file is saved to IPFS and the resultant message requires a signature with a private key.": "Envie uma mensagem de solicitação e obtenha o resultado do agente autônomo. O arquivo resultante é salvo no IPFS e a mensagem resultante requer uma assinatura com uma chave privada.",
  "Overview": "Visão geral",
  "This case study explores how Robonomics Network facilitates decentralized data access using IoT devices and blockchain technology. By leveraging the Robonomics dApp connected to a weather sensor on Fuji Mountain, users can obtain real-time weather data securely and transparently.": "Este estudo de caso explora como a Rede Robonomics facilita o acesso descentralizado a dados usando dispositivos IoT e tecnologia blockchain. Ao alavancar o dApp da Robonomics conectado a um sensor de clima no Monte Fuji, os usuários podem obter dados meteorológicos em tempo real de forma segura e transparente.",
  "How does it work?": "Como funciona?",
  "Technical Insights": "Percepções técnicas",
  "Here's a walkthrough video:": "Aqui está um vídeo explicativo:",
  "This R&D case highlights the capabilities of decentralized technologies in real-world data collection and access. Robonomics Network empowers secure, verifiable data retrieval from IoT sensors, advancing the reliability of environmental monitoring solutions.": "Este caso de P&D destaca as capacidades de tecnologias descentralizadas na coleta e acesso de dados do mundo real. A Rede Robonomics capacita a recuperação segura e verificável de dados de sensores IoT, avançando a confiabilidade de soluções de monitoramento ambiental.",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy. By leveraging blockchain technology, IoT devices can generate, verify, and tokenize data as units of value, creating a secure and transparent mechanism for digital asset creation.": "A tokenização de dados de dispositivos IoT (Internet das Coisas) representa um desenvolvimento inovador na economia digital. Ao alavancar a tecnologia blockchain, dispositivos IoT podem gerar, verificar e tokenizar dados como unidades de valor, criando um mecanismo seguro e transparente para a criação de ativos digitais.",
  "Background": "Contexto",
  "The Role of IoT Devices in Tokenization": "O Papel dos Dispositivos IoT na Tokenização",
  "Key Benefits of Tokenized IoT Data": "Principais Benefícios dos Dados IoT Tokenizados",
  "Tokenizing IoT data through blockchain not only enhances data security and transparency but also paves the way for autonomous, machine-driven economies. This transformative approach creates a new generation of tokenized assets, unlocking immense potential for global innovation and economic growth.": "A tokenização de dados IoT por meio de blockchain não apenas aprimora a segurança e transparência dos dados, mas também abre caminho para economias autônomas e orientadas por máquinas. Esta abordagem transformadora cria uma nova geração de ativos tokenizados, desbloqueando um imenso potencial para inovação global e crescimento econômico.",
  "Last updated: February 03, 2025": "Última atualização: 03 de fevereiro de 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Esta Política de Privacidade descreve nossas políticas e procedimentos sobre a coleta, uso e divulgação de suas informações quando você usa o Serviço e informa sobre seus direitos de privacidade e como a lei o protege.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Usamos seus dados pessoais para fornecer e melhorar o Serviço. Ao usar o Serviço, você concorda com a coleta e uso de informações de acordo com esta Política de Privacidade.",
  "Interpretation and Definitions": "Interpretação e Definições",
  "Interpretation": "Interpretação",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "As palavras cuja letra inicial é maiúscula têm significados definidos nas seguintes condições. As seguintes definições terão o mesmo significado, independentemente de aparecerem no singular ou no plural.",
  "Definitions": "Definições",
  "For the purposes of this Privacy Policy:": "Para os fins desta Política de Privacidade:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(referido como \"o DAO\", \"Nós\", \"Nosso\" ou \"Nossos\" neste Acordo) refere-se à organização autônoma descentralizada Robonomics Network, um operador para o site",
  "(referred to as": "(referido como",
  "Website": "Site",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "neste Acordo). Para os fins do GDPR, o DAO é o Controlador de Dados.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "são pequenos arquivos que são colocados em seu computador, dispositivo móvel ou qualquer outro dispositivo por um site, contendo os detalhes do seu histórico de navegação naquele site entre seus muitos usos. Informações mais detalhadas sobre cookies e como eles funcionam podem ser encontradas em:",
  "Country": "País",
  "refers to: Cyprus.": "refere-se a: Chipre.",
  "Data Controller": "Controlador de Dados",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "para os fins do GDPR (Regulamento Geral de Proteção de Dados), refere-se ao DAO como a pessoa jurídica que sozinha ou em conjunto com outros determina as finalidades e os meios do processamento de Dados Pessoais.",
  "Device": "Dispositivo",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "significa qualquer dispositivo que pode acessar o Serviço, como um computador, um celular ou um tablet digital.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "refere-se ao Regulamento Geral de Proteção de Dados da UE.",
  "Personal Data": "Dados Pessoais",
  "is any information that relates to an identified or identifiable individual.": "são quaisquer informações que se relacionem com um indivíduo identificado ou identificável.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Para os fins do GDPR, Dados Pessoais significam quaisquer informações relacionadas a você, como um nome, um número de identificação, dados de localização, identificador online ou um ou mais fatores específicos da identidade física, fisiológica, genética, mental, econômica, cultural ou social.",
  "Service": "Serviço",
  "refers to the Website": "refere-se ao Site",
  "Service Provider": "Prestador de Serviços",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "significa qualquer pessoa física ou jurídica que processe os dados em nome do DAO. Refere-se a empresas ou indivíduos de terceiros empregados pelo DAO para facilitar o Serviço, para fornecer o Serviço em nome do DAO, para realizar serviços relacionados ao Serviço ou para ajudar o DAO a analisar como o Serviço é usado. Para os fins do GDPR, os Prestadores de Serviços são considerados Processadores de Dados.",
  "Usage Data": "Dados de Uso",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "referem-se a dados coletados automaticamente, gerados pelo uso do Serviço ou da própria infraestrutura do Serviço (por exemplo, a duração de uma visita à página).",
  "You": "Você",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(referido como \"Seu\" neste Acordo) significa o indivíduo que acessa ou usa o Serviço, ou o DAO, ou outra entidade jurídica em nome da qual tal indivíduo está acessando ou usando o Serviço, conforme aplicável.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Nos termos do GDPR, você pode ser referido como o Titular dos Dados ou como o Usuário, pois você é o indivíduo que usa o Serviço.",
  "Collecting and Using Your Personal Data": "Coleta e Uso de Seus Dados Pessoais",
  "Types of Data Collected": "Tipos de Dados Coletados",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Ao usar nosso Serviço, podemos solicitar que você nos forneça certas informações pessoalmente identificáveis que podem ser usadas para contatá-lo ou identificá-lo. As informações pessoalmente identificáveis podem incluir, mas não estão limitadas a:",
  "Email address": "Endereço de e-mail",
  "First name and last name": "Nome e sobrenome",
  "Usage Data is collected automatically when using the Service.": "Dados de Uso são coletados automaticamente ao usar o Serviço.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Os Dados de Uso podem incluir informações como o endereço de Protocolo de Internet do seu Dispositivo (por exemplo, endereço IP), tipo de navegador, versão do navegador, as páginas de nosso Serviço que você visita, a hora e a data de sua visita, o tempo gasto nessas páginas, identificadores de dispositivos exclusivos e outros dados de diagnóstico.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Quando você acessa o Serviço por meio de um dispositivo móvel, podemos coletar automaticamente certas informações, incluindo, mas não se limitando a, o tipo de dispositivo móvel que você usa, seu ID exclusivo de dispositivo móvel, o endereço IP do seu dispositivo móvel, seu sistema operacional móvel, o tipo de navegador de Internet móvel que você usa, identificadores de dispositivos exclusivos e outros dados de diagnóstico.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Também podemos coletar informações que seu navegador envia sempre que você visita nosso Serviço ou quando você acessa o Serviço por meio de um dispositivo móvel.",
  "Cookies & Browser Storage": "Cookies e Armazenamento do Navegador",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Os Sites podem usar cookies. Usamos cookies e armazenamento do navegador apenas para configurações essenciais para melhorar sua experiência—não para rastreamento. Eles ajudam a lembrar suas preferências, como configurações de idioma ou escolhas de consentimento, para que você não precise redefini-las toda vez que visitar.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Não usamos cookies para rastreamento ou publicidade personalizada. Você pode gerenciar ou desativar os cookies nas configurações do seu navegador, mas algumas funcionalidades podem não funcionar corretamente sem eles.",
  "Matomo Analytics": "Análise Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Nosso site pode usar o Matomo, uma plataforma de análise de código aberto, para obter insights sobre o uso do site. Isso inclui dados anonimizados, como:",
  "Pages visited and navigation paths": "Páginas visitadas e caminhos de navegação",
  "Time spent on our website": "Tempo gasto em nosso site",
  "Whether you’re a returning or new visitor": "Se você é um visitante novo ou recorrente",
  "Your device type (desktop, mobile, etc.)": "O tipo de dispositivo que você usa (desktop, móvel, etc.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Para proteger sua privacidade, seu endereço IP é anonimizado antes de ser armazenado. Os dados que coletamos são usados apenas para melhorar o site e não são usados para identificação pessoal.",
  "Under Art. 6(1)(f) GDPR": "Nos termos do artigo 6(1)(f) do GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "processamos esses dados com base no nosso interesse legítimo em melhorar os nossos serviços.",
  "Opt-Out Option": "Opção de Desativação",
  "You can disable Matomo tracking at any time:": "Você pode desativar o rastreamento do Matomo a qualquer momento:",
  "Use of Your Personal Data": "Uso dos Seus Dados Pessoais",
  "The DAO may use Personal Data for the following purposes:": "O DAO pode usar Dados Pessoais para os seguintes fins:",
  "To provide and maintain our Service": "Para fornecer e manter o nosso Serviço",
  "including to monitor the usage of our Service.": "incluindo para monitorar o uso do nosso Serviço.",
  "For the performance of a contract": "Para a execução de um contrato",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "o desenvolvimento, cumprimento e realização do contrato de compra dos produtos, itens ou serviços que Você adquiriu ou de qualquer outro contrato conosco através do Serviço.",
  "To contact You": "Para entrar em contato com Você",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Para entrar em contato com Você por e-mail, chamadas telefônicas, SMS ou outras formas equivalentes de comunicação eletrônica, como notificações push de aplicativos móveis sobre atualizações ou comunicações informativas relacionadas às funcionalidades, produtos ou serviços contratados, incluindo as atualizações de segurança, quando necessário ou razoável para sua implementação.",
  "To provide You": "Para fornecer a Você",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "notícias, ofertas especiais e informações gerais sobre outros bens, serviços e eventos que oferecemos e que sejam semelhantes aos que você já adquiriu ou perguntou, a menos que Você tenha optado por não receber tais informações.",
  "To manage Your requests": "Para gerenciar Suas solicitações",
  "To attend and manage Your requests to Us.": "Para atender e gerenciar Suas solicitações para nós.",
  "For other purposes": "Para outros fins",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Podemos usar Suas informações para outros fins, como análise de dados, identificação de tendências de uso, determinação da eficácia de nossas campanhas promocionais e para avaliar e melhorar nosso Serviço, produtos, serviços, marketing e sua experiência.",
  "We may share Your personal information in the following situations:": "Podemos compartilhar Suas informações pessoais nas seguintes situações:",
  "With Service Providers": "Com Prestadores de Serviços",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Podemos compartilhar Suas informações pessoais com Prestadores de Serviços para monitorar e analisar o uso do nosso Serviço, para entrar em contato com Você.",
  "With Your consent": "Com o Seu consentimento",
  "We may disclose Your personal information for any other purpose with Your consent.": "Podemos divulgar Suas informações pessoais para qualquer outro fim com o Seu consentimento.",
  "Retention of Your Personal Data": "Retenção dos Seus Dados Pessoais",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "O DAO reterá Seus Dados Pessoais apenas pelo tempo necessário para os fins estabelecidos nesta Política de Privacidade. Reteremos e usaremos Seus Dados Pessoais na medida do necessário para cumprir nossas obrigações legais (por exemplo, se formos obrigados a reter seus dados para cumprir leis aplicáveis), resolver disputas e fazer cumprir nossos acordos legais e políticas.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "O DAO também reterá Dados de Uso para fins de análise interna. Os Dados de Uso geralmente são retidos por um período de tempo mais curto, exceto quando esses dados são usados para fortalecer a segurança ou melhorar a funcionalidade do Nosso Serviço, ou somos legalmente obrigados a reter esses dados por períodos mais longos.",
  "Security of Your Personal Data": "Segurança dos Seus Dados Pessoais",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "A segurança dos Seus Dados Pessoais é importante para Nós, mas lembre-se de que nenhum método de transmissão pela Internet, ou método de armazenamento eletrônico é 100% seguro. Embora nos esforcemos para usar meios comercialmente aceitáveis para proteger Seus Dados Pessoais, não podemos garantir sua segurança absoluta.",
  "Detailed Information on the Processing of Your Personal Data": "Informações Detalhadas sobre o Processamento dos Seus Dados Pessoais",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Suas informações, incluindo Dados Pessoais, são processadas no(s) provedor(es) de serviços do site do DAO e em qualquer outro local onde as partes envolvidas no processamento estejam localizadas. Isso significa que essas informações podem ser transferidas para — e mantidas em — computadores localizados fora do seu estado, província, país ou outra jurisdição governamental onde as leis de proteção de dados podem ser diferentes das da sua jurisdição.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Seu consentimento a esta Política de Privacidade seguido pelo envio de tais informações representa Sua concordância com essa transferência.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "O DAO tomará todas as medidas razoavelmente necessárias para garantir que Seus dados sejam tratados de forma segura e de acordo com esta Política de Privacidade e nenhuma transferência de Seus Dados Pessoais será feita para uma organização ou país, a menos que haja controles adequados em vigor, incluindo a segurança de Seus dados e outras informações pessoais.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Por favor, note que qualquer transmissão de dados pela Internet (por exemplo, comunicação por e-mail) geralmente não é segura e não aceitamos nenhuma responsabilidade por dados transmitidos para nós via Internet. Infelizmente, a proteção absoluta não é tecnicamente possível. Essas informações não se aplicam ao site de terceiros e aos links correspondentes fornecidos em nosso site. O DAO não assume nenhuma responsabilidade por estes.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Os Prestadores de Serviços que usamos podem ter acesso aos Seus Dados Pessoais. Esses fornecedores terceirizados coletam, armazenam, usam, processam e transferem informações sobre Sua atividade em Nosso Serviço de acordo com suas Políticas de Privacidade.",
  "Email Marketing": "Marketing por E-mail",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Podemos usar Seus Dados Pessoais para entrar em contato com Você com boletins informativos, materiais de marketing ou promocionais e outras informações que possam ser do Seu interesse. Você pode optar por não receber qualquer, ou todos, essas comunicações de Nós seguindo o link de cancelamento de inscrição ou as instruções fornecidas em qualquer e-mail que enviarmos ou entrando em contato conosco.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Podemos usar Provedores de Serviços de Email Marketing para gerenciar e enviar emails para Você;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Sua Política de Privacidade pode ser visualizada em",
  "Usage, Performance and Miscellaneous": "Uso, Desempenho e Diversos",
  "We may use third-party Service Providers to maintain and improve our Service.": "Podemos usar Provedores de Serviços de terceiros para manter e melhorar nosso Serviço.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "Privacidade GDPR",
  "Legal Basis for Processing Personal Data under GDPR": "Base Legal para o Processamento de Dados Pessoais sob o GDPR",
  "We may process Personal Data under the following conditions:": "Podemos processar Dados Pessoais nas seguintes condições:",
  "Consent:": "Consentimento:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Você deu seu consentimento para o processamento de Dados Pessoais para um ou mais propósitos específicos.",
  "Performance of a contract:": "Execução de um contrato:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "A disponibilização de Dados Pessoais é necessária para a execução de um acordo com Você e/ou para quaisquer obrigações pré-contratuais relacionadas.",
  "Legal obligations:": "Obrigações legais:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "O processamento de Dados Pessoais é necessário para o cumprimento de uma obrigação legal à qual o DAO está sujeito.",
  "Vital interests:": "Interesses vitais:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "O processamento de Dados Pessoais é necessário para proteger seus interesses vitais ou de outra pessoa natural.",
  "Public interests:": "Interesses públicos:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "O processamento de Dados Pessoais está relacionado a uma tarefa realizada no interesse público ou no exercício da autoridade oficial investida no DAO.",
  "Legitimate interests:": "Interesses legítimos:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "O processamento de Dados Pessoais é necessário para os fins dos interesses legítimos perseguidos pelo DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "Em qualquer caso, o DAO terá prazer em ajudar a esclarecer a base legal específica que se aplica ao processamento, e em particular se a disponibilização de Dados Pessoais é um requisito estatutário ou contratual, ou um requisito necessário para celebrar um contrato.",
  "Your Rights under the GDPR": "Seus Direitos sob o GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "O DAO se compromete a respeitar a confidencialidade de seus Dados Pessoais e garantir que você possa exercer seus direitos.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "Você tem o direito, sob esta Política de Privacidade e por lei, se estiver dentro da UE, de:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "O direito de acessar, atualizar ou excluir as informações que temos sobre Você. Sempre que possível, você pode acessar, atualizar ou solicitar a exclusão de seus Dados Pessoais diretamente na seção de configurações de sua conta. Se você não puder realizar essas ações sozinho, entre em contato conosco para ajudá-lo. Isso também permite que você receba uma cópia dos Dados Pessoais que temos sobre você.",
  "Request correction of the Personal Data that We hold about You.": "Solicitar correção dos Dados Pessoais que temos sobre você.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "Você tem o direito de ter quaisquer informações incompletas ou imprecisas que temos sobre você corrigidas.",
  "Object to processing of Your Personal Data.": "Opor-se ao processamento de seus Dados Pessoais.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Esse direito existe quando estamos confiando em um interesse legítimo como base legal para nosso processamento e há algo sobre sua situação particular que faz você querer se opor ao nosso processamento de seus Dados Pessoais nesse fundamento. Você também tem o direito de se opor quando estamos processando seus Dados Pessoais para fins de marketing direto.",
  "Request erasure of Your Personal Data.": "Solicitar a exclusão de seus Dados Pessoais.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "Você tem o direito de nos pedir para excluir ou remover Dados Pessoais quando não houver motivo para continuarmos processando-os.",
  "Request the transfer of Your Personal Data.": "Solicitar a transferência de seus Dados Pessoais.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Forneceremos a você, ou a um terceiro que você escolheu, seus Dados Pessoais em um formato estruturado, comumente usado e legível por máquina. Observe que esse direito se aplica apenas a informações automatizadas para as quais você inicialmente forneceu consentimento para nós usar ou quando usamos as informações para realizar um contrato com você.",
  "Withdraw Your consent.": "Retirar seu consentimento.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "Você tem o direito de retirar seu consentimento para o uso de seus Dados Pessoais. Se você retirar seu consentimento, podemos não ser capazes de fornecer acesso a determinadas funcionalidades específicas do Serviço.",
  "Exercising of Your GDPR Data Protection Rights": "Exercício de Seus Direitos de Proteção de Dados do GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Você pode exercer seus direitos de acesso, retificação, cancelamento e oposição entrando em contato conosco. Observe que podemos solicitar que você verifique sua identidade antes de responder a tais solicitações. Se você fizer uma solicitação, faremos o possível para responder a você o mais rápido possível.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "Você tem o direito de reclamar com uma Autoridade de Proteção de Dados sobre nossa coleta e uso de seus Dados Pessoais. Para obter mais informações, se estiver na Área Econômica Europeia (EEA), entre em contato com a autoridade local de proteção de dados na EEA.",
  "Children's Privacy": "Privacidade das Crianças",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Nosso Serviço não se destina a menores de 13 anos. Não coletamos intencionalmente informações de identificação pessoal de menores de 13 anos. Se você é pai ou responsável e tem conhecimento de que seu filho nos forneceu Dados Pessoais, entre em contato conosco. Se tomarmos conhecimento de que coletamos Dados Pessoais de menores de 13 anos sem verificação do consentimento dos pais, tomaremos medidas para remover essas informações de nossos servidores.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Se precisarmos contar com o consentimento como base legal para o processamento de suas informações e seu país exigir o consentimento de um dos pais, poderemos exigir o consentimento de seus pais antes de coletar e usar essas informações.",
  "Links to Other Websites": "Links para Outros Sites",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Nosso Serviço pode conter links para outros sites que não são operados por nós. Se você clicar em um link de terceiros, será direcionado para o site desse terceiro. Recomendamos fortemente que você revise a Política de Privacidade de cada site que visitar.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Não temos controle sobre e não assumimos responsabilidade pelo conteúdo, políticas de privacidade ou práticas de quaisquer sites ou serviços de terceiros.",
  "Changes to this Privacy Policy": "Alterações a esta Política de Privacidade",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Podemos atualizar nossa Política de Privacidade de tempos em tempos. Vamos notificá-lo de quaisquer alterações postando a nova Política de Privacidade nesta página.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Vamos informá-lo por e-mail e/ou por um aviso proeminente em nosso Serviço, antes que a alteração entre em vigor e atualizaremos a data de \"Última atualização\" no topo desta Política de Privacidade.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "É aconselhável que você revise esta Política de Privacidade periodicamente para quaisquer alterações. As alterações nesta Política de Privacidade entram em vigor quando são postadas nesta página.",
  "Contact Us": "Contate-nos",
  "If you have any questions about this Privacy Policy, You can contact us:": "Se você tiver alguma dúvida sobre esta Política de Privacidade, você pode nos contatar:",
  "By visiting this page on our website:": "Visitando esta página em nosso site:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Este Acordo foi originalmente escrito em inglês. Esta tradução de IA é fornecida apenas para sua referência.",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Ao clicar no botão “Enviar”, você concorda em receber e-mails regulares da Robonomics (não mais do que 1 por mês) e concorda com",
  "Request access to Your Personal Data.": "Solicitar acesso aos seus Dados Pessoais.",
  "Aira is back": "Aira está de volta",
  "Transform your screen with our brand new wallpaper—download now!": "Transforme sua tela com nosso novo papel de parede - baixe agora!",
  "Open-Source Hardware & Software": "Hardware e Software de Código Aberto",
  "Independent Decentralized Network Technologies": "Tecnologias de Rede Descentralizadas Independentes",
  "Colorful 3D-Printed Cases of Your Choice": "Estojos Coloridos Impressos em 3D da Sua Escolha",
  "Order Now": "Faça seu Pedido Agora",
  "Altruist": "Altruista",
  "3 highlights for you": "3 destaques para você",
  "Our special wallpapers to commemorate the launch of the Outdoor sensor “Altruist“": "Nossos papéis de parede especiais para comemorar o lançamento do sensor externo 'Altruist'",
  "Order from the EU": "Encomende da UE",
  "In its natural habitat": "Em seu habitat natural",
  "Tag": "Marque",
  "(Robonomics Hardware) in your post with a photo.": "(Hardware Robonomics) em sua postagem com uma foto.",
  "Share Your “Altruist” in Action": "Compartilhe o seu “Altruísta” em Ação",
  "Air Quality Sensor “ALTRUIST“": "Sensor de Qualidade do Ar “ALTRUIST“",
  "Europe": "Europa",
  "Japan": "Japão",
  "Order from the Japan": "Pedido do Japão",
  "Russia": "Rússia",
  "Order from the Russia": "Pedido da Rússia",
  "With the Altruist Air Quality Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data — signed, mapped, and shared across a distributed network.": "Com o Sensor de Qualidade do Ar Altruist, você se torna uma força no monitoramento ambiental descentralizado. Capture dados de ruído, poeira e temperatura — assinados, mapeados e compartilhados em uma rede distribuída.",
  "Early bird price": "Preço de lançamento",
  "Coming in early 2025": "Chegando no início de 2025",
  "Now Available!": "Agora disponível!",
  "Worldwide Shipping": "Envio mundial",
  "Multi-tool Device for developers": "Dispositivo multiuso para desenvolvedores",
  "Design your own software": "Projete seu próprio software",
  "OPEN-SOURCE HARDWARE": "HARDWARE DE CÓDIGO ABERTO",
  "Extend it in whatever way you like": "Estenda-o da maneira que desejar",
  "Real-time monitor of electricity consumption": "Monitor em tempo real do consumo de eletricidade",
  "INDEPENDENT DECENTRALIZED data backup": "Backup de dados descentralizado e independente",
  "OPEN-SOURCE HARDWARE & SOFTWARE": "HARDWARE E SOFTWARE DE CÓDIGO ABERTO",
  "Robonomics Hardware logos": "Logotipos de Hardware Robonomics"
}