{
  "What is Robonomics network?": "O que é a rede robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "A Robonomics é uma plataforma de código aberto para aplicações IoT. Oferecemos suporte a uma nova geração de tecnologias da internet (web3) que implementam a troca de informações técnicas e econômicas na forma de transações atômicas entre aplicações do usuário, serviços da Internet e robótica complexa.",
  "Get started": "Iniciar",
  "Explore Robonomics": "Explorar Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics é uma tecnologia de código aberto para o mercado de IoT (Internet das Coisas), disponível para todos. Leia um resumo para saber mais",
  "Get XRT": "Obter XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT é o token utilitário que possibilita o controle de dispositivos IoT no topo da rede Ethereum e da parachain Robonomics",
  "Use a Dapp": "Use un Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Dê uma olhada na versão Beta da aplicação descentralizada para o gerenciamento de dispositivos IoT",
  "Start building": "Comece a construir",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Aprenda Robonomics através de tutoriais e experimentos práticos na WIKI Robonomics",
  "Robonomics objectives": "Objetivos da Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Com base nas conquistas das plataformas em nuvem, a Robonomics visa oferecer ao mercado de IoT soluções de Internet mais seguras e avançadas em todas as etapas da comunicação homem-máquina. Existem algumas  tarefas principais para as quais a Robonomics está sendo desenvolvida",
  "IoT device management with a decentralized cloud": "Gerenciamento de dispositivo IoT com uma nuvem descentralizada",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "As redes Blockchain têm todos os parâmetros para garantir o mais alto nível de segurança para inicialização do dispositivo e recebimento de telemetria. A interação com um dispositivo pode ser descrita alterando o estado do gêmeo digital armazenado na rede blockchain e fornecendo informações sobre essas alterações ao dispositivo físico. No caso de usar uma blockchain não permissionada, podemos ter certeza da disponibilidade global dos provedores, bem como um alto nível de proteção de dados do gêmeo digital contra alterações indesejadas.",
  "Techno-economic transactions between humans and machines": "Transações tecno-econômicas entre humanos e máquinas",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Podemos falar de conquistas institucionais em termos de acesso de sistemas automatizados diretamente aos mercados digitais através de moedas criptográficas e contratos inteligentes. Por exemplo, a Ethereum já implementa a maioria das ferramentas básicas da atividade econômica. As aplicações criadas hoje para conectar o usuário final e os dispositivos IoT serão muito mais eficientes se o pagamento e as condições de serviço forem inseparáveis dos parâmetros de lançamento do dispositivo.",
  "Serverless IoT applications for users": "Aplicativos de IoT sem servidor para usuários",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "A questão da privacidade dos usuários em aplicações modernas não deve ficar presa à incapacidade das empresas de utilizar os avanços modernos no campo da web3. Não há necessidade de autenticar ou exigir conexão com servidores específicos para acessar a telemetria e controlar o dispositivo.",
  "Learn with Robonomics": "Aprenda com a robonomics",
  "Introduction course": "Curso de Introdução",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Mergulhar nos problemas que surgem em torno da construção de aplicações modernas da Internet das Coisas e possíveis soluções com tecnologias Web3 e ferramentas da Robonomics para desenvolvedores e usuários de IoT.",
  "Boston dynamics spot software developing": "Desenvolvimento de Software do Spot da Boston Dynamics",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Estamos entusiasmados em apresentar-lhe o programa educacional SDK Spot! Nosso objetivo é familiarizá-lo com o SDK Spot e permitir que você teste suas habilidades remotamente usando o robô Spot da Boston Dynamics em nosso laboratório.",
  "Sovereign smart home with robonomics and home assistant": "Casa Inteligente Soberana com Robonomics e Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Neste curso, você passará por todas as etapas necessárias para construir sua própria casa inteligente soberana, cuja principal vantagem é a segurança / privacidade dos dados dos usuários.",
  "Shop": "Loja",
  "Science papers": "Artigos científicos",
  "Books": "Livros",
  "Logo and assets": "Logotipo e ativos",
  "Blog": "Blog",
  "Ambassador program": "Programa de embaixadores",
  "Contacts": "Contatos",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Cronologia",
  "Tokenomics": "Tokenomia",
  "Parachain": "Parachain",
  "User (D)App": "Usuário (D)App",
  "Function request": "Solicitação de função",
  "Report": "Relatório",
  "Control": "Controle",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Aplicação descentralizada",
  "Digital twin": "Gêmeos digitais",
  "IoT / Smart device": "Dispositivo IoT / inteligente ",
  "Robonomics tokenomics": "Tokenomia da Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "é o token de utilidade que tornará possível controlar dispositivos IoT no topo da rede Ethereum e na parachain Robonomics no ecossistema Polkadot.",
  "The task": "A tarefa",
  "Be aware of scammers": "Esteja atento aos golpistas",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "por favor, use apenas mercados bem conhecidos para trocar XRT. Não envie seus tokens para contas que lhe são fornecidas em mensagens privadas, qualquer que seja a transação que você gostaria de realizar (comprar ou vender tokens). Se você recebeu alguma 'mensagem estrondosa' sobre o token da Robonomics (os golpistas costumam usar algo como anúncio de airdrop), por favor, verifique este website (https://robonomics.network/) ou nosso ",
  "for official updates. Be careful, be safe.": "para atualizações oficiais. Tenha cuidado, esteja a salvo.",
  "XRT in Ethereum": "XRT na Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Ao implementar o projeto Robonomics em 2015 - 2018, a equipe do projeto precisava encontrar uma conexão entre o fornecimento de uma função útil pela Rede Robonomics, ou seja, o lançamento de dispositivos IoT de acordo com o modelo robot-as-a-service, e o reembolso dos custos para os provedores da Robonomics pelas taxas de gás na Ethereum. Precisávamos pensar no ciclo de vida da responsabilidade de cada dispositivo inteligente individual para realizar um serviço. Como resultado do início da P&D na Robonomics, a equipe criou um mecanismo para minerar novos tokens para recompensar cada contrato inteligente de robot-as-a-service. Este modelo continua viável para o futuro da Robonomics na Ethereum, mas somente com melhorias significativas na Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Leia isto para conhecer o histórico e os planos de longo prazo da equipe para o XRT no ecossistema Ethereum.",
  "Etherscan profile": "Perfil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Veja o contrato inteligente do token e as transações na rede Ethereum aqui.",
  "Coingecko markets": "Mercados na Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Aqui você pode encontrar os mercados CEX e DEX para negociar XRT.",
  "XRT In Polkadot": "XRT na Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Mudando da Ethereum para a Polkadot, precisamos fazer uma 'escalada' na tokenomia. As parachains no ecossistema Polkadot não são o equivalente a um contrato inteligente, mas são uma blockchain totalmente programável que aluga um segmento da rede geral.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "O pagamento real por parte das parachains Polkadot e Kusama é a união a longo prazo de tokens nativos da Relay chain (DOT / KSM) em quantidade suficiente para ganhar um dos leilões. O XRT na parachain Robonomics auxilia na renovação do slot e recompensa às partes interessadas. O mecanismo de queima dos XRT subjacente à ativação de assinaturas IoT é projetado para reduzir a inflação ao mínimo e, em caso de aumento de juros, a zero.",
  "Learn more": "Saiba mais",
  "in Twitter thread from our network architect.": "no Twitter do nosso arquiteto de rede.",
  "Usage:": "Utilização:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT pode ser usado tanto para pagar taxas pela realização de transações na parachain quanto para comprar uma assinatura IoT que garanta o processamento prioritário de dispositivos ou transações IoT do usuário.",
  "Rewards:": "Recompensas:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Ao longo do ano, a parachain emite uma pequena quantidade de XRT para incentivar os coletores (collators) da parachain.",
  "The parameter of the total reward": "O parâmetro da recompensa total",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "para os coletores durante o ano é determinado pela votação on-chain dos detentores de tokens, e pode ser alterado através da realização de um referendo.",
  "Use XRT": "Utilizar XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Compre a assinatura IoT em nosso aplicativo descentralizado. Controle seus dispositivos inteligentes via blockchain sem que nenhuma corporação centralizada observe.",
  "Subscan profile": "Perfil Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Visualize estatísticas do token no topo do ecossistema Polkadot.",
  "Other questions": "Outras perguntas",
  "What is RWS?": "O que é RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Em desenvolvimento da funcionalidade principal] Para engenheiros, a equipe do Core Dev tentará fazer diferentes modelos de uso da Robonomics e o primeiro passo desta forma é lançar o token de assinatura vitalício - o token RWS. Cada token RWS lhe dará 1 transação por segundo (tps) de/para seu dispositivo IoT por meio da Parachain Robonomics. Ative seu token RWS e faça transações 'grátis' com pré-execução e latência previsíveis. Desative o token RWS e negocie-o em uma DEX.",
  "What is AIRA/AIR ID?": "O que é AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Um token pré-XRT distribuído em 2017 como parte autônoma da futura infra-estrutura da Robonomics na Ethereum. Após o lançamento bem-sucedido da Robonomics na Ethereum em 2019, os tokens AIRA foram conectados à infra-estrutura criada do projeto através de",
  "ambix smart contract": "um contrato inteligente ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "que garantiu um processo autônomo e independente de troca do pré-XRT para o XRT  ERC-20.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "do token da Robonomics é garantir a operação de uma rede descentralizada para a manutenção de Cidades Inteligentes e Indústria 4.0 na infraestrutura blockchain. Para atingir este objetivo, a economia do token precisa refletir os incentivos para a implementação da rede.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "A aplicação descentralizada (dapp) funciona dentro da Blockchain. É de fonte aberta e os seus dados são servidos em IPFS e Github. Estas tecnoligias permitem que a aplicação seja segura e transparente ao mesmo tempo. Os nossos criadores estão a trabalhar tanto no desenvolvimento da aplicação Robonomics como nas bibliotecas que pode utilizar na construção da sua própria dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "O Gêmeo Digital (Digital Twin) é um dos instrumentos fornecidos pela Robonomics Web Services (RWS). Ele atua como uma versão digital do equipamento do mundo real e copia todas as suas características técnicas. Ele permite tornar um aplicativo descentralizado mais responsivo aos comandos do usuário.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Você pode usar a Robonomics com uma ampla gama de dispositivos inteligentes Zigbee para automatizar e controlar vários aspectos de sua casa/escritório ou usá-la com robótica baseada em ROS para tarefas industriais mais complexas.",
  "Do Androids Dream of Electric Sheep?": "Os Andróides Sonham com Ovelhas Elétricas?",
  "Sleeping Mew Space": "Mew Adormecido no Espaço",
  "Are you ready for Mars?": "Você está pronto para Marte?",
  "Shiva Robot": "Robô Shiva",
  "Space Travelers": "Viajantes Espaciais",
  "Retro Astronaut": "Astronauta Retrô",
  "New Newton": "Novo Newton",
  "Your email": "Seu email",
  "Want emails from robonomics": "Quer receber e-mails da Robonomics",
  "Adding you to our special list...": "Adicionando-o à nossa lista especial...",
  "Nice, you are in the list": "Ótimo, você está na lista",
  "Something went  wrong. Try again later": "Algo deu errado. Tente novamente mais tarde",
  "Robonomics art shop": "Robonomics art shop",
  "Welcome to our brand new online shop on": "Bem-vindo à nossa nova loja online em",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Nossa loja oferece roupas, acessórios, decoração doméstica e outros itens que demonstram nosso amor pela robótica, tecnologia e arte. Você pode encontrar camisetas, mangas longas, capuzes, cortinas de chuveiro, travesseiros, cobertores e outros produtos úteis com nossos designs exclusivos feitos por artistas da Robonomics, enquanto a produção e envio são processados por nossos colegas da Threadless. Aproveite!",
  "Shop now on threadless": "Compre agora na threadless",
  "alternative shop": "loja alternativa",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "O ano começou com uma grande conquista - a Robonomics venceu o 20º leilão de slots de parachain e",
  "officially became": "tornou-se oficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "uma parachain com a ID 2048 na rede Kusama. As funções de lançamento, registro de dados (datalog), Gêmeo Digital (DigitalTwin), responsabilidade (liability) e assinaturas IoT estão disponíveis para todos os usuários do ecossistema. Para fornecer detalhes para esta fase do projeto, a equipe principal publicou os primeiros capítulos do",
  "Robonomics Whitepaper 2.0.": "Whitepaper 2.0 da Robonomics",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "A Robonomics 2.0 em Substrate foi lançada com suporte para mensagens XCM, e começamos a abrir canais HRMP com outras parachains (como Crust, Shadow e Darwinia), cuja funcionalidade é extremamente útil para nós.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Ao mesmo tempo, revelamos uma estratégia para introduzir o mercado de IOT em nosso protocolo. Nossas experiências com equipamentos de IoT nos levaram ao conceito de uma casa inteligente soberana, que é independente dos provedores de serviços de nuvem centralizados. Desenvolvemos nossa",
  "integration": "integração",
  "with the Home Assistant automation system, and also designed our own": "com o sistema de automação Home Assistant, e também projetamos nosso próprio",
  "IoT gateway": "gateway IoT",
  "for connecting smart devices.": "para conectar dispositivos inteligentes.",
  "We have launched two big initiatives in order to increase community engagement —": "Lançamos duas grandes iniciativas para aumentar o envolvimento da comunidade —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "o Programa de Embaixadores da Robonomics",
  "Additionally,": "Além disso, o ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "foi realizado no outono, para que a comunidade Robonomics pudesse experimentar nossos mecanismos de governança pela primeira vez. Recentemente, a equipe da Robonomics ajudou o projeto DAO IPCI a obter um slot de parachain, para apresentar o serviço de compensação de carbono para edifícios inteligentes.",
  "In 2021, our": "Em 2021, nosso",
  "main focus": "foco principal",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "mudou para preparar o projeto para que os aplicativos de IoT pudessem ser usados por meio de nossa parachain na rede Kusama. A Robonomics 1.0 em Substrate foi lançada e estamos testando a conexão de sensores na parachain para enviar seus dados de telemetria, além de desenvolver a funcionalidade de gêmeo digital. Na metade do ano, decidimos testar o ciclo completo de nossa rede e criamos nossa própria relay chain chamada",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "à qual a parachain Robonomics foi integrada (antes de ser migrada para a relay chain Kusama). Houve muito foco em conseguir uma vaga de parachain na Kusama, para a qual organizamos várias campanhas de crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Houve duas grandes mudanças para a comunidade. Em primeiro lugar, lançamos o",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "que permite que projetos web3, de robótica e IoT recebam financiamento para tarefas de P&D (Pesquisa e desenvolvimento). Até o final do ano, quatro projetos ativos participavam do programa. Em segundo lugar, a equipe iniciou o",
  "Exodus process": "processo Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "permitindo que os detentores de tokens na Ethereum transferissem seus tokens XRT para a parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Entre as colaborações, podemos recordar a notável aparição do Boston Dynamics Spot da MerkleBot, para a qual foi desenvolvido um",
  "rental remote control system": "sistema de controle remoto de aluguel",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Também gostaríamos de informá-lo sobre a empresa Multi-Agent Systems, que é um projeto pessoal formado por uma equipe de engenheiros da Robonomics. Eles desenvolveram um robô chamado Eisenkoch, que prepara waffles em uma cafeteria.",
  "There came a time when the existing limitations of Ethereum": "Chegou um momento em que as limitações existentes da Ethereum",
  "began to stand out clearly": "começaram a se destacar claramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(em particular, baixa escalabilidade, baixa velocidade e custo de transações muito alto). A atualização para a ETH2.0 deveria corrigir a situação, mas esta atualização foi repetidamente adiada. Embora não quiséssemos sair da rede Ethereum, percebemos que na situação atual era difícil implementar nossos casos de uso e começamos a procurar uma rede alternativa. O ecossistema de blockchain fragmentada de Polkadot se tornou essa alternativa. Começamos experimentando o framework Substrate para migrar os principais recursos da Robonomics e implantar nossa própria rede de teste. No final desta etapa, implantamos nossa parachain na rede de teste Rococó e começamos a nos preparar para obter um slot na rede Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando a estudar os sistemas de IoT, identificamos a principal funcionalidade da Robonomics, que pode agregar valor aos usuários - a função de nuvem descentralizada para IoT. Esta ideia formou a base da ",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "A infra-estrutura RWS assumiu todas as funções de uma nuvem centralizada típica, mas sem os problemas padrão de disponibilidade global, segurança e privacidade. Além disso, tivemos a ideia de assinaturas IoT da parachain que permitem que os titulares de assinaturas usem a rede blockchain sem precisar pagar uma taxa por cada transação. O primeiro experimento com as assinaturas IoT foi a emissão do token RWS, que permite que seu proprietário envie 1 transação por bloco. Além disso, começamos a dar os primeiros passos para desenvolver nosso próprio kit de hardware para o controle de dispositivos inteligentes (o conceito DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Naturalmente, o apoio à Robonomics na Ethereum não parou. A pilha de comunicação da Robonomics foi finalizada para a versão",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "O token XRT começou a ser negociado em várias bolsas (em particular, na DEX Uniswap), e o programa de incentivo à liquidez foi lançado.",
  "The team actively developed ways to interact with the community. The first version of our": "A equipe desenvolveu ativamente formas de interagir com a comunidade. A primeira versão de nosso site",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "e Robonomics Wiki foi lançada. Para uma gestão de projetos mais transparente e conveniente, começamos a utilizar a",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Hospedamos a ",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "em 2019 para os recém-chegados ao projeto.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "As colaborações com projetos simpatizantes também continuaram. A Robonomics e a Dao IPCI introduziram um serviço para coletar e analisar dados sensoriais - ",
  "Robonomics became the foundation for the": "A Robonomics se tornou a base do projeto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "que está desenvolvendo um sistema para o leasing inteligente de equipamentos robóticos.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Entendemos que os agentes autônomos precisavam de um ambiente que garantisse suas operações técnicas e econômicas confiáveis. Por vários anos, tínhamos desenvolvido um protocolo para criar uma rede descentralizada de fornecedores que ajudassem os agentes robóticos a fornecer seus serviços. Foram desenvolvidas ferramentas para a manutenção da rede e para a pilha de comunicação entre Ethereum e o ROS (Sistema Operacional de Robôs). Em 2018 publicamos o",
  "Robonomics Whitepaper": "Whitepaper da Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "e a versão alfa da Rede Robonomics foi lançada na rede principal da Ethereum. Os preparativos ativos para o evento da geração de tokens XRT (que acabou acontecendo na primavera de 2019 devido ao primeiro inverno criptográfico) continuaram.",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "A partir deste período, a Robonomics começou a desenvolver dinamicamente casos de uso relacionados à Indústria 4.0 - fábricas inteligentes, cidades inteligentes e residências inteligentes - e isto trouxe nossa atenção para o mundo da IoT. Em busca de inovação, a equipe apresentou várias demonstrações grandes e únicas de P&D: uma",
  "sensor network": "rede de sensores civis",
  "a water drone": "un drone aquático",
  "for environmental monitoring (supported by a sensor systems manufacturer": "para monitoramento ambiental (apoiado por um fabricante de sistemas de sensores",
  "a smart factory model": "um modelo de fábrica inteligente",
  "a self-employed": "um",
  "robot artist Gaka-chu": "artista robô autônomo, Gaka-chu",
  "and a": "e",
  "drone traffic management system": "um sistema de gerenciamento de tráfego de drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "A Robonomics iniciou a cooperação com o projeto DAO IPCI no gerenciamento de ativos ambientais usando tecnologias web3 e dispositivos de IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Este foi um período ativo de P&D durante o qual identificamos uma série de tarefas, nas quais as tecnologias p2p têm capacidades que antes não estavam disponíveis para robótica. Combinando o computador Ethereum, armazenamento de arquivos IPFS e o ROS, percebemos que qualquer dispositivo poderia potencialmente se tornar um",
  "autonomous intelligent robot agent": "agente robótico inteligente autônomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Por sua vez, isto nos abriu o caminho para os conceitos de Robot-as-a-Service e economia dos robôs.",
  "Our publications in scientific journals of this period are available in the": "Nossas publicações em periódicos científicos deste período estão disponíveis na seção",
  "Papers section": "Papers (Artigos)",
  "We have collected all R&D projects over the years in the": "Reunimos todos os projetos de P&D ao longo dos anos em um ",
  "a handy book": "livro prático",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tudo começou com uma ideia que surgiu dos fundadores, quando a Ethereum tinha acabado de lançar sua rede principal. E se um robô realizar uma tarefa para um cliente em troca de criptmoedas, e sua lógica for controlada por um contrato inteligente?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Para testar a ideia, fizemos uma demonstração na qual foi lançado um drone controlado por um computador Ethereum para alcançar as coordenadas GPS especificadas, depois que o usuário completou uma transação de pagamento.",
  "The demo is available on": "A demonstração está disponível no",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Cronologia de desenvolvimento de infra-estrutura e tecnologia",
  "Notable events": "Eventos importantes",
  "World Economic Forum Annual Meeting 2022": "Reunião Anual do Fórum Econômico Mundial 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "A caminho da Automação Doméstica Soberana",
  "Becoming a Parachain for IoT Applications": "Tornando-se uma parachain para aplicações de IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (patrocinado pela Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (hospedada pela Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transição para a Multinetwork — Junto veio a Polkadot",
  "The Rise of Robonomics Network": "A Ascensão da Rede Robonomics",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop 'The Economy of Robots'": "Workshop do Parlamento Europeu 'A economia dos Robôs'",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simpósio sobre Blockchain para Sistemas Robóticos no MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Escola de verão Robonomics-2018 organizada pela equipe da Robonomics",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Reunindo Tecnologias Web3 e Frameworks Robóticos",
  "Playing with Human-Machine Interaction through Ethereum": "Brincando com a Interação Homem-Máquina através da Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Guia de boas-vindas do Robonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Desenvolvemos um protocolo técnico-econômico de comunicação de máquina rodando no topo da Ethereum e do IPFS, e o complementamos com elementos de uma plataforma IoT baseada em nuvem e em parachain de Polkadot. Hoje, já temos uma plataforma híbrida para a criação de aplicações IoT futuristas. Ela proporciona interação com dispositivos sob o controle de um computador global descentralizado. Antes de começarmos a criar aplicações IoT seguras, sem servidores e futuristas usando a plataforma Robonomics, vamos nos aprofundar um pouco na teoria...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Os dois primeiros capítulos do whitepaper da Robonomics já estão disponíveis para os usuários.",
  "Chapter 1.": "Capítulo 1.",
  "At the intersection of cybernetics and economics": "Na interseção entre cibernética e economia",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Apresentamos um sistema econômico no qual os dispositivos robóticos atuam como agentes independentes capazes de realizar atividades econômicas importantes, anteriormente reservadas aos seres humanos. Neste capítulo, falaremos sobre a relevância da economia robótica, que pode se tornar uma parte importante da vida das pessoas e transformar o nível atual da economia em serviços totalmente automatizados no futuro.",
  "In this chapter you will learn": "Neste capítulo você aprenderá",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase e a Natureza da Firma",
  "CPS - cyber-physical system": "CPS - sistema ciber físico",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener e a busca por padrões em coisas vivas e nas máquinas",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "A Quarta Revolução Industrial, Dinheiro para Robôs e Bitcoin",
  "Ethereum Smart Contracts": "Smart Contracts Ethereum",
  "Polkadot Parachains": "Parachains Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Perguntas abertas sobre teleologia e o trabalho de Mises",
  "Read chapter 1": "Leia o capítulo 1",
  "Chapter 2.": "Capítulo 2.",
  "Robonomics architecture": "Arquitetura da Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "No segundo capítulo, você lerá sobre a interação homem-máquina usando a moderna tecnologia da Internet - desde dispositivos IoT até uma rede de provedores descentralizada e globalmente acessível. Analisaremos o básico da Internet das Coisas para destacar os problemas e os principais desafios enfrentados pelos criadores dos sistemas de IoT e para a solução da qual Robonomics se propõe.",
  "Overview of the state of the Internet of Things (IoT)": "Visão geral do estado da Internet das Coisas (IoT)",
  "Classification of IoT devices": "Classificação dos dispositivos IoT",
  "Embedded IoT systems": "Sistemas IoT integrados",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: Gateways e controladores IoT",
  "Autonomous Systems": "Sistemas Autônomos",
  "Internet of Things providers": "Provedores de Internet das Coisas",
  "Digital twins are the heart of the Internet of Things": "Gêmeos digitais são o coração da Internet das Coisas",
  "IoT data flows in cloud service": "Fluxos de dados IoT no serviço em nuvem",
  "Popular examples of IoT solutions": "Popular examples of IoT solutions",
  "Current problems of building IoT solutions": "Problemas atuais na construção de soluções IoT",
  "Main tasks of Robonomics architecture": "Principais tarefas da arquitetura Robonomics",
  "Basic components of Robonomics architecture": "Componentes básicos da arquitetura Robonomics",
  "A simple representation of Robonomics architecture": "Uma representação simples da arquitetura Robonomics",
  "Read chapter 2": "Leia o capítulo 2",
  "We continue to update the white paper of Robonomics": "Continuamos atualizando o Whitepaper da Robonomics,",
  "stay tuned for new parts on our website and in Discord": "acompanhe nosso site e Discord para ficar informado sobre novas atualizações",
  "Join our discord": "Junte-se ao nosso discord",
  "Robonomics logos and usage": "Logotipos da robonomics e utilização",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Reunimos os logotipos e diretrizes da Robonomics para mostrar como você pode utilizá-los.",
  "Download Robonomics logo": "Download do logotipo da Robonomics",
  "Download RWS logo": "Download do logotipo RWS",
  "Download wiki logo": "Download do logotipo wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Utilize estes logotipos autorizados para estabelecer um link para a Robonomics, RWS ou Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Utilize o logotipo autorizado da Robonomics para informar aos outros que você está integrado à Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Utilize os logotipos autorizados em posts de blogs, artigos e slides sobre a tecnologia Robonomics e projetos integrados",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Não modifique os logotipos autorizados da Robonomics, incluindo a mudança de cor, dimensões ou combinação com outras palavras ou elementos de design",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Não utilize o logotipo e o nome da Robonomics de uma forma que sugira que você é da Robonomics, que sua oferta ou projeto é da Robonomics, ou que a Robonomics está endossando você ou sua oferta ou projeto se não foi aprovada pela Robonomics DAO",
  "Robonomics Color pallet": "Paleta de cores da robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Estas cores nós usamos em nossas interfaces, estampas e outros recursos visuais. </br> Use-as para seus slides, banners para posts, etc., contando sobre a Robonomics."
}