{
  "What is Robonomics network?": "O que é a rede robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "A Robonomics é uma plataforma de código aberto para aplicações IoT. Oferecemos suporte a uma nova geração de tecnologias da internet (web3) que implementam a troca de informações técnicas e econômicas na forma de transações atômicas entre aplicações do usuário, serviços da Internet e robótica complexa.",
  "Get started": "Iniciar",
  "Explore Robonomics": "Explorar Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics é uma tecnologia de código aberto para o mercado de IoT (Internet das Coisas), disponível para todos. Leia um resumo para saber mais",
  "Get XRT": "Obter XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT é o token utilitário que possibilita o controle de dispositivos IoT no topo da rede Ethereum e da parachain Robonomics",
  "Use a Dapp": "Use un Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Dê uma olhada na versão Beta da aplicação descentralizada para o gerenciamento de dispositivos IoT",
  "Start building": "Comece a construir",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Aprenda Robonomics através de tutoriais e experimentos práticos na WIKI Robonomics",
  "Robonomics objectives": "Objetivos da Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Com base nas conquistas das plataformas em nuvem, a Robonomics visa oferecer ao mercado de IoT soluções de Internet mais seguras e avançadas em todas as etapas da comunicação homem-máquina. Existem algumas  tarefas principais para as quais a Robonomics está sendo desenvolvida",
  "IoT device management with a decentralized cloud": "Gerenciamento de dispositivo IoT com uma nuvem descentralizada",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "As redes Blockchain têm todos os parâmetros para garantir o mais alto nível de segurança para inicialização do dispositivo e recebimento de telemetria. A interação com um dispositivo pode ser descrita alterando o estado do gêmeo digital armazenado na rede blockchain e fornecendo informações sobre essas alterações ao dispositivo físico. No caso de usar uma blockchain não permissionada, podemos ter certeza da disponibilidade global dos provedores, bem como um alto nível de proteção de dados do gêmeo digital contra alterações indesejadas.",
  "Techno-economic transactions between humans and machines": "Transações tecno-econômicas entre humanos e máquinas",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Podemos falar de conquistas institucionais em termos de acesso de sistemas automatizados diretamente aos mercados digitais através de moedas criptográficas e contratos inteligentes. Por exemplo, a Ethereum já implementa a maioria das ferramentas básicas da atividade econômica. As aplicações criadas hoje para conectar o usuário final e os dispositivos IoT serão muito mais eficientes se o pagamento e as condições de serviço forem inseparáveis dos parâmetros de lançamento do dispositivo.",
  "Serverless IoT applications for users": "Aplicativos de IoT sem servidor para usuários",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "A questão da privacidade dos usuários em aplicações modernas não deve ficar presa à incapacidade das empresas de utilizar os avanços modernos no campo da web3. Não há necessidade de autenticar ou exigir conexão com servidores específicos para acessar a telemetria e controlar o dispositivo.",
  "Learn with Robonomics": "Aprenda com a robonomics",
  "Introduction course": "Curso de Introdução",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Mergulhar nos problemas que surgem em torno da construção de aplicações modernas da Internet das Coisas e possíveis soluções com tecnologias Web3 e ferramentas da Robonomics para desenvolvedores e usuários de IoT.",
  "Boston dynamics spot software developing": "Desenvolvimento de Software do Spot da Boston Dynamics",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Estamos entusiasmados em apresentar-lhe o programa educacional SDK Spot! Nosso objetivo é familiarizá-lo com o SDK Spot e permitir que você teste suas habilidades remotamente usando o robô Spot da Boston Dynamics em nosso laboratório.",
  "Sovereign smart home with robonomics and home assistant": "Casa Inteligente Soberana com Robonomics e Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Neste curso, você passará por todas as etapas necessárias para construir sua própria casa inteligente soberana, cuja principal vantagem é a segurança / privacidade dos dados dos usuários.",
  "Shop": "Loja",
  "Science papers": "Artigos científicos",
  "Books": "Livros",
  "Logo and assets": "Logotipo e ativos",
  "Blog": "Blog",
  "Ambassador program": "Programa de embaixadores",
  "Contacts": "Contatos",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Cronologia",
  "Tokenomics": "Tokenomia",
  "Parachain": "Parachain",
  "User (D)App": "Usuário (D)App",
  "Function request": "Solicitação de função",
  "Report": "Relatório",
  "Control": "Controle",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Aplicação descentralizada",
  "Digital twin": "Gêmeos digitais",
  "IoT / Smart device": "Dispositivo IoT / inteligente ",
  "Robonomics tokenomics": "Tokenomia da Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "é o token de utilidade que tornará possível controlar dispositivos IoT no topo da rede Ethereum e na parachain Robonomics no ecossistema Polkadot.",
  "The task": "A tarefa",
  "Be aware of scammers": "Esteja atento aos golpistas",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "por favor, use apenas mercados bem conhecidos para trocar XRT. Não envie seus tokens para contas que lhe são fornecidas em mensagens privadas, qualquer que seja a transação que você gostaria de realizar (comprar ou vender tokens). Se você recebeu alguma 'mensagem estrondosa' sobre o token da Robonomics (os golpistas costumam usar algo como anúncio de airdrop), por favor, verifique este website (https://robonomics.network/) ou nosso ",
  "for official updates. Be careful, be safe.": "para atualizações oficiais. Tenha cuidado, esteja a salvo.",
  "XRT in Ethereum": "XRT na Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Ao implementar o projeto Robonomics em 2015 - 2018, a equipe do projeto precisava encontrar uma conexão entre o fornecimento de uma função útil pela Rede Robonomics, ou seja, o lançamento de dispositivos IoT de acordo com o modelo robot-as-a-service, e o reembolso dos custos para os provedores da Robonomics pelas taxas de gás na Ethereum. Precisávamos pensar no ciclo de vida da responsabilidade de cada dispositivo inteligente individual para realizar um serviço. Como resultado do início da P&D na Robonomics, a equipe criou um mecanismo para minerar novos tokens para recompensar cada contrato inteligente de robot-as-a-service. Este modelo continua viável para o futuro da Robonomics na Ethereum, mas somente com melhorias significativas na Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Leia isto para conhecer o histórico e os planos de longo prazo da equipe para o XRT no ecossistema Ethereum.",
  "Etherscan profile": "Perfil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Veja o contrato inteligente do token e as transações na rede Ethereum aqui.",
  "Coingecko markets": "Mercados na Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Aqui você pode encontrar os mercados CEX e DEX para negociar XRT.",
  "XRT In Polkadot": "XRT na Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Mudando da Ethereum para a Polkadot, precisamos fazer uma 'escalada' na tokenomia. As parachains no ecossistema Polkadot não são o equivalente a um contrato inteligente, mas são uma blockchain totalmente programável que aluga um segmento da rede geral.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "O pagamento real por parte das parachains Polkadot e Kusama é a união a longo prazo de tokens nativos da Relay chain (DOT / KSM) em quantidade suficiente para ganhar um dos leilões. O XRT na parachain Robonomics auxilia na renovação do slot e recompensa às partes interessadas. O mecanismo de queima dos XRT subjacente à ativação de assinaturas IoT é projetado para reduzir a inflação ao mínimo e, em caso de aumento de juros, a zero.",
  "Learn more": "Saiba mais",
  "in Twitter thread from our network architect.": "no Twitter do nosso arquiteto de rede.",
  "Usage:": "Utilização:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT pode ser usado tanto para pagar taxas pela realização de transações na parachain quanto para comprar uma assinatura IoT que garanta o processamento prioritário de dispositivos ou transações IoT do usuário.",
  "Rewards:": "Recompensas:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Ao longo do ano, a parachain emite uma pequena quantidade de XRT para incentivar os coletores (collators) da parachain.",
  "The parameter of the total reward": "O parâmetro da recompensa total",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "para os coletores durante o ano é determinado pela votação on-chain dos detentores de tokens, e pode ser alterado através da realização de um referendo.",
  "Use XRT": "Utilizar XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Compre a assinatura IoT em nosso aplicativo descentralizado. Controle seus dispositivos inteligentes via blockchain sem que nenhuma corporação centralizada observe.",
  "Subscan profile": "Perfil Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Visualize estatísticas do token no topo do ecossistema Polkadot.",
  "Other questions": "Outras perguntas",
  "What is RWS?": "O que é RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Em desenvolvimento da funcionalidade principal] Para engenheiros, a equipe do Core Dev tentará fazer diferentes modelos de uso da Robonomics e o primeiro passo desta forma é lançar o token de assinatura vitalício - o token RWS. Cada token RWS lhe dará 1 transação por segundo (tps) de/para seu dispositivo IoT por meio da Parachain Robonomics. Ative seu token RWS e faça transações 'grátis' com pré-execução e latência previsíveis. Desative o token RWS e negocie-o em uma DEX.",
  "What is AIRA/AIR ID?": "O que é AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Um token pré-XRT distribuído em 2017 como parte autônoma da futura infra-estrutura da Robonomics na Ethereum. Após o lançamento bem-sucedido da Robonomics na Ethereum em 2019, os tokens AIRA foram conectados à infra-estrutura criada do projeto através de",
  "ambix smart contract": "um contrato inteligente ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "que garantiu um processo autônomo e independente de troca do pré-XRT para o XRT  ERC-20.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "do token da Robonomics é garantir a operação de uma rede descentralizada para a manutenção de Cidades Inteligentes e Indústria 4.0 na infraestrutura blockchain. Para atingir este objetivo, a economia do token precisa refletir os incentivos para a implementação da rede.",
  "Token distribution": "Distribuição de tokens",
  "Try our Dapp": "Experimente nosso Dapp",
  "In addition": "Além disso",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "você pode operar XRT dentro de blockchains usando ferramentas fornecidas por diferentes equipes independentes nas comunidades Polkadot (Kusama) e Ethereum.",
  "Within the Kusama network, you have the capability use": "Dentro da rede Kusama, você tem a capacidade de usar",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "comunicação entre a parachain Robonomics e outras parachains usando várias aplicações descentralizadas (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Dentro da rede Ethereum, você pode usar aplicativos descentralizados alimentados pelo",
  "Attention please": "Atenção por favor",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Se você tem utilizado o serviço Multichain para transações de ponte, por favor, abstenha-se de usá-lo no momento, pois foi",
  "announced": "anunciado",
  "on the official Twitter of The Multichain.": "no Twitter oficial do Multichain.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "A aplicação descentralizada (dapp) funciona dentro da Blockchain. É de fonte aberta e os seus dados são servidos em IPFS e Github. Estas tecnoligias permitem que a aplicação seja segura e transparente ao mesmo tempo. Os nossos criadores estão a trabalhar tanto no desenvolvimento da aplicação Robonomics como nas bibliotecas que pode utilizar na construção da sua própria dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "O Gêmeo Digital (Digital Twin) é um dos instrumentos fornecidos pela Robonomics Web Services (RWS). Ele atua como uma versão digital do equipamento do mundo real e copia todas as suas características técnicas. Ele permite tornar um aplicativo descentralizado mais responsivo aos comandos do usuário.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Você pode usar a Robonomics com uma ampla gama de dispositivos inteligentes Zigbee para automatizar e controlar vários aspectos de sua casa/escritório ou usá-la com robótica baseada em ROS para tarefas industriais mais complexas.",
  "Do Androids Dream of Electric Sheep?": "Os Andróides Sonham com Ovelhas Elétricas?",
  "Sleeping Mew Space": "Mew Adormecido no Espaço",
  "Are you ready for Mars?": "Você está pronto para Marte?",
  "Shiva Robot": "Robô Shiva",
  "Space Travelers": "Viajantes Espaciais",
  "Retro Astronaut": "Astronauta Retrô",
  "New Newton": "Novo Newton",
  "Your email": "Seu email",
  "Community & Contacts": "Comunidade e Contatos",
  "Get latest updates": "Obtenha as últimas atualizações",
  "Tell us something if you want": "Diga-nos algo se quiser",
  "Submit": "Enviar",
  "Something went  wrong :( Try again later": "Algo deu errado :( Tente novamente mais tarde",
  "Want emails from robonomics": "Quer receber e-mails da Robonomics",
  "Adding you to our special list...": "Adicionando-o à nossa lista especial...",
  "Nice, you are in the list": "Ótimo, você está na lista",
  "Something went  wrong. Try again later": "Algo deu errado. Tente novamente mais tarde",
  "Robonomics art shop": "Robonomics art shop",
  "Welcome to our brand new online shop on": "Bem-vindo à nossa nova loja online em",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Nossa loja oferece roupas, acessórios, decoração doméstica e outros itens que demonstram nosso amor pela robótica, tecnologia e arte. Você pode encontrar camisetas, mangas longas, capuzes, cortinas de chuveiro, travesseiros, cobertores e outros produtos úteis com nossos designs exclusivos feitos por artistas da Robonomics, enquanto a produção e envio são processados por nossos colegas da Threadless. Aproveite!",
  "Shop now on threadless": "Compre agora na threadless",
  "alternative shop": "loja alternativa",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "O ano começou com uma grande conquista - a Robonomics venceu o 20º leilão de slots de parachain e",
  "officially became": "tornou-se oficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "uma parachain com a ID 2048 na rede Kusama. As funções de lançamento, registro de dados (datalog), Gêmeo Digital (DigitalTwin), responsabilidade (liability) e assinaturas IoT estão disponíveis para todos os usuários do ecossistema. Para fornecer detalhes para esta fase do projeto, a equipe principal publicou os primeiros capítulos do",
  "Robonomics Whitepaper 2.0.": "Whitepaper 2.0 da Robonomics",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "A Robonomics 2.0 em Substrate foi lançada com suporte para mensagens XCM, e começamos a abrir canais HRMP com outras parachains (como Crust, Shadow e Darwinia), cuja funcionalidade é extremamente útil para nós.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Ao mesmo tempo, revelamos uma estratégia para introduzir o mercado de IOT em nosso protocolo. Nossas experiências com equipamentos de IoT nos levaram ao conceito de uma casa inteligente soberana, que é independente dos provedores de serviços de nuvem centralizados. Desenvolvemos nossa",
  "integration": "integração",
  "with the Home Assistant automation system, and also designed our own": "com o sistema de automação Home Assistant, e também projetamos nosso próprio",
  "IoT gateway": "gateway IoT",
  "for connecting smart devices.": "para conectar dispositivos inteligentes.",
  "We have launched two big initiatives in order to increase community engagement —": "Lançamos duas grandes iniciativas para aumentar o envolvimento da comunidade —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "o Programa de Embaixadores da Robonomics",
  "Additionally,": "Além disso, o ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "foi realizado no outono, para que a comunidade Robonomics pudesse experimentar nossos mecanismos de governança pela primeira vez. Recentemente, a equipe da Robonomics ajudou o projeto DAO IPCI a obter um slot de parachain, para apresentar o serviço de compensação de carbono para edifícios inteligentes.",
  "In 2021, our": "Em 2021, nosso",
  "main focus": "foco principal",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "mudou para preparar o projeto para que os aplicativos de IoT pudessem ser usados por meio de nossa parachain na rede Kusama. A Robonomics 1.0 em Substrate foi lançada e estamos testando a conexão de sensores na parachain para enviar seus dados de telemetria, além de desenvolver a funcionalidade de gêmeo digital. Na metade do ano, decidimos testar o ciclo completo de nossa rede e criamos nossa própria relay chain chamada",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "à qual a parachain Robonomics foi integrada (antes de ser migrada para a relay chain Kusama). Houve muito foco em conseguir uma vaga de parachain na Kusama, para a qual organizamos várias campanhas de crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Houve duas grandes mudanças para a comunidade. Em primeiro lugar, lançamos o",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "que permite que projetos web3, de robótica e IoT recebam financiamento para tarefas de P&D (Pesquisa e desenvolvimento). Até o final do ano, quatro projetos ativos participavam do programa. Em segundo lugar, a equipe iniciou o",
  "Exodus process": "processo Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "permitindo que os detentores de tokens na Ethereum transferissem seus tokens XRT para a parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Entre as colaborações, podemos recordar a notável aparição do Boston Dynamics Spot da MerkleBot, para a qual foi desenvolvido um",
  "rental remote control system": "sistema de controle remoto de aluguel",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Também gostaríamos de informá-lo sobre a empresa Multi-Agent Systems, que é um projeto pessoal formado por uma equipe de engenheiros da Robonomics. Eles desenvolveram um robô chamado Eisenkoch, que prepara waffles em uma cafeteria.",
  "There came a time when the existing limitations of Ethereum": "Chegou um momento em que as limitações existentes da Ethereum",
  "began to stand out clearly": "começaram a se destacar claramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(em particular, baixa escalabilidade, baixa velocidade e custo de transações muito alto). A atualização para a ETH2.0 deveria corrigir a situação, mas esta atualização foi repetidamente adiada. Embora não quiséssemos sair da rede Ethereum, percebemos que na situação atual era difícil implementar nossos casos de uso e começamos a procurar uma rede alternativa. O ecossistema de blockchain fragmentada de Polkadot se tornou essa alternativa. Começamos experimentando o framework Substrate para migrar os principais recursos da Robonomics e implantar nossa própria rede de teste. No final desta etapa, implantamos nossa parachain na rede de teste Rococó e começamos a nos preparar para obter um slot na rede Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando a estudar os sistemas de IoT, identificamos a principal funcionalidade da Robonomics, que pode agregar valor aos usuários - a função de nuvem descentralizada para IoT. Esta ideia formou a base da ",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "A infra-estrutura RWS assumiu todas as funções de uma nuvem centralizada típica, mas sem os problemas padrão de disponibilidade global, segurança e privacidade. Além disso, tivemos a ideia de assinaturas IoT da parachain que permitem que os titulares de assinaturas usem a rede blockchain sem precisar pagar uma taxa por cada transação. O primeiro experimento com as assinaturas IoT foi a emissão do token RWS, que permite que seu proprietário envie 1 transação por bloco. Além disso, começamos a dar os primeiros passos para desenvolver nosso próprio kit de hardware para o controle de dispositivos inteligentes (o conceito DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Naturalmente, o apoio à Robonomics na Ethereum não parou. A pilha de comunicação da Robonomics foi finalizada para a versão",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "O token XRT começou a ser negociado em várias bolsas (em particular, na DEX Uniswap), e o programa de incentivo à liquidez foi lançado.",
  "The team actively developed ways to interact with the community. The first version of our": "A equipe desenvolveu ativamente formas de interagir com a comunidade. A primeira versão de nosso site",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "e Robonomics Wiki foi lançada. Para uma gestão de projetos mais transparente e conveniente, começamos a utilizar a",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Hospedamos a ",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "em 2019 para os recém-chegados ao projeto.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "As colaborações com projetos simpatizantes também continuaram. A Robonomics e a Dao IPCI introduziram um serviço para coletar e analisar dados sensoriais - ",
  "Robonomics became the foundation for the": "A Robonomics se tornou a base do projeto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "que está desenvolvendo um sistema para o leasing inteligente de equipamentos robóticos.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Entendemos que os agentes autônomos precisavam de um ambiente que garantisse suas operações técnicas e econômicas confiáveis. Por vários anos, tínhamos desenvolvido um protocolo para criar uma rede descentralizada de fornecedores que ajudassem os agentes robóticos a fornecer seus serviços. Foram desenvolvidas ferramentas para a manutenção da rede e para a pilha de comunicação entre Ethereum e o ROS (Sistema Operacional de Robôs). Em 2018 publicamos o",
  "Robonomics Whitepaper": "Whitepaper da Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "e a versão alfa da Rede Robonomics foi lançada na rede principal da Ethereum. Os preparativos ativos para o evento da geração de tokens XRT (que acabou acontecendo na primavera de 2019 devido ao primeiro inverno criptográfico) continuaram.",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "A partir deste período, a Robonomics começou a desenvolver dinamicamente casos de uso relacionados à Indústria 4.0 - fábricas inteligentes, cidades inteligentes e residências inteligentes - e isto trouxe nossa atenção para o mundo da IoT. Em busca de inovação, a equipe apresentou várias demonstrações grandes e únicas de P&D: uma",
  "sensor network": "rede de sensores civis",
  "a water drone": "un drone aquático",
  "for environmental monitoring (supported by a sensor systems manufacturer": "para monitoramento ambiental (apoiado por um fabricante de sistemas de sensores",
  "a smart factory model": "um modelo de fábrica inteligente",
  "a self-employed": "um",
  "robot artist Gaka-chu": "artista robô autônomo, Gaka-chu",
  "and a": "e",
  "drone traffic management system": "um sistema de gerenciamento de tráfego de drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "A Robonomics iniciou a cooperação com o projeto DAO IPCI no gerenciamento de ativos ambientais usando tecnologias web3 e dispositivos de IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Este foi um período ativo de P&D durante o qual identificamos uma série de tarefas, nas quais as tecnologias p2p têm capacidades que antes não estavam disponíveis para robótica. Combinando o computador Ethereum, armazenamento de arquivos IPFS e o ROS, percebemos que qualquer dispositivo poderia potencialmente se tornar um",
  "autonomous intelligent robot agent": "agente robótico inteligente autônomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Por sua vez, isto nos abriu o caminho para os conceitos de Robot-as-a-Service e economia dos robôs.",
  "Our publications in scientific journals of this period are available in the": "Nossas publicações em periódicos científicos deste período estão disponíveis na seção",
  "Papers section": "Papers (Artigos)",
  "We have collected all R&D projects over the years in the": "Reunimos todos os projetos de P&D ao longo dos anos em um ",
  "a handy book": "livro prático",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tudo começou com uma ideia que surgiu dos fundadores, quando a Ethereum tinha acabado de lançar sua rede principal. E se um robô realizar uma tarefa para um cliente em troca de criptmoedas, e sua lógica for controlada por um contrato inteligente?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Para testar a ideia, fizemos uma demonstração na qual foi lançado um drone controlado por um computador Ethereum para alcançar as coordenadas GPS especificadas, depois que o usuário completou uma transação de pagamento.",
  "The demo is available on": "A demonstração está disponível no",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Cronologia de desenvolvimento de infra-estrutura e tecnologia",
  "Notable events": "Eventos importantes",
  "World Economic Forum Annual Meeting 2022": "Reunião Anual do Fórum Econômico Mundial 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "A caminho da Automação Doméstica Soberana",
  "Becoming a Parachain for IoT Applications": "Tornando-se uma parachain para aplicações de IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (patrocinado pela Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (hospedada pela Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transição para a Multinetwork — Junto veio a Polkadot",
  "The Rise of Robonomics Network": "A Ascensão da Rede Robonomics",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop 'The Economy of Robots'": "Workshop do Parlamento Europeu 'A economia dos Robôs'",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simpósio sobre Blockchain para Sistemas Robóticos no MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Escola de verão Robonomics-2018 organizada pela equipe da Robonomics",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Reunindo Tecnologias Web3 e Frameworks Robóticos",
  "Playing with Human-Machine Interaction through Ethereum": "Brincando com a Interação Homem-Máquina através da Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Guia de boas-vindas do Robonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Desenvolvemos um protocolo técnico-econômico de comunicação de máquina rodando no topo da Ethereum e do IPFS, e o complementamos com elementos de uma plataforma IoT baseada em nuvem e em parachain de Polkadot. Hoje, já temos uma plataforma híbrida para a criação de aplicações IoT futuristas. Ela proporciona interação com dispositivos sob o controle de um computador global descentralizado. Antes de começarmos a criar aplicações IoT seguras, sem servidores e futuristas usando a plataforma Robonomics, vamos nos aprofundar um pouco na teoria...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Os dois primeiros capítulos do whitepaper da Robonomics já estão disponíveis para os usuários.",
  "Chapter 1.": "Capítulo 1.",
  "At the intersection of cybernetics and economics": "Na interseção entre cibernética e economia",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Apresentamos um sistema econômico no qual os dispositivos robóticos atuam como agentes independentes capazes de realizar atividades econômicas importantes, anteriormente reservadas aos seres humanos. Neste capítulo, falaremos sobre a relevância da economia robótica, que pode se tornar uma parte importante da vida das pessoas e transformar o nível atual da economia em serviços totalmente automatizados no futuro.",
  "In this chapter you will learn": "Neste capítulo você aprenderá",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase e a Natureza da Firma",
  "CPS - cyber-physical system": "CPS - sistema ciber físico",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener e a busca por padrões em coisas vivas e nas máquinas",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "A Quarta Revolução Industrial, Dinheiro para Robôs e Bitcoin",
  "Ethereum Smart Contracts": "Smart Contracts Ethereum",
  "Polkadot Parachains": "Parachains Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Perguntas abertas sobre teleologia e o trabalho de Mises",
  "Read chapter 1": "Leia o capítulo 1",
  "Chapter 2.": "Capítulo 2.",
  "Robonomics architecture": "Arquitetura da Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "No segundo capítulo, você lerá sobre a interação homem-máquina usando a moderna tecnologia da Internet - desde dispositivos IoT até uma rede de provedores descentralizada e globalmente acessível. Analisaremos o básico da Internet das Coisas para destacar os problemas e os principais desafios enfrentados pelos criadores dos sistemas de IoT e para a solução da qual Robonomics se propõe.",
  "Overview of the state of the Internet of Things (IoT)": "Visão geral do estado da Internet das Coisas (IoT)",
  "Classification of IoT devices": "Classificação dos dispositivos IoT",
  "Embedded IoT systems": "Sistemas IoT integrados",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: Gateways e controladores IoT",
  "Autonomous Systems": "Sistemas Autônomos",
  "Internet of Things providers": "Provedores de Internet das Coisas",
  "Digital twins are the heart of the Internet of Things": "Gêmeos digitais são o coração da Internet das Coisas",
  "IoT data flows in cloud service": "Fluxos de dados IoT no serviço em nuvem",
  "Popular examples of IoT solutions": "Popular examples of IoT solutions",
  "Current problems of building IoT solutions": "Problemas atuais na construção de soluções IoT",
  "Main tasks of Robonomics architecture": "Principais tarefas da arquitetura Robonomics",
  "Basic components of Robonomics architecture": "Componentes básicos da arquitetura Robonomics",
  "A simple representation of Robonomics architecture": "Uma representação simples da arquitetura Robonomics",
  "Read chapter 2": "Leia o capítulo 2",
  "We continue to update the white paper of Robonomics": "Continuamos atualizando o Whitepaper da Robonomics,",
  "stay tuned for new parts on our website and in Discord": "acompanhe nosso site e Discord para ficar informado sobre novas atualizações",
  "Join our discord": "Junte-se ao nosso discord",
  "Robonomics logos and usage": "Logotipos da robonomics e utilização",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Reunimos os logotipos e diretrizes da Robonomics para mostrar como você pode utilizá-los.",
  "Download Robonomics logo": "Download do logotipo da Robonomics",
  "Download RWS logo": "Download do logotipo RWS",
  "Download wiki logo": "Download do logotipo wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Utilize estes logotipos autorizados para estabelecer um link para a Robonomics, RWS ou Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Utilize o logotipo autorizado da Robonomics para informar aos outros que você está integrado à Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Utilize os logotipos autorizados em posts de blogs, artigos e slides sobre a tecnologia Robonomics e projetos integrados",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Não modifique os logotipos autorizados da Robonomics, incluindo a mudança de cor, dimensões ou combinação com outras palavras ou elementos de design",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Não utilize o logotipo e o nome da Robonomics de uma forma que sugira que você é da Robonomics, que sua oferta ou projeto é da Robonomics, ou que a Robonomics está endossando você ou sua oferta ou projeto se não foi aprovada pela Robonomics DAO",
  "Robonomics Color pallet": "Paleta de cores da robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Estas cores nós usamos em nossas interfaces, estampas e outros recursos visuais. </br> Use-as para seus slides, banners para posts, etc., contando sobre a Robonomics.",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines’ own economics to perform various operations in the world around them at a speed not available to humans.": "A ideia principal que os autores dA Robonomics tentaram transmitir antes - é a evolução natural, lógica e aparentemente inevitável do nível atual da economia para serviços totalmente automatizados. Os serviços automatizados precisarão ter a capacidade de falar a linguagem da economia humana e também a própria economia das máquinas para realizar várias operações no mundo ao seu redor em uma velocidade não disponível para humanos.",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "A seguir, gostaríamos de mostrar a você as áreas práticas de interação homem-máquina usando a moderna tecnologia da Internet. Passaremos da arquitetura familiar de dispositivos IoT de troca de informações técnicas por meio de serviços em nuvem para a organização da interação técnico-econômica por meio de uma rede de provedores descentralizada e globalmente acessível.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Para começar, precisamos fazer uma excursão pela área mais claramente relacionada à conexão de rede de sistemas automatizados. Em seguida, abordaremos os fundamentos da Internet das Coisas para destacar os problemas e principais desafios enfrentados pelos criadores de sistemas IoT e para a solução que a Robonomics se propõe.",
  "Overview of the state of the internet of things (IoT)": "Visão geral do estado da internet das coisas (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "A questão da acessibilidade da rede de dispositivos automáticos tem sido discutida em todo o planeta desde os anos 60, e já naquela época foram feitas tentativas bastante sérias para resolvê-lo. Por exemplo, o ciberneticista soviético Viktor Glushkov propôs e implementou parcialmente a coleta automatizada de informações sobre os volumes de produção de uma planta individual como parte do projeto do sistema nacional de informações",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "nos anos 60 e 70. É amplamente conhecido como a máquina de venda automática da Coca-Cola foi conectada à ARPANET na década de 1980 para que as máquinas pudessem informar a disponibilidade de bebidas e sua temperatura.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Mas ainda assim, o desenvolvimento real da IoT está acontecendo hoje, devido ao uso generalizado de tecnologias facilitadoras. Os principais impulsionadores da rápida evolução dos aplicativos da Internet das Coisas são os resultados do desenvolvimento de muitas áreas – desde comunicações sem fio de várias faixas e dispositivos incorporados, até análise de nuvem e aprendizado de máquina. O número de dispositivos IoT vem crescendo de forma constante nos últimos 10 anos (com previsão de 25 bilhões de unidades até 2030), e isso tem estimulado pesquisadores e desenvolvedores a criar novos aplicativos IoT em diversas áreas, como saúde, automação residencial, agronegócio, proteção ambiental.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Estamos mais interessados no processo de construção de sistemas IoT e nas tarefas que surgem nesse processo. Ao longo dos anos de pesquisa, muitas arquiteturas   diferentes foram propostas e, calculando a média delas, podemos distinguir três componentes básicos de um sistema IoT: dispositivos, infraestrutura de rede, máquinas analíticas, computacionais e de controle.",
  "New challenges": "Novos desafios",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud’s functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "O desenvolvimento e aplicação da Internet das Coisas mostrou que resolver problemas típicos não é suficiente. Conceitos e princípios completamente novos, baseados em erros anteriores e deficiências identificadas, surgiram até os dias atuais. Essa abordagem certamente conveniente de usar serviços em nuvem acabou apresentando várias deficiências críticas relacionadas à escalabilidade, privacidade e segurança. Em um esforço para resolver esses problemas, foi proposto trazer processamento de dados, lógica e computação para mais perto do local imediato onde eles são usados. Assim, surgiram os conceitos de fog e edge computing, com sistemas intermediários entre a nuvem e os dispositivos assumindo algumas das funções da nuvem. Portanto, a criação de sistemas de edge tornaram-se um dos novos desafios da construção da Internet das Coisas.",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Outro desafio recente para a construção de IoT tem sido o conceito de gêmeo digital – uma versão digital de um equipamento real que copia suas especificações e dados históricos. Este conceito é melhor em áreas onde é necessário ter uma especificação precisa e completa de um processo e ser capaz de prever seu desenvolvimento. A Internet das Coisas atua como o principal integrador de gêmeos digitais, mas essa tarefa é muito mais profunda do que a conectividade usual dos dispositivos IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Neste momento, estamos testemunhando um segmento inteiro da rede, projetado e conveniente não para pessoas, mas para máquinas. A Internet das Coisas não é mais apenas a mecânica de conectar um dispositivo à rede, mas mais serviços, criados e disponibilizados especificamente para os dispositivos. A Internet das Coisas não apenas conecta o usuário e o dispositivo, mas também ajuda os dispositivos a lidar com as tarefas de prestação de um serviço para a pessoa, mas de forma autônoma.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Esses sistemas não têm interfaces de usuário e são normalmente usados no nível mais baixo dos ecossistemas de IoT para fornecer funcionalidades básicas. Tem que ser energeticamente eficiente e pequeno. Ter recursos de computação e comunicação limitados. Os gateways ou controladores de IoT geralmente atuam como receptores de sinal.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Esses sistemas atuam como um elo entre sistemas embarcados localmente acessíveis e a Internet global. Eles normalmente suportam vários protocolos de comunicação de sistemas incorporados e transferem a telemetria dos dispositivos para a nuvem e controlam os sinais para trás. Muitas vezes, esses dispositivos são uma versão mais sofisticada do roteador WiFi, equipado com um computador de placa única para realizar o processamento primário das informações dos dispositivos sem sair da rede local.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Essa classe inclui autômatos complexos (como o Spot da Boston Dynamics), que possuem um componente de controle no nível de um computador completo com processador de alto desempenho e grande quantidade de memória. Nesses casos, o robô está conectado à Internet sem soluções intermediárias adicionais (sistemas edge). O software necessário para acessar a Internet das Coisas é instalado diretamente no computador do sistema autônomo. Os dados são coletados e parcialmente processados localmente e, em seguida, transmitidos para a Internet de forma semelhante a qualquer dispositivo de rede completo.",
  "Internet of things providers": "Provedores de internet de coisas",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "O principal trabalho dos provedores de IoT é fornecer aos usuários acesso remoto a dados e análises, bem como o gerenciamento de dispositivos inteligentes pela Internet. Os principais critérios para a qualidade do provedor são a segurança das operações, estabilidade da conexão e disponibilidade do provedor em qualquer lugar do mundo.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "O esquema padrão para trabalhar com um provedor de IoT inclui: instalação de software compatível com o dispositivo inteligente em nuvem, configuração de serviços de gerenciamento do lado da nuvem após a primeira conexão bem-sucedida de um dispositivo, conexão de vários tipos de serviços analíticos.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Falando em gêmeos digitais, deve-se notar que arquitetonicamente sua implementação é necessária; como uma recusa em dar ao usuário acesso direto aos dispositivos de controle e alterar seus estados. Das razões mais óbvias para a rejeição estão, em primeiro lugar, a presença de seus próprios requisitos e condições nos dispositivos pouco antes do lançamento. Em segundo lugar, se vários dispositivos de usuário precisarem acessar uma única fonte de dados, pode ser fundamental fornecer controle personalizado a cada usuário. Por fim, é extremamente útil manter disponível o último estado real do dispositivo caso ele fique fora de operação.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Como resultado, temos uma separação entre o fluxo de troca de informações com o usuário e a geração real de dados reais pelos sensores. Para ilustrar este princípio, abaixo está o processo do usuário que trabalha com um dispositivo IoT usando um gêmeo digital.",
  "IoT data flows in cloud services": "Fluxos de dados da IoT em serviços de nuvem",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Valores de entrada para cloud triggers. Por exemplo, o serviço de nuvem envia várias notificações ao usuário no caso de um relatório de um sensor de alarme de carro sobre uma batida.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Dados de saída para análises complexas que não podem ser produzidas no nível de edge. Por exemplo, ao processar vídeo para reconhecimento facial em uma multidão.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "A base para formar um gêmeo digital do dispositivo para criar um elenco de seu estado. Por exemplo, a pedido do usuário no aplicativo móvel ou no site.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Um tipico sistema doméstico inteligente oferece uma ampla gama de opções para controlar seu espaço de vida. Com sua ajuda, você pode controlar remotamente as fechaduras das portas, configurando acesso único ou regular à sala para a família e amigos e para pessoal de manutenção ou entrega. Com inúmeros sensores e dispositivos de gravação, o sistema é capaz de incluir gravação de vídeo ao acionar sensores de movimento, tomar decisões de forma autônoma para desligar o abastecimento de água quando for detectado um vazamento no sistema de água, iniciar um robô aspirador programado, fornecendo um relatório de limpeza para o aplicativo do usuário, alterar a temperatura ambiente para o valor ideal, dependendo da sua programação.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Carros inteligentes. Fornecendo a eletrônica de bordo do carro com acesso à Internet móvel, o usuário tem acesso ao controle remoto de diversas funções do carro diretamente de seu smartphone: abrir portas, ligar o ar condicionado, controlar os faróis. Se esses carros forem usados para carsharing (compartilhamento de carros), você poderá criar um mapa interativo da localização dos carros com seu status, o combustível restante etc. para os clientes deste serviço.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Sistema inteligente de locação de equipamentos. A empresa instala manipuladores robóticos na linha de transporte mediante contrato com pagamento pelo número de operações ou pelo tempo do robô. Os manipuladores fornecem regularmente um registro das operações realizadas, erros e avisos. A taxa de locação do robô é calculada com base nisso, bem como a manutenção preditiva do fornecedor dos robôs.",
  "Global availability": "Disponibilidade global",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "A arquitetura cliente-servidor padrão requer a especificação de endpoints ao rotear mensagens de dispositivos IoT. Assim, durante a vida útil de um dispositivo inteligente, a falta de conexão significará uma limitação na capacidade de controlar e interagir com o dispositivo.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Por exemplo, a guerra comercial entre a China e os Estados Unidos já é uma espada de Dâmocles pairando sobre milhares de consumidores de aparelhos inteligentes chineses nos Estados Unidos e vice-versa. A qualquer momento, o bloqueio de servidores da Xiaomi pelas autoridades norte-americanas pode afetar usuários de dispositivos que se conectam aos serviços em nuvem do fabricante.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Estando nas imediações de um dispositivo IoT, você não pode controlá-lo a partir de um aplicativo móvel se não houver conexão com os servidores, por meio dos quais são fornecidas a autenticação do usuário e a coleta de telemetria dos próprios dispositivos. Ou seja, o dispositivo é realmente controlado pela nuvem, não pelo usuário.",
  "Cybersecurity": "Cibersegurança",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "A razão mais importante para a baixa segurança cibernética da maioria das soluções de IoT decorre do legado problemático da arquitetura cliente-servidor em nuvem. Por exemplo, a arquitetura de casa inteligente mais comum atualmente é geralmente um hub IoT, conectado a um serviço de nuvem. Assim, um sistema IoT típico é um elemento de controle central conectado a vários ataques de rede externa, ataques DoS (conduzindo o sistema à falha), modificações maliciosas, sequestro de sessão do usuário, etc. ou desastres naturais que causam falhas nos servidores. Também outro ponto definitivamente importante é a necessidade, em princípio, de confiar na nuvem e nas pessoas que a mantêm.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Os servidores de serviços em nuvem estão sujeitos a todos os problemas típicos de segurança cibernética: os dispositivos pertencentes ao mesmo sistema podem ultrapassar centenas ou milhares e, ao mesmo tempo, por sua natureza, os dispositivos IoT têm menos poder de computação, o que dificulta muito a implantação de firewalls e antivírus para eles. Infelizmente, o fator mais pernicioso é o fato de que os dispositivos IoT estão funcionando CPSs, então as ameaças à segurança cibernética estão realmente prontas para se manifestar no nível físico.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Tudo isso é exacerbado pela escala das soluções de IoT. O número de sistemas IoT. Certamente, o serviço de nuvem é mais seguro do que os dispositivos de baixo nível, mas a consolidação do controle centralizado sobre centenas de milhares desses sistemas torna qualquer violação de segurança e vazamento um grande desastre.",
  "Data privacy": "Privacidade de dados",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "O ponto de privacidade precisa ser separado da segurança cibernética, pois esse problema é específico dos sistemas IoT. Devido ao grande número e variados tipos de dispositivos que estão muito mais integrados ao mundo físico do que apenas computadores e smartphones, a gama de tipos de dados privados é multiplicada. Não é mais apenas localização por GPS, registros de compras, transações financeiras e fotos, mas também um registro permanente de vídeos e conversas, impressões de voz, condições de saúde e até uma lista de hábitos de uma pessoa. Entre os tipos de ameaças relacionadas à privacidade estão: identificação de informações, localização e rastreamento, profiling, ataque de inventário, ataque de vinculação de dados.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "A parte mais assustadora é que os usuários têm pouca ou nenhuma consciência de que estão abrindo mão de sua privacidade porque quase não têm ideia de quais dados estão sendo coletados e como estão sendo usados. A ameaça à privacidade cresce não apenas de invasores, mas também de organizações e agências governamentais justamente por causa disso. Os serviços de IoT em nuvem normalmente exigem transferência máxima de dados dos dispositivos e não há maneiras de proibir ou restringir a transferência de dados («Aceite os termos ou vá embora»). Além disso, apesar de os dados coletados serem um ativo e terem valor real, a pessoa de quem são coletados não apenas é negado o direito de dispor ativamente desses dados, mas também é negado qualquer compensação pela coleta e uso de seus próprios dados.",
  "Main tasks of robonomics architecture": "Principais tarefas da arquitetura robonomics",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Com base nas conquistas e desafios das plataformas em nuvem, a Robonomics visa oferecer ao mercado de IoT soluções de Internet mais seguras e avançadas em todas as etapas da comunicação homem-máquina. Abaixo estão as principais tarefas para as quais a Robonomics se destina:",
  "Managing an IoT device using a decentralized cloud": "Gerenciando um dispositivo iot usando uma nuvem descentralizada",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "As redes Blockchain têm todos os recursos para fornecer o mais alto grau de segurança para executar um dispositivo e obter sua telemetria. A interação com o dispositivo pode ser descrita alterando o estado do gêmeo digital armazenado na rede blockchain e enviando informações sobre essas alterações. No caso de uma blockchain não permissionada, podemos falar sobre as garantias de disponibilidade global de provedores para IoT, bem como um alto nível de proteção de dados de gêmeos digitais contra alterações indesejadas.",
  "Performing technical and economic transaction between people and machines": "Realizando transação técnica e econômica entre pessoas e máquinas",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Graças ao mecanismo de criptomoedas e smart contracts, podemos fornecer acesso a sistemas automatizados diretamente aos mercados digitais. Por exemplo, a Ethereum já implementa a maioria das ferramentas básicas da atividade econômica que podem ser utilizadas na operação de dispositivos autônomos. Os aplicativos criados para a interação entre o usuário final e o dispositivo IoT serão muito mais eficazes se os termos de serviço e pagamento forem indissociáveis dos parâmetros de lançamento do dispositivo.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Os avanços modernos na tecnologia web3 podem resolver a questão da privacidade do usuário. Com A web3 não há necessidade de autenticar ou exigir conexão com servidores específicos para acessar a telemetria e controlar o dispositivo.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics é uma nuvem descentralizada para gêmeos digitais de dispositivos IoT. Robonomics suporta o formato tecnoeconômico para comunicação, além de fornecer aplicativos privados para usuários",
  "A human interface to access the system": "Uma interface humana para acessar o sistema",
  "A communication protocol": "Um protocolo de comunicação",
  "A machine interface": "Uma interface de máquina",
  "Human interface": "Interface humana",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Propomos o uso de aplicativos descentralizados (dapps) como a principal forma de conectar usuários para controlar dispositivos inteligentes pela Internet. Assim, poderemos fornecer a interface de usuário mais segura (em termos de dados) ao sistema, que poderá funcionar simultaneamente nas condições da rede local da cidade e por meio de uma rede global comum.",
  "Communication protocol": "Protocolo de comunicação",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Seu papel é desempenhado pela rede Robonomics, uma especificação desenvolvida pela equipe do projeto que implementa uma rede descentralizada de provedores que fornecem a transmissão, processamento e armazenamento de informações necessárias para executar dispositivos IoT. Na verdade, é uma implementação de um nó de função específica para redes IPFS, Ethereum, e Polkadot.",
  "Machine interface": "Interface da máquina",
  "We have chosen the most well-known robotics framework called Robot Operating System Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Escolhemos a estrutura de robótica mais conhecida chamada Robot Operating System (ROS) como a interface padrão para integrar qualquer sistema ciberfísico compatível. Robonomics suporta vários usos para ROS. A implementação do Robonomics para a rede Ethereum está na forma do pacote ROS robonomics_comm. Para a arquitetura ROS 2, implementamos suporte para A Robonomics como uma camada de  Middleware (consulte «Robonomics as ROS 2 Middleware» para obter detalhes). Quando o uso do ROS é redundante (por exemplo, ao trabalhar com dispositivos IoT), um módulo de interface robonomics do Python foi desenvolvido. Ele ajuda a acessar as funções da Robonomics nativamente e funciona com nós locais, privados e remotos e públicos.",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Aqui está um diagrama geral do ciclo completo de inicialização do dispositivo usando a plataforma Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "O aplicativo descentralizado do usuário envia uma solicitação para uma função de controle do dispositivo por meio da rede Robonomics.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "A rede Robonomics fornece tradução de solicitações usando libp2p e captura eventos na blockchain Ethereum ou parachain Robonomics.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "O controle do dispositivo é fornecido por uma rede descentralizada, que garante o armazenamento das informações necessárias para a execução do dispositivo IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "O dispositivo IoT recebe independentemente informações das redes Ethereum e Polkadot sobre o estado atual do gêmeo digital. Isso garante que o dispositivo possa ser iniciado com segurança somente após os parâmetros técnicos e econômicos de inicialização terem sido estabelecidos.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Como resultado da operação, o dispositivo IoT publica um log de operações concluídas, que pode ser usado como evidência do serviço prestado ou para depuração de erros.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "O log é transformado em relatório para o usuário e fica disponível em seu dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Construindo DApps & Web Services para IoT na Parachain Robonomics",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, arquiteto de software",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Devemos lembrar que a máquina automática é o equivalente econômico exato do trabalho escravo. Qualquer trabalho que concorra com o trabalho escravo deve aceitar as consequências econômicas do trabalho escravo.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "ciberneticista",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Os robôs são como crianças maduras hoje - eles já podem administrar dinheiro, e entrar em relações jurídicas, ser independentes.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "O futuro da própria humanidade depende de como ensinamos os robôs a controlar suas capacidades.",
  "Robonomics tools": "Ferramentas Robonomics",
  "Operate with digital twins of IoT devices": "Operar com gêmeos digitais de dispositivos IoT",
  "The first tools of the robot economy: money for robots, contracts for robots": "As primeiras ferramentas da economia dos robôs: dinheiro para robôs, contratos para robôs",
  "Software for connecting devices to a decentralized cloud": "Software para conectar dispositivos a uma nuvem descentralizada",
  "API library for custom IoT applications": "Biblioteca API para aplicações IoT personalizadas",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "A Robonomics possui um conjunto completo de ferramentas para o desenvolvimento de aplicações IOT, tanto no lado da robótica quanto no da interface do usuário. A comunicação entre o usuário e o dispositivo acontece utilizando as tecnologias de maior sucesso do mundo Web3 - IPFS, Ethereum, e Polkadot. Assim, os desenvolvedores podem criar aplicações modernas e seguras para Cidades Inteligentes e para a Indústria 4.0.",
  "Robonomics Connectivity": "Conectividade Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Para a conveniência dos desenvolvedores, a Robonomics contém um conjunto de softwares para conexões: dispositivos IoT usando o protocolo HTTP/MQTT, sistemas robóticos complexos usando o Robot Operating System (ROS).",
  "Connect a sensor": "Conecte um sensor",
  "to the Robonomics network": "à rede Robonomis",
  "Try": "Experimente",
  "a simple prototyping tool": "uma ferramenta simples de prototipagem",
  "Start building your own cyber physical system with": "Comece construir seu próprio sistema físico cibernético com o",
  "Aira OS": "Sistema Operacional Aira",
  "Robonomics Supports Hundreds of Robots Out of the Box": "A Robonomics Suporta Centenas de Robôs Exclusivos",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Os usuários da plataforma podem conectar robôs compatíveis com ROS à economia digital em questão de minutos. Para uma lista completa de robôs compatíveis, por favor, siga o link",
  "Decentralized Cloud infrastructure for IoT": "Infraestrutura de nuvem descentralizada para IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) é o serviço básico de infraestrutura para Robótica e IoT na Parachain Robonomics e IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Dapp Robonomics",
  "economy of robots": "Economia dos robôs",
  "Core RWS features available for IoT today": "Principais recursos RWS disponíveis para IoT hoje",
  "RWS PubSub Message Broker": "RWS Intermediário de mensagens PubSub",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "Use mensagens ilimitadas através de uma rede p2p baseada no protocolo IPFS",
  "RWS Data Blockchainization Service": "RWS Serviço de blockchainização de dados",
  "RWS Robot Actions": "RWS Atividades de robô",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Ligar / desligar; inicie ou pare seus dispositivos IoT sob o controle de um computador descentralizado",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "O Coração de Sua Aplicação IoT - Gêmeos Digitais na Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Na arquitetura técnica, os gêmeos digitais IoT fornecem visibilidade e monitoramento das coisas e eventos relacionados (por exemplo, usando dispositivos IoT para obter automaticamente a origem de um produto), e a blockchain permite a versão única compartilhada da verdade sobre o estado dessas coisas ao longo de seus ciclos de vida e eventos comerciais associados",
  "from Gartner research": "da pesquisa de Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "A Parachain Robonomics oferece a oportunidade de criar um modelo de gêmeo digital e atualizar seu estado a cada 6 segundos.",
  "App Store for Robotics - Robonomics Marketplace": "App Store para Robótica - Robonomics Marketplace",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "As empresas que projetam e fabricam produtos e equipamentos conectados a IoT devem adotar um modelo flexível de entrega de gêmeos digitais para reduzir as barreiras à adoção, como oferecer gêmeos digitais por meio de marketplaces, em vez de oferecer apenas gêmeos digitais por meio de seu próprio modelo de entrega proprietário",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry": "O modelo de gêmeo digital desenvolvido pode ser diretamente vinculado a serviços adicionais que sua empresa fornece para o setor de IoT",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service": "Para tornar um processo de entrega conveniente e simples para centenas de clientes, adicionamos uma seção de serviços para o marketplace de robôs. Dê uma olhada nos primeiros exemplos dos pacotes de modelos de gêmeos digitais implementados + serviço automatizado da empresa",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "Você tem uma ideia para seu serviço para robôs ou usuários? Siga às instruções passo a passo para construir sua aplicação IoT na plataforma Robonomics.",
  "Secure": "Secure",
  "Serverless": "Sem Servidor",
  "Futuristic": "Futuristas",
  "IoT applications": "Aplicações IoT ",
  "Robonomics network vision": "Visão da rede Robonomics",
  "At the frontier of cybernetics and economics": "Na fronteira da cibernética e da economia",
  "Build your IoT services on Robonomics platform": "Construa seus serviços iot na plataforma robonomics",
  "taking full advantage of decentralized architecture": "aproveitando ao máximo a arquitetura descentralizada",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "A Robonomics permite que os usuários se conectem a dispositivos inteligentesusando aplicativos descentralizados (dapp) que não exigem a transferência de dadosdo usuário para autenticação. A comunicação ocorre por meio de uma rede descentralizadade provedores sem um único ponto de falha, e o dispositivo obtém informações deforma independente da rede da blockchain para executar ou transmitir dados remotamente.Assim, a Robonomics fornece um alto nível de segurança cibernética do dispositivoe privacidade dos dados do usuário em todas as etapas da comunicação, desde oaplicativo do usuário até o lançamento do dispositivo inteligente.",
  "From smart contracts to cross chain IoT platform": "De smart contracts a plataforma iot cross chain",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "O projeto Robonomics tem mais de 6 anos. Começamos a nos preparar para o primeiroexperimento demonstrando a comunicação homem-máquina usando uma rede de provedoresdescentralizada independente em 2015, desde os primeiros dias da rede Ethereum.No início de 2021, a equipe do projeto conseguiu criar um protocolo de comunicaçãode máquina tecnoeconômico executado em Ethereum e IPFS e complementá-lo com elementosde uma plataforma de IoT baseada em nuvem com base em parachain na Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Como resultado, hoje já temos uma plataforma híbrida para criar aplicativosIoT futuristas que permitem a interação com dispositivos sob o controle de umcomputador global descentralizado.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Os criadores da Robonomics são experimentadores, engenheiros e cientistas quese preocupam em entender a validade científica da abordagem e obter clareza naapresentação dos princípios que devem formar a base de toda a arquitetura da soluçãode software.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "Em nossos artigos entre 2017 e 2020, apresentamos à comunidade científica muitosconceitos e soluções unidos em torno da ideia da economia robótica, um sistemaeconômico no qual dispositivos robóticos atuam como agentes independentes capazesde realizar atividades econômicas fundamentais, antes reservadas aos humanos.Você pode ler os artigos científicos",
  "this link": "neste link",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Gostaríamos de justificar o surgimento da economia robótica e explicar em termosgerais por que acreditamos que esse conceito é a resposta inevitável e óbvia parao funcionamento dos sistemas robóticos de grande escala na nova revolução industrial.",
  "Move towards the factory of the future": "Rumo à fábrica do futuro",
  "Inspired by Ronald Coase": "Inspirado por Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "O Prêmio Nobel de Economia Ronald Coase em seu trabalho de 1937 “The Natureof the Firm” demonstrou melhor  a dicotomia “hierarquia vs livre mercado” e deuuma explicação das razões da existência das organizações, em particular as empresas.Coase discute o impacto dos custos de transação (o custo de coleta e processamentode informações) para tomar decisões sobre a celebração de um contrato e monitorarsua implementação. A empresa, com toda sua estrutura hierárquica extramercado,se constitui como a forma mais eficiente de fornecer ao consumidor o produto alvocom os menores custos de transação no momento, momento em que o esforço transacionalpara criar o mesmo produto por meio de múltiplas trocas no mercado entre os indivíduostorna-se muito maior. Para visualizar melhor esse processo, veja o exemplo ilustrativoda compra de um carro. Tente comprar um carro pelas peças e calcule quanto dinheiroe tempo você gastará apenas para montar todos os componentes em sua garagem. Osriscos e custos de negociação da compra de peças são muito altos em comparaçãocom o Model X da Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "No entanto, isso não leva ao surgimento da única empresa do mundo para a produçãode tudo. A questão é que os mesmos custos de transação também impõem restriçõesao tamanho das empresas. Coase escreve:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...uma empresa tenderá a se expandir até que os custos de organizar uma transaçãoextra dentro da empresa se tornem iguais aos custos de realizar a mesma transaçãopor meio de uma troca no mercado aberto...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Em outras palavras, quanto mais complexa a hierarquia dentro da empresa, maioressão os custos internos e, em algum momento, tornam-se excessivos em relação aoscustos de retorno ao mercado. Por isso, para garantir seu crescimento como umdos impulsionadores, os empreendedores buscam formas de reduzir esses custos.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "A ideia de reduzir os custos de transação através da capacidade de todos osparticipantes no processo de negócios (produção, logística, consumo) se uniremem um nível mais próximo se",
  "clearly correlates": "correlaciona claramente",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "com os problemas e desafios enfrentados pelos fabricantes de soluções de automação.Nos últimos 50 anos, as operações padrão/regulares da maioria dos processos denegócios de grandes empresas foram quase totalmente automatizadas. Os fabricantesficam essencialmente com a tarefa de construir uma comunicação segura entre aspartes totalmente automatizadas da cadeia de suprimentos, e essa tarefa é um fatorque impede uma maior redução dos custos de transação por meio da automação. Odesejo de comercializar produtos ou serviços mais competitivos em relação às empresasparcialmente automatizadas",
  "firms spurs the search for solutions to": "estimula a busca de soluções",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "para esses desafios. Parece que tudo está caminhando para o surgimento das empresasrobotizadas – organizações em que todo o ciclo de processos de negócios é totalmenteautomatizado e não requer participação humana, exceto como beneficiários e consumidores.",
  "Get rid of transaction costs": "Livre-se dos custos de transação",
  "Our future in smart cities": "Nosso futuro em cidades inteligentes",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "A tarefa que os fabricantes de automação enfrentam hoje tem um nome específico- a construção de sistemas ciber-físicos (Construction of cyber-physical systemsou CPS). Por",
  "definition,": "definição,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "um CPS é uma forte unificação e integração mútua de vários processos computacionais, de rede e físicos.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "As tarefas de construção do CPS são centrais para qualquer ideia descrita nanova (quarta) revolução industrial. Portanto, o CPS é a pedra angular de nossavida futura nas Cidades Inteligentes, manifestando-se em todos os lugares. Exemplosde sistemas ciberfísicos do futuro são: piloto automático Uber, selfies de drones,rede de impressoras 3D em estações de metrô.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "O CPS é uma estrutura complexa com muitos elementos conectados: do aplicativono telefone, ele se estende ao controle do drone em voo sobre a cidade e depoispublica as fotos resultantes no Instagram, mas somente após o processamento pelaIA na nuvem.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "A coisa mais importante no processo de design do CPS é encontrar a linha tênueentre o número suficiente e excessivo de elementos automatizados na cadeia desuprimentos do usuário do serviço. Em outras palavras, onde está o limite de tamanhodo CPS? Para responder a esta pergunta, devemos recorrer ao famoso matemáticoNorbert Wiener.",
  "Self-regulating systems": "Sistemas auto-reguláveis",
  "Inspired by Norbert Wiener": "Inspirado por Norbert Wiener",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works 'Cybernetics: Or Control and Communication in the Animal and the Machine'. He used the term 'cybernetics' as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday": "Em 1948, um professor de matemática do MIT, Norbert Wiener publicou um dostrabalhos mais importantes ;'Cibernética: Ou Controle e Comunicação no Animal ena Máquina'. Ele usou pela primeira vez o termo 'cibernética' como mecanismosautorreguladores e, por isso, esta publicação é considerada um aniversário cibernéticoreconhecido.",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener fala sobre a viabilidade da abordagem interdisciplinar da ciência.Por exemplo, ele traçou os paralelos entre os sistemas de controle automatizadose os desafios de dimensionamento e aumento da complexidade da sociedade humana.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Assim, em outras palavras, a abordagem cibernética pode ser aplicada igualmenteà psicoterapia, biologia e navegação automatizada. É baseado na função do sistema,como as ações individuais são controladas e como os nós individuais interagementre si.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Levando em conta as publicações de Ronald Coase e Norbert Wiener, acompanhandoo desenvolvimento da Indústria 4.0, podemos considerar o uso do CPS como um agenteeconômico, ao projetar serviços robotizados. Para regular o tamanho do CPS e seadaptar às necessidades de mudança dos indivíduos, podemos usar o mecanismo demercado.",
  "And what’s so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this": "E o que é tão interessante cientificamente, tomando como base a ideia das restriçõesimpostas pelo mercado ao tamanho da empresa, podemos dizer que o limite do aumentodo CPS será sempre determinado pelo mercado e nada mais é necessário para isto.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Empresas robotizadas são uma representação ideal para sistemas ciber-físicos.Eles são uma unidade bastante autônoma capaz de fornecer serviços a humanos eoutros robôs por dinheiro. Como resultado, a economia robótica nos parece serum conjunto geral de CPSs que fornecem serviços e bens diretamente ao mercado.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Dinheiro para robôs",
  "Industry 1.0": "Indústria 1.0",
  "Mechanization:": "Mecanização:",
  "replacement of muscle power with steam energy.": "substituição da força muscular pela energia do vapor.",
  "1784 y.": "Ano de 1784.",
  "Industry 2.0": "Indústria 2.0",
  "Electrification:": "Eletrificação:",
  "introduction of assembly-line production.": "introdução da produção em linha de montagem.",
  "1870 y.": "Ano de 1870.",
  "Industry 3.0": "Indústria 3.0",
  "Automation:": "Automação",
  "introduction of automated systems with CNC.": "introdução de sistemas automatizados com CNC.",
  "1969 y.": "Ano de 1969.",
  "Industry 4.0": "Indústria 4.0",
  "Smart production:": "Produção inteligente:",
  "development of cyber physical systems.": "desenvolvimento de sistemas físicos cibernéticos.",
  "Now": "Atualmente",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "No mundo das empresas robóticas, é natural fornecer aos robôs acesso a instituições sociais que antes eram necessárias apenas para humanos.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "As instituições sociais não aparecem porque somos pessoas e fisiologicamenteuma pessoa não pode viver sem bancos, contratos e outros instrumentos da sociedade.Mas só porque uma pessoa, em algum momento, entrou no caminho das relações maiscomplexas da sociedade e deu um passo importante para acelerar os processos daquelesque nos cercam.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Dinheiro e contratos devem estar disponíveis para robôs, não porque isso sejauma fantasia doentia de fãs de robôs que esqueceram o que é a Skynet. Mas apenasporque a nova revolução industrial se propõe a construir cadeias automatizadascomplexas, cujos processos afetarão a troca de informações técnicas e econômicas,e também prosseguirão em uma velocidade inacessível aos humanos",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to “charge” your ride with uber and make it faster.": "Um dos exemplos de nossos experimentos: negociar espaço viário e pagamentosde direito de passagem para veículos autônomos para reduzir o congestionamento.O que uma pessoa absolutamente não faria no trânsito, o carro fará por você semdificuldades: você quer mudar de faixa, o seu carro e o carro do seu vizinho 'conversam' sobre o custo de tal operação a uma taxa de centenas de msgs por segundo, elesrevelarão um preço de equilíbrio e, portanto, você já está na outra faixa. Issosignifica que agora estará disponível para “carregar” sua carona com o uber etorná-la mais rápida.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Os robôs precisam de dinheiro que esteja diretamente disponível para eles parapoder realizar operações sem uma pessoa na velocidade com que apenas as máquinaspodem tomar decisões. E tudo isso é apenas para uma pessoa aproveitar a vida naCidade Inteligente!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "E aqui chegamos sem problemas ao primeiro dinheiro eletrônico - Bitcoin. O fatode que o Bitcoin pode ser armazenado em sua conta no princípio de não ser um banco,mas dinheiro em sua carteira torna o primeiro dinheiro que o robô pode gerenciarde forma independente, mais precisamente de forma autônoma. Ao mesmo tempo, hojejá podemos dizer que o Bitcoin não é apenas dinheiro eletrônico, mas uma instituiçãofinanceira verdadeiramente global.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Como resultado: um evento não inventado por nós, mas claramente enquadradoem nossa visão, faz do Bitcoin o primeiro dinheiro para robôs, ou, se olharmosainda mais fundo, é justamente essa instituição social que ajudará na formaçãode empresas robóticas.",
  "Smart contracts": "Smart contracts",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin se tornou o primeiro dinheiro disponível para robôs. Enquanto isso,não podemos falar sobre o Bitcoin em sua forma atual como uma ferramenta paratroca técnica e econômica completa.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Agora já temos contratos inteligentes, mercados DeFi e uma infraestrutura descentralizadapara troca de mensagens entre robôs que abrem a possibilidade para a humanidadecriar uma parte totalmente automatizada da economia humana - a economia robótica.",
  "One of the great opportunity to build the economy of robots is": "Uma das grandes oportunidades para construir a economia dos robôs é a tecnologia da",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Com a funcionalidades da Ethereum, os robôs são capazes não apenas de trocar dinheiro, mas de firmar contratos com humanos e entre si.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Mas qual é o objetivo da comunicação baseada em contrato máquina a máquina (m2m)?Essa é uma ótima pergunta! Voltemos ao CPS. Quando falamos de comunicações diretasentre sensores, equipamentos de máquinas ou quaisquer outros elementos, aindafalamos de colaboração dentro de um sistema regulado. Mas se queremos que os serviçosde cidades inteligentes estejam vivos (ou até mesmo casas inteligentes em algunscasos), precisamos estabelecer comunicação com vários elementos de terceiros.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Vamos imaginar o serviço de entrega por drones. Se um drone, por exemplo, épropriedade da DHL, como ela pode acessar os armazéns da Amazon ou acessar todoo espaço aéreo da cidade? Será um monopólio? Este é um grande desafio para muitasiniciativas da 4ª revolução industrial!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "A maioria das corporações diz que precisa de direitos quase completos sobreseus arredores porque não sabe como configurar com segurança a troca de informaçõestécnicas entre sistemas automatizados fora de sua própria estrutura corporativainterna. Ao mesmo tempo, se você observar os processos em que uma pessoa trabalha,veremos que a cooperação de diferentes corporações é longa e existe com sucesso.Você pode facilmente solicitar a entrega porta a porta de mercadorias compradasno site da Amazon, e o correio poderá dirigir um carro pelas estradas da cidade,receber um pedido no armazém e trazê-lo para você.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Qual é a diferença? No primeiro caso não há como construir uma relação contratualentre máquinas, e no segundo caso, no mundo das pessoas, já existem relações contratuais.",
  "Parachains": "Parachains da",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "A principal dificuldade que a Robonomics enfrenta hoje é o alto preço para lançarum dispositivo IoT usando a Ethereum. Na Ethereum você tem que pagar uma comissãosobre cada transação em termos de dólares americanos, na faixa de US$ 10 a US$100. É bastante caro para a maioria dos casos da economia real, seja uma viagemde compartilhamento de carro, aluguel de um apartamento inteligente, entrega pordrones ou ordenar a impressão em 3D de seu herói anime favorito.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Por justiça, gostaríamos de observar que existem cenários lucrativos mesmo comas taxas de transação na rede Ethereum de 2018 - 2019. Por exemplo, transaçõesautomatizadas de compensação de pegada de carbono ou transferência do pedido dosite diretamente para a produção. Mas ainda assim, para a aplicação em massa dastecnologias web3 no campo da IoT, é necessária uma redução no preço que a nuvemcobra do dispositivo conectado.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Procurando uma oportunidade para reduzir o custo de interação com um dispositivoIoT, os desenvolvedores da Robonomics estudaram desenvolvimentos alternativosao Ethereum. Nossa escolha se baseou na arquitetura da",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": ", que nos permitiria rodar nossa própria blockchain, dentro de uma rede comum, na qual a segurança é garantida por validadores independentes do nosso projeto.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Rede Blockchain Heterogênea",
  "Homogeneous Shard Network": "Rede de Shards Homogêneos",
  "On-chain protocol control": "Controle de protocolo on-chain",
  "Protection against the tyranny of the crowd": "Proteção contra a tirania da multidão",
  "Auction of bandwidth in the common network": "Leilão de largura de banda na rede comum",
  "Payment for gas by users": "Pagamento de gas pelos usuários",
  "Have you read this?": "Você leu isso?",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection": "Grandes livros levam a grandes ideias. Se você está atrás de mais inspiraçãosobre comunicação homem-máquina, tente ler livros de ficção científica. Marqueos livros que você já leu e veja o que mais podemos lhe oferecer para uma reflexãomais aprofundada.",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Eu, Robô",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "O Homem Bicentenario",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Questões abertas de teleologia",
  "and a treatise by L. von Mises": "e um tratado de L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Para concluir, gostaríamos de mencionar questões que permanecem em aberto de um ponto de vista global. Qual é o objetivo dos robôs?",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots": "De fato, a economia das pessoas está muitas vezes associada à consciência derealizar tarefas no âmbito do contrato, ao desejo das partes de alcançar um resultado,ao comportamento oportunista e altruísta do indivíduo na sociedade. Todos essesprincípios são difíceis de aplicar à economia dos robôs. Quais são os motivosda economia robótica? É uma questão em aberto que precisamos pesquisar e discutirna sociedade para melhor compreensão e aplicação dos robôs.",
  "For the start we suggest to look at Mises's work 'Human Action: A Treatise on Economics' (praxeological approach) and at early article by Norbert Wiener 'Behavior, Purpose and Teleology' (teleological vision).": "Para começar, sugerimos olhar para a obra de Mises 'Human Action: A Treatise on Economics' (abordagem praxeológica) e para o artigo inicial de Norbert Wiener 'Behavior, Purpose and Teleology' (visão teleológica).",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "A praxeologia nos inspira com ideias interessantes sobre o comportamento humanosem dependência direta dos propósitos. Isso nos dá a oportunidade de trabalharnos processos da economia robótica condicionalmente como com uma caixa preta semnos aprofundarmos nos objetivos finais. Ao mesmo tempo, a teleologia representaum desafio para explicar as causas.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Esperamos que em algum lugar na junção dos trabalhos de Mises e Wiener, possaser encontrado um ponto para um maior desenvolvimento da economia robótica, nãoapenas como um protocolo de interação entre pessoas e máquinas de natureza praxeológica,mas levando em conta o elementos da construção de comunicação interespécies.",
  "or": "ou"
}