{
  "What is Robonomics network?": "O que é a rede robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "A Robonomics é uma plataforma de código aberto para aplicações IoT. Oferecemos suporte a uma nova geração de tecnologias da internet (web3) que implementam a troca de informações técnicas e econômicas na forma de transações atômicas entre aplicações do usuário, serviços da Internet e robótica complexa.",
  "Get started": "Iniciar",
  "Explore Robonomics": "Explorar Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics é uma tecnologia de código aberto para o mercado de IoT (Internet das Coisas), disponível para todos. Leia um resumo para saber mais",
  "Get XRT": "Obter XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT é o token utilitário que possibilita o controle de dispositivos IoT no topo da rede Ethereum e da parachain Robonomics",
  "Use a Dapp": "Use un Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Dê uma olhada na versão Beta da aplicação descentralizada para o gerenciamento de dispositivos IoT",
  "Start building": "Comece a construir",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Aprenda Robonomics através de tutoriais e experimentos práticos na WIKI Robonomics",
  "Robonomics objectives": "Objetivos da Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Com base nas conquistas das plataformas em nuvem, a Robonomics visa oferecer ao mercado de IoT soluções de Internet mais seguras e avançadas em todas as etapas da comunicação homem-máquina. Existem algumas  tarefas principais para as quais a Robonomics está sendo desenvolvida",
  "IoT device management with a decentralized cloud": "Gerenciamento de dispositivo IoT com uma nuvem descentralizada",
  "Techno-economic transactions between humans and machines": "Transações tecno-econômicas entre humanos e máquinas",
  "Serverless IoT applications for users": "Aplicativos de IoT sem servidor para usuários",
  "Learn with Robonomics": "Aprenda com a robonomics",
  "Introduction course": "Curso de Introdução",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Mergulhar nos problemas que surgem em torno da construção de aplicações modernas da Internet das Coisas e possíveis soluções com tecnologias Web3 e ferramentas da Robonomics para desenvolvedores e usuários de IoT.",
  "Boston dynamics spot software developing": "Desenvolvimento de Software do Spot da Boston Dynamics",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Estamos entusiasmados em apresentar-lhe o programa educacional SDK Spot! Nosso objetivo é familiarizá-lo com o SDK Spot e permitir que você teste suas habilidades remotamente usando o robô Spot da Boston Dynamics em nosso laboratório.",
  "Sovereign smart home with robonomics and home assistant": "Casa Inteligente Soberana com Robonomics e Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Neste curso, você passará por todas as etapas necessárias para construir sua própria casa inteligente soberana, cuja principal vantagem é a segurança / privacidade dos dados dos usuários.",
  "Shop": "Loja",
  "Science papers": "Artigos científicos",
  "Books": "Livros",
  "Logo and assets": "Logotipo e ativos",
  "Blog": "Blog",
  "Ambassador program": "Programa de embaixadores",
  "Contacts": "Contatos",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Cronologia",
  "Tokenomics": "Tokenomia",
  "Parachain": "Parachain",
  "User (D)App": "Usuário (D)App",
  "Function request": "Solicitação de função",
  "Report": "Relatório",
  "Control": "Controle",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Aplicação descentralizada",
  "Digital twin": "Gêmeos digitais",
  "IoT / Smart device": "Dispositivo IoT / inteligente ",
  "Robonomics tokenomics": "Tokenomia da Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "é o token de utilidade que tornará possível controlar dispositivos IoT no topo da rede Ethereum e na parachain Robonomics no ecossistema Polkadot.",
  "The task": "A tarefa",
  "Be aware of scammers": "Esteja atento aos golpistas",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "por favor, use apenas mercados bem conhecidos para trocar XRT. Não envie seus tokens para contas que lhe são fornecidas em mensagens privadas, qualquer que seja a transação que você gostaria de realizar (comprar ou vender tokens). Se você recebeu alguma 'mensagem estrondosa' sobre o token da Robonomics (os golpistas costumam usar algo como anúncio de airdrop), por favor, verifique este website (https://robonomics.network/) ou nosso ",
  "for official updates. Be careful, be safe.": "para atualizações oficiais. Tenha cuidado, esteja a salvo.",
  "XRT in Ethereum": "XRT na Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Ao implementar o projeto Robonomics em 2015 - 2018, a equipe do projeto precisava encontrar uma conexão entre o fornecimento de uma função útil pela Rede Robonomics, ou seja, o lançamento de dispositivos IoT de acordo com o modelo robot-as-a-service, e o reembolso dos custos para os provedores da Robonomics pelas taxas de gás na Ethereum. Precisávamos pensar no ciclo de vida da responsabilidade de cada dispositivo inteligente individual para realizar um serviço. Como resultado do início da P&D na Robonomics, a equipe criou um mecanismo para minerar novos tokens para recompensar cada contrato inteligente de robot-as-a-service. Este modelo continua viável para o futuro da Robonomics na Ethereum, mas somente com melhorias significativas na Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Leia isto para conhecer o histórico e os planos de longo prazo da equipe para o XRT no ecossistema Ethereum.",
  "Etherscan profile": "Perfil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Veja o contrato inteligente do token e as transações na rede Ethereum aqui.",
  "Coingecko markets": "Mercados na Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Aqui você pode encontrar os mercados CEX e DEX para negociar XRT.",
  "XRT In Polkadot": "XRT na Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Mudando da Ethereum para a Polkadot, precisamos fazer uma 'escalada' na tokenomia. As parachains no ecossistema Polkadot não são o equivalente a um contrato inteligente, mas são uma blockchain totalmente programável que aluga um segmento da rede geral.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "O pagamento real por parte das parachains Polkadot e Kusama é a união a longo prazo de tokens nativos da Relay chain (DOT / KSM) em quantidade suficiente para ganhar um dos leilões. O XRT na parachain Robonomics auxilia na renovação do slot e recompensa às partes interessadas. O mecanismo de queima dos XRT subjacente à ativação de assinaturas IoT é projetado para reduzir a inflação ao mínimo e, em caso de aumento de juros, a zero.",
  "Learn more": "Saiba mais",
  "in Twitter thread from our network architect.": "no Twitter do nosso arquiteto de rede.",
  "Usage:": "Utilização:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT pode ser usado tanto para pagar taxas pela realização de transações na parachain quanto para comprar uma assinatura IoT que garanta o processamento prioritário de dispositivos ou transações IoT do usuário.",
  "Rewards:": "Recompensas:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Ao longo do ano, a parachain emite uma pequena quantidade de XRT para incentivar os coletores (collators) da parachain.",
  "The parameter of the total reward": "O parâmetro da recompensa total",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "para os coletores durante o ano é determinado pela votação on-chain dos detentores de tokens, e pode ser alterado através da realização de um referendo.",
  "Use XRT": "Utilizar XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Compre a assinatura IoT em nosso aplicativo descentralizado. Controle seus dispositivos inteligentes via blockchain sem que nenhuma corporação centralizada observe.",
  "Subscan profile": "Perfil Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Visualize estatísticas do token no topo do ecossistema Polkadot.",
  "Other questions": "Outras perguntas",
  "What is RWS?": "O que é RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Em desenvolvimento da funcionalidade principal] Para engenheiros, a equipe do Core Dev tentará fazer diferentes modelos de uso da Robonomics e o primeiro passo desta forma é lançar o token de assinatura vitalício - o token RWS. Cada token RWS lhe dará 1 transação por segundo (tps) de/para seu dispositivo IoT por meio da Parachain Robonomics. Ative seu token RWS e faça transações 'grátis' com pré-execução e latência previsíveis. Desative o token RWS e negocie-o em uma DEX.",
  "What is AIRA/AIR ID?": "O que é AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Um token pré-XRT distribuído em 2017 como parte autônoma da futura infra-estrutura da Robonomics na Ethereum. Após o lançamento bem-sucedido da Robonomics na Ethereum em 2019, os tokens AIRA foram conectados à infra-estrutura criada do projeto através de",
  "ambix smart contract": "um contrato inteligente ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "que garantiu um processo autônomo e independente de troca do pré-XRT para o XRT  ERC-20.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "do token da Robonomics é garantir a operação de uma rede descentralizada para a manutenção de Cidades Inteligentes e Indústria 4.0 na infraestrutura blockchain. Para atingir este objetivo, a economia do token precisa refletir os incentivos para a implementação da rede.",
  "Token distribution": "Distribuição de tokens",
  "Try our Dapp": "Experimente nosso Dapp",
  "In addition": "Além disso",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "você pode operar XRT dentro de blockchains usando ferramentas fornecidas por diferentes equipes independentes nas comunidades Polkadot (Kusama) e Ethereum.",
  "Within the Kusama network, you have the capability use": "Dentro da rede Kusama, você tem a capacidade de usar",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "comunicação entre a parachain Robonomics e outras parachains usando várias aplicações descentralizadas (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Dentro da rede Ethereum, você pode usar aplicativos descentralizados alimentados pelo",
  "Attention please": "Atenção por favor",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Se você tem utilizado o serviço Multichain para transações de ponte, por favor, abstenha-se de usá-lo no momento, pois foi",
  "announced": "anunciado",
  "on the official Twitter of The Multichain.": "no Twitter oficial do Multichain.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "A aplicação descentralizada (dapp) funciona dentro da Blockchain. É de fonte aberta e os seus dados são servidos em IPFS e Github. Estas tecnoligias permitem que a aplicação seja segura e transparente ao mesmo tempo. Os nossos criadores estão a trabalhar tanto no desenvolvimento da aplicação Robonomics como nas bibliotecas que pode utilizar na construção da sua própria dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "O Gêmeo Digital (Digital Twin) é um dos instrumentos fornecidos pela Robonomics Web Services (RWS). Ele atua como uma versão digital do equipamento do mundo real e copia todas as suas características técnicas. Ele permite tornar um aplicativo descentralizado mais responsivo aos comandos do usuário.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Você pode usar a Robonomics com uma ampla gama de dispositivos inteligentes Zigbee para automatizar e controlar vários aspectos de sua casa/escritório ou usá-la com robótica baseada em ROS para tarefas industriais mais complexas.",
  "Do Androids Dream of Electric Sheep?": "Os Andróides Sonham com Ovelhas Elétricas?",
  "Your email": "Seu email",
  "Community & Contacts": "Comunidade e Contatos",
  "Get latest updates": "Obtenha as últimas atualizações",
  "Tell us something if you want": "Diga-nos algo se quiser",
  "Submit": "Enviar",
  "Something went  wrong :( Try again later": "Algo deu errado :( Tente novamente mais tarde",
  "Want emails from robonomics": "Quer receber e-mails da Robonomics",
  "Adding you to our special list...": "Adicionando-o à nossa lista especial...",
  "Nice, you are in the list": "Ótimo, você está na lista",
  "Something went  wrong. Try again later": "Algo deu errado. Tente novamente mais tarde",
  "Robonomics art shop": "Robonomics art shop",
  "Welcome to our brand new online shop on": "Bem-vindo à nossa nova loja online em",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Nossa loja oferece roupas, acessórios, decoração doméstica e outros itens que demonstram nosso amor pela robótica, tecnologia e arte. Você pode encontrar camisetas, mangas longas, capuzes, cortinas de chuveiro, travesseiros, cobertores e outros produtos úteis com nossos designs exclusivos feitos por artistas da Robonomics, enquanto a produção e envio são processados por nossos colegas da Threadless. Aproveite!",
  "Shop now on threadless": "Compre agora na threadless",
  "alternative shop": "loja alternativa",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "O ano começou com uma grande conquista - a Robonomics venceu o 20º leilão de slots de parachain e",
  "officially became": "tornou-se oficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "uma parachain com a ID 2048 na rede Kusama. As funções de lançamento, registro de dados (datalog), Gêmeo Digital (DigitalTwin), responsabilidade (liability) e assinaturas IoT estão disponíveis para todos os usuários do ecossistema. Para fornecer detalhes para esta fase do projeto, a equipe principal publicou os primeiros capítulos do",
  "Robonomics Whitepaper 2.0.": "Whitepaper 2.0 da Robonomics",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "A Robonomics 2.0 em Substrate foi lançada com suporte para mensagens XCM, e começamos a abrir canais HRMP com outras parachains (como Crust, Shadow e Darwinia), cuja funcionalidade é extremamente útil para nós.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Ao mesmo tempo, revelamos uma estratégia para introduzir o mercado de IOT em nosso protocolo. Nossas experiências com equipamentos de IoT nos levaram ao conceito de uma casa inteligente soberana, que é independente dos provedores de serviços de nuvem centralizados. Desenvolvemos nossa",
  "integration": "integração",
  "with the Home Assistant automation system, and also designed our own": "com o sistema de automação Home Assistant, e também projetamos nosso próprio",
  "IoT gateway": "gateway IoT",
  "for connecting smart devices.": "para conectar dispositivos inteligentes.",
  "We have launched two big initiatives in order to increase community engagement —": "Lançamos duas grandes iniciativas para aumentar o envolvimento da comunidade —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "o Programa de Embaixadores da Robonomics",
  "Additionally,": "Além disso, o ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "foi realizado no outono, para que a comunidade Robonomics pudesse experimentar nossos mecanismos de governança pela primeira vez. Recentemente, a equipe da Robonomics ajudou o projeto DAO IPCI a obter um slot de parachain, para apresentar o serviço de compensação de carbono para edifícios inteligentes.",
  "In 2021, our": "Em 2021, nosso",
  "main focus": "foco principal",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "mudou para preparar o projeto para que os aplicativos de IoT pudessem ser usados por meio de nossa parachain na rede Kusama. A Robonomics 1.0 em Substrate foi lançada e estamos testando a conexão de sensores na parachain para enviar seus dados de telemetria, além de desenvolver a funcionalidade de gêmeo digital. Na metade do ano, decidimos testar o ciclo completo de nossa rede e criamos nossa própria relay chain chamada",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "à qual a parachain Robonomics foi integrada (antes de ser migrada para a relay chain Kusama). Houve muito foco em conseguir uma vaga de parachain na Kusama, para a qual organizamos várias campanhas de crowdloan.",
  "There have been two big changes for the community. First, we launched the": "Houve duas grandes mudanças para a comunidade. Em primeiro lugar, lançamos o",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "que permite que projetos web3, de robótica e IoT recebam financiamento para tarefas de P&D (Pesquisa e desenvolvimento). Até o final do ano, quatro projetos ativos participavam do programa. Em segundo lugar, a equipe iniciou o",
  "Exodus process": "processo Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "permitindo que os detentores de tokens na Ethereum transferissem seus tokens XRT para a parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Entre as colaborações, podemos recordar a notável aparição do Boston Dynamics Spot da MerkleBot, para a qual foi desenvolvido um",
  "rental remote control system": "sistema de controle remoto de aluguel",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Também gostaríamos de informá-lo sobre a empresa Multi-Agent Systems, que é um projeto pessoal formado por uma equipe de engenheiros da Robonomics. Eles desenvolveram um robô chamado Eisenkoch, que prepara waffles em uma cafeteria.",
  "There came a time when the existing limitations of Ethereum": "Chegou um momento em que as limitações existentes da Ethereum",
  "began to stand out clearly": "começaram a se destacar claramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(em particular, baixa escalabilidade, baixa velocidade e custo de transações muito alto). A atualização para a ETH2.0 deveria corrigir a situação, mas esta atualização foi repetidamente adiada. Embora não quiséssemos sair da rede Ethereum, percebemos que na situação atual era difícil implementar nossos casos de uso e começamos a procurar uma rede alternativa. O ecossistema de blockchain fragmentada de Polkadot se tornou essa alternativa. Começamos experimentando o framework Substrate para migrar os principais recursos da Robonomics e implantar nossa própria rede de teste. No final desta etapa, implantamos nossa parachain na rede de teste Rococó e começamos a nos preparar para obter um slot na rede Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando a estudar os sistemas de IoT, identificamos a principal funcionalidade da Robonomics, que pode agregar valor aos usuários - a função de nuvem descentralizada para IoT. Esta ideia formou a base da ",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "A infra-estrutura RWS assumiu todas as funções de uma nuvem centralizada típica, mas sem os problemas padrão de disponibilidade global, segurança e privacidade. Além disso, tivemos a ideia de assinaturas IoT da parachain que permitem que os titulares de assinaturas usem a rede blockchain sem precisar pagar uma taxa por cada transação. O primeiro experimento com as assinaturas IoT foi a emissão do token RWS, que permite que seu proprietário envie 1 transação por bloco. Além disso, começamos a dar os primeiros passos para desenvolver nosso próprio kit de hardware para o controle de dispositivos inteligentes (o conceito DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Naturalmente, o apoio à Robonomics na Ethereum não parou. A pilha de comunicação da Robonomics foi finalizada para a versão",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "O token XRT começou a ser negociado em várias bolsas (em particular, na DEX Uniswap), e o programa de incentivo à liquidez foi lançado.",
  "The team actively developed ways to interact with the community. The first version of our": "A equipe desenvolveu ativamente formas de interagir com a comunidade. A primeira versão de nosso site",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "e Robonomics Wiki foi lançada. Para uma gestão de projetos mais transparente e conveniente, começamos a utilizar a",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Hospedamos a ",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "em 2019 para os recém-chegados ao projeto.",
  "Robonomics became the foundation for the": "A Robonomics se tornou a base do projeto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "que está desenvolvendo um sistema para o leasing inteligente de equipamentos robóticos.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Entendemos que os agentes autônomos precisavam de um ambiente que garantisse suas operações técnicas e econômicas confiáveis. Por vários anos, tínhamos desenvolvido um protocolo para criar uma rede descentralizada de fornecedores que ajudassem os agentes robóticos a fornecer seus serviços. Foram desenvolvidas ferramentas para a manutenção da rede e para a pilha de comunicação entre Ethereum e o ROS (Sistema Operacional de Robôs). Em 2018 publicamos o",
  "Robonomics Whitepaper": "Whitepaper da Robonomics",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "e a versão alfa da Rede Robonomics foi lançada na rede principal da Ethereum. Os preparativos ativos para o evento da geração de tokens XRT (que acabou acontecendo na primavera de 2019 devido ao primeiro inverno criptográfico) continuaram.",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "A partir deste período, a Robonomics começou a desenvolver dinamicamente casos de uso relacionados à Indústria 4.0 - fábricas inteligentes, cidades inteligentes e residências inteligentes - e isto trouxe nossa atenção para o mundo da IoT. Em busca de inovação, a equipe apresentou várias demonstrações grandes e únicas de P&D: uma",
  "sensor network": "rede de sensores civis",
  "a water drone": "un drone aquático",
  "for environmental monitoring (supported by a sensor systems manufacturer": "para monitoramento ambiental (apoiado por um fabricante de sistemas de sensores",
  "a smart factory model": "um modelo de fábrica inteligente",
  "a self-employed": "um",
  "robot artist Gaka-chu": "artista robô autônomo, Gaka-chu",
  "and a": "e",
  "drone traffic management system": "um sistema de gerenciamento de tráfego de drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "A Robonomics iniciou a cooperação com o projeto DAO IPCI no gerenciamento de ativos ambientais usando tecnologias web3 e dispositivos de IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Este foi um período ativo de P&D durante o qual identificamos uma série de tarefas, nas quais as tecnologias p2p têm capacidades que antes não estavam disponíveis para robótica. Combinando o computador Ethereum, armazenamento de arquivos IPFS e o ROS, percebemos que qualquer dispositivo poderia potencialmente se tornar um",
  "autonomous intelligent robot agent": "agente robótico inteligente autônomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "Por sua vez, isto nos abriu o caminho para os conceitos de Robot-as-a-Service e economia dos robôs.",
  "Our publications in scientific journals of this period are available in the": "Nossas publicações em periódicos científicos deste período estão disponíveis na seção",
  "Papers section": "Papers (Artigos)",
  "We have collected all R&D projects over the years in the": "Reunimos todos os projetos de P&D ao longo dos anos em um ",
  "a handy book": "livro prático",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Tudo começou com uma ideia que surgiu dos fundadores, quando a Ethereum tinha acabado de lançar sua rede principal. E se um robô realizar uma tarefa para um cliente em troca de criptmoedas, e sua lógica for controlada por um contrato inteligente?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Para testar a ideia, fizemos uma demonstração na qual foi lançado um drone controlado por um computador Ethereum para alcançar as coordenadas GPS especificadas, depois que o usuário completou uma transação de pagamento.",
  "The demo is available on": "A demonstração está disponível no",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Cronologia de desenvolvimento de infra-estrutura e tecnologia",
  "Notable events": "Eventos importantes",
  "Robonomics whitepaper 2022 welcome guide": "Guia de boas-vindas do Robonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Desenvolvemos um protocolo técnico-econômico de comunicação de máquina rodando no topo da Ethereum e do IPFS, e o complementamos com elementos de uma plataforma IoT baseada em nuvem e em parachain de Polkadot. Hoje, já temos uma plataforma híbrida para a criação de aplicações IoT futuristas. Ela proporciona interação com dispositivos sob o controle de um computador global descentralizado. Antes de começarmos a criar aplicações IoT seguras, sem servidores e futuristas usando a plataforma Robonomics, vamos nos aprofundar um pouco na teoria...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Os dois primeiros capítulos do whitepaper da Robonomics já estão disponíveis para os usuários.",
  "Chapter 1.": "Capítulo 1.",
  "At the intersection of cybernetics and economics": "Na interseção entre cibernética e economia",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Apresentamos um sistema econômico no qual os dispositivos robóticos atuam como agentes independentes capazes de realizar atividades econômicas importantes, anteriormente reservadas aos seres humanos. Neste capítulo, falaremos sobre a relevância da economia robótica, que pode se tornar uma parte importante da vida das pessoas e transformar o nível atual da economia em serviços totalmente automatizados no futuro.",
  "In this chapter you will learn": "Neste capítulo você aprenderá",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase e a Natureza da Firma",
  "CPS - cyber-physical system": "CPS - sistema ciber físico",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener e a busca por padrões em coisas vivas e nas máquinas",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "A Quarta Revolução Industrial, Dinheiro para Robôs e Bitcoin",
  "Ethereum Smart Contracts": "Smart Contracts Ethereum",
  "Polkadot Parachains": "Parachains Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Perguntas abertas sobre teleologia e o trabalho de Mises",
  "Read chapter 1": "Leia o capítulo 1",
  "Chapter 2.": "Capítulo 2.",
  "Robonomics architecture": "Arquitetura da Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "No segundo capítulo, você lerá sobre a interação homem-máquina usando a moderna tecnologia da Internet - desde dispositivos IoT até uma rede de provedores descentralizada e globalmente acessível. Analisaremos o básico da Internet das Coisas para destacar os problemas e os principais desafios enfrentados pelos criadores dos sistemas de IoT e para a solução da qual Robonomics se propõe.",
  "Overview of the state of the Internet of Things (IoT)": "Visão geral do estado da Internet das Coisas (IoT)",
  "Classification of IoT devices": "Classificação dos dispositivos IoT",
  "Embedded IoT systems": "Sistemas IoT integrados",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: Gateways e controladores IoT",
  "Autonomous Systems": "Sistemas Autônomos",
  "Internet of Things providers": "Provedores de Internet das Coisas",
  "Digital twins are the heart of the Internet of Things": "Gêmeos digitais são o coração da Internet das Coisas",
  "IoT data flows in cloud service": "Fluxos de dados IoT no serviço em nuvem",
  "Popular examples of IoT solutions": "Popular examples of IoT solutions",
  "Current problems of building IoT solutions": "Problemas atuais na construção de soluções IoT",
  "Main tasks of Robonomics architecture": "Principais tarefas da arquitetura Robonomics",
  "Basic components of Robonomics architecture": "Componentes básicos da arquitetura Robonomics",
  "A simple representation of Robonomics architecture": "Uma representação simples da arquitetura Robonomics",
  "Read chapter 2": "Leia o capítulo 2",
  "We continue to update the white paper of Robonomics": "Continuamos atualizando o Whitepaper da Robonomics,",
  "stay tuned for new parts on our website and in Discord": "acompanhe nosso site e Discord para ficar informado sobre novas atualizações",
  "Join our discord": "Junte-se ao nosso discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "A seguir, gostaríamos de mostrar a você as áreas práticas de interação homem-máquina usando a moderna tecnologia da Internet. Passaremos da arquitetura familiar de dispositivos IoT de troca de informações técnicas por meio de serviços em nuvem para a organização da interação técnico-econômica por meio de uma rede de provedores descentralizada e globalmente acessível.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Para começar, precisamos fazer uma excursão pela área mais claramente relacionada à conexão de rede de sistemas automatizados. Em seguida, abordaremos os fundamentos da Internet das Coisas para destacar os problemas e principais desafios enfrentados pelos criadores de sistemas IoT e para a solução que a Robonomics se propõe.",
  "Overview of the state of the internet of things (IoT)": "Visão geral do estado da internet das coisas (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "A questão da acessibilidade da rede de dispositivos automáticos tem sido discutida em todo o planeta desde os anos 60, e já naquela época foram feitas tentativas bastante sérias para resolvê-lo. Por exemplo, o ciberneticista soviético Viktor Glushkov propôs e implementou parcialmente a coleta automatizada de informações sobre os volumes de produção de uma planta individual como parte do projeto do sistema nacional de informações",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "nos anos 60 e 70. É amplamente conhecido como a máquina de venda automática da Coca-Cola foi conectada à ARPANET na década de 1980 para que as máquinas pudessem informar a disponibilidade de bebidas e sua temperatura.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Mas ainda assim, o desenvolvimento real da IoT está acontecendo hoje, devido ao uso generalizado de tecnologias facilitadoras. Os principais impulsionadores da rápida evolução dos aplicativos da Internet das Coisas são os resultados do desenvolvimento de muitas áreas – desde comunicações sem fio de várias faixas e dispositivos incorporados, até análise de nuvem e aprendizado de máquina. O número de dispositivos IoT vem crescendo de forma constante nos últimos 10 anos (com previsão de 25 bilhões de unidades até 2030), e isso tem estimulado pesquisadores e desenvolvedores a criar novos aplicativos IoT em diversas áreas, como saúde, automação residencial, agronegócio, proteção ambiental.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Estamos mais interessados no processo de construção de sistemas IoT e nas tarefas que surgem nesse processo. Ao longo dos anos de pesquisa, muitas arquiteturas   diferentes foram propostas e, calculando a média delas, podemos distinguir três componentes básicos de um sistema IoT: dispositivos, infraestrutura de rede, máquinas analíticas, computacionais e de controle.",
  "New challenges": "Novos desafios",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Outro desafio recente para a construção de IoT tem sido o conceito de gêmeo digital – uma versão digital de um equipamento real que copia suas especificações e dados históricos. Este conceito é melhor em áreas onde é necessário ter uma especificação precisa e completa de um processo e ser capaz de prever seu desenvolvimento. A Internet das Coisas atua como o principal integrador de gêmeos digitais, mas essa tarefa é muito mais profunda do que a conectividade usual dos dispositivos IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Neste momento, estamos testemunhando um segmento inteiro da rede, projetado e conveniente não para pessoas, mas para máquinas. A Internet das Coisas não é mais apenas a mecânica de conectar um dispositivo à rede, mas mais serviços, criados e disponibilizados especificamente para os dispositivos. A Internet das Coisas não apenas conecta o usuário e o dispositivo, mas também ajuda os dispositivos a lidar com as tarefas de prestação de um serviço para a pessoa, mas de forma autônoma.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Esses sistemas não têm interfaces de usuário e são normalmente usados no nível mais baixo dos ecossistemas de IoT para fornecer funcionalidades básicas. Tem que ser energeticamente eficiente e pequeno. Ter recursos de computação e comunicação limitados. Os gateways ou controladores de IoT geralmente atuam como receptores de sinal.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Esses sistemas atuam como um elo entre sistemas embarcados localmente acessíveis e a Internet global. Eles normalmente suportam vários protocolos de comunicação de sistemas incorporados e transferem a telemetria dos dispositivos para a nuvem e controlam os sinais para trás. Muitas vezes, esses dispositivos são uma versão mais sofisticada do roteador WiFi, equipado com um computador de placa única para realizar o processamento primário das informações dos dispositivos sem sair da rede local.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Essa classe inclui autômatos complexos (como o Spot da Boston Dynamics), que possuem um componente de controle no nível de um computador completo com processador de alto desempenho e grande quantidade de memória. Nesses casos, o robô está conectado à Internet sem soluções intermediárias adicionais (sistemas edge). O software necessário para acessar a Internet das Coisas é instalado diretamente no computador do sistema autônomo. Os dados são coletados e parcialmente processados localmente e, em seguida, transmitidos para a Internet de forma semelhante a qualquer dispositivo de rede completo.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "O principal trabalho dos provedores de IoT é fornecer aos usuários acesso remoto a dados e análises, bem como o gerenciamento de dispositivos inteligentes pela Internet. Os principais critérios para a qualidade do provedor são a segurança das operações, estabilidade da conexão e disponibilidade do provedor em qualquer lugar do mundo.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "O esquema padrão para trabalhar com um provedor de IoT inclui: instalação de software compatível com o dispositivo inteligente em nuvem, configuração de serviços de gerenciamento do lado da nuvem após a primeira conexão bem-sucedida de um dispositivo, conexão de vários tipos de serviços analíticos.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Falando em gêmeos digitais, deve-se notar que arquitetonicamente sua implementação é necessária; como uma recusa em dar ao usuário acesso direto aos dispositivos de controle e alterar seus estados. Das razões mais óbvias para a rejeição estão, em primeiro lugar, a presença de seus próprios requisitos e condições nos dispositivos pouco antes do lançamento. Em segundo lugar, se vários dispositivos de usuário precisarem acessar uma única fonte de dados, pode ser fundamental fornecer controle personalizado a cada usuário. Por fim, é extremamente útil manter disponível o último estado real do dispositivo caso ele fique fora de operação.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Como resultado, temos uma separação entre o fluxo de troca de informações com o usuário e a geração real de dados reais pelos sensores. Para ilustrar este princípio, abaixo está o processo do usuário que trabalha com um dispositivo IoT usando um gêmeo digital.",
  "IoT data flows in cloud services": "Fluxos de dados da IoT em serviços de nuvem",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Valores de entrada para cloud triggers. Por exemplo, o serviço de nuvem envia várias notificações ao usuário no caso de um relatório de um sensor de alarme de carro sobre uma batida.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Dados de saída para análises complexas que não podem ser produzidas no nível de edge. Por exemplo, ao processar vídeo para reconhecimento facial em uma multidão.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "A base para formar um gêmeo digital do dispositivo para criar um elenco de seu estado. Por exemplo, a pedido do usuário no aplicativo móvel ou no site.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Um tipico sistema doméstico inteligente oferece uma ampla gama de opções para controlar seu espaço de vida. Com sua ajuda, você pode controlar remotamente as fechaduras das portas, configurando acesso único ou regular à sala para a família e amigos e para pessoal de manutenção ou entrega. Com inúmeros sensores e dispositivos de gravação, o sistema é capaz de incluir gravação de vídeo ao acionar sensores de movimento, tomar decisões de forma autônoma para desligar o abastecimento de água quando for detectado um vazamento no sistema de água, iniciar um robô aspirador programado, fornecendo um relatório de limpeza para o aplicativo do usuário, alterar a temperatura ambiente para o valor ideal, dependendo da sua programação.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Carros inteligentes. Fornecendo a eletrônica de bordo do carro com acesso à Internet móvel, o usuário tem acesso ao controle remoto de diversas funções do carro diretamente de seu smartphone: abrir portas, ligar o ar condicionado, controlar os faróis. Se esses carros forem usados para carsharing (compartilhamento de carros), você poderá criar um mapa interativo da localização dos carros com seu status, o combustível restante etc. para os clientes deste serviço.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Sistema inteligente de locação de equipamentos. A empresa instala manipuladores robóticos na linha de transporte mediante contrato com pagamento pelo número de operações ou pelo tempo do robô. Os manipuladores fornecem regularmente um registro das operações realizadas, erros e avisos. A taxa de locação do robô é calculada com base nisso, bem como a manutenção preditiva do fornecedor dos robôs.",
  "Global availability": "Disponibilidade global",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "A arquitetura cliente-servidor padrão requer a especificação de endpoints ao rotear mensagens de dispositivos IoT. Assim, durante a vida útil de um dispositivo inteligente, a falta de conexão significará uma limitação na capacidade de controlar e interagir com o dispositivo.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Por exemplo, a guerra comercial entre a China e os Estados Unidos já é uma espada de Dâmocles pairando sobre milhares de consumidores de aparelhos inteligentes chineses nos Estados Unidos e vice-versa. A qualquer momento, o bloqueio de servidores da Xiaomi pelas autoridades norte-americanas pode afetar usuários de dispositivos que se conectam aos serviços em nuvem do fabricante.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Estando nas imediações de um dispositivo IoT, você não pode controlá-lo a partir de um aplicativo móvel se não houver conexão com os servidores, por meio dos quais são fornecidas a autenticação do usuário e a coleta de telemetria dos próprios dispositivos. Ou seja, o dispositivo é realmente controlado pela nuvem, não pelo usuário.",
  "Cybersecurity": "Cibersegurança",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "A razão mais importante para a baixa segurança cibernética da maioria das soluções de IoT decorre do legado problemático da arquitetura cliente-servidor em nuvem. Por exemplo, a arquitetura de casa inteligente mais comum atualmente é geralmente um hub IoT, conectado a um serviço de nuvem. Assim, um sistema IoT típico é um elemento de controle central conectado a vários ataques de rede externa, ataques DoS (conduzindo o sistema à falha), modificações maliciosas, sequestro de sessão do usuário, etc. ou desastres naturais que causam falhas nos servidores. Também outro ponto definitivamente importante é a necessidade, em princípio, de confiar na nuvem e nas pessoas que a mantêm.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Os servidores de serviços em nuvem estão sujeitos a todos os problemas típicos de segurança cibernética: os dispositivos pertencentes ao mesmo sistema podem ultrapassar centenas ou milhares e, ao mesmo tempo, por sua natureza, os dispositivos IoT têm menos poder de computação, o que dificulta muito a implantação de firewalls e antivírus para eles. Infelizmente, o fator mais pernicioso é o fato de que os dispositivos IoT estão funcionando CPSs, então as ameaças à segurança cibernética estão realmente prontas para se manifestar no nível físico.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Tudo isso é exacerbado pela escala das soluções de IoT. O número de sistemas IoT. Certamente, o serviço de nuvem é mais seguro do que os dispositivos de baixo nível, mas a consolidação do controle centralizado sobre centenas de milhares desses sistemas torna qualquer violação de segurança e vazamento um grande desastre.",
  "Data privacy": "Privacidade de dados",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "O ponto de privacidade precisa ser separado da segurança cibernética, pois esse problema é específico dos sistemas IoT. Devido ao grande número e variados tipos de dispositivos que estão muito mais integrados ao mundo físico do que apenas computadores e smartphones, a gama de tipos de dados privados é multiplicada. Não é mais apenas localização por GPS, registros de compras, transações financeiras e fotos, mas também um registro permanente de vídeos e conversas, impressões de voz, condições de saúde e até uma lista de hábitos de uma pessoa. Entre os tipos de ameaças relacionadas à privacidade estão: identificação de informações, localização e rastreamento, profiling, ataque de inventário, ataque de vinculação de dados.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "A parte mais assustadora é que os usuários têm pouca ou nenhuma consciência de que estão abrindo mão de sua privacidade porque quase não têm ideia de quais dados estão sendo coletados e como estão sendo usados. A ameaça à privacidade cresce não apenas de invasores, mas também de organizações e agências governamentais justamente por causa disso. Os serviços de IoT em nuvem normalmente exigem transferência máxima de dados dos dispositivos e não há maneiras de proibir ou restringir a transferência de dados («Aceite os termos ou vá embora»). Além disso, apesar de os dados coletados serem um ativo e terem valor real, a pessoa de quem são coletados não apenas é negado o direito de dispor ativamente desses dados, mas também é negado qualquer compensação pela coleta e uso de seus próprios dados.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Com base nas conquistas e desafios das plataformas em nuvem, a Robonomics visa oferecer ao mercado de IoT soluções de Internet mais seguras e avançadas em todas as etapas da comunicação homem-máquina. Abaixo estão as principais tarefas para as quais a Robonomics se destina:",
  "Managing an IoT device using a decentralized cloud": "Gerenciando um dispositivo iot usando uma nuvem descentralizada",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "As redes Blockchain têm todos os recursos para fornecer o mais alto grau de segurança para executar um dispositivo e obter sua telemetria. A interação com o dispositivo pode ser descrita alterando o estado do gêmeo digital armazenado na rede blockchain e enviando informações sobre essas alterações. No caso de uma blockchain não permissionada, podemos falar sobre as garantias de disponibilidade global de provedores para IoT, bem como um alto nível de proteção de dados de gêmeos digitais contra alterações indesejadas.",
  "Performing technical and economic transaction between people and machines": "Realizando transação técnica e econômica entre pessoas e máquinas",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Graças ao mecanismo de criptomoedas e smart contracts, podemos fornecer acesso a sistemas automatizados diretamente aos mercados digitais. Por exemplo, a Ethereum já implementa a maioria das ferramentas básicas da atividade econômica que podem ser utilizadas na operação de dispositivos autônomos. Os aplicativos criados para a interação entre o usuário final e o dispositivo IoT serão muito mais eficazes se os termos de serviço e pagamento forem indissociáveis dos parâmetros de lançamento do dispositivo.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Os avanços modernos na tecnologia web3 podem resolver a questão da privacidade do usuário. Com A web3 não há necessidade de autenticar ou exigir conexão com servidores específicos para acessar a telemetria e controlar o dispositivo.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics é uma nuvem descentralizada para gêmeos digitais de dispositivos IoT. Robonomics suporta o formato tecnoeconômico para comunicação, além de fornecer aplicativos privados para usuários",
  "A human interface to access the system": "Uma interface humana para acessar o sistema",
  "A communication protocol": "Um protocolo de comunicação",
  "A machine interface": "Uma interface de máquina",
  "Human interface": "Interface humana",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Propomos o uso de aplicativos descentralizados (dapps) como a principal forma de conectar usuários para controlar dispositivos inteligentes pela Internet. Assim, poderemos fornecer a interface de usuário mais segura (em termos de dados) ao sistema, que poderá funcionar simultaneamente nas condições da rede local da cidade e por meio de uma rede global comum.",
  "Communication protocol": "Protocolo de comunicação",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Seu papel é desempenhado pela rede Robonomics, uma especificação desenvolvida pela equipe do projeto que implementa uma rede descentralizada de provedores que fornecem a transmissão, processamento e armazenamento de informações necessárias para executar dispositivos IoT. Na verdade, é uma implementação de um nó de função específica para redes IPFS, Ethereum, e Polkadot.",
  "Machine interface": "Interface da máquina",
  "We have chosen the most well-known robotics framework called Robot Operating System Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Escolhemos a estrutura de robótica mais conhecida chamada Robot Operating System (ROS) como a interface padrão para integrar qualquer sistema ciberfísico compatível. Robonomics suporta vários usos para ROS. A implementação do Robonomics para a rede Ethereum está na forma do pacote ROS robonomics_comm. Para a arquitetura ROS 2, implementamos suporte para A Robonomics como uma camada de  Middleware (consulte «Robonomics as ROS 2 Middleware» para obter detalhes). Quando o uso do ROS é redundante (por exemplo, ao trabalhar com dispositivos IoT), um módulo de interface robonomics do Python foi desenvolvido. Ele ajuda a acessar as funções da Robonomics nativamente e funciona com nós locais, privados e remotos e públicos.",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Aqui está um diagrama geral do ciclo completo de inicialização do dispositivo usando a plataforma Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "O aplicativo descentralizado do usuário envia uma solicitação para uma função de controle do dispositivo por meio da rede Robonomics.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "A rede Robonomics fornece tradução de solicitações usando libp2p e captura eventos na blockchain Ethereum ou parachain Robonomics.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "O controle do dispositivo é fornecido por uma rede descentralizada, que garante o armazenamento das informações necessárias para a execução do dispositivo IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "O dispositivo IoT recebe independentemente informações das redes Ethereum e Polkadot sobre o estado atual do gêmeo digital. Isso garante que o dispositivo possa ser iniciado com segurança somente após os parâmetros técnicos e econômicos de inicialização terem sido estabelecidos.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Como resultado da operação, o dispositivo IoT publica um log de operações concluídas, que pode ser usado como evidência do serviço prestado ou para depuração de erros.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "O log é transformado em relatório para o usuário e fica disponível em seu dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Construindo DApps & Web Services para IoT na Parachain Robonomics",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, arquiteto de software",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Devemos lembrar que a máquina automática é o equivalente econômico exato do trabalho escravo. Qualquer trabalho que concorra com o trabalho escravo deve aceitar as consequências econômicas do trabalho escravo.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "ciberneticista",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Os robôs são como crianças maduras hoje - eles já podem administrar dinheiro, e entrar em relações jurídicas, ser independentes.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "O futuro da própria humanidade depende de como ensinamos os robôs a controlar suas capacidades.",
  "Robonomics tools": "Ferramentas Robonomics",
  "Operate with digital twins of IoT devices": "Operar com gêmeos digitais de dispositivos IoT",
  "The first tools of the robot economy: money for robots, contracts for robots": "As primeiras ferramentas da economia dos robôs: dinheiro para robôs, contratos para robôs",
  "Software for connecting devices to a decentralized cloud": "Software para conectar dispositivos a uma nuvem descentralizada",
  "API library for custom IoT applications": "Biblioteca API para aplicações IoT personalizadas",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "A Robonomics possui um conjunto completo de ferramentas para o desenvolvimento de aplicações IOT, tanto no lado da robótica quanto no da interface do usuário. A comunicação entre o usuário e o dispositivo acontece utilizando as tecnologias de maior sucesso do mundo Web3 - IPFS, Ethereum, e Polkadot. Assim, os desenvolvedores podem criar aplicações modernas e seguras para Cidades Inteligentes e para a Indústria 4.0.",
  "Robonomics Connectivity": "Conectividade Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Para a conveniência dos desenvolvedores, a Robonomics contém um conjunto de softwares para conexões: dispositivos IoT usando o protocolo HTTP/MQTT, sistemas robóticos complexos usando o Robot Operating System (ROS).",
  "Connect a sensor": "Conecte um sensor",
  "to the Robonomics network": "à rede Robonomis",
  "Try": "Experimente",
  "a simple prototyping tool": "uma ferramenta simples de prototipagem",
  "Start building your own cyber physical system with": "Comece construir seu próprio sistema físico cibernético com o",
  "Aira OS": "Sistema Operacional Aira",
  "Robonomics Supports Hundreds of Robots Out of the Box": "A Robonomics Suporta Centenas de Robôs Exclusivos",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Os usuários da plataforma podem conectar robôs compatíveis com ROS à economia digital em questão de minutos. Para uma lista completa de robôs compatíveis, por favor, siga o link",
  "Decentralized Cloud infrastructure for IoT": "Infraestrutura de nuvem descentralizada para IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) é o serviço básico de infraestrutura para Robótica e IoT na Parachain Robonomics e IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Dapp Robonomics",
  "economy of robots": "Economia dos robôs",
  "Core RWS features available for IoT today": "Principais recursos RWS disponíveis para IoT hoje",
  "RWS PubSub Message Broker": "RWS Intermediário de mensagens PubSub",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "Use mensagens ilimitadas através de uma rede p2p baseada no protocolo IPFS",
  "RWS Data Blockchainization Service": "RWS Serviço de blockchainização de dados",
  "RWS Robot Actions": "RWS Atividades de robô",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Ligar / desligar; inicie ou pare seus dispositivos IoT sob o controle de um computador descentralizado",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "O Coração de Sua Aplicação IoT - Gêmeos Digitais na Blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Na arquitetura técnica, os gêmeos digitais IoT fornecem visibilidade e monitoramento das coisas e eventos relacionados (por exemplo, usando dispositivos IoT para obter automaticamente a origem de um produto), e a blockchain permite a versão única compartilhada da verdade sobre o estado dessas coisas ao longo de seus ciclos de vida e eventos comerciais associados",
  "from Gartner research": "da pesquisa de Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "A Parachain Robonomics oferece a oportunidade de criar um modelo de gêmeo digital e atualizar seu estado a cada 6 segundos.",
  "App Store for Robotics - Robonomics Marketplace": "App Store para Robótica - Robonomics Marketplace",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "As empresas que projetam e fabricam produtos e equipamentos conectados a IoT devem adotar um modelo flexível de entrega de gêmeos digitais para reduzir as barreiras à adoção, como oferecer gêmeos digitais por meio de marketplaces, em vez de oferecer apenas gêmeos digitais por meio de seu próprio modelo de entrega proprietário",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "Você tem uma ideia para seu serviço para robôs ou usuários? Siga às instruções passo a passo para construir sua aplicação IoT na plataforma Robonomics.",
  "Secure": "Secure",
  "Serverless": "Sem Servidor",
  "Futuristic": "Futuristas",
  "IoT applications": "Aplicações IoT ",
  "Robonomics network vision": "Visão da rede Robonomics",
  "At the frontier of cybernetics and economics": "Na fronteira da cibernética e da economia",
  "Build your IoT services on Robonomics platform": "Construa seus serviços iot na plataforma robonomics",
  "taking full advantage of decentralized architecture": "aproveitando ao máximo a arquitetura descentralizada",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "A Robonomics permite que os usuários se conectem a dispositivos inteligentesusando aplicativos descentralizados (dapp) que não exigem a transferência de dadosdo usuário para autenticação. A comunicação ocorre por meio de uma rede descentralizadade provedores sem um único ponto de falha, e o dispositivo obtém informações deforma independente da rede da blockchain para executar ou transmitir dados remotamente.Assim, a Robonomics fornece um alto nível de segurança cibernética do dispositivoe privacidade dos dados do usuário em todas as etapas da comunicação, desde oaplicativo do usuário até o lançamento do dispositivo inteligente.",
  "From smart contracts to cross chain IoT platform": "De smart contracts a plataforma iot cross chain",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "O projeto Robonomics tem mais de 6 anos. Começamos a nos preparar para o primeiroexperimento demonstrando a comunicação homem-máquina usando uma rede de provedoresdescentralizada independente em 2015, desde os primeiros dias da rede Ethereum.No início de 2021, a equipe do projeto conseguiu criar um protocolo de comunicaçãode máquina tecnoeconômico executado em Ethereum e IPFS e complementá-lo com elementosde uma plataforma de IoT baseada em nuvem com base em parachain na Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Como resultado, hoje já temos uma plataforma híbrida para criar aplicativosIoT futuristas que permitem a interação com dispositivos sob o controle de umcomputador global descentralizado.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Os criadores da Robonomics são experimentadores, engenheiros e cientistas quese preocupam em entender a validade científica da abordagem e obter clareza naapresentação dos princípios que devem formar a base de toda a arquitetura da soluçãode software.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "Em nossos artigos entre 2017 e 2020, apresentamos à comunidade científica muitosconceitos e soluções unidos em torno da ideia da economia robótica, um sistemaeconômico no qual dispositivos robóticos atuam como agentes independentes capazesde realizar atividades econômicas fundamentais, antes reservadas aos humanos.Você pode ler os artigos científicos",
  "this link": "neste link",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Gostaríamos de justificar o surgimento da economia robótica e explicar em termosgerais por que acreditamos que esse conceito é a resposta inevitável e óbvia parao funcionamento dos sistemas robóticos de grande escala na nova revolução industrial.",
  "Move towards the factory of the future": "Rumo à fábrica do futuro",
  "Inspired by Ronald Coase": "Inspirado por Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "O Prêmio Nobel de Economia Ronald Coase em seu trabalho de 1937 “The Natureof the Firm” demonstrou melhor  a dicotomia “hierarquia vs livre mercado” e deuuma explicação das razões da existência das organizações, em particular as empresas.Coase discute o impacto dos custos de transação (o custo de coleta e processamentode informações) para tomar decisões sobre a celebração de um contrato e monitorarsua implementação. A empresa, com toda sua estrutura hierárquica extramercado,se constitui como a forma mais eficiente de fornecer ao consumidor o produto alvocom os menores custos de transação no momento, momento em que o esforço transacionalpara criar o mesmo produto por meio de múltiplas trocas no mercado entre os indivíduostorna-se muito maior. Para visualizar melhor esse processo, veja o exemplo ilustrativoda compra de um carro. Tente comprar um carro pelas peças e calcule quanto dinheiroe tempo você gastará apenas para montar todos os componentes em sua garagem. Osriscos e custos de negociação da compra de peças são muito altos em comparaçãocom o Model X da Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "No entanto, isso não leva ao surgimento da única empresa do mundo para a produçãode tudo. A questão é que os mesmos custos de transação também impõem restriçõesao tamanho das empresas. Coase escreve:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...uma empresa tenderá a se expandir até que os custos de organizar uma transaçãoextra dentro da empresa se tornem iguais aos custos de realizar a mesma transaçãopor meio de uma troca no mercado aberto...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Em outras palavras, quanto mais complexa a hierarquia dentro da empresa, maioressão os custos internos e, em algum momento, tornam-se excessivos em relação aoscustos de retorno ao mercado. Por isso, para garantir seu crescimento como umdos impulsionadores, os empreendedores buscam formas de reduzir esses custos.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "A ideia de reduzir os custos de transação através da capacidade de todos osparticipantes no processo de negócios (produção, logística, consumo) se uniremem um nível mais próximo se",
  "clearly correlates": "correlaciona claramente",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "com os problemas e desafios enfrentados pelos fabricantes de soluções de automação.Nos últimos 50 anos, as operações padrão/regulares da maioria dos processos denegócios de grandes empresas foram quase totalmente automatizadas. Os fabricantesficam essencialmente com a tarefa de construir uma comunicação segura entre aspartes totalmente automatizadas da cadeia de suprimentos, e essa tarefa é um fatorque impede uma maior redução dos custos de transação por meio da automação. Odesejo de comercializar produtos ou serviços mais competitivos em relação às empresasparcialmente automatizadas",
  "firms spurs the search for solutions to": "estimula a busca de soluções",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "para esses desafios. Parece que tudo está caminhando para o surgimento das empresasrobotizadas – organizações em que todo o ciclo de processos de negócios é totalmenteautomatizado e não requer participação humana, exceto como beneficiários e consumidores.",
  "Get rid of transaction costs": "Livre-se dos custos de transação",
  "Our future in smart cities": "Nosso futuro em cidades inteligentes",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "A tarefa que os fabricantes de automação enfrentam hoje tem um nome específico- a construção de sistemas ciber-físicos (Construction of cyber-physical systemsou CPS). Por",
  "definition,": "definição,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "um CPS é uma forte unificação e integração mútua de vários processos computacionais, de rede e físicos.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "As tarefas de construção do CPS são centrais para qualquer ideia descrita nanova (quarta) revolução industrial. Portanto, o CPS é a pedra angular de nossavida futura nas Cidades Inteligentes, manifestando-se em todos os lugares. Exemplosde sistemas ciberfísicos do futuro são: piloto automático Uber, selfies de drones,rede de impressoras 3D em estações de metrô.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "O CPS é uma estrutura complexa com muitos elementos conectados: do aplicativono telefone, ele se estende ao controle do drone em voo sobre a cidade e depoispublica as fotos resultantes no Instagram, mas somente após o processamento pelaIA na nuvem.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "A coisa mais importante no processo de design do CPS é encontrar a linha tênueentre o número suficiente e excessivo de elementos automatizados na cadeia desuprimentos do usuário do serviço. Em outras palavras, onde está o limite de tamanhodo CPS? Para responder a esta pergunta, devemos recorrer ao famoso matemáticoNorbert Wiener.",
  "Self-regulating systems": "Sistemas auto-reguláveis",
  "Inspired by Norbert Wiener": "Inspirado por Norbert Wiener",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener fala sobre a viabilidade da abordagem interdisciplinar da ciência.Por exemplo, ele traçou os paralelos entre os sistemas de controle automatizadose os desafios de dimensionamento e aumento da complexidade da sociedade humana.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Assim, em outras palavras, a abordagem cibernética pode ser aplicada igualmenteà psicoterapia, biologia e navegação automatizada. É baseado na função do sistema,como as ações individuais são controladas e como os nós individuais interagementre si.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Levando em conta as publicações de Ronald Coase e Norbert Wiener, acompanhandoo desenvolvimento da Indústria 4.0, podemos considerar o uso do CPS como um agenteeconômico, ao projetar serviços robotizados. Para regular o tamanho do CPS e seadaptar às necessidades de mudança dos indivíduos, podemos usar o mecanismo demercado.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Empresas robotizadas são uma representação ideal para sistemas ciber-físicos.Eles são uma unidade bastante autônoma capaz de fornecer serviços a humanos eoutros robôs por dinheiro. Como resultado, a economia robótica nos parece serum conjunto geral de CPSs que fornecem serviços e bens diretamente ao mercado.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Dinheiro para robôs",
  "Industry 1.0": "Indústria 1.0",
  "Mechanization:": "Mecanização:",
  "replacement of muscle power with steam energy.": "substituição da força muscular pela energia do vapor.",
  "1784 y.": "Ano de 1784.",
  "Industry 2.0": "Indústria 2.0",
  "Electrification:": "Eletrificação:",
  "introduction of assembly-line production.": "introdução da produção em linha de montagem.",
  "1870 y.": "Ano de 1870.",
  "Industry 3.0": "Indústria 3.0",
  "Automation:": "Automação",
  "introduction of automated systems with CNC.": "introdução de sistemas automatizados com CNC.",
  "1969 y.": "Ano de 1969.",
  "Industry 4.0": "Indústria 4.0",
  "Smart production:": "Produção inteligente:",
  "development of cyber physical systems.": "desenvolvimento de sistemas físicos cibernéticos.",
  "Now": "Atualmente",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "No mundo das empresas robóticas, é natural fornecer aos robôs acesso a instituições sociais que antes eram necessárias apenas para humanos.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "As instituições sociais não aparecem porque somos pessoas e fisiologicamenteuma pessoa não pode viver sem bancos, contratos e outros instrumentos da sociedade.Mas só porque uma pessoa, em algum momento, entrou no caminho das relações maiscomplexas da sociedade e deu um passo importante para acelerar os processos daquelesque nos cercam.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Dinheiro e contratos devem estar disponíveis para robôs, não porque isso sejauma fantasia doentia de fãs de robôs que esqueceram o que é a Skynet. Mas apenasporque a nova revolução industrial se propõe a construir cadeias automatizadascomplexas, cujos processos afetarão a troca de informações técnicas e econômicas,e também prosseguirão em uma velocidade inacessível aos humanos",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Os robôs precisam de dinheiro que esteja diretamente disponível para eles parapoder realizar operações sem uma pessoa na velocidade com que apenas as máquinaspodem tomar decisões. E tudo isso é apenas para uma pessoa aproveitar a vida naCidade Inteligente!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "E aqui chegamos sem problemas ao primeiro dinheiro eletrônico - Bitcoin. O fatode que o Bitcoin pode ser armazenado em sua conta no princípio de não ser um banco,mas dinheiro em sua carteira torna o primeiro dinheiro que o robô pode gerenciarde forma independente, mais precisamente de forma autônoma. Ao mesmo tempo, hojejá podemos dizer que o Bitcoin não é apenas dinheiro eletrônico, mas uma instituiçãofinanceira verdadeiramente global.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Como resultado: um evento não inventado por nós, mas claramente enquadradoem nossa visão, faz do Bitcoin o primeiro dinheiro para robôs, ou, se olharmosainda mais fundo, é justamente essa instituição social que ajudará na formaçãode empresas robóticas.",
  "Smart contracts": "Smart contracts",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin se tornou o primeiro dinheiro disponível para robôs. Enquanto isso,não podemos falar sobre o Bitcoin em sua forma atual como uma ferramenta paratroca técnica e econômica completa.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Agora já temos contratos inteligentes, mercados DeFi e uma infraestrutura descentralizadapara troca de mensagens entre robôs que abrem a possibilidade para a humanidadecriar uma parte totalmente automatizada da economia humana - a economia robótica.",
  "One of the great opportunity to build the economy of robots is": "Uma das grandes oportunidades para construir a economia dos robôs é a tecnologia da",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Com a funcionalidades da Ethereum, os robôs são capazes não apenas de trocar dinheiro, mas de firmar contratos com humanos e entre si.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Mas qual é o objetivo da comunicação baseada em contrato máquina a máquina (m2m)?Essa é uma ótima pergunta! Voltemos ao CPS. Quando falamos de comunicações diretasentre sensores, equipamentos de máquinas ou quaisquer outros elementos, aindafalamos de colaboração dentro de um sistema regulado. Mas se queremos que os serviçosde cidades inteligentes estejam vivos (ou até mesmo casas inteligentes em algunscasos), precisamos estabelecer comunicação com vários elementos de terceiros.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Vamos imaginar o serviço de entrega por drones. Se um drone, por exemplo, épropriedade da DHL, como ela pode acessar os armazéns da Amazon ou acessar todoo espaço aéreo da cidade? Será um monopólio? Este é um grande desafio para muitasiniciativas da 4ª revolução industrial!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "A maioria das corporações diz que precisa de direitos quase completos sobreseus arredores porque não sabe como configurar com segurança a troca de informaçõestécnicas entre sistemas automatizados fora de sua própria estrutura corporativainterna. Ao mesmo tempo, se você observar os processos em que uma pessoa trabalha,veremos que a cooperação de diferentes corporações é longa e existe com sucesso.Você pode facilmente solicitar a entrega porta a porta de mercadorias compradasno site da Amazon, e o correio poderá dirigir um carro pelas estradas da cidade,receber um pedido no armazém e trazê-lo para você.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Qual é a diferença? No primeiro caso não há como construir uma relação contratualentre máquinas, e no segundo caso, no mundo das pessoas, já existem relações contratuais.",
  "Parachains": "Parachains da",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "A principal dificuldade que a Robonomics enfrenta hoje é o alto preço para lançarum dispositivo IoT usando a Ethereum. Na Ethereum você tem que pagar uma comissãosobre cada transação em termos de dólares americanos, na faixa de US$ 10 a US$100. É bastante caro para a maioria dos casos da economia real, seja uma viagemde compartilhamento de carro, aluguel de um apartamento inteligente, entrega pordrones ou ordenar a impressão em 3D de seu herói anime favorito.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Por justiça, gostaríamos de observar que existem cenários lucrativos mesmo comas taxas de transação na rede Ethereum de 2018 - 2019. Por exemplo, transaçõesautomatizadas de compensação de pegada de carbono ou transferência do pedido dosite diretamente para a produção. Mas ainda assim, para a aplicação em massa dastecnologias web3 no campo da IoT, é necessária uma redução no preço que a nuvemcobra do dispositivo conectado.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Procurando uma oportunidade para reduzir o custo de interação com um dispositivoIoT, os desenvolvedores da Robonomics estudaram desenvolvimentos alternativosao Ethereum. Nossa escolha se baseou na arquitetura da",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": ", que nos permitiria rodar nossa própria blockchain, dentro de uma rede comum, na qual a segurança é garantida por validadores independentes do nosso projeto.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Rede Blockchain Heterogênea",
  "Homogeneous Shard Network": "Rede de Shards Homogêneos",
  "On-chain protocol control": "Controle de protocolo on-chain",
  "Protection against the tyranny of the crowd": "Proteção contra a tirania da multidão",
  "Auction of bandwidth in the common network": "Leilão de largura de banda na rede comum",
  "Payment for gas by users": "Pagamento de gas pelos usuários",
  "Have you read this?": "Você leu isso?",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Eu, Robô",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "O Homem Bicentenario",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Questões abertas de teleologia",
  "and a treatise by L. von Mises": "e um tratado de L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Para concluir, gostaríamos de mencionar questões que permanecem em aberto de um ponto de vista global. Qual é o objetivo dos robôs?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "A praxeologia nos inspira com ideias interessantes sobre o comportamento humanosem dependência direta dos propósitos. Isso nos dá a oportunidade de trabalharnos processos da economia robótica condicionalmente como com uma caixa preta semnos aprofundarmos nos objetivos finais. Ao mesmo tempo, a teleologia representaum desafio para explicar as causas.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Esperamos que em algum lugar na junção dos trabalhos de Mises e Wiener, possaser encontrado um ponto para um maior desenvolvimento da economia robótica, nãoapenas como um protocolo de interação entre pessoas e máquinas de natureza praxeológica,mas levando em conta o elementos da construção de comunicação interespécies.",
  "or": "ou",
  "Wallpapers": "Papéis de parede",
  "Cases": "Capas",
  "Wiki": "Wiki",
  "Academy": "Academia",
  "Github": "Github",
  "Dapp": "Dapp",
  "Robonomics is 100% open-source.": "Robonomics é 100% de código aberto.",
  "Anyone can contribute to": "Qualquer pessoa pode contribuir para",
  "the code base": "a base de código",
  "build services with Robonomics": "construir serviços com Robonomics",
  "Translation was executed by AI so there may be some inaccuracies": "A tradução foi executada por IA, então pode haver algumas imprecisões",
  "Inform us": "Nos informe",
  "please": "por favor",
  "if you find any": "se você encontrar alguma",
  "Additional icons for the wallpaper:": "Ícones adicionais para o papel de parede:",
  "Important news &amp; announcements": "Notícias importantes e anúncios",
  "All posts": "Todas as postagens",
  "I agree to receive emails": "Concordo em receber e-mails",
  "Send": "Enviar",
  "Thanks, your application has been sent!": "Obrigado, sua inscrição foi enviada!",
  "R&D cases": "Casos de P&D",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Colaboração com desenvolvedor imobiliário em Chipre para rastrear a distribuição diária, consumo e compensação de qualquer excesso de pegada de carbono.",
  "This page is out of your space": "Esta página está fora do seu espaço",
  "Check url once more or create an": "Verifique a URL novamente ou crie um",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "nos informando que você recebeu um erro 404 (não se esqueça de mencionar a URL atual)",
  "Embedded iot systems": "Sistemas embarcados de IoT",
  "Autonomous systems": "Sistemas autônomos",
  "Digital twins are the heart of the internet of things": "Digital twins são o coração da internet das coisas",
  "\"Main tasks of robonomics architecture": "Principais tarefas da arquitetura da Robonomics",
  "No posts yet": "Nenhuma postagem ainda",
  "If you want to help us with translation": "Se você quiser nos ajudar com a tradução",
  "contact us at": "entre em contato conosco em",
  "send": "envie",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics é uma plataforma de IoT 100% de código aberto, segura, econômica e futurista para conectar robótica sob controle de Polkadot e Ethereum. Qualquer pessoa pode construir serviços com Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Abaixo está uma lista de nossas aplicações comprovadas de tecnologias modernas de robótica.",
  "By interest:": "Por interesse:",
  "Sort by progress:": "Ordenar por progresso:",
  "Any progress": "Qualquer progresso",
  "Complete": "Completo",
  "Proceeding": "Em andamento",
  "Sort by time:": "Ordenar por tempo:",
  "Recent": "Mais recente",
  "Earliest": "Mais antigo",
  "Show more": "Mostrar mais",
  "Robonomics token": "Token Robonomics",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Coloque dados no IPFS e armazene hashes em uma Blockchain pública",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry.": "O modelo de gêmeo digital desenvolvido pode ser diretamente vinculado a serviços adicionais que sua empresa oferece para a indústria de IoT.",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service.": "Para tornar o processo de entrega conveniente e simples para centenas de clientes, adicionamos uma seção dos serviços para o mercado de robôs. Dê uma olhada nos primeiros exemplos dos pacotes implementados do modelo de gêmeo digital + serviço automatizado da empresa.",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Aqui, reunimos uma coleção de NFTs criados durante nossa extensa jornada criptográfica, tanto de forma independente quanto com grandes equipes. Esses tokens únicos oferecem propriedade verificável na blockchain e são ótimos para enfeitar sua conta de blockchain. Você pode dar lances em alguns deles em leilão ou até mesmo criar sua própria peça única.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Durante nossa campanha inicial de crowdloan Kusama, decidimos recompensar os contribuidores pioneiros de nossa criptomoeda com mais do que apenas tokens - também lhes presenteamos com um NFT colorido. Este cartão tem um grande significado para nós e, se alguém o possui, sabemos que eles são um fantástico apoiador dos valores da Robonomics: liberdade e descentralização.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Estamos animados em apresentar nossa série especial de ativos digitais - Robonomics Crypto Girls, criadas pela equipe Robonomics Art&Science. Cada NFT desta coleção é uma representação gráfica única da tecnologia usada na Robonomics ou construída em cima dos casos de uso da Robonomics. Nossos talentosos artistas desenharam cada garota no estilo característico da Robonomics. Você pode escolher aquela que mais ressoa com você ou colecionar a série inteira! Ao comprar esses NFTs, você não está apenas adicionando um complemento elegante à sua coleção, mas também nos apoiando continuamente na inovação e implementação da conectividade descentralizada para robôs. Fique atento para novas adições à coleção!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. COLEÇÕES DE NFTS SAZONAIS",
  "On demand minting": "Mintagem sob demanda",
  "SEASONAL SPOT NFT COLLECTIONS": "COLEÇÕES DE NFTS SAZONAIS",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Essas coleções sazonais de NFTs representam um ativo digital único que captura a interação única entre o usuário e o Spot dentro da parachain da Robonomics. Os usuários podem desenhar qualquer coisa no navegador e o robô replicará seus movimentos para criar uma imagem desenhada à mão. Uma vez que a interação estiver completa, o NFT é mintado na Singular marketplace para a conta Polkadot do usuário. Agora, qualquer pessoa pode interagir com um robô real localizado em um laboratório na Califórnia para criar ativos digitais personalizados e únicos que podem ser possuídos, comprados e vendidos como qualquer outro ativo digital.",
  "Create your NFT": "Crie seu NFT",
  "4. automated telescope collection": "4. coleção de telescópios automatizados",
  "automated telescope collection": "coleção de telescópios automatizados",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Localizado no Deserto do Atacama, no Chile, um telescópio físico pode ser acessado por meio de um aplicativo descentralizado para capturar imagens em tempo real de objetos astronômicos no espaço profundo. Qualquer usuário com conexão à internet pode acessá-lo com tokens $STRGZN, que estão disponíveis para compra no aplicativo usando um cartão de crédito. Selecione um objeto astronômico, envie um comando para o telescópio tirar uma foto e aguarde o NFT mintado na plataforma Singular. Observe que o aplicativo só está disponível para uso das 23h às 6h GMT-3 devido ao horário de funcionamento do telescópio.",
  "Try yourself": "Experimente você mesmo",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "Em colaboração com Polkapets",
  "and": "e",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Como membro orgulhoso do ecossistema Polkadot, a Robonomics participou do Polka Pets World. Juntamente com a equipe Polka Pets, mintamos 1200 NFTs com um conceito de design único que mostra nossa ideia central de conectividade. Para dar vida a essa ideia, criamos uma personalidade: um androide especializado em ajudar os humanos a se conectarem com qualquer entidade robótica.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "Em 2021, a Robonomics começou a apoiar a adição dos paletes da RMRK em sua runtime, o que resultaria em integração nativa com a lógica de NFT mais avançada do mundo. Para celebrar essa conquista notável, lançamos um item especial compatível com Kanaria - um NFT infantil que pode ser equipado no seu pássaro Kanaria e pode fornecer vantagens no metaverso da RMRK.",
  "RMRK Partnerships": "Parcerias RMRK",
  "This page has moved to a": "Esta página foi movida para um",
  "Automatic redirecting": "Redirecionamento automático",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "Em 1948, um professor de matemática do MIT, Norbert Wiener, publicou uma das obras mais seminais \"Cibernética: Ou Controle e Comunicação no Animal e na Máquina\". Ele utilizou o termo \"cibernética\" pela primeira vez para se referir a mecanismos de autorregulação e, por isso, essa publicação é considerada o aniversário reconhecido da Cibernética.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Grandes livros levam a grandes ideias. Se você está em busca de mais inspiração sobre comunicação entre humanos e máquinas, tente ler livros de ficção científica. Marque os livros que você já leu e veja o que mais podemos oferecer para reflexão adicional.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Na verdade, a economia das pessoas muitas vezes está associada à consciência de realizar tarefas dentro do contrato, ao desejo das partes de alcançar um resultado, ao comportamento oportunista e altruísta do indivíduo na sociedade. Todos esses princípios são difíceis de aplicar à economia dos robôs. Quais são os motivos da economia dos robôs? É uma pergunta em aberto que precisamos pesquisar e discutir na sociedade para melhor compreensão e aplicação dos robôs.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Para começar, sugerimos dar uma olhada no trabalho de Mises \"Ação Humana: Um Tratado de Economia\" (abordagem praxeológica) e no artigo inicial de Norbert Wiener \"Comportamento, Propósito e Teleologia\" (visão teleológica).",
  "Robonomics wallpapers": "Papéis de parede Robonomics",
  "Regular wallpapers": "Papéis de parede regulares",
  "Wallpapers for phones": "Papéis de parede para telefones",
  "Hidden wallpapers": "Papéis de parede ocultos",
  "This page may need translation": "Esta página pode precisar de tradução",
  "Establishing democracy with smart contracts": "Estabelecendo democracia com contratos inteligentes",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Vamos imaginar um pequeno escritório com uma equipe de 10 a 15 pessoas. Enquanto todos estão focados em seus prazos para suas principais tarefas profissionais, ninguém parece se importar com a manutenção do espaço do escritório. A solução mais comum para evitar o caos é contratar indivíduos terceirizados para oferecer suporte. Outra abordagem é tomar a iniciativa e impor penalidades àqueles que bagunçam ou esgotam os suprimentos sem repô-los. No entanto, é ético viver sob tirania em nosso futuro mundo cripto-anarquista, onde se espera que todos sejam responsáveis e desfrutem da liberdade? Vamos nos esforçar para criar uma sociedade mais democrática usando contratos inteligentes e a nova geração de tecnologias da Internet (frequentemente referidas como Web3). Precisamos de ferramentas que possam nos ajudar a tomar decisões juntos e garantir que funcionem corretamente sem que os humanos precisem se envolver diretamente.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Quem bebeu todo o café?!' ou a tragédia dos comuns",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Existe um conceito amplamente discutido em economia, ecologia e outras ciências conhecido como 'tragédia dos comuns'. Isso se refere a um cenário em que indivíduos que têm acesso a um recurso compartilhado priorizam seus próprios interesses, esgotando assim o recurso. O café se assemelha muito a esse recurso, pois se deteriora devido ao consumo descontrolado no escritório. No entanto, ao mesmo tempo, geralmente nenhum dos membros da equipe está inclinado a investir seu tempo e dinheiro na obtenção de um pacote adicional de grãos de café. Então, eles continuam bebendo café sem obter novos suprimentos.",
  "How to formulate the task in numbers.": "Como formular a tarefa em números.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Supondo um orçamento mensal de café de $100, o que é aproximadamente equivalente a 150 xícaras para nossa equipe de 10 pessoas, isso deixa cada pessoa com 1 xícara a cada 2 dias. Agora, vamos nos aprofundar nos detalhes técnicos. A pergunta é: como podemos dar vida a uma máquina de café autônoma no escritório?",
  "Step 1: automated coffee bean ordering": "Passo 1: pedido automatizado de grãos de café",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Fizemos um acordo com o barista, Nikita, que está localizado perto do escritório. Ele nos fornecerá grãos de café ao receber um alerta do robô. O robô envia uma mensagem quando o café está acabando, especificando a quantidade de café (em quilogramas) necessária para o pedido e o valor correspondente determinado pela equipe. Com esses detalhes, Nikita pode selecionar o café de acordo com sua preferência.",
  "Step 2: automatic access to smart office.": "Passo 2: acesso automático ao escritório inteligente.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Simultaneamente ao pedido, a máquina de café gera um código QR. Nikita então apresenta este código QR à câmera para entrada no escritório.",
  "Step 3: distribution of coffee tokens to the team.": "Passo 3: distribuição de tokens de café para a equipe.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Uma vez que a câmera local lê o código QR, o sistema de gerenciamento residencial inteligente inicia um pagamento para Nikita e distribui novos tokens de café entre os membros da equipe.",
  "Step 4: drink coffee!": "Passo 4: beba café!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Para receber uma xícara de café fresca, um membro da equipe precisa enviar um token de café para o endereço da máquina de café.",
  "Coffee beans delivery process:": "Processo de entrega de grãos de café:",
  "Unlock new possibilities with this concept": "Desbloqueie novas possibilidades com este conceito",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Além disso, uma máquina de café automatizada introduz várias dimensões econômicas e sociais. Vamos dar uma olhada nelas:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Os desenvolvedores podem depositar tokens de café extras quando o consumo fica abaixo do limite. Isso cria um sistema transparente para o uso variado de café dentro do limite.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "A máquina de café poderia manter uma conta compartilhada, permitindo que os membros do escritório contribuam com fundos de suas contas pessoais para uma experiência de café de maior qualidade da próxima vez.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "A equipe decide coletivamente a quantidade de café que a máquina irá pedir a cada vez por meio de uma votação DAO. Isso proporciona liberdade para lidar com o desafio com recursos limitados.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Processos programáveis reduzem a influência de fatores humanos e também oferecem maior flexibilidade na personalização das configurações para equipes específicas.",
  "How we smarten up our coffee machine in real life": "Como tornamos nossa máquina de café mais inteligente na vida real",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Para obter controle prático da máquina de café, integramos um computador de placa única, especificamente o Raspberry Pi 4, juntamente com uma máquina de café de mercado de massa comumente disponível que suportava conexão GPIO. Nossa preferência foi o",
  "selected for its affordability and the convenience of its easily removable front panel.": "selecionado por sua acessibilidade e pela conveniência de seu painel frontal facilmente removível.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Em seguida, trabalhamos nos detalhes operacionais, especificamente em relação aos tokens que os usuários poderiam enviar e ao algoritmo subjacente. Aqui está o resultado:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Para desfrutar de uma xícara de café deliciosa, os usuários precisam enviar uma certa quantia de fundos (em nosso caso, 1 token ACT da Statemine, id=3077) para o endereço da máquina de café de uma parachain (Statemine). Em seguida, o processo de despejo de café começa e um registro de ação é posteriormente publicado em",
  "via the Datalog function": "por meio da função Datalog",
  "When the concept extends beyond the office": "Quando o conceito se estende além do escritório",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Este conceito oferece inúmeras possibilidades para expandir a ideia. Foi implementado com sucesso no Polkadot Web3 Hub durante o Fórum Econômico Mundial de 2022 em Davos. Os participantes puderam fazer pedidos de café e especificar o tipo de café desejado (por exemplo, espresso, americano, cappuccino) enviando uma certa quantidade de tokens. Vamos compartilhar fotos e vídeos deste evento:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Nossa máquina de café blockchain fazendo café no Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "Faça você mesmo ou como construir sua própria máquina de café blockchain inteligente",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Você pode encontrar um tutorial detalhado e especificações técnicas no repositório GitHub de código aberto. Tenha em mente que você pode usar qualquer máquina de café que preferir e quase qualquer token de sua escolha para dar vida a este projeto em seu próprio espaço.",
  "In a nutshell": "Em poucas palavras",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Hoje em dia, está cada vez mais claro que o consumo de energia é um grande contribuinte para as pegadas de carbono, tornando cada vez mais importante encontrar maneiras de reduzir nosso impacto ambiental. Escritórios e edifícios comerciais desempenham um papel significativo nesse consumo de energia. Os engenheiros da Robonomics instalaram um sistema no escritório da BBF, uma empresa imobiliária sediada em Chipre, para rastrear e coletar medições de eletricidade. Esse sistema também oferece uma maneira prática de compensar a pegada de carbono.",
  "1. Monitoring surplus energy generation": "1. Monitorando a geração de energia excedente",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "No prédio do escritório da empresa BBF, vários painéis solares foram instalados e integrados ao sistema Solarweb, permitindo a fácil coleta de análises. O sistema fornece dados sobre o consumo geral de eletricidade do prédio e a eletricidade gerada pelos painéis solares. No entanto, uma característica crucial que está faltando é a capacidade de compensar a pegada de carbono resultante da eletricidade consumida além do que é gerado pelos painéis solares.",
  "2. Converting excess energy power to CO2 offset": "2. Convertendo o excesso de energia em compensação de CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Ter dados sobre o consumo total de eletricidade e a produção de eletricidade dos painéis solares permite um cálculo direto da pegada de carbono. Assume-se que a eletricidade dos painéis solares tem uma pegada de carbono de 0, o que significa que a compensação é necessária apenas para a eletricidade excedente consumida além do que os painéis solares geraram.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "É importante ressaltar que as emissões de CO2 variam entre os países. Em Chipre, a poluição média é de 587 g/kWh, de acordo com Hannah Ritchie, Max Roser e Pablo Rosado (2022) - \"Energia\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Para compensar a pegada de carbono, são utilizados créditos de carbono, sendo que cada crédito representa 1 tonelada de CO2. Esses créditos desempenham um papel vital na compensação do impacto ambiental causado pelo consumo de eletricidade além da contribuição dos painéis solares.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Assim, munidos de dados sobre o consumo de energia, produção de painéis solares e o coeficiente de Chipre, torna-se fácil determinar o número de tokens necessários para compensar a pegada de carbono.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Para alcançar isso, incorporamos um Raspberry Pi, configuramos o Home Assistant para coletar dados analíticos e desenvolvemos uma integração para compensar a pegada. O painel de energia do Home Assistant mostra os seguintes detalhes:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Além disso, nossa integração aprimora o sistema oferecendo um painel de controle conveniente para visualizar estatísticas e acionar a compensação:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Abaixo está um exemplo ilustrativo de como ocorre a compensação da pegada de carbono por meio de nossa integração. Após a conclusão bem-sucedida, a",
  "transaction": "transação",
  "unfolds as follows:": "se desenrola da seguinte forma:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Reduzir o consumo de energia no escritório é tão importante quanto compensar as emissões de carbono. Podemos alcançar isso fazendo pequenas mudanças, como usar iluminação e eletrodomésticos eficientes em termos de energia e manter os equipamentos de escritório bem conservados.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "O consumo de energia é uma grande parte de nossa pegada de carbono, e as empresas devem fazer sua parte para serem mais ecologicamente corretas. Ter um sistema que rastreia o uso de energia e ajuda a compensar as emissões de carbono pode reduzir significativamente o impacto de um prédio de escritórios no meio ambiente. Ao adotar a abordagem correta, as empresas podem contribuir para um futuro mais verde.",
  "The way forward": "O caminho a seguir",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Estratégia para transformar a máquina de café em um dispositivo robótico autônomo",
  "Robot and electrics sheep artboard": "Arte de robôs e ovelhas elétricas",
  "Robot and apple artboard": "Arte de robôs e maçã",
  "Robot and cosmonaut artboard": "Arte de robôs e cosmonautas",
  "Robot and cat artboard": "Arte de robôs e gatos",
  "Space travelers artboard": "Arte de viajantes espaciais",
  "Coloured astronaut artboard": "Arte de astronauta colorido",
  "Black and white astronaut artboard": "Arte de astronauta preto e branco",
  "icons for macos": "Ícones para macOS",
  "icons for windows": "Ícones para Windows",
  "Sleeping Mew Space": "Espaço Mew Dormindo",
  "Are you ready for Mars?": "Você está pronto para Marte?",
  "Shiva Robot": "Robô Shiva",
  "Space Travelers": "Viajantes Espaciais",
  "Retro Astronaut": "Astronauta Retrô",
  "New Newton": "Novo Newton",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "The latest Robonomics news here.": "As últimas notícias da Robonomics aqui.",
  "Follow us": "Siga-nos",
  "Video tutorials, screencasts, interviews, events.": "Tutoriais em vídeo, screencasts, entrevistas, eventos.",
  "Watch videos": "Assista vídeos",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "Converse conosco e com nossa comunidade. Sinta-se à vontade para fazer perguntas e discutir suas sugestões.",
  "Join chat": "Junte-se ao chat",
  "Medium Blog": "Blog Medium",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "Nossa visão do passado, presente e futuro sobre Robonomics, Ethereum, redes Polkadot, mercados verdes, robótica e tudo o que está relacionado com Robonomics.",
  "Read": "Leia",
  "Telegram chat": "Chat do Telegram",
  "Local communities & news. You are welcome!": "Comunidades locais e notícias. Seja bem-vindo!",
  "On the Way to Sovereign Home Automation": "A caminho da automação residencial soberana",
  "World Economic Forum Annual Meeting 2022": "Reunião Anual do Fórum Econômico Mundial 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Tornando-se uma Parachain para Aplicações de IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (patrocinado pela Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Escola de Inverno Robonomics 2021 (hospedada pela Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transição para Multirrede - Surgiu o Polkadot",
  "The Rise of Robonomics Network": "A Ascensão da Rede Robonomics",
  "Crypto Valley Conference 2018": "Conferência Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Workshop do Parlamento Europeu 'A Economia dos Robôs'",
  "Consensus 2018 conference": "Conferência Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simpósio sobre Blockchain para Sistemas Robóticos no MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Escola de Verão Robonomics-2018 hospedada pela Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Integração Fronius Solar.web com o Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Um de nossos objetivos no desenvolvimento deste caso é transformar a Robonomics em Middleware ROS 2. Isso nos permitirá usar a Robonomics no Substrate para criar um dapp que pode executar o ROS 2 diretamente do navegador!",
  "Eisenkoch, the robot chef": "Eisenkoch, o chef robô",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Caso real para o robô equipado com duas máquinas de waffle e assando 6 waffles ao mesmo tempo em 5-7 minutos.",
  "Blockchain-powered smart coffee machine": "Máquina de café inteligente alimentada por blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Café Robonomics - é uma máquina de café inteligente integrada à Rede Robonomics. Este projeto tem como objetivo mostrar o potencial da Robonomics na esfera da IoT por meio de um exemplo do mundo real.",
  "Water environmental inspector": "Inspetor ambiental de água",
  "Air monitoring network": "Rede de monitoramento do ar",
  "Production quality control platform “Feecc”": "Plataforma de controle de qualidade de produção “Feecc”",
  "Backup and archiving service for robotics companies": "Serviço de backup e arquivamento para empresas de robótica",
  "Public lab with Boston Dynamics Spot": "Laboratório público com Boston Dynamics Spot",
  "Autonomous telescope service": "Serviço de telescópio autônomo",
  "Smart home secure remote control and backup service": "Controle remoto seguro e serviço de backup para casa inteligente",
  "Blockchain as quality control system for chemistry": "Blockchain como sistema de controle de qualidade para química",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Redução real de emissões de CO2 com certificados comprovados por blockchain",
  "Robot-artist Gaka-Chu": "Robô-artista Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Demonstração “Obtenha o clima do Monte Fuji”",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "A ideia principal que os autores do Robonomics tentaram transmitir antes - é a evolução natural, lógica e aparentemente inevitável do nível atual da economia para serviços totalmente automatizados. Os serviços automatizados precisarão ter tanto a capacidade de falar a linguagem da economia humana quanto a economia das máquinas para realizar várias operações no mundo ao seu redor em uma velocidade não disponível para os humanos.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "O desenvolvimento e aplicação da Internet das Coisas mostrou que resolver problemas típicos não é suficiente. Novos conceitos e princípios completamente novos, baseados em erros anteriores e deficiências identificadas, surgiram até os dias atuais. Essa abordagem certamente conveniente de usar serviços em nuvem acabou tendo uma série de deficiências críticas relacionadas à escalabilidade, privacidade e segurança. Na tentativa de resolver esses problemas, propôs-se aproximar o processamento de dados, lógica e computação do local imediato onde são usados. Assim, surgiram os conceitos de computação em névoa e borda, com sistemas intermediários entre a nuvem e os dispositivos assumindo algumas das funções da nuvem. Portanto, a criação de sistemas de borda tornou-se um dos novos desafios na construção da Internet das Coisas.",
  "the Robonomics Parachain portal": "o portal Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Gerenciando a compensação de pegada de carbono verificada em blockchain",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "As colaborações com projetos afins também continuaram. Robonomics e DAO IPCI introduziram um serviço para coleta e análise de dados sensoriais -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "E o que é cientificamente interessante, tomando como base a ideia das restrições impostas pelo mercado ao tamanho da empresa, podemos dizer que o limite do aumento em CPS será sempre determinado pelo mercado e nada mais é necessário para isso.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Um dos exemplos de nossos experimentos: negociação de espaço na estrada e pagamentos de direito de passagem para veículos autônomos para reduzir o congestionamento. O que uma pessoa absolutamente não faria no trânsito, o carro fará por você sem dificuldades: você quer mudar de faixa, seu carro e o carro do seu vizinho trocam ofertas sobre o custo dessa operação a uma taxa de centenas de mensagens por segundo, eles revelarão um preço de equilíbrio e assim você já está na próxima faixa de movimento mais rápido. Isso significa que agora será possível \"carregar\" sua viagem com a Uber e torná-la mais rápida.",
  "Important news and announcements": "Notícias e anúncios importantes",
  "Robonomics White Paper": "Robonomics White Paper",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Aqui, você pode encontrar e baixar (completamente grátis, é claro) o primeiro white paper do Robonomics, que foi introduzido em maio de 2018. Embora muito tenha evoluído desde então, os fundamentos do Robonomics ainda estão delineados neste documento.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Um Robô Artista Autônomo Autônomo",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Localização Cooperativa e Rastreamento de Limites Ambientais em Movimento por Equipes de Robôs Não-Holonômicos",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robô como um Serviço: Das Tecnologias em Nuvem para Tecnologias de Peer-to-Peer",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Monitoramento Ambiental Confiável por Meio de Redes de Sensores em Embarcações Marinhas Autônomas e Tecnologia de Livro-Razão Distribuído",
  "Digital Passport for Unmanned Vehicles": "Passaporte Digital para Veículos Não Tripulados",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics como uma Plataforma Baseada em Blockchain para Gerenciamento de Tráfego Não Tripulado de Veículos Móveis",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Rumo a Sistemas Robóticos Multi-Agentes Baseados em Blockchain: Análise, Classificação e Aplicações",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Serviços Robóticos para Cidades Inteligentes de Novo Paradigma Baseadas em Tecnologias Descentralizadas",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protocolo para Organização de uma Rede de Agentes Autônomos Descentralizados em Fábricas Usando Mecanismos de Mercado",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Rumo a Robonomics Baseado em Blockchain: Validação de Comportamento de Agentes Autônomos",
  "Transforming Climate Finance and Green Investment with Blockchains": "Transformando o Financiamento Climático e o Investimento Verde com Blockchains",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: plataforma para integração de sistemas ciberfísicos na economia humana",
  "Blockchain based protocol for economical communication in industry 4.0": "Protocolo baseado em blockchain para comunicação econômica na indústria 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics baseado em blockchain como princípio de criação de fábricas inteligentes",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Ecossistema de blockchain para mercados de carbono, ativos ambientais, direitos e responsabilidades: Conceito de design e implementação",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Protocolo baseado em blockchain de atividade empresarial autônoma para sistemas multi-agentes compostos por UAVs",
  "English": "Inglês",
  "Russian": "Russo",
  "Chinese": "Chinês",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics é uma plataforma de código aberto que facilita tanto serviços simples de IoT quanto robótica complexa, permitindo uma comunicação eficaz entre agentes, sejam eles humanos ou robóticos. Para integrar robôs a este sistema, utilizamos o ROS. Neste artigo, temos como objetivo fornecer uma visão geral do nosso processo de integração do Robonomics ao ROS 2.",
  "Why ROS 2 in Robonomics?": "Por que o ROS 2 no Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, o Sistema Operacional de Robôs, é uma das mais antigas estruturas de código aberto para robótica. É uma coleção de bibliotecas de software e ferramentas para fazer robôs funcionarem. Possui desde o básico até recursos avançados e vem com ferramentas úteis para programadores. É amplamente utilizado por universidades em todo o mundo para ensino e pesquisa em robótica, portanto, é bem estabelecido, funciona com muitos tipos de robôs e possui uma grande comunidade de desenvolvedores.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Desde que o ROS foi iniciado em 2007, ocorreram mudanças significativas no campo da robótica e dentro da comunidade ROS. Em resposta a esses desenvolvimentos, o ROS 2 foi introduzido com o objetivo de se adaptar a essas mudanças. Ele se baseia nos pontos fortes do ROS 1, ao mesmo tempo em que aborda suas limitações. Estamos utilizando o ROS no Robonomics desde o início e agora é hora de migrarmos para o ROS 2.",
  "You might find this interesting": "Você pode achar isso interessante",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Existem inúmeros robôs de código aberto e plataformas robóticas complexas que suportam o ROS. Isso significa que você pode criar um impressionante sistema multi-robô para alcançar seus objetivos específicos. Para",
  "the most current list of supported robots": "a lista mais atualizada de robôs suportados,",
  "please visit the ROS website.": "visite o site do ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Vamos ver como o ROS é usado dentro do framework Robonomics, retratando todo o sistema com o Robonomics atuando como diferentes camadas:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "Na camada 'Interface de Máquina', precisamos de ferramentas para conectar perfeitamente robôs com software. O ROS 2 fornece um conjunto robusto de ferramentas de desenvolvimento perfeitamente adequadas para essa tarefa.",
  "Robonomics packages for ROS and ROS 2": "Pacotes Robonomics para ROS e ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "A construção de um sistema multi-robótico muitas vezes envolve o desafio de conectar dispositivos de vários fornecedores, ou até mesmo dispositivos dentro de um único fornecedor, cada um usando protocolos diferentes. Seja para uma configuração de casa inteligente ou fabricação automatizada, a comunicação efetiva entre suas máquinas é crucial. O ROS (e, é claro, o ROS 2) oferece vários modos para lidar com isso. E se você pudesse personalizar tarefas enquanto o ROS gerencia a comunicação entre os nós?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "A equipe Robonomics criou vários pacotes para o ROS para tornar os robôs mais inteligentes e lidar com tarefas específicas conforme necessário. Para ver as tarefas que realizamos com o ROS, confira nossa página de casos de P&D. Quase toda interação com um robô depende do ROS. Você pode encontrar nossos pacotes Robonomics de código aberto para o ROS no GitHub, e aqui estão alguns deles:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "A pilha de comunicação Robonomics contém um conjunto de pacotes ROS para fins de comunicação econômica.",
  "Robonomics' contribution in the ROS 2 community": "A contribuição da Robonomics na comunidade ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "A Robonomics combina Robótica com tecnologias Web3, e nosso objetivo é crescer nessas áreas. Desde a introdução do ROS 2, identificamos três principais desafios que envolvem o suporte à comunidade ROS 2 e a melhoria das capacidades da Robonomics:",
  "Creating ROS 2 tools for Rust:": "Criando ferramentas ROS 2 para Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Essas ferramentas capacitam os desenvolvedores a escrever aplicativos ROS 2 usando Rust. Para descobrir mais sobre por que escolhemos Rust e a importância deste projeto para nós, você pode encontrar",
  "additional details": "detalhes adicionais",
  "Developing Robonomics Middleware for ROS 2:": "Desenvolvendo o Middleware Robonomics para ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Isso desempenha um papel importante na garantia da integração perfeita da Robonomics em vários sistemas de robótica multiagente usando o ROS 2. Ele pode facilitar a integração de robôs em tecnologias de blockchain Web 3, reduzindo erros durante o processo de integração, economizando tempo e custos.",
  "Creating a robotics lab with ROS 2:": "Criando um laboratório de robótica com ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "À medida que o ROS 2 ganha popularidade na comunidade de robótica, estamos ansiosos para ver mais robôs e hardware trabalhando com o ROS 2. Nosso objetivo é conectá-los ao ecossistema Web3 usando a Robonomics.",
  "Research papers": "Artigos de pesquisa",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Sem pesquisa acadêmica, o avanço de sistemas complexos que podem ser integrados em nossa vida diária pode perder seu propósito ou até mesmo representar riscos. Devemos contemplar cuidadosamente nossa direção, objetivos e consequências potenciais. As esferas em que a Robonomics opera, especificamente Robótica, Relações Econômicas e tecnologias Web3, valem a pena ser estudadas individualmente, explorando como elas podem ser integradas entre si e avaliando seu impacto potencial em nossas vidas.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Este caso está atualmente em andamento; não perca as notícias - inscreva-se para receber atualizações na caixa abaixo",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "A 'Robonomics Coffee' é uma máquina de café inteligente integrada à Rede Robonomics. Este projeto tem como objetivo ilustrar o potencial da Robonomics na esfera da IoT através de um exemplo do mundo real.",
  "logos and assets": "logotipos e ativos",
  "Download the Robonomics logos here. We've got two options for your": "Baixe os logotipos do Robonomics aqui. Temos duas opções para suas",
  "basic needs": "necessidades básicas",
  "and one designed for": "e uma projetada para",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "token. Além disso, descubra a paleta de",
  "color palette": "cores ideal",
  "for the distinguished Robonomics brand": "para a distinta marca Robonomics",
  "Robonomics logos": "Logotipos do Robonomics",
  "Download all": "Baixe todos os",
  "XRT logos": "logotipos do XRT",
  "Recommended color palette": "Paleta de cores recomendada",
  "RWS logos": "Logotipos RWS",
  "Buy in Telegram bot": "Comprar no bot do Telegram",
  "Key Features": "Recursos principais",
  "Smart Devices": "Dispositivos inteligentes",
  "Control your home": "Controle sua casa",
  "Be smart": "Seja inteligente",
  "Be independent": "Seja independente",
  "Support it on hackster.io": "Apoie-o em hackster.io",
  "Product 1: Universal IR Remote Control": "Produto 1: Controle Remoto IR Universal",
  "Build smart climate control with any ANY A-N-Y air conditioner, setup open/close operations for any ANY A-N-Y gates in your home. We’ve built universal IR remote control with an open-source Tasmota firmware onboard. We installed USB-C port for your better experience - upgrade the firmware for the remote control just with a simple wired connection!": "Crie um controle climático inteligente com QUALQUER ar condicionado, configure operações de abertura/fechamento para QUALQUER portão em sua casa. Construímos um controle remoto IR universal com firmware Tasmota de código aberto embarcado. Instalamos uma porta USB-C para uma melhor experiência - atualize o firmware do controle remoto apenas com uma simples conexão com fio!",
  "Supports wide range of devices": "Compatível com uma ampla gama de dispositivos",
  "Home Assistant Friendly": "Compatível com o Home Assistant",
  "Product 2: Smart Energy Power Consumption Monitoring": "Produto 2: Monitoramento de Consumo de Energia Inteligente",
  "Efficient energy monitoring consumption": "Monitoramento eficiente de consumo de energia",
  "Doesn’t need any cloud service": "Não precisa de nenhum serviço de nuvem",
  "You are currently opted out. Click here to opt in.": "Você está atualmente optado por sair. Clique aqui para optar por entrar.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out completo; suas visitas a este site não serão registradas pela ferramenta de análise da Web. Note que se você limpar seus cookies, excluir o cookie de opt-out ou se trocar de computador ou navegador da Web, será necessário realizar o procedimento de opt-out novamente.",
  "Please click below to opt in:": "Por favor, clique abaixo para optar por entrar:",
  "You are currently opted in. Click here to opt out.": "Você está atualmente optado por entrar. Clique aqui para optar por sair.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Você pode optar por não ter um número de identificação de cookie de análise da web exclusivo atribuído ao seu computador para evitar a agregação e análise de dados coletados neste site.",
  "To make that choice, please click below to receive an opt-out cookie": "Para fazer essa escolha, clique abaixo para receber um cookie de opt-out.",
  "Privacy Policy": "Política de Privacidade",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Esta Política descreve as informações que coletamos de você, como usamos essas informações e nossa base legal para fazê-lo. Também abrange se e como essas informações podem ser compartilhadas e seus direitos e escolhas em relação às informações que você nos fornece.",
  "Tracking cookies are not used": "Cookies de rastreamento não são usados",
  "The data is not used for any other purpose than analytics": "Os dados não são usados para nenhum outro propósito além de análises",
  "A user cannot be tracked across days within the same website": "Um usuário não pode ser rastreado ao longo de dias dentro do mesmo site",
  "What We Collect and Receive": "O que coletamos e recebemos",
  "Visitors aren't tracked across websites": "Os visitantes não são rastreados em diferentes sites",
  "Where are those annoying cookie consent pop-ups": "Onde estão aquelas irritantes janelas pop-up de consentimento de cookies",
  "We don't need cookie consent is needed because": "Não precisamos de consentimento de cookies porque",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include": "Para que possamos fornecer a melhor experiência possível em nossos sites, precisamos coletar e processar certas informações. Dependendo do seu uso dos Serviços, isso pode incluir",
  "Contact us via email": "Entre em contato conosco por e-mail",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "por exemplo, quando você envia nossos formulários, nos envia perguntas ou comentários, ou relata um problema, coletaremos seu nome, endereço de e-mail, mensagem, etc. Usamos esses dados exclusivamente para responder às consultas que recebemos.",
  "Usage data": "Dados de uso",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "quando você visita nosso site, armazenaremos: a URL de onde você nos visitou, as páginas da web de nosso site que você visita, a data e a duração de sua visita, seu endereço IP anonimizado, as especificações do dispositivo (tipo de dispositivo, sistema operacional, resolução de tela, idioma, país em que você está localizado e tipo de navegador da web) que você usou durante sua visita e",
  "other": "outros",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "dados não pessoais. Processamos esses dados de uso apenas em nosso servidor, não os transmitindo a terceiros com",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "plataforma de análise da web que nos dá 100% de propriedade dos dados. Essa análise nos ajuda a melhorar a experiência do usuário com nosso site e a reconhecer e interromper qualquer uso indevido.",
  "Non-personalized cookies": "Cookies não personalizados",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "usamos cookies não rastreáveis (pequenos arquivos de dados transferidos para computadores ou dispositivos por sites) para fins de registro e para aprimorar a funcionalidade em nosso site. Você pode desativar ou restringir a transmissão desses cookies alterando as configurações do seu navegador da web ou optando por sair nesta página no formulário abaixo. Os cookies já armazenados podem ser excluídos a qualquer momento.",
  "Opt-out of website tracking": "Desativar rastreamento de sites",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Você pode optar por não ser rastreado pela nossa instância do Matomo Analytics abaixo:",
  "Your Rights": "Seus Direitos",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Você tem o direito de ser informado sobre os Dados Pessoais processados pelo Matomo, o direito de retificação/correção, exclusão e restrição de processamento. Você também tem o direito de solicitar de nós um formato estruturado, comum e legível por máquina dos Dados Pessoais que você nos forneceu.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Só podemos identificá-lo por meio do seu endereço de e-mail e só podemos cumprir sua solicitação e fornecer informações se tivermos Dados Pessoais sobre você por meio de seu contato direto conosco e/ou seu uso de nosso site e/ou serviço. Não podemos fornecer, retificar ou excluir quaisquer dados que armazenamos em nome de nossos usuários ou clientes.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Para exercer qualquer um dos direitos mencionados nesta Política de Privacidade e/ou em caso de dúvidas ou comentários relacionados ao uso de Dados Pessoais, você pode entrar em contato conosco.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Além disso, você tem o direito de apresentar uma reclamação à autoridade de proteção de dados em sua jurisdição.",
  "Retention of data": "Retenção de dados",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Network legal rights.": "Manteremos suas informações pelo tempo necessário para fornecer os serviços ou conforme estabelecido nesta Política. Também manteremos e utilizaremos essas informações conforme necessário para os fins estabelecidos nesta Política e na medida necessária para cumprir nossas obrigações legais, resolver disputas, fazer valer nossos acordos e proteger os direitos legais da Robonomics Network.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations": "Também coletamos e mantemos informações agregadas, anonimizadas ou pseudonimizadas, que podemos reter indefinidamente para proteger a segurança de nosso site, melhorar nossos serviços ou cumprir obrigações legais.",
  "Devices": "Dispositivos",
  "type-c for OSS firmware upgrading": "type-c para atualização de firmware OSS",
  "WI-FI": "WI-FI",
  "MQTT": "MQTT",
  "Product 3, 4: 1,2 gang wi-fi Smart Switch": "Produto 3, 4: Interruptor inteligente wi-fi de 1,2 gangues",
  "Why should you install any corporate app for switching on/off your smart light?  Our wi-fi smart switches doesn’t require any cloud connection. We tried out many other switches from various manufactureres all over the world and know some important details to make comfortable device. As other smart devices from Robonomics it is fully compatible with Home Assistant, uses open-source upgradable firmware Tasmota.": "Por que você deve instalar qualquer aplicativo corporativo para ligar/desligar sua luz inteligente? Nossos interruptores inteligentes wi-fi não requerem nenhuma conexão em nuvem. Testamos muitos outros interruptores de vários fabricantes ao redor do mundo e conhecemos alguns detalhes importantes para tornar o dispositivo confortável. Como outros dispositivos inteligentes da Robonomics, ele é totalmente compatível com o Home Assistant e usa o firmware de código aberto atualizável Tasmota.",
  "large touchable  buttons": "Botões grandes e sensíveis ao toque",
  "Product 5: Air Quality Sensor": "Produto 5: Sensor de Qualidade do Ar",
  "Join with this air quality sensor to the decentralized opensource sensors map which operates with the sole intent of serving the free will of individuals. This sensor is ready to install, you will need wi-fi and a power socket, it can be installed both indoor and outdoor. Includes PM2.5/PM10 sensor and temperature/humidity sensor, can be expanded with several types of additional sensors (VOC, CO2, atmospheric pressure).": "Junte-se a este sensor de qualidade do ar ao mapa descentralizado de sensores de código aberto, que opera com o único objetivo de servir a vontade livre das pessoas. Este sensor está pronto para instalar, você precisará de wi-fi e uma tomada de energia, ele pode ser instalado tanto em ambientes internos quanto externos. Inclui sensor de PM2.5/PM10 e sensor de temperatura/umidade, pode ser expandido com vários tipos de sensores adicionais (VOC, CO2, pressão atmosférica).",
  "Measures PM2.5/PM10": "Mede PM2.5/PM10",
  "Can be added as a part of global sensor map or your own fork": "Pode ser adicionado como parte do mapa global de sensores ou do seu próprio fork",
  "Compatible with luftdaten": "Compatível com luftdaten",
  "View specification": "Ver especificação",
  "Robonomics Middleware Framework for ROS 2": "Estrutura intermediária Robonomics para ROS 2",
  "Twitter": "Twitter",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Buy devices": "Comprar dispositivos",
  "Have you ever wondered what consumes the most electricity in your home? Our smart energy power meter is designed to help you identify the major sources of electricity usage and prevent unwanted energy leaks. This energy meter works both, with an individual asset or an entire building, doesn’t need any cloud, MQTT protocol onboard, can be used with Home Assistant and it’s useful energy management dashboard.": "Você já se perguntou o que consome mais eletricidade em sua casa? Nosso medidor de energia inteligente foi projetado para ajudá-lo a identificar as principais fontes de consumo de eletricidade e evitar vazamentos indesejados de energia. Esse medidor de energia funciona tanto com um ativo individual quanto com um prédio inteiro, não precisa de nuvem, tem protocolo MQTT embarcado, pode ser usado com o Home Assistant e possui um painel de gerenciamento de energia útil.",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Unindo tecnologias Web3 e estruturas robóticas",
  "Playing with Human-Machine Interaction through Ethereum": "Brincando com a interação humano-máquina através do Ethereum",
  "We are an autonomous team with extensive expertise in robotics, blockchain, and IoT. Having a deep understanding of the challenges faced by advanced smart home users, we've chosen to venture into manufacturing our own devices. Take control of your home, save energy, and liberate yourself from corporate clouds and device limitations with us!": "Somos uma equipe autônoma com ampla experiência em robótica, blockchain e IoT. Compreendendo profundamente os desafios enfrentados pelos usuários avançados de casas inteligentes, optamos por nos aventurar na fabricação de nossos próprios dispositivos. Assuma o controle da sua casa, economize energia e liberte-se das nuvens corporativas e das limitações dos dispositivos conosco!",
  "Following the Multichain crash, we are awaiting the implementation of native bridges within Polkadot to connect Polkadot XRT with Ethereum.": "Após a queda do Multichain, estamos aguardando a implementação de pontes nativas dentro do Polkadot para conectar o Polkadot XRT com o Ethereum.",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Esta informação de estudo expirou. Para aulas e workshops atualizados, visite nossa",
  "academy": "academia",
  "Free worldwide shipping starts from February 2024": "O envio gratuito em todo o mundo começa em fevereiro de 2024",
  "Free worldwide shipping starts from January 2024": "O envio gratuito em todo o mundo começa em janeiro de 2024",
  "Home Assistant themes": "Temas do Home Assistant",
  "Home assistant themes": "Temas do Home Assistant",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Personalize o seu Home Assistant com os nossos temas gratuitos para usar. Siga as instruções de instalação em",
  "It's gonna get worse": "Vai piorar",
  "DIY": "Faça você mesmo",
  "your own safe": "o seu próprio seguro",
  "smart space": "espaço inteligente",
  "manifest": "manifesto",
  "Have you ever wondered why, in the process of evolution on Earth, the human species prevailed instead of, for example, fungi? Even now, it's challenging to provide a definitive answer to this question. The success of Homo sapiens is often attributed to successful cooperation, but then why not bees or ants? Our survival is also owed to a crucial characteristic—the autonomy of an individual within the population. In other words, the ability not to unquestionably submit to the queen bee. Ultimately, the group where each member has the right to be independent prevails.": "Você já se perguntou por que, no processo de evolução na Terra, a espécie humana prevaleceu em vez de, por exemplo, fungos? Mesmo agora, é desafiador fornecer uma resposta definitiva para essa pergunta. O sucesso do Homo sapiens é frequentemente atribuído à cooperação bem-sucedida, mas então por que não abelhas ou formigas? Nossa sobrevivência também se deve a uma característica crucial - a autonomia de um indivíduo dentro da população. Em outras palavras, a capacidade de não se submeter inquestionavelmente à rainha abelha. No final, o grupo em que cada membro tem o direito de ser independente prevalece.",
  "Unfortunately, those who proclaim themselves arbiters of human destinies rarely contemplate the true laws of nature. Politicians and major corporations engage in strategic games, where the populace is treated as mere units. This dynamic existed before the advent of computer games and has persisted since: 'buying units,' 'building units,' 'removing units'—throughout history, various ruling structures around the world have resorted to such dehumanizing terms when dealing with other people. However, almost invariably, to commit crimes against humanity, these rulers require enforcers, who, in turn, have their subordinates. Therefore, over the last 200 years, such stark dystopias in the vein of the book '1984' typically endure for no more than one or two generations.": "Infelizmente, aqueles que se proclamam árbitros dos destinos humanos raramente contemplam as verdadeiras leis da natureza. Políticos e grandes corporações se envolvem em jogos estratégicos, onde a população é tratada como meras unidades. Essa dinâmica existia antes do surgimento dos jogos de computador e persiste desde então: 'comprando unidades', 'construindo unidades', 'removendo unidades' - ao longo da história, várias estruturas de governo ao redor do mundo recorreram a termos desumanizantes ao lidar com outras pessoas. No entanto, quase invariavelmente, para cometer crimes contra a humanidade, esses governantes precisam de executores, que, por sua vez, têm seus subordinados. Portanto, nos últimos 200 anos, tais distopias acentuadas no estilo do livro '1984' geralmente duram no máximo uma ou duas gerações.",
  "This is exactly where we are all heading now. And this could be just the beginning of a widespread nightmare that will quietly embed itself in the lives of many modern people in a twisted way.": "É exatamente para onde estamos todos indo agora. E isso pode ser apenas o começo de um pesadelo generalizado que se infiltrará silenciosamente na vida de muitas pessoas modernas de maneira distorcida.",
  "We, the Robonomics team, aim to redirect the development of IoT towards a more open and secure path. We've": "Nós, a equipe da Robonomics, temos como objetivo redirecionar o desenvolvimento da IoT para um caminho mais aberto e seguro. Nós temos",
  "an independent web3 cloud for IoT, allowing your home to stay connected autonomously, and communication with the manufacturer's server is only optional. Currently, we have started producing our own": "uma nuvem web3 independente para IoT, permitindo que sua casa permaneça conectada autonomamente, e a comunicação com o servidor do fabricante é apenas opcional. Atualmente, começamos a produzir nossos próprios",
  "IoT devices": "dispositivos IoT",
  "based on open hardware and open software. Our goal is to create a fully open hardware-software system that won't let any digital intruders into your apartment. So, with our innovations, you can enjoy your time in the bedroom as you wish!": "baseados em hardware e software abertos. Nosso objetivo é criar um sistema de hardware-software totalmente aberto que não permita a entrada de invasores digitais em seu apartamento. Portanto, com nossas inovações, você pode desfrutar do seu tempo no quarto como desejar!",
  "introduced": "introduzido",
  "Why human?": "Por que humano?",
  "In the name of free will...": "Em nome do livre arbítrio...",
  "Can IoT be dangerous?": "A IoT pode ser perigosa?",
  "What can unsettle the balance between freedom and subordination is the Internet of Things (IoT). Completely confining people, for example, is no easy task these days. A recent case with the quarantine vividly illustrated this: in Shanghai, exits from homes were sealed, and it was such a disturbing action by the authorities that these measures remained in place for no more than 3 months.": "O que pode perturbar o equilíbrio entre liberdade e subordinação é a Internet das Coisas (IoT). Confinar completamente as pessoas, por exemplo, não é uma tarefa fácil nos dias de hoje. Um caso recente com a quarentena ilustrou vividamente isso: em Xangai, as saídas das casas foram seladas, e essa ação perturbadora pelas autoridades fez com que essas medidas permanecessem em vigor por não mais do que 3 meses.",
  "But what if goals could be achieved without turning to such obvious methods? What if you could ask a major telecommunications company to disable the lock-opening function in all the apartments in the city? What if you could start blocking essential functions in their customers' cars because they haven't paid a subscription or the surveillance policy (gathering necessary metrics) doesn't align with their region's policy on collecting information about citizens": "Mas e se os objetivos pudessem ser alcançados sem recorrer a métodos tão óbvios? E se você pudesse pedir a uma grande empresa de telecomunicações para desativar a função de abertura de fechaduras em todos os apartamentos da cidade? E se você pudesse começar a bloquear funções essenciais nos carros de seus clientes porque eles não pagaram uma assinatura ou a política de vigilância (coleta de métricas necessárias) não está alinhada com a política de sua região sobre a coleta de informações sobre os cidadãos?",
  "What’s the plan?": "Qual é o plano?",
  "Do you want": "Quer",
  "to dive even deeper?": "mergulhar ainda mais fundo?",
  "Our": "Nosso",
  "White Paper": "White Paper",
  "Science": "Ciência",
  "Read books": "Ler livros",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Achamos que ler livros pode realmente abrir sua mente. Sejam ideias simples mas inteligentes ou mais complexas, os livros são a melhor maneira para o seu cérebro absorver tudo. Você pode pegar nossos livros de graça e conferir nossa lista de leituras recomendadas para mergulhar no emocionante mundo da robótica!",
  "Download books about Robonomics": "Baixe livros sobre Robonomics",
  "Open your mind [list of recommendations]": "Abra sua mente [lista de recomendações]",
  "Robonomics R&D": "Robonomics P&D",
  "R&D 18-28": "P&D 18-28",
  "R&D 1-17": "P&D 1-17",
  "Robot economics": "Economia de robôs"
}