{
  "What is Robonomics network?": "Что такое Робономика?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Робономика - это платформа с открытым исходным кодом для приложений Интернета вещей. Мы поддерживаем новое поколение интернет-технологий (Web3), которые реализуют обмен технической и экономической информацией в форме атомарных транзакций между пользовательскими приложениями, сервисами Интернета вещей и сложной робототехникой.",
  "Serverless IoT applications for users": "Бессерверные IoT-приложения пользователей",
  "or": "или",
  "Timeline": "Таймлайн",
  "User (D)App": "Пользовательское (D)App",
  "Function request": "Запрос функции",
  "Report": "Отчет",
  "Control": "Контроль",
  "Log": "Журнал",
  "IoT Device": "Устройство IoT",
  "Decentralized application": "Децентрализованное приложение",
  "Digital twin": "Цифровой двойник",
  "IoT / Smart device": "IoT / Умное устройство",
  "Robonomics tokenomics": "Токеномика Робономики",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "- это утилитарный токен, который позволит контролировать устройства IoT на основе сети Ethereum и парачейна Робономики в экосистеме Polkadot.",
  "Token distribution": "Дистрибуция токена",
  "The task": "Задача",
  "Try our Dapp": "Попробуйте наш Dapp",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "вы можете работать с XRT в блокчейнах, используя инструменты, предоставленные различными независимыми командами в сообществах Polkadot (Kusama) и Ethereum.",
  "Within the Kusama network, you have the capability use": "В рамках сети Kusama у вас есть возможность использовать",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "коммуникацию между парачейном Робономики и другими парачейнами с использованием различных децентрализованных приложений (dApps):",
  "Be aware of scammers": "Остерегайтесь мошенников",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "пожалуйста, используйте только известные рынки для обмена XRT. Не отправляйте свои токены на аккаунты, отправленные вам в личных сообщениях, какую бы транзакцию вы ни хотели совершить (купить или продать токен). Если вы получили какие-либо «громкие заявления» о токене Робономики (мошенники часто используют что-то вроде объявления об airdrop), пожалуйста, проверьте этот сайт (https://robonomics.network/) или наш",
  "for official updates. Be careful, be safe.": "для получения официальных обновлений. Будьте осторожны, будьте в безопасности.",
  "XRT in Ethereum": "XRT в Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реализуя проект 'Робономика' в 2015-2018, команде проекта необходимо было найти связь между обеспечением сетью Робономики полезной функции, а именно запуском IoT-устройств по модели «робот как услуга», и возмещением затрат провайдеров Робономики на комиссию за газ в Ethereum. Нам нужно было подумать о жизненном цикле обязательства каждого отдельного смарт-устройства за выполнение услуги. В результате ранних исследований и разработок в Робономики команда разработала механизм майнинга новых токенов для вознаграждения каждого созданного смарт-контракта формата «робот как услуга». Эта модель остается жизнеспособной для будущего Робономики на Ethereum, но только со значительными улучшениями в Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочтите это, чтобы узнать историю и долгосрочные планы команды на XRT в экосистеме Ethereum.",
  "Etherscan profile": "Etherscan профиль",
  "View token smart contract and transactions in Ethereum network here.": "Посмотреть смарт-контракт токена и транзакции в сети Ethereum можно здесь",
  "Coingecko markets": "Биржи Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Здесь вы можете найти биржи CEX и DEX для торговли XRT.",
  "XRT In Polkadot": "XRT в Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходя от Ethereum к Polkadot, нам нужно «масштабироваться» в токеномике. Парачейны в экосистеме Polkadot не являются эквивалентами смарт-контрактов, а представляют собой полностью программируемый блокчейн, арендующий сегмент всей сети.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактический платеж со стороны парачейнов Polkadot и Kusama — это долгосрочное связывание нативных токенов Relay chain (DOT/KSM) в количестве, достаточном для победы в одном из аукционов. XRT в парачейне Робономики поддерживает обновление слотов и вознаграждения для стейкхолдеров. Механизм сжигания XRT, лежащий в основе активации IoT-подписок, призван снизить инфляцию до минимума, а в случае повышенного интереса до нуля.",
  "Learn more": "Узнайте больше",
  "in Twitter thread from our network architect.": "в твиттер-треде от нашего архитектора сети.",
  "Usage:": "Использование:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можно использовать как для оплаты комиссий за выполнение транзакций в парачейне, так и для покупки IoT-подписки, которая гарантирует приоритетную обработку IoT-транзакций устройств или пользователей.",
  "Rewards:": "Вознаграждения:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "В течение года парачейн выпускает небольшое количество XRT, чтобы стимулировать коллаторов парачейна.",
  "The parameter of the total reward": "Параметр общего вознаграждения",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для коллаторов за год определяется ончейн-голосованием держателей токенов и может быть изменен путем проведения референдума.",
  "Use XRT": "Используйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купите IoT-подписку в нашем децентрализованном приложении. Управляйте своими умными устройствами через блокчейн без наблюдения какой-либо централизованной корпорацией.",
  "Subscan profile": "Subscan профиль",
  "View token statistics on top of Polkadot ecosystem.": "Просматривайте статистику токенов в экосистеме Polkadot.",
  "Other questions": "Другие вопросы",
  "What is RWS?": "Что такое RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Разрабатывается основная функциональность] Для инженеров команда Core Dev попытается создать различные модели использования Робономики, и первым шагом на этом пути будет запуск токена пожизненной подписки — токена RWS. Каждый токен RWS дает вам 1 транзакцию в секунду (tps) с/на ваше IoT-устройство через парачейн Робономики. Активируйте свой токен RWS и совершайте транзакции с «бесплатным газом» с предварительным выполнением и предсказуемой задержкой. Деактивируйте токен RWS и обменяйте его на DEX.",
  "What is AIRA/AIR ID?": "Что такое AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT токен был распространен в 2017 году как автономная часть будущей инфраструктуры Робономики на Ethereum. После успешного запуска Робономики над Ethereum в 2019 году токены AIRA были подключены к созданной инфраструктуре проекта через",
  "ambix smart contract": "смарт-контракт ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "который гарантировал автономный и независимый процесс обмена pre-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "токена Робономики — обеспечить работу децентрализованной сети для обслуживания Умных городов и Индустрии 4.0 в инфраструктуре блокчейна. Для достижения этой цели экономика токена должна отражать стимулы для реализации сети.",
  "In addition": "Кроме того",
  "Within the Ethereum network you can use decentralized application powered by the": "В рамках сети Ethereum вы можете использовать децентрализованные приложения, работающие на основе",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Децентрализованное приложение (dapp) работает в рамках Blockchain. Оно имеет открытый исходный код, а его данные хранятся на IPFS и Github. Эти технологии позволяют приложению быть безопасным и прозрачным одновременно. Наши разработчики работают как над созданием приложения Робономики, так и над библиотеками, которые вы можете использовать при создании своего собственного dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Цифровой двойник — это один из инструментов, предоставляемых Robonomics Web Services (RWS). Он действует как цифровая версия реального оборудования и копирует все его технические характеристики. Это позволяет сделать децентрализованное приложение более отзывчивым на команды пользователя.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Вы можете использовать Робономику с широким спектром умных устройств Zigbee для автоматизации и управления различными аспектами вашего дома/офиса или использовать ее с робототехникой на основе ROS для более сложных промышленных задач.",
  "Do Androids Dream of Electric Sheep?": "Мечтают ли Андроиды об Электроовцах?",
  "Your email": "Ваш адрес электронной почты",
  "Robonomics nfts": "NFT Робономики",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Здесь мы собрали коллекцию NFT, созданных во время нашего обширного крипто-путешествия, как независимо, так и с великими командами. Эти уникальные токены предлагают проверяемую собственность на блокчейне и являются отличным украшением для вашего блокчейн-аккаунта. Вы можете делать ставки на некоторые из них на аукционе или даже создавать свои собственные уникальные произведения.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Во время нашей первоначальной кампании по сбору средств на Kusama мы приняли решение вознаградить наших крипто-пионеров не только токенами, но и подарить им красочный NFT. Эта карточка имеет большое значение для нас, и если кто-то ее владеет, мы знаем, что он является фантастическим сторонником ценностей Робономики: свободы и децентрализации.",
  "Robonomics crypto girls": "Robonomics Crypto Girls",
  "2. Robonomics crypto girls": "2. Robonomics Crypto Girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Мы рады представить нашу специальную серию цифровых активов - Robonomics Crypto Girls, созданных командой Робономики Art&Science. Каждый NFT в этой коллекции является уникальным графическим представлением технологии, используемой в Робономики или созданной на основе применения Робономики. Наши талантливые художники нарисовали каждую девушку в характерном стиле Робономики. Вы можете выбрать ту, которая вам нравится, или собрать всю серию! Приобретая эти NFT, вы не только добавляете стильное дополнение к своей коллекции, но и поддерживаете нас в продолжении инноваций и реализации децентрализованной связи для роботов. Следите за новыми добавлениями в коллекцию!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. СЕЗОННЫЕ КОЛЛЕКЦИИ NFT",
  "On demand minting": "Минтирование по требованию",
  "SEASONAL SPOT NFT COLLECTIONS": "СЕЗОННЫЕ КОЛЛЕКЦИИ NFT",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Эти сезонные коллекции NFT представляют собой уникальный цифровой актив, который запечатлевает уникальное взаимодействие между пользователем и Spot в парачейне Робономики. Пользователи могут рисовать что угодно в браузере, и робот будет повторять их движения, чтобы создать рисунок, нарисованный от руки. После завершения взаимодействия NFT монтируется на рынке Singular для полкадот-аккаунта пользователя. Теперь любой может взаимодействовать с реальным роботом, находящимся в лаборатории в Калифорнии, чтобы создавать персонализированные и уникальные цифровые активы, которыми можно владеть, покупать и продавать, как и любой другой цифровой актив.",
  "Create your NFT": "Создайте свой NFT",
  "4. automated telescope collection": "4. Коллекция автоматизированных телескопов",
  "automated telescope collection": "Коллекция автоматизированных телескопов",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Находящийся в пустыне Атакама, Чили, физический телескоп может быть доступен через децентрализованное приложение для получения изображений астрономических объектов в реальном времени в глубоком космосе. Любой пользователь с интернет-соединением может получить доступ к нему с помощью токенов $STRGZN, которые можно приобрести в приложении с использованием кредитной карты. Выберите астрономический объект, отправьте команду телескопу сделать снимок и дождитесь монтирования NFT на платформе Singular. Обратите внимание, что приложение доступно только для использования с 23:00 до 6:00 по GMT-3 из-за рабочих часов телескопа.",
  "Try yourself": "Попробуйте сами",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "В сотрудничестве с Polkapets",
  "and": "и",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Как гордый участник экосистемы Polkadot, Робономика приняла участие в Polka Pets World. Вместе с командой Polka Pets мы создали 1200 NFT с уникальной концепцией дизайна, которая демонстрирует нашу основную идею связности. Чтобы воплотить эту идею в жизнь, мы создали персонажа: андроида, специализирующегося на помощи людям взаимодействовать с любой робототехнической сущностью.",
  "6. Mecha Arm Jetpack": "6. Механический реактивный ранец",
  "Mecha Arm Jetpack": "Механический реактивный ранец",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "В 2021 году Робономика начала поддержку добавления палет RMRK в свою среду выполнения, что привело к нативной интеграции с самой передовой логикой NFT в мире. Чтобы отпраздновать этот знаменательный момент, мы запустили специальный совместимый с Kanaria предмет - дочерний NFT, который можно экипировать на птицу Kanaria и который может давать преимущества в метавселенной RMRK.",
  "RMRK Partnerships": "Партнерства RMRK",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Год начался с крупного достижения — Робономика выиграла 20-й аукцион слотов парачейна и",
  "officially became": "официально стала",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "парачейном с ID 2048 в сети Kusama. Функции launch, datalog, DigitalTwin, liability и IoT-подписки стали доступны всем пользователям экосистемы. Чтобы предоставить подробную информацию об этом этапе проекта, команда разработчиков опубликовала первые главы",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Робономика 2.0 на Substrate была выпущена с поддержкой XCM-сообщений, и мы начали открывать HRMP-каналы с другими парачейнами (такими как Crust Shadow и Darwinia), функционал которых нам крайне полезен.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "В то же время мы разблокировали стратегию внедрения нашего протокола на рынок IoT. Наши эксперименты с IoT-оборудованием привели нас к концепции суверенного умного дома, независимого от централизованных поставщиков облачных услуг. Мы разработали свою",
  "integration": "интеграцию",
  "with the Home Assistant automation system, and also designed our own": "с системой автоматизации Home Assistant, а также разработали собственный",
  "IoT gateway": "IoT-шлюз",
  "for connecting smart devices.": "для подключения умных устройств.",
  "We have launched two big initiatives in order to increase community engagement —": "Мы запустили две большие инициативы для повышения вовлеченности сообщества —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Кроме того, осенью был проведен ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "для того чтобы сообщество Робономики могло впервые опробовать наши механизмы управления. Недавно команда Робономики помогла проекту DAO IPCI получить слот для парачейна, чтобы презентовать сервис по компенсации выбросов углерода для умных зданий.",
  "In 2021, our": "В 2021 году наше",
  "main focus": "основное внимание",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "переключилось на подготовку проекта к использованию IoT-приложений с помощью нашего парачейна в сети Kusama. Была выпущена Робономика 1.0 на Substrate, протестировано подключение датчиков к парачейну с целью отправки их телеметрии, а также разработаны функции цифрового двойника. В середине года мы решили протестировать полный цикл нашей сети и создали собственный релей-чейн под названием",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "в который был интегрирован парачейн Робономики (до миграции в Kusama). Большой фокус был сконцентрирован на получении слота парачейна в Kusama, для чего мы организовали несколько краудлоан-кампаний.",
  "There have been two big changes for the community. First, we launched the": "В сообществе произошли два больших изменения. Во-первых, мы запустили",
  "Robonomics Grant Program": "грантовую программу Робономики",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "которая позволяет проектам в области робототехники, Web3 и IoT получать финансирование для R&D задач. К концу года в программе участвовали четыре активных проекта. Во-вторых, команда запустила",
  "Exodus process": "процесс Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "позволив держателям токенов Ethereum переместить свои токены XRT в парачейн.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Среди коллабораций можно упомянуть примечательное появление Boston Dynamics Spot у MerkleBot, для которого была разработана",
  "rental remote control system": "система аренды удаленного управления роботом",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Также стоит упомянуть о появлении компании Multi-Agent Systems, которая является личным проектом команды инженеров Робономики. Они разработали робота-повара под названием Eisenkoch, который может выпекать вафли для посетителей кофеен.",
  "There came a time when the existing limitations of Ethereum": "В этот период",
  "began to stand out clearly": "стали отчетливо выделяться",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "существующие ограничения сети Ethereum (в частности, плохая масштабируемость, низкая скорость и очень высокая стоимость транзакций). Обновление до ETH2.0 должно было исправить ситуацию, но это обновление неоднократно откладывалось. Мы не хотели покидать сеть Ethereum, но поняли, что в текущей ситуации сложно реализовать наши сценарии применения, и начали искать альтернативную сеть. Этой альтернативой стала сегментированная блокчейн-экосистема Polkadot. Мы начали эксперементировать с фреймворком Substrate, чтобы перенести основные функции Робономики и развернуть собственную тестовую сеть. К концу этого этапа мы развернули наш парачейн в тестовой сети Rococo и начали подготовку к получению слота в сети Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Продолжая изучать IoT-системы, мы определили основной функционал Робономики, который может принести ценность пользователям — функцию децентрализованного облака для IoT. Эта идея легла в основу",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Инфраструктура RWS взяла на себя все функции типичного централизованного облака, но без стандартных проблем глобальной доступности, безопасности и конфиденциальности. Кроме того, мы предложили идею IoT-подписок для парачейна, которая позволяет держателям подписки использовать блокчейн-сеть без необходимости платить комиссию за каждую транзакцию. Первым экспериментом с IoT-подписками стала эмиссия токена RWS, который позволяет его владельцу отправлять 1 транзакцию на блок парачейна. Кроме того, мы начали делать первые шаги по разработке собственного аппаратного набора для управления умными устройствами (концепция DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Разумеется, поддержка Робономики на Ethereum не прекратилась. Коммуникационный стек Робономики был доработан до версии",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Токен XRT начал торговаться на нескольких биржах (в частности, Uniswap DEX), а также была запущена программа поддержки ликвидности.",
  "The team actively developed ways to interact with the community. The first version of our": "Команда активно разрабатывала способы взаимодействия с сообществом. Была запущена первая версия нашего",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "и Robonomics Wiki. Для более прозрачного и удобного управления проектами мы начали использовать ",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "В 2019 году мы провели",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "для новичков в проекте.",
  "Robonomics became the foundation for the": "Робономики стала основой для проекта",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "разрабатывающего систему умного лизинга роботизированного оборудования.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Мы понимали, что автономным агентам нужна среда, обеспечивающая их надежную техническую и экономическую деятельность. Несколько лет мы разрабатывали протокол для создания децентрализованной сети провайдеров, которые помогают роботам-агентам предоставлять свои услуги. Были разработаны инструменты для обслуживания сети и коммуникационный стек между Ethereum и ROS. В 2018 году мы опубликовали",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "после чего была запущена альфа-версия сети Робономики в Ethereum. Мы продолжили активную подготовку к генерации токенов XRT (которая в итоге задержалась до весны 2019 года из-за первой криптозимы).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "С этого периода Робономика начала динамично разрабатывать сценарии применения, связанные с Индустрией 4.0 — умные фабрики, умные города и умные дома — и это привлекло наше пристальное внимание к миру Интернета вещей. В поисках инноваций команда представила несколько крупных и уникальных R&D демонстраций: гражданская",
  "sensor network": "сеть датчиков",
  "a water drone": "водный дрон",
  "for environmental monitoring (supported by a sensor systems manufacturer": "для мониторинга окружающей среды (при поддержке производителя сенсорных систем",
  "a smart factory model": "модель умной фабрики",
  "a self-employed": "зарабатывающий независимо от человека",
  "robot artist Gaka-chu": "робот-художник Gaka-chu",
  "and a": "и",
  "drone traffic management system": "система управления трафиком дронов",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Робономика начала сотрудничество с проектом DAO IPCI по управлению экологическими активами с использованием технологий Web3 и IoT-устройств.",
  "Important news &amp; announcements": "Важные новости и объявления",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Это был период активной R&D деятельности, в ходе которой мы определили круг задач, в которых P2P-технологии обладают возможностями, недоступными ранее для робототехники. Объединив компьютер Ethereum, файловое хранилище IPFS и Robot Operating System (ROS), мы поняли, что любое устройство потенциально может стать",
  "autonomous intelligent robot agent": "автономным умным роботом-агентом",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "В свою очередь, это открыло нам путь к концепциям Robot-as-a-Service и экономики роботов.",
  "Our publications in scientific journals of this period are available in the": "Наши публикации в научных журналах этого периода доступны в разделе",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Все R&D проекты за эти годы доступны в ",
  "a handy book": "удобной книге",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Все началось с идеи, которая пришла в голову основателям проекта, когда Ethereum только запустил свою основную сеть. Что если робот будет выполнять работу для клиента за криптовалюту, а его логика управляется смарт-контрактом?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Чтобы проверить идею, мы сделали демонстрацию, в которой дрон, управляемый компьютером Ethereum, запускался для достижения заданных GPS-координат после того, как пользователь совершил платежную транзакцию.",
  "The demo is available on": "Демо доступно на",
  "YouTube": "YouTube",
  "Notable events": "Примечательные события",
  "Robonomics whitepaper 2022 welcome guide": "Гайд по White Paper 2022 Робономики",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Мы разработали протокол техникоэкономической коммуникации машин, работающий поверх Ethereum и IPFS, и дополнили его элементами облачной IoT-платформы на базе парачейна Polkadot. Сегодня мы имеем гибридную платформу для создания футуристичных IoT-приложений. Она обеспечивает взаимодействие с устройствами, находящимися под управлением мирового децентрализованного компьютера. Прежде чем использовать платформу 'Робономика', погрузимся немного в теорию.",
  "Chapter 1.": "Глава 1.",
  "At the intersection of cybernetics and economics": "На стыке кибернетики и экономики",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Мы представили экономическую систему, в которой робототехнические устройства выступают как независимые агенты, способные к выполнению ключевых экономических активностей, ранее присущих только человеку. В этой главе мы осветим актуальность появления экономики роботов, которая в будущем может стать важной частью жизни людей и изменить текущий уровень экономики в полностью автоматизированные сервисы.",
  "In this chapter you will learn": "В этой главе вы узнаете\r \r",
  "Ronald Coase and The Nature of the Firm": "Рональд Коуз и природа фирмы\r \r",
  "CPS - cyber-physical system": "КФС – кибер-физическая система\r \r",
  "Norbert Wiener and the search for patterns in living and machine": "Норберт Винер и поиск закономерностей в живом и машинном\r \r",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Четвёртая промышленная революция, деньги для роботов и Bitcoin\r \r",
  "Ethereum Smart Contracts": "Умные контракты Ethereum\r \r",
  "Polkadot Parachains": "Парачейны Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Открытые вопросы телеологии и работа Мизеса",
  "Read chapter 1": "Читать главу 1",
  "Chapter 2.": "Глава 2.",
  "Robonomics architecture": "Архитектура Робономики",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Во 2 главе вы узнаете о взаимодействии людей и машин с использованием современных интернет-технологий – от IoT-устройств к децентрализованной и глобально доступной сети провайдеров. Мы осветим основы Интернета вещей, чтобы выделить проблематику и ключевые вызовы, с которыми сталкиваются создатели IoT-систем и на решение которых направлена Робономика.",
  "Overview of the state of the Internet of Things (IoT)": "Обзор состояния Интернета вещей",
  "Classification of IoT devices": "Классификация IoT-устройств\r",
  "Embedded IoT systems": "Встраиваемые IoT-системы\r",
  "Edge-systems: IoT gateways and controllers": "Edge-системы: IoT-шлюзы и контроллеры\r",
  "Autonomous Systems": "Автономные системы\r",
  "Internet of Things providers": "Провайдеры Интернета вещей\r",
  "Digital twins are the heart of the Internet of Things": "Цифровые двойники — сердце Интернета вещей\r",
  "IoT data flows in cloud service": "Потоки IoT-данных в облачных сервисах\r\r",
  "Popular examples of IoT solutions": "Популярные примеры IoT-решений\r\r",
  "Current problems of building IoT solutions": "Актуальные проблемы построения IoT-решений\r\r",
  "Main tasks of Robonomics architecture": "Основные задачи архитектуры Робономики",
  "Basic components of Robonomics architecture": "Базовые компоненты архитектуры Робономики\r\r",
  "A simple representation of Robonomics architecture": "Простое представление архитектуры Робономики",
  "Read chapter 2": "Читать главу 2",
  "We continue to update the white paper of Robonomics": "Мы продолжаем дополнять белую бумагу Робономики,",
  "stay tuned for new parts on our website and in Discord": "следите за выходом новых частей на сайте и в Discord",
  "Join our discord": "Присоединяйтесь к нашему discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Далее мы перейдем практической части взаимодействия людей и машин с использованием современных интернет-технологий. Мы будем двигаться от привычной для IoT-устройств архитектуры обмена технической информацией с помощью облачных сервисов к организации технико-экономического взаимодействия с помощью децентрализованной, глобально доступной сети провайдеров.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Для начала нужно сделать экскурс в область, которая наиболее явно связана с сетевым подключением автоматизированных систем. Далее мы рассмотрим основы Интернета вещей, чтобы выделить проблематику и основные вызовы, с которыми сталкиваются создатели IoT-систем и на решение которых направлена Робономика.",
  "Overview of the state of the internet of things (IoT)": "Обзор состояния интернета вещей (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Вопрос сетевой доступности автоматических устройств обсуждался по всей планете начиная с 60-х годов, причём уже в то время были предприняты довольно серьезные попытки для его решения. К примеру, советский кибернетик Виктор Глушков предложил и частично реализовал автоматизиро- ванный сбор информации об объемах производства отдельного завода в рамках проектирования национальной информационной системы",
  "OGAS": "ОГАС",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "в 60-70-х годах. Широко известно, как 1980-ых торго- вый автомат Coca-Cola подключили к ARPANET, чтобы автомат мог сообщать о наличии напитков и их температуре.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Но всё же фактическое развитие IoT происходит именно сегодня, из-за широкого распространения опорных (enabling) технологий. Основными драйверами стремительной эволюции приложений Интернета вещей (домашняя автоматизация, smart grid, удаленные мониторинг здоровья, экологический мониторинг и т.д.) называют результаты развития многих областей – от беспроводных коммуникаций различной дальности и встраиваемых устройств до облачной аналитики и машинного обучения. Количество IoT-устройств неуклонно растет на протяжении последних 10 лет (с прогнозом в 25 млрд единиц к 2030 году), и это подстегивает исследователей и разработчиков создавать новые IoT-приложения в различных сферах: здравоохранение, домашняя автоматизация, агропромышленность, охрана экологии.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Нам же более интересен процесс построения IoT-систем и возникающие при этом задачи. За годы исследований было предложено множество различных архитектур, и, усредняя их, можно выделить три базовых компонента IoT-системы: непосредственно устройства, сетевая инфраструктура, аналитические, вычислительные и управляющие машины.",
  "New challenges": "Новые вызовы",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Еще одной новейшей задачей для построения IoT стала концепция цифрового двойника — цифровой версий реального оборудования, которая копирует его технические характеристики и исторические данные. Эта концепция в наилучшей степени проявляет себя в тех сферах, где необходимо иметь точную и полную спецификацию какого-либо процесса и уметь прогнозировать его развитие. Интернет вещей выступает как основной интегратор цифровых двойников, однако эта задача куда более глубокая, чем обычное подключение IoT-устройств.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Прямо сейчас на наших глазах происходит становление целого сегмента сети, спроектированного и удобного не для людей, а для машин. Интернет вещей — это уже не просто механика подключения устройства к сети, но больше сервисы и службы, созданные и доступные именно устройствам. Интернет вещей не только связывает пользователя и устройство, но и помогает устройствам справляться с задачами по оказанию услуги для человека, но автономно от него.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Такие системы не имеют пользовательских интерфейсов. Как правило, эти устройства используются на самом низком уровне IoT-экосистемы, обеспечивая базовые функции. Они должны быть энергоэффективными и небольшими, поэтому вычислительные и коммуникационные ресурсы сильно ограничены. Сигналы могут передаваться через Wi-Fi, Bluetooth или по радиочастотам, а приемником сигналов обычно выступают IoT-шлюзы или контроллеры.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Эти системы выступают связующим звуном между локально доступными встраиваемыми системами и глобальной сетью Интернет. Обычно они выполняют задачу по поддержке нескольких протоколов коммуникации встраиваемых систем и передают телеметрию от устройств в облако, а управляющие сигналы в обратном направлении. Зачастую эти стройства представляют собой более сложную версию WiFi-машрутизатора, оснащённого одноплатным компьютером, за счёт чего производится первичная обработка информации от устройств без вывода за пределы локальной сети.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "К этому классу относятся сложные автоматы (такие как Spot от Boston Dynamics), имеющие управляющий компонент на уровне полноценного компьютера с высо- копроизводительным процессором и большим объемом памяти. В таких случаях робот подключается к сети Интернет без дополнительных промежуточных решений (edge-систем). Необходимое программное обеспечение для доступа к Интернету вещей устанавливается напрямую на компьютер автономной системы. Данные собираются и частично обрабатываются локально, затем транслируются в сеть Интернет аналогично любому полноценному сетевому устройству.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Основная работа IoT провайдеров состоит в обеспечении удалённого доступа к данным и их аналитике, а также обеспечение управления умными устройствами через сеть Интернет. Основным критерием качества провайдера для пользователя выступает безопасность функционирования, стабильность подключения и доступность провайдера из любой точки мира.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Стандартная схема работы с провайдером Интернета вещей включает, установку программного обеспечения на умное устройство, совместимого с облаком; настройку управляющих сервисов на стороне облака после первого успешного подключения устройства; подключение различного вида аналитических сервисов.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Говоря про цифровые двойники, нужно отметить, что архитектурно их внедрение требуется как отказ в предоставлении пользователю прямого доступа к управлению устройствами и изменению их состояний. Из наиболее явных причин для отказа можно назвать, во-первых, наличие собственных требований и условий у устройств непосредственно перед запуском. Во-вторых, если множество пользовательских устройств должны обращаться к одному источнику данных, то давать персонализированное управление каждому пользователю может быть критично. И в-третьих, в случае выхода устройства из рабочего состояния крайне полезно сохранять доступ- ным его последнее актуальное состояние.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Прямо сейчас на наших глазах происходит становление целого сегмента сети, спроектированного и удобного не для людей, а для машин. Интернет вещей — это уже не просто механика подключения устройства к сети, но больше сервисы и службы, созданные и доступные именно устройствам. Интернет вещей не только связывает пользователя и устройство, но и помогает устройствам справляться с задачами по оказанию услуги для человека, но автономно от него.",
  "IoT data flows in cloud services": "Потоки IoT-данных в облачных сервисах",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Входные значения для облачных триггеров. Например, в случае получения сообщения от датчика сигнализации автомобиля об ударе облачный сервис отправляет различные уведомления пользователю.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Выходные данные для сложной аналитики, которую нельзя произвести на edge-уровне. Например, при обработке видео для распознавания лиц в толпе.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Основа для формирования цифрового двойника устройства с целью создания слепка его состояния. Например, по запросу пользователя в мобильном приложение или на сайте.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Типичная система умного дома предоставляет широкие возможности по управлению вашим жилым помещением. С ее помощью можно удаленно управлять дверными замками, настроив разовый или регулярный доступ в помещение как родных и друзей, так и обслуживающий персонал. С помощью многочисленных датчиков и регистрирующих устройств, система умеет включать запись видео при триггере датчиков движения, автономно принимать решения о перекрытии подачи воды при обнаружении протечек в системе водоснабжения, запускать по расписанию робота-пылесоса, предоставляя отчет об уборке в пользовательское приложение, изменять температуру в помещении до оптимального значения в зависимости от вашего расписания.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Умные автомобили. Обеспечив бортовой электронике автомобиля доступ к мобильному интернету, пользователь получает доступ к удаленному управлению различными функциями авто прямо со своего смартфона: открытие дверей, включение кондиционера, управление фарами. Если подобные автомобили используются для каршеринга, то для клиентов этого сервиса можно создать интерактивную карту расположения автомобилей с указанием их статуса, отстатков топлива, и т. д.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": " Система умного лизинга оборудования. Предприятие устанавливает роботов-манипуляторов на конвейерную линию по договору с оплатой за количество операций или за время работы робота. Манипуляторы регулярно предоставляют лог выполненных операций, ошибок и предупреждений, на основании чего обеспечивается расчет суммы оплаты за лизинг, а также предиктивное обслуживание роботов вендором.",
  "Global availability": "Глобальная доступность",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Стандартная клиент-серверная архитектура требует указания конечных точек при маршрутизации сообщений от IoT-устройств. Тем самым в процессе жизни умного устройства отсутствие соединения будет означать ограничение возможностей управления и взаимодействия с устройством.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Например, торговая война между Китаем и США уже сегодня висит дамокловым мечом над тысячами потребителей китайской умной техники в США и наоборот. В любой момент блокировка серверов Xiaomi властями США может сказаться на пользователях устройств, подключаемых к облачным сервисам производителя.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Находясь в непосредственной близости от IoT-устройства, вы не сможете им управлять из мобильного приложения, если отсутствует соединение с серверами, через которые обеспечивается аутентификация пользователей и сбор телеметрии от самих устройств. Т.е. фактически устройством управляет облако, а не пользователь.",
  "Cybersecurity": "Кибербезопасность",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Наиболее важная причина низкой кибербезопасности большинства IoT-решений произрастает из проблемного наследия облачной клиент-серверной архитектуры. Например, сейчас наиболее распространенная архитектура умного дома — это, как правило, IoT-хаб, подключенный к облачному сервису. Таким образом, типичная IoT-система представляет собой центральный контролирующий элемент, подключенный к множеству внешних систем. Безусловно, облачный сервис более защищен, чем низкоуровневые устройства, однако из-за укрупнения централизованного контроля за сотнями тысяч таких систем любые бреши в безопасности и утечки становятся масштабной катастрофой.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Сервера облачного сервиса подвержены всем типичным проблемам кибербезопасности: сетевые атаки, DoS-атаки (доведение системы до отказа), вредоносные модификации, захват пользовательских сессий, ит.д. Но к сильным угрозам также добавляются и непреднамеренные проблемы, такие как ошибки при проектировании, неправильное использование или стихийные бедствия, приводящие к поломкам серверов. И еще один, безусловно, важный пункт — необходимость в принципе доверять облаку и обслуживающим его сотрудникам.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Все это усугубляется масштабом IoT-решений. Количество IoT-устройств, принадлежащих одной системе, может превышать сотни и тысячи, и при этом по своей природе IoT-устройства обладают меньшими вычислительными возможностями, что значительно затрудняет развертывание фаерволов и антивирусов для них. Но самым губительным фактором выступает то, что IoT-устройства являются действующими КФС, поэтому угрозы кибербезопасности проявляются уже и на физическом уровне.",
  "Data privacy": "Приватность данных",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Пункт с приватностью нужно выделить отдельно от кибербезопасности, потому что эта проблема имеет особый характер для IoT-систем. Из-за множества самых разнообразных устройств, которые гораздо сильнее интегрированы в физический мир, чем просто компьютеры и смартфоны, спектр приватных данных многократно увеличивается. Это уже не только GPS-локация, записи о покупках, финансовые транзакции и фото, но и постоянная запись видео и разговоров, голосовой отпечаток, состояние здоровья и даже список привычек человека. Среди типов угроз, связанных с приватностью, можно привести: локализация и слежение, профилирование, inventory attack (сбор данных для последующего профилирования), линковка данных",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "Но наиболее жуткая часть заключается в том, что пользователи практически не осознают, что отказываются от своей конфиденциальности, потому что практически не имеют понятия о том, какие данные собираются и как они используются. Именно из-за этого угроза приватности произрастает не только со стороны злоумышленников, но и со стороны организаций и государственных структур. Для облачных IoT-сервисов, как правило, требуется максимальная передача данных с устройств, а способов запретить или сузить передачу данных нет (“Accept the Terms or Piss Off”). Более того, несмотря на то, что данные являются ассетом и имеют ценность, их владельцу не предоставляется не только право активно распоряжаться ими, но и даже какая-либо компенсация за их сбор и использование.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Опираясь на достижения и проблемы облачных платформ, Робономика ставит своей задачей предложить IoT-рынку более безопасные и продвинутые интернет-решения на каждом этапе коммуникации человека и машины. Ниже приводятся основные задачи, на которые нацелена Робономика:",
  "Managing an IoT device using a decentralized cloud": "Управление iot-устройством с помощью децентрализованного облака",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Блокчейн сети обладают всеми возможностями для обеспечения наивысшей степени безопасности запуска устройства и получения его телеметрии. Взаимодействие с устройством фактически можно описать изменением состояния цифрового двойника, хранящегося в блокчейн сети, и отправкой информации об этих изменениях. В случаи использования permissionless blockchain мы можем говорить о гарантиях глобальной доступности провайдеров для IoT, а также высоком уровне защиты данных цифрового двойника от нежелательных изменений.",
  "Performing technical and economic transaction between people and machines": "Выполнение технико-экономических транзакции между людьми и машинами\n",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Благодаря механизму криптовалют и умных контрактов мы можем обеспечить доступ автоматических систем напрямую к цифровым рынкам. Например, в Ethereum уже реализовано большинство базовых инструментов экономической деятельности, которые можно использовать в работе автономных устройств. Приложения, создаваемые для взаимодействия конечного пользователя и IoT-устройства, будут намного эффективнее, если условия оказания услуги и оплата за нее будут неразрывны с параметрами запуска устройства.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Современные достижения из области Web3-технологий могут решить вопрос приватности пользователей. Благодаря Web3 нет необходимости производить аутентификацию или требовать подключения к конкретным серверам для доступа к телеметрии и управления устройством.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Робономика — это децентрализованное облако для цифровых двойников IoT-устройств. Робономика поддерживает технико-экономический формат коммуникации, а также обеспечение приватных приложений для пользователей.",
  "A human interface to access the system": "Интерфейс человека для доступа к системе",
  "A communication protocol": "Протокол коммуникации",
  "A machine interface": "Интерфейс машины",
  "Human interface": "Интерфейс человека",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Мы предлагаем использовать децентрализованные приложения (dapp, сокр. от decentralized applications) в качестве основного способа подключения пользователей к управлению умными устройствами через сеть Интернет. Таким образом, мы сможем предоставить наиболее безопасный (с точки зрения данных) пользовательский интерфейс в систему, который сможет одновременно работать как в условиях локальной городской сети, так и через общую глобальную сеть.",
  "Communication protocol": "Протокол коммуникации",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Его роль выполняет сеть Робономика — спецификация, разработанная командой проекта, реализует децентрализованную сеть провайдеров, которые обеспечивают передачу, обработку и хранение информации необходимой для запуска IoT-устройств. Фактически, является реализацией специфичного по своим функциям узла для сетей IPFS, Ethereum, Polkadot.",
  "Machine interface": "Интерфейс машины",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Ниже представлена общая схема полного цикла запуска устройства с помощью платформы Робономики:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "Пользовательское децентрализованное приложение отправляет запрос на выполнение функции по управлению устройством через сеть Робономика.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "Сеть Робономика обеспечивает транслирование запроса с помощью libP2P и фиксирует события в Ethereum blockchain или Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Контроль за устройством обеспечивается децентрализованной сетью, которая гарантированно хранит необходимую информацию для запуска IoT-устройства.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "IoT-устройство самостоятельно получает информацию из сетей Ethereum и Polkadot о текущем состоянии цифрового двойника. Благодаря этому гарантируется безопасный запуск устройства только после поселения технических и экономических параметров запуска.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "В результате работы IoT-устройство публикует лог выполненных операций, который может использоваться в качестве доказательства оказанной услуги или для отладки ошибок.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Лог трансформируется в отчет для пользователя и становится доступен в его dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Создание децентрализованных приложений и веб-сервисов для Интернета вещей на парачейне Робономики",
  "Sergei Lonshakov, software architect": "Сергей Лоншаков, архитектор ПО",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Давайте вспомним, что робот - это точный экономический эквивалент рабского труда. Любой труд, конкурирующий с рабским, должен принять экономические последствия рабского труда.",
  "Norbert Wiener": "Норберт Винер",
  "cybernetics": "кибернетика",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Сегодня роботы похожи на повзрослевших детей - они уже могут управлять деньгами, вступать в правоотношения, быть независимыми.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Будущее человечества зависит от того, как мы научим роботов управлять своими возможностями.",
  "Robonomics tools": "Инструменты Робономики",
  "Operate with digital twins of IoT devices": "Работа с цифровыми двойниками IoT-устройств",
  "The first tools of the robot economy: money for robots, contracts for robots": "Первые инструменты экономики роботов: деньги и контракты для роботов",
  "Software for connecting devices to a decentralized cloud": "ПО для подключения устройств к децентрализованному облаку",
  "API library for custom IoT applications": "Библиотека API для пользовательских приложений Интернета вещей",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Робономика содержит полный набор инструментов для разработки приложений Интернета вещей, как для робототехники, так и для пользовательского интерфейса. Связь между пользователем и устройством происходит с использованием самых успешных технологий из мира Web3 - IPFS, Ethereum и Polkadot. Таким образом, разработчики могут создавать современные и безопасные приложения для умных городов и Индустрии 4.0.",
  "Robonomics Connectivity": "Совместимость Робономики",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Для удобства разработчиков Робономика содержит набор ПО для подключения: устройств Интернета вещей, использующих протокол HTTP/MQTT, сложных роботизированных систем, использующих операционную систему роботов (ROS).",
  "Connect a sensor": "Подключите сенсор",
  "to the Robonomics network": "к сети Робономики",
  "Try": "Попробуйте",
  "a simple prototyping tool": "простой инструмент для создания прототипов",
  "Start building your own cyber physical system with": "Начните строить свою кибер-физическую систему с",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Робономика поддерживает сотни роботов из коробки",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Пользователи платформы могут подключить роботов, совместимых с ROS, к цифровой экономике за считанные минуты. Чтобы увидеть полный список поддерживаемых роботов, перейдите по ссылке",
  "Decentralized Cloud infrastructure for IoT": "Децентрализованная структура облака для Интернета вещей",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) - это базовый инфраструктурный сервис для робототехники и Интернета вещей на основе парачейна Робономики и IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "dapp Робономики",
  "economy of robots": "экономика роботов",
  "Core RWS features available for IoT today": "Основные функции RWS, доступные для Интернета вещей сегодня",
  "RWS PubSub Message Broker": "Брокер сообщений RWS PubSub",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Используйте неограниченный обмен сообщениями по сети P2P на основе протокола IPFS",
  "RWS Data Blockchainization Service": "Сервис RWS для блокчейнизации данных",
  "RWS Robot Actions": "Действия роботов с RWS",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Запускайте и останавливайте свои IoT-устройства под управлением децентрализованного компьютера",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Сердце вашего IoT-приложения - цифровой двойник на блокчейне",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "В технической архитектуре цифровые IoT-двойники обеспечивают видимость и мониторинг вещей и связанных с ними событий (например, с помощью IoT-устройств для автоматического определения происхождения продукта), а блокчейн позволяет поделиться единой версией истины о состоянии этих вещей на протяжении их жизненных циклов и связанных с ними бизнес-событий",
  "from Gartner research": "из исследования Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Парачейн Робономики дает возможность создать модель цифрового двойника и обновлять ее состояние каждые 6 секунд.",
  "Secure": "Безопасные",
  "Serverless": "бессерверные",
  "Futuristic": "футуристические ",
  "IoT applications": "IoT-приложения",
  "Robonomics network vision": "Концепция сети Робономика",
  "At the frontier of cybernetics and economics": "На стыке кибернетики и экономики",
  "Build your IoT services on Robonomics platform": "Постройте свои iot-сервисы на платформе Робономика,",
  "taking full advantage of decentralized architecture": "получая все преимущества децентрализованной архитектуры",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Робономика позволяет подключать пользователей к умным устройствам с помощьюдецентрализованных приложений (dapp), которые не требуют передачи пользовательскихданных для аутентификации. Коммуникация происходит через децентрализованную сетьпровайдеров без единой точки отказа, а устройство самостоятельно получает информациюиз блокчейн-сети для запуска на исполнение или передачи данных удалённо. Такимобразом, Робономика обеспечивает высокий уровень кибербезопасности устройств иприватности данных пользователей на всех этапах коммуникации от пользовательскогоприложения до запуска умного устройства.",
  "From smart contracts to cross chain IoT platform": "От смарт-контрактов до межсетевой iot-платформы",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Проекту Робономика уже более 6 лет. Готовиться к проведению первого эксперимента,демонстрирующего коммуникацию людей и машин с использованием независимой децентрализованнойсетипровайдеров, мы начали в 2015 году - с первых дней существования сети Ethereum.К началу 2021 года команде проекта удалось создать протокол технико-экономическойкоммуникации машин, работающий поверх Ethereum и IPFS, и дополнить его элементамиоблачной IoT-платформы на базе парачейна Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "В итоге, уже сегодня мы имеем гибридную платформу для создания футуристичныхIoT-приложений, обеспечивающих взаимодействие с устройствами, находящимися подконтролем мирового децентрализованного компьютера.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Создатели Робономики - экспериментаторы, инженеры и ученые, которым важно разобратьсяв научной обоснованности подхода и достигнуть ясности в представлении принципов,которые должны быть положены в основу всей архитектуры программного решения.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "В своих статьях в период с 2017 по 2020 год мы представили научному сообществумножество концепций и решений, объединенных вокруг идеи экономики роботов — экономическойсистемы, в которой робототехнические устройства выступают как независимые агенты,способные к выполнению ключевых экономических активностей, ранее присущих толькочеловеку. С научными статьями вы можете ознакомиться по",
  "this link": "данной ссылке",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "В этой главе мы хотели бы обосновать появление экономики роботов и объяснитьв общих чертах, почему мы считаем, что именно это понятие является неизбежными явным ответом на вопрос функционирования крупномасштабных роботизированных системновой промышленной революции.",
  "Move towards the factory of the future": "Путь к заводу будущего",
  "Inspired by Ronald Coase": "Вдохновлённый Роландом Коузом",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Нобелевский лауреат по экономике Рональд Коуз в своей работе 1937 года “TheNature of the Firm”лучше всего продемонстрировал дихотомию “иерархия vs свободный рынок” и дал объяснениепричин существования организаций, в частности фирм. Коуз рассуждает о влияниитранзакционных издержек (издержек на сбор и обработку информации) на принятиерешений о заключении контракта и на контроль его выполнения. Фирма со всей своейиерархической внерыночной структурой образуется как наиболее эффективный способпредоставить потребителю целевой продукт с наименьшими транзакционными издержкамив тот момент, когда транзакционные усилия по созданию того же продукта путем множестваобменных операций на рынке между индивидами становятся значительно выше. Чтобылучше всего представить себе этот процесс, посмотрите на показательный примерс покупкой автомобиля. Попробуйте купить автомобиль по запчастям и посчитайте,сколько средств и времени вы потратите, чтобы просто собрать все комплектующиев своём гараже. Риски и издержки на переговоры при покупке деталей слишком высокипо сравнению с готовым к употреблению Model X от фирмы Tesla. ",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Тем не менее, это не приводит к возникновению единственной в мире фирмы попроизводству всего.Все дело в том, что те же транзакционные издержки накладывают ограничения и наразмер фирм. Коуз пишет:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "«...фирма будет стремиться к расширению до тех пор, пока затраты на организациюдополнительной сделки внутри фирмы не сравняются с затратами на проведение тойже сделки посредством обмена на открытом рынке...»",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Другими словами, чем сложнее иерархия внутри фирмы, тем больше внутренних издержек,и в какой-то момент они оказываются избыточными по сравнению с издержками привозвращении к рынку. Поэтому, чтобы обеспечить свой рост в качестве одного издрайверов, предприниматели ищут способы уменьшить эти издержки.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Идея снижения транзакционных издержек за счёт возможности всех участников бизнес-процесса(производитсво, логистика, потребление) объединиться на более тесном уровне",
  "clearly correlates": "явно коррелирует",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "с проблемами и задачами, которые стоят перед производителями решений для автоматизации.За последние 50 лет почти полностью были автоматизированы стандартные/регулярныеоперации большинства бизнес-процессов крупных компаний. Перед производителямипо сути осталась задача выстраивания безопасной коммуникации между полностью автоматизированнымиучастками цепочек обеспечения, и данная задача является фактором, сдерживающимдальнейшее уменьшение транзакционных издержек за счёт автоматизации. Стремлениевыпустить на рынок более конкурентную продукцию или услуги по сравнению с частичноавтоматизированными фирмами,",
  "firms spurs the search for solutions to": "подстегивает поиск решения",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "этих задач. И по всей видимости все идет к появлению робофирм — организаций,в которых весь цикл бизнес-процесса полностью автоматизирован и не требует участиялюдей, разве что в качестве бенефициаров и потребителей.",
  "Get rid of transaction costs": "Избавьтесь от транзакционных издержек",
  "Our future in smart cities": "Наше будущее в умных городах",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "У задачи, которая сегодня ставится перед производителями автоматизации, есть конкретное название — построение кибер-физических систем (сокр. КФС). По",
  "definition,": "определению,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "КФС — это прочное объединение и взаимная интеграция множества вычислительных, сетевых и физических процессов.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Задачи по построению КФС являются центральным элементом любой идеи, описываемойв рамках новой (четвёртой) промышленной революции. Поэтому КФС — это краеугольныйкамень нашей будущей жизни в Умных городах, проявляющий себя везде. Кибер-физическиесистемы будущего это: aвтопилотный Uber, дрон-селфи, сеть 3D-принтеров на станцияхметро.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "КФС — это сложная структура множества связанных элементов: от приложения втелефоне она простирается к управлению дроном в полёте над городом, а затем переходитк публикации полученных фото в Instagram, но только после обработки облачным AI.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Самое важное в процессе проектирования КФС — это найти тонкую грань между достаточными избыточным количеством автоматизированных элементов в цепочке обеспечения пользователяуслугами. Другими словами, где предел размера КФС? Для ответа на данный вопроснам стоит обратиться к известному математику Норберту Винеру.",
  "Self-regulating systems": "Саморегулируемые системы",
  "Inspired by Norbert Wiener": "Вдохновленные Норбертом Винером",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Норберт Винер говорит о жизнеспособности междисциплинарного научного подхода.Например, он провел параллели между автоматизированными системами управления ипроблемами масштабирования и усложнения человеческого общества.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Другими словами, кибернетический подход может быть применен в равной степеник психотерапии, биологии и автоматизированной навигации. Он основан на функциисистемы, на том, как контролируются отдельные действия и как отдельные узлы взаимодействуютдруг с другом.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Принимая во внимание публикации Рональда Коуза и Норберта Винера, продолжающиетему развития Индустрии 4.0, мы можем рассмотреть возможность использования КФСв качестве экономического агента при разработке роботизированных услуг. Чтобырегулировать размер КФС и адаптироваться к изменяющимся потребностям людей, мыможем использовать рыночный механизм.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Робофирмы являются идеальными иллюстрациями кибер-физических систем. Они представляютсобой довольно автономные единицы, способные предоставлять услуги как людям, таки другим роботам за деньги. В результате экономика роботов предстает перед намикак общий набор КФС, предоставляющих услуги и товары непосредственно на рынок.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Деньги для роботов",
  "Industry 1.0": "Индустрия 1.0",
  "Mechanization:": "Механизация:",
  "replacement of muscle power with steam energy.": "замена мышечной силы паровой энергией.",
  "1784 y.": "1784 г.",
  "Industry 2.0": "Индустрия 2.0",
  "Electrification:": "Электрификация:",
  "introduction of assembly-line production.": "внедрение конвейерного производства.",
  "1870 y.": "1870 г.",
  "Industry 3.0": "Индустрия 3.0",
  "Automation:": "Автоматизация:",
  "introduction of automated systems with CNC.": "внедрение автоматизированных систем с ЧПУ.",
  "1969 y.": "1969 г.",
  "Industry 4.0": "Индустрия 4.0",
  "Smart production:": "Умное производство:",
  "development of cyber physical systems.": "разработка кибер-физических систем.",
  "Now": "Сейчас",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "В мире робофирм оказывается естественным предоставлять роботам доступ к социальным институтам, которые раньше были нужны только людям.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Социальные институты возникают не потому, что мы люди и физиологически человекне может жить без банков, контрактов и других инструментов общества. Но толькопотому, что человек в какой-то момент времени вступил на путь более сложных отношенийв обществе и сделал важный шаг к ускорению окружающих процессов.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Деньги и контракты должны стать доступными для роботов не потому, что это больнаяфантазия фанатов роботов, забывших, что такое Скайнет. А лишь потому, что новаяпромышленная революция ставит перед собой задачу построения сложных автоматизированныхцепочек, процессы в которых будут затрагивать обмен как технической, так и экономическойинформацией, а также будут протекать с недоступной для человека скоростью.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Роботам нужны деньги, доступные им напрямую, чтобы иметь возможность выполнятьоперации без человека со скоростью, доступной только машинам. И все это исключительнодля того, чтобы человек наслаждался жизнью в Умном городе!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "И вот мы плавно подходим к первой электронной наличности — Bitcoin. Тот факт,что Bitcoin может храниться на вашем счету по принципу не банка, а наличных ввашем кошельке, делает его первыми деньгами, которыми робот может распоряжатьсясамостоятельно, точнее автономно. При этом уже сегодня можно сказать, что Bitcoin— это не просто электронные деньги, а действительно глобальный финансовый институт.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "В итоге: событие, придуманное не нами, но явно относящееся к нашей концепции,делает Bitcoin первыми деньгами для роботов, или, если смотреть еще глубже, именнотем социальным институтом, который поможет формированию роботизированных фирм",
  "Smart contracts": "Смарт-контракты",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin стал первыми деньгами, доступными для роботов. При этом мы не можемговорить о Bitcoin в его нынешнем виде как об инструменте полноценного техническогои экономического обмена.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Сейчас у нас уже есть смарт-контракты, рынки DeFi и децентрализованная инфраструктураобмена сообщениями между роботами, которые открывают перед человечеством возможностьсоздания полностью автоматизированной части человеческой экономики — экономикироботов.",
  "One of the great opportunity to build the economy of robots is": "Одна из прекрасных возможностей построить экономику роботов — это",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "технологии. Благодаря функциональности Ethereum роботы могут не только обменивать деньги, но и заключать контракты с людьми и между собой.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Но в чем смысл взаимодействия между машинами (m2m) на основе контрактов? Этоотличный вопрос! Вернемся к КФС. Когда мы говорим о прямой связи между датчиками,машинным оборудованием или любыми другими элементами, мы все равно говорим о взаимодействиив рамках одной регулируемой системы. Но если мы хотим, чтобы сервисы умного города(а в некоторых случаях даже умного дома) работали, нам необходимо наладить связьс различными сторонними элементами.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Представим себе службу доставки дронами. Если дрон, например, является собственностьюDHL, как он может получить доступ к складам Amazon или доступ ко всему воздушномупространству города? Будет ли это монополией? Это серьезный вызов для многих инициативчетвертой промышленной революции!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Большинство корпораций говорят, что им нужны почти полные права на окружающуюих территорию, потому что они не знают, как безопасно настроить обмен техническойинформацией между автоматизированными системами за пределами их собственной внутреннейкорпоративной структуры. В то же время, если посмотреть на процессы, где работаетчеловек, то мы видим, что сотрудничество разных корпораций давно и успешно существует.Вы легко можете заказать доставку купленных товаров «от двери до двери» на сайтеAmazon, а курьер сможет проехать на автомобиле по дорогам города, получить заказна складе и привезти его к вам.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Какая разница? В первом случае нет возможности построить договорные отношениямежду машинами, а во втором случае в мире людей договорные отношения уже существуют.",
  "Parachains": "Парачейны",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Основная трудность, с которой сегодня сталкивается Робономика — это высокаяцена за запуск IoT-устройства с использованием Ethereum. В Ethereum вы должныплатить комиссию за каждую транзакцию в долларах США в диапазоне от 10 до 100долларов. Это достаточно дорого для большинства случаев из реальной экономики,будь то поездка на каршеринге, аренда шикарной квартиры, доставка дронами или3D-печать любимого аниме-героя на заказ.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Справедливости ради отметим, что есть прибыльные сценарии даже с комиссией затранзакции в сети Ethereum 2018-2019 годов. Например, автоматизированные транзакциикомпенсации углеродного следа или передача заказа с сайта напрямую в производство.Но все же для массового применения технологий Web3 в сфере IoT требуется снижениецены, которую облако взимает с подключенного устройства.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "В поисках возможности снизить стоимость взаимодействия с IoT-устройством разработчики Робономики изучили альтернативные Ethereum разработки. Наш выбор остановился на",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "архитектуре, которая позволила бы нам запустить собственный блокчейн в общей сети, в которой безопасность обеспечивается независимыми от нашего проекта валидаторами.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Сеть гетерогенных блокчейнов",
  "Homogeneous Shard Network": "Сеть однородных шард",
  "On-chain protocol control": "On-chain управление протоколом",
  "Protection against the tyranny of the crowd": "Защита от тирании толпы",
  "Auction of bandwidth in the common network": "Аукционы пропускной способности в общей сети",
  "Payment for gas by users": "Оплата газа пользователями",
  "Have you read this?": "Уже читали это?",
  "Philip K. Dick": "Филип K. Дик",
  "Autofac": "Аутофак",
  "I, Robot": "Я робот",
  "Isaac Asimov": "Айзек Азимов",
  "The Bicentennial Man": "Двухсотлетний человек",
  "Neuromancer": "Нейромант",
  "William Gibson": "Уильям Гибсон",
  "Marionettes, Inc.": "Марионетки, Inc.",
  "Ray Bradbury": "Рэй Брэдбери",
  "Open questions of teleology": "Открытые вопросы телеологии",
  "and a treatise by L. von Mises": "и трактат Л. фон Мизеса",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "В заключение хотелось бы упомянуть вопросы, которые остаются открытыми с глобальной точки зрения. Какова цель роботов?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Праксиология внушает нам интересные идеи о человеческом поведении вне прямойзависимости от целей. Это дает нам возможность работать над процессами экономикироботов условно, как с черным ящиком, не вникая в конечные цели. В то же времятелеология бросает вызов объяснению причин.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Мы надеемся, что где-то на стыке работ Мизеса и Винера может быть найдена точкадальнейшего развития экономики роботов не просто как протокола взаимодействиялюдей и машин праксеологического характера, а с учетом телеологического элементыпостроения межвидовой коммуникации.",
  "This page is out of your space": "Страница не найдена",
  "No posts yet": "Пока нет публикаций",
  "If you want to help us with translation": "Если вы хотите помочь нам с переводом",
  "contact us at": "пишите на email",
  "send": "отправьте",
  "Github": "Github",
  "All posts": "Все сообщения",
  "R&D cases": "R&D кейсы",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Сотрудничество с застройщиком недвижимости на Кипре для отслеживания ежедневного распределения, потребления и компенсации избыточного углеродного следа.",
  "Check url once more or create an": "Проверьте URL еще раз или создайте",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "сообщение о том, что у вас ошибка 404 (не забудьте указать текущий URL)",
  "Embedded iot systems": "Встроенные IoT-системы",
  "Autonomous systems": "Автономные системы",
  "Digital twins are the heart of the internet of things": "Цифровые двойники - сердце интернета вещей",
  "\"Main tasks of robonomics architecture": "«Основные задачи архитектуры Робономики",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Робономика - это 100% открытая, безопасная, экономически эффективная и футуристическая платформа IoT для подключения робототехники под контролем Polkadot и Ethereum. Любой может создавать сервисы с помощью Робономики.",
  "Below a list of our  proven applications of modern robotics technologies.": "Ниже приведен список наших проверенных приложений современных технологий робототехники.",
  "By interest:": "По интересам:",
  "Sort by progress:": "Сортировать по прогрессу:",
  "Any progress": "Любой прогресс",
  "Complete": "Завершено",
  "Proceeding": "В процессе",
  "Sort by time:": "Сортировать по времени:",
  "Recent": "Последние",
  "Earliest": "Самые ранние",
  "Show more": "Показать больше",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Поместите данные в IPFS и сохраните хэши в публичном блокчейне",
  "This page has moved to a": "Эта страница была перемещена на",
  "Automatic redirecting": "Автоматическое перенаправление",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "В 1948 году профессор математики Массачусетского технологического института Норберт Винер опубликовал оду из самых важных работ «Кибернетика: Или управление и коммуникация в животном и машине». Он впервые использовал термин «кибернетика» как саморегулирующиеся механизмы, и поэтому эта публикация считается признанным кибернетическим днем рождения.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Великие книги приводят к великим идеям. Если вам нужна больше вдохновения в области коммуникации между человеком и машиной, попробуйте прочитать научно-фантастические книги. Отметьте книги, которые вы уже прочитали, и посмотрите, что еще мы можем предложить вам для дальнейшего размышления.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Фактически, экономика людей часто связана с добросовестностью выполнения задач в рамках контракта, желанием сторон достичь результата, возможным и альтруистическим поведением индивида в обществе. Все эти принципы трудно применить к роботизированной экономике. Каковы мотивы роботизированной экономики? Это открытый вопрос, который нам нужно исследовать и обсудить в обществе для лучшего понимания и применения роботов.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Для начала мы предлагаем ознакомиться с работой Мизеса «Человеческое действие: Трактат по экономике» (праксеологический подход) и с ранней статьей Норберта Винера «Поведение, цель и телеология» (телеологическое видение).",
  "Establishing democracy with smart contracts": "Установление демократии с помощью смарт-контрактов",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Давайте представим небольшой офис с командой из 10-15 человек. Пока каждый сосредоточен на своих сроках выполнения основных профессиональных задач, никто не кажется заботиться о поддержании порядка в офисе. Самым распространенным решением, чтобы избежать погружения в хаос, является найм сторонних лиц для поддержки. Другой подход - взять инициативу и накладывать штрафы на тех, кто создает беспорядок или истощает ресурсы без их пополнения. Однако, этично ли жить под тиранией в нашем будущем крипто-анархистском мире, где от каждого ожидается ответственность и свобода? Давайте стремиться создать более демократическое общество, используя смарт-контракты и новое поколение интернет-технологий (часто называемых Web3). Нам нужны инструменты, которые могут помочь нам принимать решения вместе, а затем гарантировать их правильную работу без прямого участия людей.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Кто выпил весь кофе?!' или трагедия общих ресурсов",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Существует концепция, широко обсуждаемая в экономике, экологии и других науках, известная как 'трагедия общих ресурсов'. Это относится к ситуации, когда люди, имеющие доступ к общему ресурсу, приоритезируют свои собственные интересы, в конечном итоге истощая ресурс. Кофе тесно связан с таким ресурсом, так как он портится из-за неуправляемого потребления в офисе. Однако, в то же время, обычно ни один из членов команды не стремится потратить свое время и деньги на покупку дополнительного пакета кофейных зерен. Поэтому ои продолжают пить кофе, не пополняя его запасы.",
  "How to formulate the task in numbers.": "Как сформулировать задачу в цифрах.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Предположим, что ежемесячный бюджет на кофе составляет $100, что примерно эквивалентно 150 чашкам для нашей команды из 10 человек, это означает, что каждому человеку достается 1 чашка каждые 2 дня. Теперь давайте углубимся в технические детали. Вопрос состоит в том, как мы можем оживить автономную кофейную машину в офисе?",
  "Step 1: automated coffee bean ordering": "Шаг 1: автоматический заказ кофейных зерен",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Мы договорились с бариста Никитой, который находится недалеко от офиса. Он будет поставлять нам кофейные зерна по получении оповещения от бота. Бот отправляет сообщение, когда кофе заканчивается, указывая количество кофе (в килограммах), необходимое для заказа, и соответствующую сумму оплаы, определенную командой. С этими данными Никита может выбрать кофе по своему вкусу.",
  "Step 2: automatic access to smart office.": "Шаг 2: автоматический доступ к умному офису.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Одновременно с заказом, кофейная машина генерирует QR-код. Затем Никита предъявляет этот QR-код камере для входа в офис.",
  "Step 3: distribution of coffee tokens to the team.": "Шаг 3: распределение кофейных токенов команде.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Когда локальная камера сканирует QR-код, система управления умным домом инициирует платеж Никите и распределяет новые кофейные токены среди членов команды.",
  "Step 4: drink coffee!": "Шаг 4: пить кофе!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Чтобы получить свежую чашку кофе, член команды должен отправить кофейный токен на адрес кофейной машины.",
  "Coffee beans delivery process:": "Процесс доставки кофейных зерен:",
  "Unlock new possibilities with this concept": "Откройте новые возможности с этой концепцией",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Более того, такая автоматизированная кофейная машина вводит различые экономические и социальные аспекты. Давайте рассмотрим их:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Разработчики могут вносить дополнительные кофейные токены, когда потребление опускается ниже предела. Это создает прозрачную систему для разнообразного использования кофе в пределах лимита.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "Кофейная машина может поддерживать общий счет, позволяя членам офиса вносить средства со своих личных счетов для более качественного кофейного опыта в следующий раз.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Команда коллективно определяет количество кофе, которое машина будет заказывать каждый раз через голосование DAO. Это дает свободу решать проблему с ограниченными ресурсами.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Программируемые процессы снижают влияние человеческого фактора и также предлагают большую гибкость в настройке параметров для конкртных команд.",
  "How we smarten up our coffee machine in real life": "Как мы умнее нашей кофейной машины в реальной жизни",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Чтобы получить полный контроль над кофейной машиной, мы интегрировали одноплатный компьютер, в частности Raspberry Pi 4, вместе с широко доступной массовой кофейной машиной, поддерживающей подключение GPIO. Наш выбор пал на",
  "selected for its affordability and the convenience of its easily removable front panel.": "ввиду его доступности и удобства съемной передней панели.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Затем мы разработали операционные детали, в частности, касающиеся токенов, которые пользователи могут отправлять, и базового алгоритма. Вот результат:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Чтобы насладиться чашкой вкусного кофе, пользователи должны отправить определенную сумму средств (в нашем случае, 1 токен ACT от Statemine, id=3077) на адрес кофейной машины из парачейна (Statemine). После этого начинается процесс наливания кофе, и затем убликуется журнал действий на",
  "via the Datalog function": "через функцию Datalog",
  "When the concept extends beyond the office": "Когда концепция выходит за пределы офиса",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Эта концепция предлагает множество возможностей для расширения идеи. Она успешно была реализована в Полкадот Веб3 Хабе во время Всемирного экономического форума в Давосе в 2022 году. Участники могли размещать заказы на кофе и указывать желаемый вид кофе (например, эспрессо, американо, капуччино), отправляя определенное количество токенов. Давайте поделимся фотографиями и видео с этого события:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Наш блокчейн-кофеварка готовит кофе в Полкадот Веб3 Хабе",
  "DIY or how to build your own smart blockchain coffee machine": "Сделай сам или как построить свою собственную умную блокчейн-кофеварку",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Вы можете найти подробное руководство и технические характеристики в открытом репозитории GitHub. Имейте в виду, что вы можете использовать любую кофеварку, которую предпочитаете, и практически любой токен по вашему выбору, чтобы воплотить этот проект в жизнь в своем пространстве.",
  "In a nutshell": "В двух словах",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "В настоящее время становится все более ясно, что энергопотребление является основным источником выбросов углерода, поэтому все важнее найти способы сократить наш экологический след. Офисы и коммерческие здания играют значительную роль в этом энергопотреблении. Инженеры Робономики установили систему в офисе BBF, кипрского разработчика недвижимости, для отслеживания и сбора измерений электроэнергии. Эта система также предоставляет практический способ компенсации углеродного следа.",
  "1. Monitoring surplus energy generation": "1. Мониторинг избыточной генерации энергии",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "В офисном здании компании BBF было установлено несколько солнечных панелей, интегрированных в систему Solarweb, что позволяет легко собирать аналитику. Система предоставляет данные о общем потреблении электроэнергии здания и электроэнергии, производимой солнечными панелями. Однако отсутствует важная функция - возможность компенсации углеродного следа, возникающего из-за потребления электроэнергии, превышающего то, что генерируют солнечные панели.",
  "2. Converting excess energy power to CO2 offset": "2. Преобразование избыточной энергии в компенсацию CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Наличие данных о общем потреблении электроэнергии и производстве электроэнергии солнечными панелями позволяет легко рассчитать углеродный след. Предполагается, что электроэнергия от солнечных панелей имеет углеродный след 0, что означает необходимость компенсации только за избыточную потребляемую электроэнергию, превышающую то, что генерируют солнечные панели.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "Следует отметить, что выбросы CO2 различаются в разных странах. В Кипре среднее загрязнение составляет 587 г/кВт-ч, согласно Ханне Ричи, Максу Розеру и Пабло Росадо (2022) - \"Энергетика\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Для компенсации углеродного следа используются углеродные кредиты, каждый из которых представляет собой 1 тонну CO2. Эти кредиты играют важную роль в компенсации экологического воздействия, вызванного потреблением электроэнергии, превышающим вклад солнечных панелей.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Таким образом, имея данные о потреблении энергии, производстве солнечных панелей и коэффициенте Кипра, легко определить количество токенов, необходимых для компенсации углеродного следа.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Для достижения этой цели мы включили Raspberry Pi, настроили Home Assistant для сбора аналитических данных и разработали интеграцию для компенсации углеродного следа. Панель управления энергией Home Assistant показывает следующие детали:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Кроме того, наша интеграция улучшает систему, предлагая удобную панель управления для просмотра статистики и запуска компенсации:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Ниже приведен иллюстративный пример того, как компенсация углеродного следа осуществляется через нашу интеграцию. После успешного завершения",
  "transaction": "транзакция",
  "unfolds as follows:": "разворачивается следующим образом:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Сокращение энергопотребления в офисе так же важно, как компенсация выбросов углерода. Мы можем достичь этого, внесши небольшие изменения, такие как использование энергоэффективного освещения и бытовой техники и поддержание в хорошем состоянии офисного оборудования.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Потребление энергии является большой частью нашего углеродного следа, и бизнесу необходимо принять меры для более экологически чистой деятельности. Наличие системы, которая ослеживает потребление энергии и помогает компенсировать выбросы углерода, может значительно снизить воздействие офисного здания на окружающую среду. Правильный подход позволяет бизнесу внести свой вклад в более зеленое будущее.",
  "The way forward": "Путь вперед",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Стратегия превращения кофейного аппарата в автономное роботизированное устройство",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Александр Капитонов, Сергей Лоншаков, Виталий Булатов, Бабак Киа Монтазам, Джеймс Уайт",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Иван Берман, Эрика Зерейк, Александр Капитонов, Фабио Бонсиньорио, Алишер Хасанов, Азиза Орипова, Сергей Лоншаков, Виталий Булатов",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Вадим Манаенко, Александр Капитонов, Иван Берман",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Александр Капитонов; Иван Берман; Вадим Манаенко; Вячеслав Ржевский; Виталий Булатов; Артемий Зенкин",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Илья Афанасьев, Александр Колотов, Руслан Резин, Константин Данилов, Мануэль Маззара, Субхам Чакраборти, Алексей Кашевник, Андрей Чечулин, Александр Капитонов, Владимир Йоцов, ндон Топалов, Никола Шакев, Севиль Ахмед",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Александр Капитонов, Сергей Лоншаков, Иван Берман, Эдуардо Кастельо Феррер, Фабио П. Бонсиньорио, Виталий Булатов, Александр Свистов",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Александр Капитонов, Иван Берман, Сергей Лоншаков, Александр Крупенкин, Виталий Булатов",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Константин Данилов; Руслан Резин; Илья Афанасьев; Александр Колотов",
  "Alastair Marke": "Аластер Марке",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Сергей Лоншаков, Александр Крупенкин, Александр Капитонов, Евгений Радченко, Алишер Хасанов, Александр Старостин",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Александр Капитонов, Иван Берман, Сергей Лоншаков, Александр Крупенкин",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Александр Капитонов, Иван Берман, Виталий Булатов, Сергей Лоншаков, Александр Крупенкин",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Антон Галенович, Сергей Лоншаков, Алексей Шарин",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Александр Капитонов, Сергей Лоншаков, Александр Крупенкин, Иван Берман",
  "On the Way to Sovereign Home Automation": "Путь к суверенной домашней автоматизации",
  "World Economic Forum Annual Meeting 2022": "Ежегодное собрание Всемирного экономического форума 2022 года",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Становление парачейном для приложений IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (при поддержке Робономики)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Зимняя школа Robonomics 2021 (организована Робономикой)",
  "Transition to Multinetwork — Along Came Polkadot": "Переход к мульти-сети — Появление Polkadot",
  "The Rise of Robonomics Network": "Возникновение сети 'Робономика'",
  "Crypto Valley Conference 2018": "Конференция Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Семинар Европейского парламента «Экономика роботов»",
  "Consensus 2018 conference": "Конференция Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Симпозиум по блокчейну для робототехнических систем в MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Летняя школа Robonomics-2018, организованная Робономикой.",
  "Fronius Solar.web integration with Home Assistant": "Интеграция Fronius Solar.web с Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Одна з наших целей в разработке этого случая - превратить Робономику в промежуточное ПО ROS 2. Это позволит нам использовать Робономику на Substrate для создания dapp, который может работать с ROS 2 прямо из браузера!",
  "Eisenkoch, the robot chef": "Робот-повар Eisenkoch",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Реальный случай для робота, оснащенного двумя вафельными железами и выпекающего 6 вафель одновременно за 5-7 минут.",
  "Blockchain-powered smart coffee machine": "Смарт-кофейная машина на блокчейне",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics coffee - это смарт-кофейная машина, интегрированная в сеть Робономики. Этот проект направлен на демонстрацию потенциала Робономики в сфере IoT на реальном примере.",
  "Water environmental inspector": "Инспектор по водной среде",
  "Air monitoring network": "Сеть мониторинга воздуха",
  "Production quality control platform “Feecc”": "Платформа контроля качества производства «Feecc»",
  "Backup and archiving service for robotics companies": "Сервис резервного копирования и архивирования для робототехнических компаний",
  "Public lab with Boston Dynamics Spot": "Публичная лаборатория с роботом Boston Dynamics Spot",
  "Autonomous telescope service": "Служба автономного телескопа",
  "Smart home secure remote control and backup service": "Удаленное управление и резервное копирование умного дома",
  "Blockchain as quality control system for chemistry": "Блокчейн как система контроля качества для химии",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Снижение реальных выбросов CO2 с помощью блокчейн-подтвержденных сертификатов",
  "Robot-artist Gaka-Chu": "Робот-художник Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Демонстрация «Получение погоды горы Фудзи»",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Основная идея, которую авторы Робономики пытались передать ранее, - это естественная, логическая и кажущаяся неизбежной эволюция от текущего уровня экономики к полностью автоматизированым услугам. Автоматизированным услугам потребуется иметь возможность говорить на языке человеческой экономики и также на языке собственной экономики машин, чтобы выполнять различные операции вокруг них со скоростью, недоступной для людей.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Разработка и применение интернета вещей показали, что решение типичных проблем недостаточно. К настоящему дню появились совершенно новые концепции и принципы, основанные на ранее допущенных ошибках и выявленных недостатках. Этот удобный подход использования облачных сервисов оказался с рядом критических недостатков, связанных с масштабируемостью, конфиденциальностью и безопасностью. В попытке решить эти проблемы было предложено приблизить обработку данных, логику и вычисления к месту их ипользования. Таким образом, появились концепции туманного и краевого вычисления, с промежуточными системами между облаком и устройствами, которые берут на себя некоторые функции облака. Таким образом, создание краевых систем стало одним из новых вызовов построения интернета вещей.",
  "the Robonomics Parachain portal": "портал Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Управление блокчейном, подтверждающим компенсацию углеродного следа",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Также продолжались сотрудничества с соответствующими проектами. Робономика и DAO IPCI представили сервис для сбора и анализа сенсорных данных —",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "И что научно интересно, исходя из идеи ограничений, накладываемых рынком на размер фирмы, можно сказать, что предел увеличения CPS всегда будет определяться рынком, и для этого ничего больше не требуется.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Один из примеров нашх экспериментов: переговоры о дорожном пространстве и платежах за право проезда для автономных транспортных средств с целью снижения заторов. То, что человек никогда не сделает в пробке, автомобиль сделает для вас без труда: вы хотите перестроиться, ваш автомобиль и автомобиль вашего соседа обмениваются предложениями о стоимости такой операции со скоростью сотни сообщений в секунду, они определяют равновесную цену, и таким образом вы уже находитесь в следующей быстрее движущейся полосе. Это означает, что теперь у вас появится возможность \"зарядить\" свою поездку с помощью Uber и сделать ее быстрее.",
  "Robonomics White Paper": "White Paper Робономики",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Здесь вы можете найти и скачать (конечно же, бесплатно) первую white paper Робономики, которая была представлена в мае 2018 года. Хотя с тех пор многое изменилось, основы Робономики все еще описаны в этой книге.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Самозанятый автономный робот-художник",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Кооперативная безградиентная локализация и отслеживание движущихся границ окружающей среды командами неголономных роботов",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Робот-как-сервис: от облачных до пиринговых технологий",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Доверительный мониторинг окружающей среды с помощью сетей датчиков на роющихся автономных морских судах и технологии распределенного реестра",
  "Digital Passport for Unmanned Vehicles": "Цифровой паспорт для беспилотных транспортных средств",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Робономика как блокчейн-платформа для управления беспилотным движением мобильных транспортных средств",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "К блокчейн-основанным мультиагентным робототехническим системам: анализ, классификация и применение",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Робототехнические услуги для новых парадигм умных городов н основе децентрализованных технологий",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Протокол для организации децентрализованной сети автономных агентов на фабриках с использованием рыночных механизмов",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "К блокчейн-основанному Робономике: проверка поведения автономных агентов",
  "Transforming Climate Finance and Green Investment with Blockchains": "Преобразование климатического финансирования и зеленых инвестиций с помощью блокчейнов",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Робономика: платформа для интеграции киберфизических систем в человеческую экономику",
  "Blockchain based protocol for economical communication in industry 4.0": "Протокол на основе блокчейна для экономического общения в промышленности 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Робономика на основе блокчейна как принцип создания умных фабрик",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Экосистема блокчейна для рынков углерода, экологических активов, прав и обязательств: концептуальное проектирование и реализация",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Протокол на основе блокчейна автономной деловой деятельности для мультиагентных систем, состоящих из БПЛА",
  "English": "Английский",
  "Russian": "Русский",
  "Chinese": "Китайский",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Робономика - это платформа с открытым исходным кодом, которая облегчает как простые службы Интернета вещей, так и сложную робототехнику, обеспечивая эффективное взаимодействие между агентами, будь то человек или робот. Для интеграции роботов в эту систему мы используем ROS. В этой статье мы стремимся дать обзор нашего процесса интеграции Робономики в ROS 2.",
  "Why ROS 2 in Robonomics?": "Почему ROS 2 в Робономике?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, операционная система роботов, является одной из самых старых открытых фреймворков для робототехники. Это набор программных библиотек и инструментов для работы с роботами. Он имеет все, начиная от основ до продвинутых функций и поставляется с удобными инструментами для программистов. Он широко используется университетами по всему миру для обучения и исследований в области робототехники, поэтому он хорошо зарекомендовал себя, работает с различными типами роботов и имеет большое сообщество разработчиков.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "С момента запуска ROS в 2007 году произошли значительные изменения в области робототехники и в сообществе ROS. В ответ на эти изменения был представлен ROS 2 с целью адаптации к ним. Он строит на преимуществах ROS 1, устраняя его ограничения. Мы используем ROS в Робономике с самого начала, и теперь пришло время для нас перейти на ROS 2.",
  "You might find this interesting": "Вам это может быть интересно",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Существует множество открытых роботов и сложных робототехнических платформ, которые поддерживают ROS. Это означает, что вы можете создать впечатляющую мультироботную систему для достижения ваших конкретных целей. Для",
  "the most current list of supported robots": "самого актуального списка поддерживаемых роботов",
  "please visit the ROS website.": "пожалуйста, посетите веб-сайт ROS.",
  "Research papers": "Научные статьи",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Без академических исследований развитие сложных систем, которые могут быть интегрированы в нашу повседневную жизнь, может потерять свою цель или даже представлять опасность. Мы должны тщательно обдумывать нашу направленность, цели и потенциальные последствия. Сферы, в которых работает Робономика, а именно робототехника, экономические отношения и технологии Web3, стоит изучать отдельно, исследуя, как они могут быть интегрированы друг с другом и оценивая их потенциальное влияние на нашу жизнь.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Давайте посмотрим, как ROS используется в рамках фреймворка 'Робономика', представляя всю систему с Робономикой в качестве различных слоев:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "На уровне 'Интерфейса машины' нам требуются инструменты для безшовного подключения роботов к программному обеспечению. ROS 2 предоставляет надежный набор инструментов разработчика, идеально подходящих для этой задачи.",
  "Robonomics packages for ROS and ROS 2": "Пакеты Робономики для ROS и ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "Построение много-роботной системы часто включает в себя вызов подключения устройств от разных производителей или даже устройств одного производителя, каждое из которых использует разные протоколы. Будь то умная домашняя система или автоматизированное производство, эффективное взаимодействие между вашими машинами крайне важно. ROS (и, конечно же, ROS 2) предлагает различные режимы для решения этой проблемы. Что, если бы вы могли настраивать задачи, а ROS управлял бы коммуникацией между узлами?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Команда Робономики создала различные пакеты для ROS, чтобы сделать роботов умнее и обрабатывать конкретные задачи по мере необходимости. Чтобы увидеть задачи, которые мы выполнили с помощью ROS, ознакомьтесь с нашей страницей исследовательских и разработческих случаев. Почти каждое взаимодействие с роботом основано на ROS. Вы можете найти наши открытые пакеты Робономики для ROS на GitHub, и вот некоторые из них:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Стек коммуникации Робономики содержит набор пакетов ROS для экономической коммуникации.",
  "Robonomics' contribution in the ROS 2 community": "Вклад Робономики в сообщество ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Робономика объединяет робототехнику с технологиями Web3, и мы стремимся развиваться в этих областях. С момента введения ROS 2 мы выделили три основных вызова, связанных с поддержкой сообщества ROS 2 и улучшением возможностей Робономики:",
  "Creating ROS 2 tools for Rust:": "Создание инструментов ROS 2 для Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Эти инструменты позволяю разработчикам писать приложения ROS 2 с использованием Rust. Чтобы узнать больше о том, почему мы выбрали Rust и о значимости этого проекта для нас, вы можете найти",
  "additional details": "дополнительные детали",
  "Developing Robonomics Middleware for ROS 2:": "Разработка промежуточного программного обеспечения Робономики для ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Это играет важную роль в обеспечении безшовной интеграции Робономики в различные многоагентные робототехнические системы с использованием ROS 2. Оно может облегчить интеграцию роботов в технологии блокчейна Web 3, а также снизить ошибки в процессе интеграции, тем самым экономя время и затраты.",
  "Creating a robotics lab with ROS 2:": "Создание лаборатории робототехники с ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Поскольку ROS 2 становится популярным в робототехническом сообществе, мы с нетерпением ждем большего числа роботов и аппаратных средств, работающих с ROS 2. Нашей целью является их подключение к экосистеме Web3 с использованием Робономики.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Это дело в настоящее время находится в движении; не пропустите новости - подпишитесь на обновления в поле ниже",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "'Robonomics Coffee' - это умная кофейная машина, интегрированная в сеть 'Робономика'. Этот проект направлен на иллюстрацию потенциала Robonomics в сфере интернета вещей на примере реального мира.",
  "logos and assets": "логотипы и активы",
  "Download the Robonomics logos here. We've got two options for your": "Здесь вы можете скачать логотипы Робономики. У нас есть два варианта для ваших",
  "basic needs": "основных потребностей",
  "and one designed for": "и один специально разработанный для",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "токена. Кроме того, узнайте оптимальную",
  "color palette": "цветовую палитру",
  "for the distinguished Robonomics brand": "для выдающегося бренда 'Робономика'",
  "Robonomics logos": "Логотипы Робономики",
  "Download all": "Скачать все",
  "XRT logos": "логотипы XRT",
  "Recommended color palette": "Рекомендуемая цветовая палитра",
  "RWS logos": "Логотипы RWS",
  "You are currently opted out. Click here to opt in.": "Вы в настоящее время отказались от участия. Щелкните здесь, чтобы снова принять участие.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Отказ от участия завершен; ваши посещения этого веб-сайта не будут записываться с помощью инструмента веб-аналитики. Обратите внимание, что если вы очистите файлы cookie, удалите файл cookie отказа от участия или измените компьютер или веб-браузер, вам придется снова выполнить процедуру отказа от участия.",
  "Please click below to opt in:": "Пожалуйста, нажмите ниже, чтобы принять участие:",
  "You are currently opted in. Click here to opt out.": "Вы в настоящее время приняли участие. Щелкните здесь, чтобы отказаться от участия.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Вы можете отказаться от присвоения уникального идентификатора файла cookie веб-аналитики вашему компьютеру, чтобы избежать агрегации и анализа данных, собранных на этом веб-сайте.",
  "To make that choice, please click below to receive an opt-out cookie": "Чтобы сделать это выбор, пожалуйста, нажмите ниже, чтобы получить файл cookie отказа от участия",
  "Privacy Policy": "Политика конфиденциальности",
  "Robonomics Middleware Framework for ROS 2": "Robonomics Middleware Framework для ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Соединение технологий Web3 и роботических фреймворков",
  "Playing with Human-Machine Interaction through Ethereum": "Игра с взаимодействием человека и машины через Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Информация об этом исследовании устарела. Для актуальных уроков и мастер-классов посетите нашу",
  "academy": "академию",
  "Home assistant themes": "Темы для Home Assistant",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Настройте свой Home Assistant с нашими бесплатными темами. Следуйте инструкциям по установке на",
  "Do you want": "Хотите ли вы",
  "to dive even deeper?": "погрузиться еще глубже?",
  "Our": "Наши",
  "White Paper": "Белая книга",
  "Science": "Наука",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Мы считаем, что чтение книг действительно может открыть ваш разум. Будь то простые, но умные идеи или более сложные, книги - лучший способ для вашего мозга впитать все это. Вы можете взять наши книги бесплатно и ознакомиться с нашим списком рекомендуемых произведений, чтобы погрузиться в захватывающий мир робототехники!",
  "Download books about Robonomics": "Скачать книги о Робономике",
  "Open your mind [list of recommendations]": "Откройте свой разум [список рекомендаций]",
  "Robonomics R&D": "Робономика R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Экономика роботов",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Заберите свой мерч с уникальными артами Робономики, нарисованным нашими великолепными девушками. Мы создали магазины на крупнейших онлайн-рынках для художников, загляните и найдите футболки, длинные рукава, толстовки, занавески для душа, подушки, одеяла и другие полезные вещи.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Мы выбрали самый известный фреймворк робототехники под названием Robot Operating System (ROS) в качестве стандартного интерфейса для интеграции любой совместимой кибер-физической системы. Робономика поддерживает несколько вариантов использования ROS. Реализация Робономики для сети Ethereum представлена в виде пакета ROS под названием robonomics_comm. Для архитектуры ROS 2 мы реализуем поддержку Робономики в виде промежуточного слоя (см. «Robonomics как промежуточное ПО ROS 2» для подробностей). Когда использование ROS излишне (например, при работе с устройствами IoT), был разработан модуль Python robonomics-interface. Он помогает получить доступ к функциям Робономики нативно и работает как с локальными и частными, так и с удаленными и публичными узлами.",
  "read our almanac": "Прочитайте наш альманах",
  "Begin your adventure in the world of cyberpunks": "Начните свое приключение в мире кибер-панков",
  "Pure open source": "Чистый открытый исходный код",
  "Local and Global Availability": "Локальная и глобальная доступность",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Используя открытый исходный код, P2P и веб3, нет места для корпоративных уловок, обеспечивая защиту ваших персональных данных. Вся информация хранится либо локально, либо зашифрована с использованием вашего личного ключа в облачном веб3",
  "Interested in how the team reached this stage?": "Интересно, как команда достигла этого этапа?",
  "The Robonomics Timeline": "Хронология Робономики",
  "can guide you through our journey": "может провести вас через наше путешествие",
  "Device Design and Development": "Проектирование и разработка устройств",
  "Smart devices": "Умные устройства",
  "Wearable merch": "Носимая продукция",
  "Academy": "Академия",
  "Wiki": "Вики",
  "Science & White paper": "Наука и белая бумага",
  "Tokenomics": "Токеномика",
  "Cases": "Кейсы",
  "Brand assets": "Брендовые ресурсы",
  "Wallpapers": "Обои",
  "NFT": "NFT",
  "Blog": "Блог",
  "Contacts": "Контакты",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Станьте поставщиком окружающих данных для ваших друзей и соседей в районе. Получите по-настоящему децентрализованные измерения качества воздуха, шума, температуры и других окружающих условий на карте датчиков.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "Самый открытый умный домашний сервер, работающий на RISC-V, с облачным Web3, заменяющим серверы Google под капотом.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Умные WI-FI устройства MQTT с прошивкой с открытым исходным кодом Tasmota на плате, полностью совместимые с Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Подключите свой умный дом и умную одежду к Hikikomori, чтобы отслеживать данные датчиков - прямо у ваших пальцев. Буквально.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Знакомьтесь с умными устройствами и футуристическим оборудованием от автономной команды с обширным опытом в робототехнике, блокчейне и интернете вещей",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "Обработка данных всегда чувствительный вопрос. Поэтому мы предлагаем полностью открытый исходный код",
  "connectivity module": "модуль подключения",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Робономика создал три центра подключения для обеспечения стабильного соединения. Эта опция включена по умолчанию на станции.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Вы можете запустить свой собственный центр для получения данных от Альтруистической Гражданской Станции и их дальнейшей обработки.",
  "Steps to set up your Connectivity": "Шаги для настройки вашего подключения",
  "Deploy Connectivity": "Развернуть подключение",
  "Technical requirements:": "Технические требования:",
  "2 CPU cores;": "2 ядра процессора;",
  "4 GB RAM;": "4 ГБ ОЗУ;",
  "40 GB storage;": "40 ГБ хранилища;",
  "Static IP": "Статический IP",
  "Than set up": "Затем настройте",
  "and follow": "и следуйте",
  "the instructions": "инструкциям",
  "Connect a station to your connectivity": "Подключите станцию к вашему подключению",
  "Open your sensor settings by its IP.": "Откройте настройки датчика по его IP-адресу.",
  "Go to APIs settings": "Перейдите в настройки API",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Установите флажок для отправки данных в пользовательский API и заполните соответствующие поля (IP-адрес сервера, порты и т. д.).",
  "Join with your setup to global map (optional)": "Присоединитесь к вашей установке к глобальной карте (по желанию)",
  "If you want to publish data to": "Если вы хотите опубликовать данные на",
  "the global map": "глобальную карту",
  "you need to make two pull requests:": "вам нужно сделать два запроса на извлечение:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Добавьте IPFS ID вашего подключения в список агентов карты датчиков:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Добавьте адрес парачейна вашего подключения в список агентов шаблона долгосрочного хранения:",
  "Steps for launching your own map": "Шаги для запуска вашей собственной карты",
  "Deploy web interface": "Развернуть веб-интерфейс",
  "Fork the map repository:": "Форк репозитория карты:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Измените настройки, чтобы настроить вашу карту, включая домен, провайдера, начальную точку зрения и ваш IPFS ID для списка агентов.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Разверните свою собственную версию веб-интерфейса и начните получать данные в реальном времени от вашего датчика.",
  "Full guide here:": "Полное руководство здесь:",
  "Launch long-term storage": "Запустите долгосрочное хранилище",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Просто сбор данных с датчиков недостаточно; их нужно обработать. Настройте сервер для сбора данных датчиков на основе программного обеспечения с открытым исходным кодом node.js",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "и получите свой собственный рабочий сервер для долгосрочного хранения картографических данных.",
  "Static IP.": "Статический IP.",
  "Steps for launching a storage:": "Шаги для запуска хранилища:",
  "Fork the RoSeMAN repository:": "Форкните репозиторий RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Выберите версию Docker или Node.js (требуется база данных MongoDB).",
  "Add a parachain address of your Connectivity to agents list.": "Добавьте адрес парачейна вашего Connectivity в список агентов.",
  "Run the project.": "Запустите проект.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "Первый сервер для умного дома, построенный исключительно на открытом исходном коде — от ЦП до децентрализованного облака.",
  "Processor:": "Процессор:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 с 4-ядерным процессором RISC-V, 2 МБ кэш-памяти L2, до 1,5 ГГц, поддержка ISA RV64GC",
  "GPU:": "Графический процессор:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, до 600 МГц",
  "Memory:": "Память:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 ГБ LPDDR4 SDRAM, до 2800 Мбит/с",
  "Storage:": "Хранение данных:",
  "32 GB TF card (minimum)": "32 ГБ TF-карта (минимум)",
  "Interfaces:": "Интерфейсы:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2 порта Gigabit Ethernet, 4 порта USB 3.0 типа A, разъем GPIO с 40 контактами, разъем M.2, разъем eMMC, разъем вентилятора с 2 контактами",
  "Power:": "Питание:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5 В постоянного тока через USB-C, до 30 Вт (минимум 3 А) или 5 В через разъем GPIO с 40 контактами",
  "OS:": "ОС:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Установка Home Assistant Core",
  "Robonomics Integration Installation": "Установка интеграции Робономики",
  "Zigbee Devices in Zigbee2MQTT": "Устройства Zigbee в Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Добавить домен RoSeMAN в удаленного поставщика карты.",
  "All hardware": "Весь аппарат",
  "Use it": "Используйте его",
  "Learn": "Учиться",
  "Explore website": "Исследовать веб-сайт",
  "Timeline since 2015": "Хронология с 2015 года",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "Команда приобретает новые навыки в проектировании и программировании умных устройств с нуля.",
  "sensors.social": "сенсоры.социальные",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "Была создана сеть, где работают испытательные устройства, разработанные инженерами Робономики. Также была разработана линейка умных устройств для дома на основе Wi-Fi Tasmota, и с лета 2024 года эта линейка проходит сертификацию для рынка ЕС. Осенью 2024 года команда проекта представит линейку устройств с открытым исходным кодом на основе технологий Web3 под названием \"Hardware for Cryptopunks\".",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Робономика продолжает развиваться в экосистеме Polkadot. Парачейн сети Kusama работает уже более двух лет, и начиная с осени 2024 года, парачейн также будет запущен в сети Polkadot. Более 5 миллионов транзакций от пользовательских устройств были записаны в сети. Команда продолжает исследовать возможности интеграции своих реализаций как на Ethereum, так и на Polkadot.",
  "Robo Smart Devices:": "Умные устройства Robo:",
  "Read books": "Читать книги",
  "Robonomics merch": "Товары Робономики",
  "Desktop": "Рабочий стол",
  "Smartphone": "Смартфон",
  "our robo art wallpapers": "наши робо-арт обои",
  "Space monkey devcon 2024 special": "Космическая обезьяна Devcon 2024 специальная",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Скачайте это изображение на свое устройство и присоединитесь к нашему специальному квесту Devcon 2024 на захватывающих локациях вокруг Бангкока!",
  "Free Wallpapers for you from our artists": "Бесплатные обои для вас от наших художников",
  "Hide your folder with secret wallpaper": "Спрячьте свою папку с секретным обоем",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "Мы создали секретные обои специально для вас! Скачайте фон и значки папок, и ваши папки будут гармонично вписываться в ваш домашний экран, оставляя видимым только красивые произведения искусства.",
  "Desktop background": "Фон рабочего стола",
  "Mac OS icons": "Иконки Mac OS",
  "Windows icons": "Иконки Windows",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "Outdoor sensor “Altruist“": "Датчик на открытом воздухе «Альтруист»",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Неинвазивное устройство для установки в электрических щитах с монтажом на DIN-рейку. Построен на микросхеме Espressif ESP32C6 с открытой архитектурой RISC-V.",
  "Sign up for updates": "Подпишитесь на обновления",
  "Hardware for cyberpunks": "Аппаратное обеспечение для кибер-панков",
  "Tech Blog & Updates": "Технический блог и обновления",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Делитесь и получайте данные о шуме, пыли и температуре от других независимых датчиков поблизости. Забудьте о корпоративных серверах - эти данные безопасно распространяются по всему миру с помощью инновационной технологии Web3.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Почувствуйте мощь истинной DePIN (Децентрализованной Физической Инфраструктурной Сети) - революционного технологического движения, ожившего и процветающего уже много лет на нашей",
  "decentralized sensor map": "децентрализованной карте датчиков",
  "3 ways to use it": "3 способа использования",
  "Access": "Доступ",
  "noise, dust, and temperature data": "данные о шуме, пыли и температуре",
  "from other independent sensors on our": "от других независимых датчиков на нашей",
  "Connect your device as simple as other smart devices and share your environmental outdoor data with community.": "Подключите ваше устройство так же просто, как другие умные устройства, и делитесь своими данными об окружающей среде на открытом воздухе с сообществом.",
  "Check open-source sensor firmware on GitHub": "Проверьте открытую прошивку датчика на GitHub",
  "Operate your own Data Server": "Управляйте своим собственным сервером данных",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "предоставляя вам свободу выбора серверов для обработки. Нет собственных облаков, нет скрытого кода.",
  "Keep in mind, you can join the": "Имейте в виду, что вы можете присоединиться к",
  "global decentralized sensor map": "глобальной децентрализованной карте датчиков",
  "even with a sensor connected through your own server!": "даже с датчиком, подключенным через ваш собственный сервер!",
  "Run your own Interactive Map": "Запустите свою собственную интерактивную карту",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Понравилась идея децентрализованной карты, но хотите настроить ее с дополнительными макетами и стать администратором новой суверенной инфраструктуры датчиков? Вы можете развернуть",
  "your own version by forking": "свою собственную версию, ветвив",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "наш открытый код на GitHub (обязательно проверьте тип лицензии). Помните, что нужно использовать ресурсы с открытым исходным кодом ответственно.",
  "Device Specifications": "Характеристики устройства",
  "Input Voltage:": "Напряжение ввода:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Гц",
  "Wireless protocol:": "Беспроводной протокол:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Поддерживает 2,4 ГГц Wi-Fi 6 (802.11 b/g/n) и Bluetooth 5 (LE), Zigbee с встроенной антенной",
  "Equipped with a high-performance": "Оборудован высокопроизводительным",
  "32-bit RISC-V processor": "32-битным процессором RISC-V",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "с тактовой частотой до 160 МГц и низкопотребляющим 32-битным процессором RISC-V с тактовой частотой до 20 МГц",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320 КБ ROM, 512 КБ HP SRAM, 16 КБ LP SRAM и 4 МБ флэш-памяти",
  "USB-C": "USB-C",
  "for firmware development and updates": "для разработки и обновления прошивки",
  "PM sensor:": "Датчик PM:",
  "SDS011 laser PM2.5/PM10 sensor": "Датчик лазерного PM2.5/PM10 SDS011",
  "Supported sensors:": "Поддерживаемые датчики:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X, BME280, HTU21D; Датчик уровня шума: I2S INMP441; Счетчик Гейгера: Radsens.",
  "Help & support": "Помощь и поддержка",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "С децентрализованной картой Робономики вы можете использовать Robonomics Connectivity или создать свой собственный сервис подключения.",
  "Your own Connectivity": "Ваше собственное подключение",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Умный домашний ассистент, о котором вам будет приятно заботиться, даже когда вы далеко. Только для разработчиков.",
  "Robonomics open-source hardware": "Открытое аппаратное обеспечение Робономики",
  "Open-source hardware": "Открытое аппаратное обеспечение",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Почувствуйте мощь истинной DePIN (Децентрализованной Физической Инфраструктурной Сети) - революционного технологического движения, ожившего и процветающего с Робономикой",
  "Home server with Web3 cloud": "Домашний сервер с облачным хранилищем Web3",
  "Home server on RISC V": "Домашний сервер на RISC V",
  "Supports": "Поддерживает",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "2,4 ГГц Wi-Fi 6 (802.11 b/g/n) и Bluetooth 5 (LE), с встроенной антенной",
  "Built in": "Встроенный",
  "Onboard": "На борту",
  "1.47inch LCD display, 172x320 resolution, 262K color": "1,47-дюймовый ЖК-дисплей, разрешение 172x320, 262 тыс. цветов",
  "Adapting": "Адаптируется",
  "integrates": "интегрирует",
  "full-speed USB-С port": "порт USB-С полной скорости",
  "Onboard TF card slot": "Слот для TF-карты на борту",
  "for external TF card storage of pictures or files": "для внешнего хранения TF-карты изображений или файлов",
  "Supports accurate control": "Поддерживает точное управление",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "такое как гибкие часы и несколько режимов питания для реализации низкого энергопотребления в различных сценариях",
  "Built-in RGB LED": "Встроенный RGB-светодиод",
  "with clear acrylic sandwich panel for cool lighting effect": "с прозрачной акриловой панелью для крутого светового эффекта",
  "Battery Level Gauge": "Индикатор уровня заряда батареи",
  "Low-Power I2C Temperature sensor": "Низкопотребляющий датчик температуры I2C",
  "RV-3032-C7 Real-Time Clock Module": "Модуль часов реального времени RV-3032-C7",
  "Battery 180mA": "Батарея 180 мА",
  "Measuring Range:": "Диапазон измерения:",
  "0.1-80A": "0.1-80A",
  "Wireless Protocol:": "Беспроводной протокол:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (2.4 ГГц Wi-Fi)",
  "CPU:": "ЦПУ:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "Микроконтроллер ESP32-S3 на основе системы на одной микросхеме (SoC) с двухъядерным микропроцессором (Xtensa 32-битный LX7), до 240 МГц",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 КБ ROM, 520 КБ SRAM, 8 МБ FLASH",
  "for development and updates": "для разработки и обновлений",
  "To configure the device, please visit:": "Для настройки устройства, пожалуйста, посетите:",
  "multiple IO interfaces,": "несколько интерфейсов ввода-вывода,",
  "Early bird price": "Цена для ранних покупателей",
  "Get updates about smart devices": "Получайте обновления о смарт-устройствах",
  "Receive regular emails from Robonomics": "Получайте регулярные электронные письма от Робономики",
  "Thanks for your submission!": "Спасибо за вашу заявку!",
  "Not submitted": "Не отправлено",
  "Notify me when available": "Уведомить меня, когда будет доступно",
  "Captcha is not verified. Please, check your internet connection": "Капча не прошла проверку. Пожалуйста, проверьте ваше интернет-соединение",
  "Thanks for the submition!": "Спасибо за представление!",
  "Submitting": "Представление",
  "Submit": "Представить",
  "Follow for latest news and important updates": "Следите за последними новостями и важными обновлениями",
  "The best way to check open-source project": "Лучший способ проверить проект с открытым исходным кодом",
  "Useful, serious, cute videos, teasers etc.": "Полезные, серьезные, милые видео, трейлеры и т. д.",
  "Chat for engineers and developers": "Чат для инженеров и разработчиков",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Неофициальный чат для криптолюбителей",
  "Use cases": "Примеры использования",
  "Coming in early 2025": "Приходит в начале 2025 года",
  "Rent in California, USA": "Аренда в Калифорнии, США",
  "Available by the Hour, Day, or Week": "Доступно по часам, дням или неделям",
  "Your name": "Ваше имя",
  "Your comment": "Ваш комментарий",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Нажимая на эту кнопку, вы соглашаетесь получать электронное письмо относительно аренды робота Unitree G1 Humanoid.",
  "We'll get in touch shortly!": "Мы свяжемся с вами в ближайшее время!",
  "Contact me": "Свяжитесь со мной",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Умный датчик, собирающий окружающие данные и интегрирующий их в децентрализованную карту датчиков.",
  "Smart Tamagotchi “Hikikomori“": "Умный Тамагочи 'Hikikomori'",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Плата разработки микроконтроллера, предназначенная для интеграции с системами Web3. Это может быть ваш умный домашний тамагочи, игровой контроллер, образовательный инструмент - все, что вы разработаете!",
  "Energy monitor with USB-C": "Энергетический монитор с USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Неинвазивное устройство, предназначенное для монтажа на DIN-рейке в электрических щитах, отслеживает потребление и генерацию электроэнергии.",
  "Smart devices from Robonomics": "Умные устройства от Робономики",
  "Our values": "Наши ценности",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Наши устройства разработаны для полной прозрачности. Каждый продукт поставляется с открытым процессором RISC-V, открытым исходным кодом и схемами схем, а также инструкциями по локальному обновлению - нет необходимости в облачных подключениях. Вы можете понять, настроить и доверять вашей технологии с нуля",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "Комбинация P2P-коммуникации и облачного веб3 гарантирует, что ваши устройства всегда будут подключены. Нет доступа к интернету? Вы все равно можете подключиться напрямую к устройству. Переезжаете в новый регион или уезжаете в отпуск? Ваши устройства останутся онлайн и доступными где бы вы ни находились",
  "Privacy by design": "Конфиденциальность по дизайну",
  "Trust the Code": "Доверьтесь коду",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Полностью открытый исходный код, без скрытых алгоритмов, без корпоративного наблюдения. Это прозрачность для истинного децентрализатора.",
  "Your data, your keys": "Ваши данные, ваши ключи",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Полностью контролируйте свои данные с нашим полностью открытым модулем подключения. Выберите между Робономикой или безопасным облачным хранилищем Web3 с вашим персональным ключом - нет закрытых облаков, нет непрозрачного кода.",
  "Always Connected, Always Secure": "Всегда подключен, всегда защищен",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "Локальная P2P-коммуникация и облачное веб3 гарантируют, что ваш датчик всегда будет доступен, где бы вы ни находились. Нет централизованных точек отказа - только чистое, равноправное соединение.",
  "Join the Altruist Collective": "Присоединяйтесь к коллективу Altruist",
  "Plug the device into the global,": "Подключите устройство к глобальной,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Поделитесь своими окружающими данными с вашими соседями, вашим сообществом или вашей децентрализованной сетью.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Оборудован USB-C поддерживает WiFi и Zigbee. Записывает данные о потреблении и генерации электроэнергии в сети Polkadot через интервалы в 10 минут.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori работает на плате разработки микроконтроллера ESP32-C6, имеет ЖК-дисплей, поддерживает Wi-Fi 6 и BLE 5.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori подходит для быстрого развития приложений IoT на основе Web3. Это може быть ваш умный домашний тамагочи, игровой контроллер, образовательный инструмент - все, что вы разработаете!",
  "Unitree G1 Humanoid Robot": "Робот-гуманоид Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Арендуйте передового гуманоида для ваших исследовательских, программных и развлекательных проектов.",
  "Hour": "Час",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Аренда на месте (Окленд, Калифорния)",
  "Suitable for short tasks": "Подходит для коротких задач",
  "No engineering support included": "Не включена инженерная поддержка",
  "Day": "День",
  "$900": "$900",
  "Suitable for bigger tasks": "Подходит для более крупных задач",
  "Basic engineering support included": "Базовая инженерная поддержка включена",
  "Week+": "Неделя+",
  "On demand": "По запросу",
  "Delivery to your location": "Доставка в ваше местоположение",
  "Customized approach": "Индивидуальный подход",
  "Engineering support can be included": "Инженерная поддержка может быть включена",
  "Enter the new era": "Вступите в новую эру",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "Гуманоидный робот G1 со своими инновационными функциями предлагает универсальность для исследовательских, программных и развлекательных потребностей. Unitree G1 включает в себя руку с декстерным управлением мощности, что позволяет ему выполнять тонкие задачи, такие как обращение с объектами, нажатие кнопок и выполнение других точных операций с различными предметами.",
  "Tech specification": "Технические характеристики",
  "Height, Width and Thickness（Stand）": "Высота, ширина и толщина (стойка)",
  "1320x450x200mm": "1320x450x200 мм",
  "Height, Width and Thickness（Fold）": "Высота, ширина и толщина (складывание)",
  "690x450x300mm": "690x450x300 мм",
  "Weight (With Battery)": "Вес (с аккумулятором)",
  "About 35kg": "Около 35 кг",
  "Arm Maximum Load": "Максимальная нагрузка на руку",
  "About 2Kg": "Около 2 кг",
  "Cooling System": "Система охлаждения",
  "Local air cooling": "Местное воздушное охлаждение",
  "Smart Battery (Quick Release)": "Умная батарея (быстрый выпуск)",
  "9000mAh": "9000 мАч",
  "Charger": "Зарядное устройство",
  "54V 5A": "54V 5A",
  "Battery Life": "Время работы от батареи",
  "About 2h": "Около 2 часов",
  "Sensing Sensor": "Датчик сенсора",
  "Depth Camera+3D LiDAR": "Камера глубины + 3D LiDAR",
  "5W Speaker": "5W динамик",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6, Bluetooth 5.2",
  "Manual Controller": "Ручной контроллер",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Возьмите контроль над данными вашего умног дома с домашним сервером с открытым исходным кодом на процессоре RISC-V и подключением Web3.",
  "Surveillance-free": "Без слежки",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Нет скрытых журналов данных на корпоративных серверах, сохраняя при этом безопасный удаленный доступ.",
  "No vendor lock-in": "Нет привязки к поставщику",
  "Supports over 3000 integrations with devices from various manufacturers.": "Поддерживает более 3000 интеграций с устройствами различных производителей.",
  "Open hardware": "Открытый аппаратный компонент",
  "Open processor architecture and open-source code ensure a trustless system.": "Открытая архитектура процессора и открытый исходный код обеспечивают доверительную систему.",
  "Open and efficient hardware": "Открытый и эффективный аппаратный компонент",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Наш домашний сервер работает на процессоре RISC-V и имеет полностью прозрачные схемы плат. RISC-V - это открытая и модульная архитектура процессора, поставляемая с лицензией BSD. В отличие от собственной ARM, она предлагает гибкость для настройки без лицензионных ограничений, что делает ее идеальной для доверительных устройств Интернета вещей и серверов.",
  "Vendor agnostic smart home heart": "Продавец-агностическое умное сердце дома",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "Сервер поставляется с предустановленным Home Assistant, платформой для домашней автоматизации с открытым исходным кодом, позволяющей вам полностью контролировать свой умный дом без использования облачных услуг сторонних поставщиков.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Его модульная конструкция позволяет легко добавлять компоненты, автоматизации и интеграции, поддерживая более 3 000 устройств различных производителей без привязки к поставщику. С поддержкой протоколов Zigbee и Wi-Fi вы можете подключить широкий спектр устройств, от датчиков температуры до мониторов потребления энергии, все к локальному серверу.",
  "Designed for privacy": "Разработан для конфиденциальности",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Наш умный домашний сервер устраняет корпоративное вмешательство, храня ваши данные локально или зашифрованными с вашим персональным ключом в децентрализованном хранилище Web3. Наслаждайтесь полной конфиденциальностью без отслеживания, без наблюдения - просто безопасное, доверительное управление вашим умным домом.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "С помощью облачного P2P-удаленного управления Robonomics Web3 вы получаете криптографический доступ ко всем функциям умного дома:",
  "hour": "час",
  "hours": "часов",
  "day": "день",
  "days": "дней",
  "week": "неделя",
  "weeks": "недель",
  "on demand": "по требованию",
  "Special offer": "Специальное предложение",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Получите эксклюзивный доступ к одному из первых коммерчески доступных гуманоидных роботов. Гибкие варианты аренды для исследований, программирования и развлечений.",
  "With the Altruist Outdoor Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data—encrypted, mapped, and shared across a distributed network.": "С датчиком Altruist Outdoor вы становитесь силой в децентрализованном экологическом мониторинге. Захватывайте данные о шуме, пыли и температуре - зашифрованные, отображенные и распределенные по сети.",
  "Access current device states remotely": "Доступ к текущему состоянию устройств удаленно",
  "Control devices remotely via parachain or LibP2P": "Управление устройствами удаленно через парачейн или LibP2P",
  "Manage Home Assistant users": "Управление пользователями Home Assistant",
  "Back up and restore Home Assistant configurations": "Резервное копирование и восстановление конфигураций Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Храните цифровой двойник вашего дома в безопасном, децентрализованном облаке",
  "Books": "Книги",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "В 2022 году команда Robonomics начала сотрудничать с другими командами парачейн в экосистеме Polkadot, чтобы использовать уникальные преимущества этой децентрализованной сети. Это сотрудничество привело к запуску сервиса резервного копирования и архивации данных, разработанного специально для робототехнических компаний.",
  "Digital markets for robots": "Цифровые рынки для роботов",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "Развитие робототехники и автоматизированных систем во время Четвертой Промышленной Революции потребует, чтобы роботы имели возможность заказывать услуги для своего собственного обслуживания.",
  "Tokenization of Data of IOT devices": "Токенизация данных устройств IOT",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "Токенизация данных с устройств интернета вещей (IoT) представляет собой прорывное событие в цифровой экономике.",
  "Industrial zone management with capital": "Управление промышленной зоной с капиталом",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "Этот случай исследует роль умных фабрик в реагировании на изменения капитала на современных рынках. В рамках трансформации Индустрии 4.0 он представляет децентрализованный протокол коммуникации с использованием кибер-физических систем для улучшения экономической координации между промышленными агентами.",
  "Mars colonization, impossible without kusama": "Колонизация Марса, невозможная без kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Этот R&D случай исследует роль децентрализованной инфраструктуры сети Kusama в поддержке межпланетных миссий, в частности колонизации Марса.",
  "A decentralized system for negotiating road space": "Децентрализованная система для переговоров о дорожном пространстве",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Нашей целью было разработать децентрализованную систему для переговоров о дорожном пространстве, где автономные транспортные средства могут оплачивать маршруты и разрешения.",
  "Almanac": "Альманах",
  "Robonomics' Approach": "Подход Robonomics",
  "Robonomics provides an alternative to centralized corporate-controlled cloud services. Instead of relying on such systems, it leverages public blockchain networks, such as Ethereum and Polkadot, to facilitate secure and autonomous transactions between robots and service providers.": "Robonomics предоставляет альтернативу централизованным корпоративно-контролируемым облачным сервисам. Вместо использования таких систем, он использует публичные блокчейн сети, такие как Ethereum и Polkadot, для обеспечения безопасных и автономных транзакций между роботами и поставщиками услуг.",
  "How Digital Markets for Robots Work": "Как работают цифровые рынки для роботов",
  "Key Benefits": "Основные преимущества",
  "Digital markets for robots represent a critical step toward supporting the next wave of automation and smart city infrastructure. Robonomics' decentralized approach ensures secure, scalable, and autonomous service management for robots.": "Цифровые рынки для роботов представляют собой критический шаг к поддержке следующей волны автоматизации и инфраструктуры умных городов. Децентрализованный подход Robonomics обеспечивает безопасное, масштабируемое и автономное управление услугами для роботов.",
  "Conclusion": "Заключение",
  "Why Smart Factories Should Respond to Capital Changes": "Почему умные фабрики должны реагировать на изменения капитала",
  "A Decentralized Protocol for Economic Coordination": "Децентрализованный протокол для экономической координации",
  "Balancing Production and Capital": "Балансировка производства и капитала",
  "Technical Foundation": "Техническое основание",
  "This R&D case presents how capital flows can act as economic signals for smart factories. By adopting Robonomics' decentralized protocol, industries can better manage production efficiency and stay aligned with the evolving standards of Industry 4.0.": "Этот R&D случай показывает, как потоки капитала могут действовать как экономические сигналы для умных фабрик. Приняв децентрализованный протокол Robonomics, отрасли могут лучше управлять эффективностью производства и оставаться на одной волне с развивающимися стандартами Индустрии 4.0.",
  "Exploring Kusama's Role in Space Exploration": "Исследование роли Kusama в космических исследованиях",
  "The Mars Rover Experiment": "Эксперимент с марсоходом",
  "Technical Implementation": "Техническая реализация",
  "Use Cases and Potential Impact": "Сценарии использования и потенциальное воздействие",
  "A fun video about the use of KUSAMA on Mars:": "Забавное видео о использовании KUSAMA на Марсе:",
  "This R&D case demonstrates how the Kusama network can support scientific exploration, resource management, and data transparency for space missions. The decentralized architecture offers a promising foundation for the future of Mars colonization and beyond.": "Этот R&D случай демонстрирует, как сеть Kusama может поддерживать научные исследования, управление ресурсами и прозрачность данных для космических миссий. Децентрализованная архитектура предлагает многообещающее основание для будущего колонизации Марса и за его пределами.",
  "The Challenge": "Вызов",
  "The Solution": "Решение",
  "Here is the project presentation during the MOBI GRAND CHALLENGE": "Вот презентация проекта во время MOBI GRAND CHALLENGE",
  "We want to give special thanks to the Jetbrains Team’s Mobile Robot Algorithms Laboratory for giving us access to Duckietown.": "Мы хотим выразить особую благодарность Лаборатории мобильных робототехнических алгоритмов команды Jetbrains за предоставление нам доступа к Duckietown.",
  "Special Thanks": "Особая благодарность",
  "With robots generating enormous amounts of data—including videos, raw technical data, and logs—storage can become a significant challenge, especially at scale. This new service offers an affordable and secure solution to meet these needs.": "Поскольку роботы генерируют огромные объемы данных, включая видео, сырые технические данные и журналы, хранение может стать значительной проблемой, особенно в масштабе. Этот новый сервис предлагает доступное и безопасное решение для удовлетворения этих потребностей.",
  "Addressing the Challenge of Data Storage": "Решение проблемы хранения данных",
  "Our Solution: A Decentralized Approach": "Наше решение: Децентрализованный подход",
  "Key Technology Behind the Service": "Основные технологии за сервисом",
  "Why This Service Is Essential": "Почему этот сервис необходим",
  "Looking Ahead": "Взгляд в будущее",
  "For additional details about the collaboration between Robonomics and Crust Network and how decentralized storage is reshaping data management for robotics companies, visit the official": "Для дополнительной информации о сотрудничестве между Robonomics и Crust Network и о том, как децентрализованное хранилище меняет управление данными для робототехнических компаний, посетите официальный",
  "blog": "блог",
  "Learn More About the Collaboration": "Узнайте больше о сотрудничестве",
  "Send a request message and get the result from the autonomous agent. The resulting file is saved to IPFS and the resultant message requires a signature with a private key.": "Отправьте запрос и получите результат от автономного агента. Результирующий файл сохраняется в IPFS, и для результата требуется подпись с помощью закрытого ключа.",
  "Overview": "Обзор",
  "This case study explores how Robonomics Network facilitates decentralized data access using IoT devices and blockchain technology. By leveraging the Robonomics dApp connected to a weather sensor on Fuji Mountain, users can obtain real-time weather data securely and transparently.": "Этот кейс-стади исследует, как сеть Robonomics облегчает децентрализованный доступ к данным с использованием устройств интернета вещей и технологии блокчейн. Подключившись к Robonomics dApp, связанному с метеостанцией на горе Фудзи, пользователи могут получать реальные метеоданные безопасно и прозрачно.",
  "How does it work?": "Как это работает?",
  "Technical Insights": "Технические исследования",
  "Here's a walkthrough video:": "Вот видео-обзор:",
  "This R&D case highlights the capabilities of decentralized technologies in real-world data collection and access. Robonomics Network empowers secure, verifiable data retrieval from IoT sensors, advancing the reliability of environmental monitoring solutions.": "Этот R&D случай подчеркивает возможности децентрализованных технологий в сборе и доступе к данным в реальном мире. Сеть Robonomics позволяет обеспечивать безопасное, проверяемое получение данных с датчиков интернета вещей, продвигая надежность решений для мониторинга окружающей среды.",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy. By leveraging blockchain technology, IoT devices can generate, verify, and tokenize data as units of value, creating a secure and transparent mechanism for digital asset creation.": "Токенизация данных с устройств интернета вещей представляет собой прорывное событие в цифровой экономике. С использованием технологии блокчейн устройства интернета вещей могут генерировать, проверять и токенизировать данные как единицы стоимости, создавая безопасный и прозрачный механизм для создания цифровых активов.",
  "Background": "Фон",
  "The Role of IoT Devices in Tokenization": "Роль устройств IoT в токенизации",
  "Key Benefits of Tokenized IoT Data": "Основные преимущества токенизированных данных IoT",
  "Tokenizing IoT data through blockchain not only enhances data security and transparency but also paves the way for autonomous, machine-driven economies. This transformative approach creates a new generation of tokenized assets, unlocking immense potential for global innovation and economic growth.": "Токенизация данных IoT через блокчейн не только улучшает безопасность и прозрачность данных, но также открывает путь к автономным, машинно-управляемым экономикам. Этот трансформационный подход создает новое поколение токенизированных активов, разблокируя огромный потенциал для глобальных инноваций и экономического роста.",
  "Last updated: February 03, 2025": "Последнее обновление: 3 февраля 2025 года",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Эта Политика Конфиденциальности описывает наши политики и процедуры по сбору, использованию и раскрытию вашей информации при использовании Сервиса и сообщает вам о ваших правах на конфиденциальность и о том, как закон защищает вас.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Мы используем Ваши персональные данные для предоставления и улучшения Сервиса. Используя Сервис, Вы соглашаетесь на сбор и использование информации в соответствии с настоящей Политикой конфиденциальности.",
  "Interpretation and Definitions": "Толкование и Определения",
  "Interpretation": "Толкование",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Слова, первая буква которых написана с заглавной буквы, имеют значения, определенные в следующих условиях. Следующие определения имеют тот же смысл независимо от того, появляются ли они в единственном числе или во множественном числе.",
  "Definitions": "Определения",
  "For the purposes of this Privacy Policy:": "Для целей настоящей Политики конфиденциальности:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(называемое также \"DAO\", \"Мы\", \"Нас\" или \"Наш\" в настоящем Соглашении) относится к децентрализованной автономной организации Robonomics Network, оператору веб-сайта",
  "(referred to as": "(называемое",
  "Website": "Веб-сайт",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "в настоящем Соглашении). Для целей GDPR DAO является Контролером данных.",
  "Cookies": "Файлы cookie",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "являются небольшими файлами, которые размещаются на Вашем компьютере, мобильном устройстве или любом другом устройстве веб-сайтом, содержащие детали Вашей истории просмотров на этом веб-сайте среди многих других использований. Более подробную информацию о файлах cookie и их работе можно найти на:",
  "Country": "Страна",
  "refers to: Cyprus.": "относится к: Кипр.",
  "Data Controller": "Контролер данных",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "для целей GDPR (Общего регламента по защите данных) относится к DAO как юридическому лицу, которое одно или совместно с другими определяет цели и средства обработки персональных данных.",
  "Device": "Устройство",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "означает любое устройство, которое может получить доступ к Сервису, такое как компьютер, мобильный телефон или цифровой планшет.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "относится к Общему регламенту по защите данных ЕС.",
  "Personal Data": "Персональные данные",
  "is any information that relates to an identified or identifiable individual.": "любая информация, относящаяся к идентифицированному или идентифицируемому физическому лицу.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Для целей GDPR персональные данные означают любую информацию, относящуюся к Вам, такую как имя, идентификационный номер, данные о местоположении, онлайн-идентификатор или один или несколько факторов, специфичных для физической, физиологической, генетической, умственной, экономической, культурной или социальной идентичности.",
  "Service": "Сервис",
  "refers to the Website": "относится к Веб-сайту",
  "Service Provider": "Поставщик услуг",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "означает любое физическое или юридическое лицо, которое обрабатывает данные от имени DAO. Это относится к сторонним компаниям или лицам, нанятым DAO для облегчения предоставления Сервиса, для предоставления Сервиса от имени DAO, для выполнения услуг, связанных с Сервисом, или для помощи DAO в анализе того, как используется Сервис. Для целей GDPR поставщики услуг считаются обработчиками данных.",
  "Usage Data": "Данные использования",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "относится к данным, собранным автоматически, либо созданным при использовании Сервиса, либо из самой инфраструктуры Сервиса (например, продолжительность посещения страницы).",
  "You": "Вы",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(называемое также \"Ваш\" в настоящем Соглашении) означает физическое лицо, получающее доступ к Сервису, или DAO, или другое юридическое лицо, от имени которого такое физическое лицо получает доступ к Сервису, по мере необходимости.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "В соответствии с GDPR, Вы можете быть названы Субъектом данных или Пользователем, так как Вы являетесь физическим лицом, использующим Сервис.",
  "Collecting and Using Your Personal Data": "Сбор и использование Ваших персональных данных",
  "Types of Data Collected": "Типы собираемых данных",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "При использовании нашего Сервиса мы можем попросить Вас предоставить нам определенную лично идентифицируемую информацию, которая может быть использована для связи с Вами или идентификации Вас. Лично идентифицируемая информация может включать, но не ограничивается:",
  "Email address": "Адрес электронной почты",
  "First name and last name": "Имя и фамилия",
  "Usage Data is collected automatically when using the Service.": "Данные использования собираются автоматически при использовании Сервиса.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Данные использования могут включать информацию, такую как IP-адрес Вашего устройства (например, IP-адрес), тип браузера, версия браузера, страницы нашего Сервиса, которые Вы посещаете, время и дата Вашего посещения, время, проведенное на этих страницах, уникальные идентификаторы устройств и другие диагностические данные.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Когда Вы получаете доступ к Сервису через мобильное устройство, мы можем автоматически собирать определенную информацию, включая, но не ограничиваясь, типом мобильного устройства, которым Вы пользуетесь, уникальным идентификатором Вашего мобильного устройства, IP-адресом Вашего мобильного устройства, операционной системой Вашего мобильного устройства, типом мобильного интернет-браузера, который Вы используете, уникальными идентификаторами устройств и другими диагностическими данными.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Мы также можем собирать информацию, которую Ваш браузер отправляет при каждом посещении нашего Сервиса или при доступе к Сервису через мобильное устройство.",
  "Cookies & Browser Storage": "Файлы cookie и хранилище браузера",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Веб-сайты могут использовать файлы cookie. Мы используем файлы cookie и хранилище браузера только для основных настроек для улучшения Вашего опыта, а не для отслеживания. Они помогают запоминать Ваши предпочтения, такие как языковые настройки или выбор согласия, чтобы Вам не приходилось сбрасывать их каждый раз при посещении.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Мы не используем файлы cookie для отслеживания или персонализированной рекламы. Вы можете управлять или отключить файлы cookie в настройках браузера, но некоторые функции могут не работать должным образом без них.",
  "Matomo Analytics": "Аналитика Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Наш веб-сайт может использовать Matomo, платформу аналитики с открытым исходным кодом, для получения информации о использовании веб-сайта. Это включает анонимизированные данные, такие как:",
  "Pages visited and navigation paths": "Посещенные страницы и пути навигации",
  "Time spent on our website": "Время, проведенное на нашем веб-сайте",
  "Whether you’re a returning or new visitor": "Являетесь ли Вы посетителем, возвращающимся или новым",
  "Your device type (desktop, mobile, etc.)": "Тип Вашего устройства (настольный компьютер, мобильный телефон и т. д.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Для защиты Вашей конфиденциальности Ваш IP-адрес анонимизируется перед сохранением. Собранные нами данные используются только для улучшения веб-сайта и не используются для личной идентификации.",
  "Under Art. 6(1)(f) GDPR": "В соответствии со статьей 6(1)(f) GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "мы обрабатываем эти данные на основании нашего законного интереса в улучшении наших услуг.",
  "Opt-Out Option": "Опция отказа",
  "You can disable Matomo tracking at any time:": "Вы можете отключить отслеживание Matomo в любое время:",
  "Use of Your Personal Data": "Использование ваших персональных данных",
  "The DAO may use Personal Data for the following purposes:": "DAO может использовать персональные данные для следующих целей:",
  "To provide and maintain our Service": "Для предоставления и поддержания нашего сервиса",
  "including to monitor the usage of our Service.": "включая мониторинг использования нашего сервиса.",
  "For the performance of a contract": "Для исполнения контракта",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "разработки, соблюдения и выполнения договора купли-продажи продуктов, товаров или услуг, которые вы приобрели или любого другого договора с нами через сервис.",
  "To contact You": "Для связи с вами",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Для связи с вами по электронной почте, телефонным звонкам, SMS или другими эквивалентными формами электронной связи, такими как push-уведомления мобильного приложения о обновлениях или информационных сообщениях, связанных с функциональностью, продуктами или заключенными услугами, включая обновления безопасности, когда это необходимо или разумно для их реализации.",
  "To provide You": "Для предоставления вам",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "новостей, специальных предложений и общей информации о других товарах, услугах и мероприятиях, которые мы предлагаем и которые аналогичны тем, которые вы уже приобрели или о которых узнавали, если вы не отказались от получения такой информации.",
  "To manage Your requests": "Для управления вашими запросами",
  "To attend and manage Your requests to Us.": "Для обработки и управления вашими запросами к нам.",
  "For other purposes": "Для других целей",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Мы можем использовать ваши данные для других целей, таких как анализ данных, выявление тенденций использования, определение эффективности наших рекламных кампаний и оценка и улучшение нашего сервиса, продуктов, услуг, маркетинга и вашего опыта.",
  "We may share Your personal information in the following situations:": "Мы можем передавать ваши персональные данные в следующих ситуациях:",
  "With Service Providers": "С поставщиками услуг",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Мы можем передавать ваши персональные данные поставщикам услуг для мониторинга и анализа использования нашего сервиса, для связи с вами.",
  "With Your consent": "С вашим согласием",
  "We may disclose Your personal information for any other purpose with Your consent.": "Мы можем раскрывать ваши персональные данные для любых других целей с вашего согласия.",
  "Retention of Your Personal Data": "Сохранение ваших персональных данных",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "DAO будет хранить ваши персональные данные только в течение времени, необходимого для целей, изложенных в настоящей Политике конфиденциальности. Мы будем хранить и использовать ваши персональные данные в той мере, в которой это необходимо для соблюдения наших юридических обязательств (например, если нам требуется хранить ваши данные для соблюдения применимых законов), разрешения споров и применения наших юридических соглашений и политик.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "DAO также будет хранить данные использования для внутреннего анализа. Данные использования обычно хранятся в течение более короткого периода времени, за исключением случаев, когда эти данные используются для укрепления безопасности или улучшения функциональности нашего сервиса, или когда нам законно требуется хранить эти данные в течение более длительного периода времени.",
  "Security of Your Personal Data": "Безопасность ваших персональных данных",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "Безопасность ваших персональных данных для нас важна, но помните, что ни один метод передачи данных через Интернет или метод электронного хранения не является 100% безопасным. Хотя мы стремимся использовать коммерчески приемлемые средства для защиты ваших персональных данных, мы не можем гарантировать их абсолютную безопасность.",
  "Detailed Information on the Processing of Your Personal Data": "Подробная информация о обработке ваших персональных данных",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Ваши данные, включая персональные данные, обрабатываются на сайте поставщика услуг DAO и в любых других местах, где находятся стороны, участвующие в обработке. Это означает, что эта информация может быть передана — и хранится на — компьютерах, находящихся за пределами вашего государства, провинции, страны или другой государственной юрисдикции, где законы о защите данных могут отличаться от тех, которые действуют в вашей юрисдикции.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Ваше согласие на настоящую Политику конфиденциальности, за которым следует предоставление такой информации, означает ваше согласие на такую передачу.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "DAO предпримет все разумные меры, необходимые для обеспечения безопасности ваших данных и соблюдения настоящей Политики конфиденциальности, и никакая передача ваших персональных данных не будет осуществляться в организацию или страну, если не будут приняты соответствующие меры контроля, включая обеспечение безопасности ваших данных и другой персональной информации.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Обратите внимание, что любая передача данных по Интернету (например, связь по электронной почте) обычно не является безопасной, и мы не несем ответственности за данные, переданные нам через Интернет. К сожалению, абсолютная защита технически невозможна. Эта информация не распространяется на веб-сайты третьих сторон и соответствующие ссылки, указанные на нашем веб-сайте. DAO не несет ответственности за них.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Мы используем поставщиков услуг, которые могут иметь доступ к вашим персональным данным. Эти сторонние поставщики собирают, хранят, используют, обрабатывают и передают информацию о вашей деятельности на нашем сервисе в соответствии с их Политиками конфиденциальности.",
  "Email Marketing": "Электронный маркетинг",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Мы можем использовать ваши персональные данные, чтобы связаться с вами с помощью информационных бюллетеней, маркетинговых или рекламных материалов и другой информации, которая может быть вам интересна. Вы можете отказаться от получения любых или всех этих коммуникаций от нас, следуя ссылке для отказа или инструкциям, предоставленным в любом электронном письме, которое мы отправляем, или связавшись с нами.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Мы можем использовать поставщиков услуг по электронной почте для управления и отправки электронных писем Вам;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Их Политика конфиденциальности можно просмотреть на",
  "Usage, Performance and Miscellaneous": "Использование, производительность и разное",
  "We may use third-party Service Providers to maintain and improve our Service.": "Мы можем использовать сторонних поставщиков услуг для поддержания и улучшения нашего сервиса.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR Конфиденциальность",
  "Legal Basis for Processing Personal Data under GDPR": "Правовая основа обработки персональных данных в соответствии с GDPR",
  "We may process Personal Data under the following conditions:": "Мы можем обрабатывать персональные данные в следующих условиях:",
  "Consent:": "Согласие:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Вы дали свое согласие на обработку персональных данных для одной или нескольких конкретных целей.",
  "Performance of a contract:": "Исполнение договора:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Предоставление персональных данных необходимо для исполнения соглашения с Вами и/или для выполнения любых предварительных обязательств по нему.",
  "Legal obligations:": "Юридические обязательства:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Обработка персональных данных необходима для соблюдения юридического обязательства, которому подлежит DAO.",
  "Vital interests:": "Жизненно важные интересы:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Обработка персональных данных необходима для защиты Ваших жизненно важных интересов или другого естественного лица.",
  "Public interests:": "Общественные интересы:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Обработка персональных данных связана с задачей, которая выполняется в общественном интересе или в рамках осуществления официальной власти, предоставленной DAO.",
  "Legitimate interests:": "Законные интересы:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Обработка персональных данных необходима для целей законных интересов, преследуемых DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "В любом случае DAO с удовольствием поможет прояснить конкретную правовую основу, применимую к обработке, и в частности, является ли предоставление персональных данных законным или контрактным требованием, или требованием, необходимым для заключения контракта.",
  "Your Rights under the GDPR": "Ваши права в соответствии с GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "DAO обязуется уважать конфиденциальность Ваших персональных данных и гарантировать, что Вы можете воспользоваться своими правами.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "У Вас есть право в соответствии с настоящей Политикой конфиденциальности и законом, если Вы находитесь в ЕС, на:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Право на доступ, обновление или удаление информации о Вас. При возможности Вы можете получить доступ, обновить или запросить удаление Ваших персональных данных непосредственно в разделе настроек своей учетной записи. Если Вы не можете выполнить эти действия самостоятельно, пожалуйста, свяжитесь с нами, чтобы мы могли помочь Вам. Это также позволяет Вам получить копию персональных данных, которые мы храним о Вас.",
  "Request correction of the Personal Data that We hold about You.": "Запрос на исправление персональных данных, которые мы храним о Вас.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "У Вас есть право потребовать исправления неполной или неточной информации, которую мы храним о Вас.",
  "Object to processing of Your Personal Data.": "Возражать против обработки Ваших персональных данных.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Это право существует, если мы полагаемся на законный интерес в качестве правовой основы для нашей обработки и есть что-то в Вашей конкретной ситуации, что заставляет Вас возражать против нашей обработки Ваших персональных данных на этом основании. У Вас также есть право возражать, если мы обрабатываем Ваши персональные данные в целях прямого маркетинга.",
  "Request erasure of Your Personal Data.": "Запрос на стирание Ваших персональных данных.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "У Вас есть право попросить нас удалить или убрать персональные данные, когда нет веских причин продолжать их обработку.",
  "Request the transfer of Your Personal Data.": "Запрос на передачу Ваших персональных данных.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Мы предоставим Вам, или третьему лицу, которое Вы выбрали, Ваши персональные данные в структурированном, общепринятом, машинно-читаемом формате. Обратите внимание, что это право применяется только к автоматизированной информации, которую Вы изначально предоставили согласие использовать нам или где мы использовали информацию для заключения контракта с Вами.",
  "Withdraw Your consent.": "Отозвать свое согласие.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "У Вас есть право отозвать свое согласие на использование Ваших персональных данных. Если Вы отзовете свое согласие, мы можем не иметь возможности предоставить Вам доступ к определенным конкретным функциям Сервиса.",
  "Exercising of Your GDPR Data Protection Rights": "Осуществление Ваших прав по защите данных GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Вы можете осуществить свои права на доступ, исправление, удаление и возражение, связавшись с нами. Обратите внимание, что мы можем попросить Вас подтвердить свою личность перед ответом на такие запросы. Если Вы обратитесь с запросом, мы постараемся ответить Вам как можно скорее.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "У Вас есть право пожаловаться в орган по защите данных нашего сбора и использования Ваших персональных данных. Для получения дополнительной информации, если Вы находитесь в Европейском экономическом пространстве (ЕЭП), пожалуйста, свяжитесь с местным органом по защите данных в ЕЭП.",
  "Children's Privacy": "Конфиденциальность детей",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Наш Сервис не предназначен для лиц младше 13 лет. Мы не собираем личную идентифицируемую информацию от лиц младше 13 лет. Если Вы являетесь родителем или опекуном и знаете, что Ваш ребенок предоставил нам персональные данные, пожалуйста, свяжитесь с нами. Если мы узнаем, что мы собрали персональные данные от лиц младше 13 лет без проверки согласия родителей, мы предпримем шаги по удалению этой информации с наших серверов.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Если нам нужно полагаться на согласие в качестве правовой основы для обработки Вашей информации и Ваша страна требует согласия от родителей, мы можем потребовать согласия Ваших родителей перед сбором и использованием этой информации.",
  "Links to Other Websites": "Ссылки на другие веб-сайты",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Наш Сервис может содержать ссылки на другие веб-сайты, которые не управляются нами. Если Вы нажмете на ссылку третьей стороны, Вы будете направлены на сайт этой третьей стороны. Мы настоятельно рекомендуем Вам просмотреть Политику конфиденциальности каждого сайта, который Вы посещаете.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Мы не контролируем и не несем ответственности за содержание, политику конфиденциальности или практики любых сайтов или услуг третьих сторон.",
  "Changes to this Privacy Policy": "Изменения в настоящей Политике конфиденциальности",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Мы можем время от времени обновлять нашу Политику конфиденциальности. Мы уведомим вас обо всех изменениях, разместив новую Политику конфиденциальности на этой странице.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Мы сообщим вам по электронной почте и/или выдающимся уведомлением на нашем сервисе до вступления изменений в силу и обновим дату \"Последнее обновление\" в верхней части этой Политики конфиденциальности.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Рекомендуется периодически просматривать эту Политику конфиденциальности на предмет изменений. Изменения в этой Политике конфиденциальности вступают в силу с момента их размещения на этой странице.",
  "Contact Us": "Свяжитесь с нами",
  "If you have any questions about this Privacy Policy, You can contact us:": "Если у вас есть вопросы по поводу этой Политики конфиденциальности, вы можете связаться с нами:",
  "By visiting this page on our website:": "Посетив эту страницу на нашем веб-сайте:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Этот документ составлен на английском языке. Этот перевод AI предоставлен исключительно для вашего ознакомления.",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Нажимая на кнопку «Отправить», вы соглашаетесь получать регулярные электронные письма от Robonomics (не более 1 в месяц) и соглашаетесь с",
  "Request access to Your Personal Data.": "Запросом доступа к вашим персональным данным."
}