{
  "What is Robonomics network?": "Что такое сеть Robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics - это платформа с открытым исходным кодом для приложений IoT, которая позволяет обмениваться технической и экономической информацией в форме атомных транзакций между пользовательскими приложениями, IoT-сервисами и сложными робототехническими системами.",
  "Get started": "Начать",
  "Explore Robonomics": "Исследуйте Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics - это технология с открытым исходным кодом для рынка IoT, доступная каждому. Прочтите краткое изложение, чтобы узнать больше",
  "Get XRT": "Получить XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT - это утилитарный токен, который позволяет управлять устройствами IoT на основе сети Ethereum и Robonomics parachain",
  "Use a Dapp": "Использовать Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Ознакомьтесь с бета-версией децентрализованного приложения для управления устройствами IoT",
  "Start building": "Начать создание",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Изучайте Robonomics с помощью учебных пособий и практически полезных экспериментов в Robonomics WIKI",
  "Robonomics objectives": "Цели Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Основываясь на достижениях облачных платформ, Robonomics стремится предложить рынку IoT более безопасные и передовые интернет-решения на каждом этапе взаимодействия человека и машины. Вот основные задачи, для которых разрабатывается Robonomics",
  "IoT device management with a decentralized cloud": "Управление устройствами IoT с децентрализованной облачной платформой",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Блокчейн-сети имеют все параметры для обеспечения высочайшего уровня безопасности при запуске устройства и получении телеметрии. Взаимодействие с устройством фактически может быть описано изменением состояния цифрового двойника, хранящегося в блокчейн-сети, и передачей информации об этих изменениях на физическое устройство. В случае использования блокчейна без разрешения, мы можем быть уверены в глобальной доступности провайдеров, а также в высоком уровне защиты данных цифрового двойника от нежелательных изменений.",
  "Techno-economic transactions between humans and machines": "Техно-экономические транзакции между людьми и машинами",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Мы можем говорить об институциональных достижениях в терминах доступа автоматизированных систем непосредственно к цифровым рынкам через криптовалюты и смарт-контракты. Например, Ethereum уже реализует большинство основных инструментов экономической деятельности. Приложения, созданные сегодня для связи конечного пользователя и устройств IoT, будут гораздо эффективнее, если оплата и условия обслуживания неразрывно связаны с параметрами запуска устройства.",
  "Serverless IoT applications for users": "Бессерверные приложения IoT для пользователей",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Вопрос о конфиденциальности пользователей современных приложений не должен застревать в неспособности компаний использовать современные достижения в области web3. Нет необходимости аутентифицироваться или требовать подключения к конкретным серверам для доступа к телеметрии и управлению устройством.",
  "Learn with Robonomics": "Учимся с Robonomics",
  "Introduction course": "Вводный курс",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Погрузитесь в проблемы, возникающие при создании современных приложений Интернета вещей и возможные решения с использованием технологий web3 и инструментов Robonomics для разработчиков и пользователей IoT.",
  "Boston dynamics spot software developing": "Разработка программного обеспечения для робота Boston Dynamics Spot",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Мы рады представить вам образовательную программу Spot SDK! Наша цель - познакомить вас с SDK Spot и позволить вам проверить свои навыки удаленно, используя робота Boston Dynamics Spot в нашей лаборатории.",
  "Sovereign smart home with robonomics and home assistant": "Суверенный умный дом с помощью Robonomics и Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "В этом курсе вы пройдете все необходимые шаги для создания своего собственного суверенного умного дома, основным преимуществом которого является безопасность/конфиденциальность пользовательских данных.",
  "Shop": "Магазин",
  "Science papers": "Научные статьи",
  "Books": "Книги",
  "Logo and assets": "Логотип и ресурсы",
  "Wallpapers": "Обои",
  "Blog": "Блог",
  "Cases": "Кейсы",
  "Ambassador program": "Амбассадорская программа",
  "Contacts": "Контакты",
  "Robonomics is 100% open-source.": "Robonomics - это 100% открытый исходный код.",
  "Anyone can contribute to": "Любой может внести свой вклад в",
  "the code base": "базу кода",
  "or": "или",
  "build services with Robonomics": "создавать сервисы с помощью Robonomics",
  "White Paper 2022": "Белая книга 2022",
  "Timeline": "Хронология",
  "Tokenomics": "Токеномика",
  "Parachain": "Парачейн",
  "User (D)App": "Пользовательское (D)App",
  "Function request": "Запрос функции",
  "Report": "Отчет",
  "Control": "Контроль",
  "Log": "Журнал",
  "IoT Device": "Устройство IoT",
  "Decentralized application": "Децентрализованное приложение",
  "Digital twin": "Цифровой двойник",
  "IoT / Smart device": "IoT / Умное устройство",
  "Robonomics tokenomics": "Токеномика Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "- это утилитарный токен, который позволит контролировать устройства IoT на основе сети Ethereum и парачейна Robonomics в экосистеме Polkadot.",
  "Token distribution": "Распределение токенов",
  "The task": "Задача",
  "Try our Dapp": "Попробуйте наш Dapp",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "вы можете работать с XRT в блокчейнах, используя инструменты, предоставленные различными независимыми командами в сообществах Polkadot (Kusama) и Ethereum.",
  "Within the Kusama network, you have the capability use": "В рамках сети Kusama у вас есть возможность использовать",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "коммуникацию между парачейном Robonomics и другими парачейнами с использованием различных децентрализованных приложений (dApps):",
  "Attention please": "Внимание, пожалуйста",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Если вы использовали сервис Multichain для мостовых транзакций, пожалуйста, воздержитесь от его использования на данный момент, так как это было",
  "announced": "объявлено",
  "on the official Twitter of The Multichain.": "в официальном Twitter The Multichain.",
  "Be aware of scammers": "Будьте осторожны с мошенниками",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "пожалуйста, используйте только известные рынки для обмена XRT. Не отправляйте свои токены на счета, которые вам предлагают в личных сообщениях, независимо от того, какую транзакцию вы хотите выполнить (покупку или продажу токенов). Если вы получили какие-либо «громкие заявления» о токене Robonomics (мошенники часто используют что-то вроде объявления о раздаче), пожалуйста, проверьте этот веб-сайт (https://robonomics.network/) или наш",
  "for official updates. Be careful, be safe.": "для официальных обновлений. Будьте осторожны, будьте в безопасности.",
  "XRT in Ethereum": "XRT в Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реализуя проект Robonomics в 2015-2018 годах, команде проекта потребовалось найти связь между предоставлением полезной функции Robonomics Network, а именно запуском устройств IoT в соответствии с моделью робота-как-сервиса, и возмещением затрат поставщикам Robonomics на комиссии за газ в Ethereum. Нам нужно было подумать о жизненном цикле ответственности каждого отдельного умного устройства за выполнение услуги. В результате ранних исследований и разработок в Robonomics команда пришла к механизму добычи новых токенов для вознаграждения каждого созданного умного контракта робота-как-сервиса. Эта модель остается жизнеспособной для будущего Robonomics в Ethereum, но только с существенными улучшениями в Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочтите это, чтобы узнать историческую справку и долгосрочные планы команды для XRT в экосистеме Ethereum.",
  "Etherscan profile": "Профиль Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Просмотрите умный контракт токена и транзакции в сети Ethereum здесь.",
  "Coingecko markets": "Рынки Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Здесь вы можете найти рынки CEX и DEX для торговли XRT.",
  "XRT In Polkadot": "XRT в Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходя от Ethereum к Polkadot, нам нужно сделать «масштабирование» в токеномике. Парачейны в экосистеме Polkadot не являются эквивалентом смарт-контракта, а являются полностью программируемым блокчейном, который арендует сегмент общей сети.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактическим платежом со стороны парачейнов Polkadot и Kusama является долгосрочное заблаговременное связывание местных токенов Relay chain (DOT / KSM) в достаточном количестве для выигрыша одного из аукционов. XRT в парачейне Robonomics поддерживает обновление слота и вознаграждения за заинтересованных сторон. Механизм сжигания XRT, лежащий в основе активации подписок IoT, разработан для минимизации инфляции и в случае увеличения интереса - до нуля.",
  "Learn more": "Узнайте больше",
  "in Twitter thread from our network architect.": "в твиттер-треде от нашего архитектора сети.",
  "Usage:": "Использование:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можно использовать как для оплаты комиссий за выполнение транзакций на парачейне, так и для покупки подписки IoT, которая гарантирует приоритетную обработку транзакций устройств или пользователей IoT.",
  "Rewards:": "Вознаграждения:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "На протяжении года парачейн выпускает небольшое количество XRT для стимулирования коллаторов парачейна.",
  "The parameter of the total reward": "Параметр общего вознаграждения",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для коллаторов на год определяется голосованием держателей токенов и может быть изменен путем проведения референдума.",
  "Use XRT": "Используйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купите подписку IoT в нашем децентрализованном приложении. Управляйте своими умными устройствами через блокчейн без участия централизованной корпорации.",
  "Subscan profile": "Профиль Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Просмотр статистики токена в экосистеме Polkadot.",
  "Other questions": "Другие вопросы",
  "What is RWS?": "Что такое RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[В разработке основной функциональности] Для инженеров команды Core Dev попытается создать различные модели использования Robonomics, и первый шаг в этом направлении - запуск токена подписки на всю жизнь - токена RWS. Каждый токен RWS дает вам 1 транзакцию в секунду (tps) от/к вашему устройству IoT через парачейн Robonomics. Активируйте свой токен RWS и совершайте транзакции с «бесплатным газом» с предварительным выполнением и предсказуемой задержкой. Деактивируйте токен RWS и торгуйте им на DEX.",
  "What is AIRA/AIR ID?": "Что такое AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Пред-XRT токен был распределен в 2017 году как автономная часть дальнейшей инфраструктуры Robonomics на Ethereum. После успешного запуска Robonomics на Ethereum в 2019 году токены AIRA были подключены к созданной инфраструктуре проекта через",
  "ambix smart contract": "умный контракт ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "который гарантировал автономный и независимый процесс обмена пред-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Цель токена Robonomics - обеспечить работу децентрализованной сети для обслуживания умных городов и промышленности 4.0 на блокчейн-инфраструктуре. Для достижения этой цели экономика токена должна отражать стимулы для внедрения сети.",
  "In addition": "Кроме того",
  "Within the Ethereum network you can use decentralized application powered by the": "В рамках сети Ethereum вы можете использовать децентрализованные приложения, работающие на основе",
  "Translation was executed by AI so there may be some inaccuracies": "Перевод был выполнен искусственным интеллектом, поэтому могут быть некоторые неточности",
  "Inform us": "Сообщите нам",
  "please": "пожалуйста",
  "if you find any": "если вы найдете какие-либо",
  "Scientific Papers with Robonomics": "Научные статьи с Робономикой",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Децентрализованное приложение (dapp) работает в рамках блокчейна. Оно является открытым исходным кодом, а его данные обслуживаются на IPFS и Github. Эти технологии позволяют приложению быть безопасным и прозрачным одновременно. Наши разработчики работают как над разработкой приложения Robonomics, так и над библиотеками, которые вы можете использовать при создании своего собственного dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin - один из инструментов, предоставляемых Robonomics Web Services (RWS). Он действует как цифровая версия реального оборудования и копирует все его технические характеристики. Это позволяет сделать децентрализованное приложение более отзывчивым на команды пользователя.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Вы можете использовать Robonomics с широким спектром умных устройств Zigbee для автоматизации и управления различными аспектами вашего дома/офиса или использовать его с робототехникой на основе ROS для более сложных промышленных задач.",
  "Robot and electrics sheep artboard": "Робот и художественная доска с овцами",
  "Robot and apple artboard": "Робот и художественная доска с яблоком",
  "Robot and cosmonaut artboard": "Робот и художественная доска с космонавтом",
  "Robot and cat artboard": "Робот и художественная доска с кошкой",
  "Space travelers artboard": "Художественная доска для космических путешественников",
  "Coloured astronaut artboard": "Цветной астронавт на художественной доске",
  "Black and white astronaut artboard": "Черно-белый астронавт на художественной доске",
  "icons for macos": "Иконки для macOS",
  "icons for windows": "Иконки для Windows",
  "Do Androids Dream of Electric Sheep?": "Мечтают ли андроиды об электрических овцах?",
  "Sleeping Mew Space": "Спящий космический Мью",
  "Are you ready for Mars?": "Вы готовы к Марсу?",
  "Shiva Robot": "Робот Шива",
  "Space Travelers": "Космические путешественники",
  "Retro Astronaut": "Ретро-астронавт",
  "New Newton": "Новый Ньютон",
  "White Paper / May 12, 2018": "Белая бумага / 12 мая 2018 года",
  "If you want to go deeper into learning Robonomics Network, read this document (.pdf ~ 2 MB).": "Если вы хотите углубиться в изучение сети Робономики, прочитайте этот документ (.pdf ~ 2 МБ).",
  "2021, Robot-as-a-Service: From Cloud to Peering Technologies": "2021 год, Робот-как-сервис: от облачных до пиринговых технологий",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Александр Капитонов, Сергей Лоншаков, Виталий Булатов, Бабак Киа Монтазам, Джеймс Уайт",
  "2020, Trustable Environmental Monitoring by means of Sensors Networks on Swarming Autonomous Marine Vessels and Distributed Ledger Technology": "2020 год, Доверительный мониторинг окружающей среды с помощью сетей датчиков на автономных морских судах и технологии распределенного реестра",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Иван Берман, Энрика Зерейк, Александр Капитонов, Фабио Бонсиньорио, Алишер Хасанов, Азиза Орипова, Сергей Лоншаков, Виталий Булатов",
  "2019, Digital Passport for Unmanned Vehicles": "2019 год, Цифровой паспорт для беспилотных транспортных средств",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Вадим Манаенко, Александр Капитонов, Иван Берман",
  "2019, Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "2019 год, Робономика как блокчейн-платформа для управления беспилотным движением мобильных транспортных средств",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Александр Капитонов; Иван Берман; Вадим Манаенко; Вячеслав Ржевский; Виталий Булатов; Артемий Зенкин",
  "2019, Towards Blockchain-based Multi-Agent Robotic Systems: Analysis, Classification and Applications": "2019 год, К блокчейн-ориентированным мультиагентным робототехническим системам: анализ, классификация и применение",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Илья Афанасьев, Александр Колотов, Руслан Резин, Константин Данилов, Мануэль Маззара, Субхам Чакраборти, Алексей Кашевник, Андрей Чечулин, Александр Капитонов, Владимир Йоцов, Андон Топалов, Никола Шакев, Севиль Ахмед",
  "2019, Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "2019 год, Робототехнические сервисы для новых парадигм умных городов на основе децентрализованных технологий",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Александр Капитонов, Сергей Лоншаков, Иван Берман, Эдуардо Кастельо Феррер, Фабио П. Бонсиньорио, Виталий Булатов, Александр Свистов",
  "2019, Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "2019 год, Протокол для организации децентрализованной автономной агентской сети на фабриках с использованием рыночных механизмов",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Александр Капитонов, Иван Берман, Сергей Лоншаков, Александр Крупенкин, Виталий Булатов",
  "2018, Towards Blockchain-Based Robonomics: Autonomous Agents Behavior Validation": "2018 год, К блокчейн-ориентированной Робономике: проверка поведения автономных агентов",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Константин Данилов; Руслан Резин; Илья Афанасьев; Александр Колотов",
  "2018, Transforming climate finance and green investment with blockchains": "2018 год, Преобразование климатического финансирования и зеленых инвестиций с помощью блокчейнов",
  "Alastair Marke": "Аластер Марке",
  "2018, Robonomics: platform for integration of cyber physical systems into human economy": "2018 год, Робономика: платформа для интеграции киберфизических систем в человеческую экономику",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Сергей Лоншаков, Александр Крупенкин, Александр Капитонов, Евгений Радченко, Алишер Хасанов, Александр Старостин",
  "2018, Blockchain based protocol for economical communication in industry 4.0": "2018 год, Протокол на основе блокчейна для экономического общения в промышленности 4.0",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Александр Капитонов, Иван Берман, Сергей Лоншаков, Александр Крупенкин",
  "2018, Robonomics based on blockchain as a principle of creating smart factories": "2018 год, Робономика на основе блокчейна как принцип создания умных фабрик",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Александр Капитонов, Иван Берман, Виталий Булатов, Сергей Лоншаков, Александр Крупенкин",
  "2018, Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "2018 год, Экосистема блокчейна для рынков углерода, экологических активов, прав и обязательств: концепт-дизайн и реализация",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Антон Галенович, Сергей Лоншаков, Алексей Шадрин",
  "2017, Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "2017 год, Протокол на основе блокчейна для автономной бизнес-деятельности мультиагентных систем, состоящих из БПЛА",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Александр Капитонов, Сергей Лоншаков, Александр Крупенкин, Иван Берман",
  "The latest Robonomics news here.": "Последние новости Робономики здесь.",
  "Follow us": "Следуйте за нами",
  "Video tutorials, screencasts, interviews, events.": "Видеоуроки, скринкасты, интервью, мероприятия.",
  "Watch videos": "Смотреть видео",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "Общайтесь с нами и нашим сообществом. Не стесняйтесь задавать вопросы и обсуждать свои предложения.",
  "Join chat": "Присоединиться к чату",
  "Medium Blog": "Блог Medium",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "Наше видение прошлого, настоящего и будущего Робономики, сетей Ethereum, Polkadot, зеленых рынков, робототехники и всего, что связано с Робономикой.",
  "Read": "Читать",
  "Telegram chat": "Чат в Telegram",
  "Local communities & news. You are welcome!": "Местные сообщества и новости. Добро пожаловать!",
  "Updated use cases for connected robots within web3 technologies.": "Обновленные примеры использования связанных роботов с использованием технологий web3.",
  "17 use cases for connected robots within Polkadot and Ethereum.": "17 примеров использования связанных роботов с использованием Polkadot и Ethereum.",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "Здесь мы объясняем идею кибер-физической системы, как она может помочь в масштабировании производства и что делать с обязательствами роботов.",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "Основная идея здесь заключается в том, что свободные экономические принципы достаточны для жизни в автоматизированном мире. Роботы могут быть нашими друзьями, и нам не нужна централизация, чтобы сделать это комфортным и надежным.",
  "Additional icons for the wallpaper:": "Дополнительные иконки для обоев:",
  "Want emails from robonomics": "Хотите получать электронные письма от Robonomics",
  "Adding you to our special list...": "Добавление вас в наш специальный список...",
  "Nice, you are in the list": "Отлично, вы в списке",
  "Something went  wrong. Try again later": "Что-то пошло не так. Попробуйте позже",
  "Our library": "Наша библиотека",
  "Free E-Books": "Бесплатные электронные книги",
  "Our recommendations": "Наши рекомендации",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "Мы рекомендуем эти книги, если вы хотите быть более вовлеченными, вдохновленными и самообразованными в области робототехники, продвигаться в этой сфере и понимать экономику, лежащую в ее основе. Вы можете скачать или приобрести эти книги из других источников.",
  "Community & Contacts": "Сообщество и контакты",
  "Get latest updates": "Получайте последние обновления",
  "Your email": "Ваш адрес электронной почты",
  "Tell us something if you want": "Расскажите нам что-нибудь, если хотите",
  "Submit": "Отправить",
  "Something went  wrong :( Try again later": "Что-то пошло не так :( Попробуйте позже",
  "Robonomics nfts": "Robonomics NFT",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Здесь мы собрали коллекцию NFT, созданных во время нашего обширного крипто-путешествия, как независимо, так и с великими командами. Эти уникальные токены предлагают проверяемую собственность на блокчейне и являются отличным украшением для вашего блокчейн-аккаунта. Вы можете делать ставки на некоторые из них на аукционе или даже создавать свои собственные уникальные произведения.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Во время нашей первоначальной кампании по сбору средств на Kusama мы приняли решение вознаградить наших крипто-пионеров не только токенами, но и подарить им красочный NFT. Эта карточка имеет большое значение для нас, и если кто-то ее владеет, мы знаем, что он является фантастическим сторонником ценностей Robonomics: свободы и децентрализации.",
  "Robonomics crypto girls": "Robonomics Crypto Girls",
  "2. Robonomics crypto girls": "2. Robonomics Crypto Girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Мы рады представить нашу специальную серию цифровых активов - Robonomics Crypto Girls, созданных командой Robonomics Art&Science. Каждый NFT в этой коллекции является уникальным графическим представлением технологии, используемой в Robonomics или созданной на основе применения Robonomics. Наши талантливые художники нарисовали каждую девушку в характерном стиле Robonomics. Вы можете выбрать ту, которая вам нравится, или собрать всю серию! Приобретая эти NFT, вы не только добавляете стильное дополнение к своей коллекции, но и поддерживаете нас в продолжении инноваций и реализации децентрализованной связи для роботов. Следите за новыми добавлениями в коллекцию!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. СЕЗОННЫЕ КОЛЛЕКЦИИ NFT",
  "On demand minting": "Минтирование по требованию",
  "SEASONAL SPOT NFT COLLECTIONS": "СЕЗОННЫЕ КОЛЛЕКЦИИ NFT",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Эти сезонные коллекции NFT представляют собой уникальный цифровой актив, который запечатлевает уникальное взаимодействие между пользователем и Spot в парачейне Robonomics. Пользователи могут рисовать что угодно в браузере, и робот будет повторять их движения, чтобы создать рисунок, нарисованный от руки. После завершения взаимодействия NFT монтируется на рынке Singular для полкадот-аккаунта пользователя. Теперь любой может взаимодействовать с реальным роботом, находящимся в лаборатории в Калифорнии, чтобы создавать персонализированные и уникальные цифровые активы, которыми можно владеть, покупать и продавать, как и любой другой цифровой актив.",
  "Create your NFT": "Создайте свой NFT",
  "4. automated telescope collection": "4. Коллекция автоматизированных телескопов",
  "automated telescope collection": "Коллекция автоматизированных телескопов",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Находящийся в пустыне Атакама, Чили, физический телескоп может быть доступен через децентрализованное приложение для получения изображений астрономических объектов в реальном времени в глубоком космосе. Любой пользователь с интернет-соединением может получить доступ к нему с помощью токенов $STRGZN, которые можно приобрести в приложении с использованием кредитной карты. Выберите астрономический объект, отправьте команду телескопу сделать снимок и дождитесь монтирования NFT на платформе Singular. Обратите внимание, что приложение доступно только для использования с 23:00 до 6:00 по GMT-3 из-за рабочих часов телескопа.",
  "Try yourself": "Попробуйте сами",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "В сотрудничестве с Polkapets",
  "and": "и",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Как гордый участник экосистемы Polkadot, Robonomics принял участие в Polka Pets World. Вместе с командой Polka Pets мы создали 1200 NFT с уникальной концепцией дизайна, которая демонстрирует нашу основную идею связности. Чтобы воплотить эту идею в жизнь, мы создали персонажа: андроида, специализирующегося на помощи людям взаимодействовать с любой робототехнической сущностью.",
  "6. Mecha Arm Jetpack": "6. Механический реактивный ранец",
  "Mecha Arm Jetpack": "Механический реактивный ранец",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "В 2021 году Robonomics начал поддержку добавления палет RMRK в свою среду выполнения, что привело к нативной интеграции с самой передовой логикой NFT в мире. Чтобы отпраздновать этот знаменательный момент, мы запустили специальный совместимый с Kanaria предмет - дочерний NFT, который можно экипировать на птицу Kanaria и который может давать преимущества в метавселенной RMRK.",
  "RMRK Partnerships": "Партнерства RMRK",
  "Robonomics wallpapers": "Обои Robonomics",
  "Regular wallpapers": "Обычные обои",
  "Wallpapers for phones": "Обои для телефонов",
  "Hidden wallpapers": "Скрытые обои",
  "Important news & announcements": "Важные новости и объявления"
}