{
  "What is Robonomics network?": "Что такое Robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics - это платформа с открытым исходным кодом для приложений Интернета вещей. Мы поддерживаем новое поколение интернет-технологий (web3), которые реализуют обмен технической и экономической информацией в форме атомарных транзакций между пользовательскими приложениями, сервисами Интернета вещей и сложной робототехникой.",
  "Get started": "Начало",
  "Explore Robonomics": "Откройте для себя Робономику",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics - это технология с открытым исходным кодом для рынка IoT, доступная каждому. Прочтите краткое изложение, чтобы узнать больше",
  "Get XRT": "Получить XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT - протокольный токен, который позволяет управлять IoT-устройствами поверх сети Ethereum и парачейна Робономики",
  "Use a Dapp": "Используйте Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Взгляните на бета-версию децентрализованного приложения для управления IoT-устройствами",
  "Start building": "Попробуйте на практике",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Изучите Робономику с помощью учебных пособий и практически полезных экспериментов в WIKI Робономики",
  "Robonomics objectives": "Задачи Робономики",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Опираясь на достижения облачных платформ, Робономика ставит своей задачей предложить IoT-рынку более безопасные и продвинутые интернет решения на каждом этапе коммуникации человека и машины. Ниже приводятся основные задачи, для которых Робономика разрабатывается",
  "IoT device management with a decentralized cloud": "Управление IoT-устройством с помощью децентрализованного облака",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Блокчейн сети обладают всеми параметрами для обеспечения наивысшей степени безопасности запуска устройства и получения телеметрии. Взаимодействие с устройством фактически можно описать изменением состояния цифрового двойника, хранящегося в блокчейн сети, и доставкой информации об изменениях физическому устройству. В случае использования permissionless blockchain мы можем быть уверены в глобальной доступности провайдеров, а также высоком уровне защиты данных цифрового двойника от нежелательных изменений.",
  "Techno-economic transactions between humans and machines": "Техно-экономические транзакции между людьми и машинами",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Мы можем говорить об институциональных достижениях в плане доступа автоматических систем напрямую к цифровым рынкам посредством криптовалют и умных контрактов. Например, Ethereum уже реализует большинство базовых инструментов экономической деятельности. Приложения, создаваемые сегодня для связи конечного пользователя и IoT-устройства, будут намного эффективнее, если оплата и условия оказания услуги будут неразрывны с параметрами запуска устройства.",
  "Serverless IoT applications for users": "Бессерверные IoT-приложения пользователей",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Вопрос приватности пользователей современных приложений не должен утыкаться в неумение компаний использовать современные достижения из области web3. Нет необходимости производить аутентификацию или требовать подключения к конкретным серверам для доступа к телеметрии и управления устройством.",
  "Learn with Robonomics": "Учитесь с Robonomics",
  "Introduction course": "Вводный курс",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Погрузитесь в проблемы, возникающие при создании современных приложений Интернета вещей, и возможные решения с помощью технологий web3 и инструментов Robonomics для разработчиков и пользователей Интернета вещей.",
  "Boston dynamics spot software developing": "Разработка программного обеспечения для Spot от Boston Dynamics",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Мы рады представить вам образовательную программу Spot SDK! Наша цель — познакомить вас с SDK Spot и дать возможность удаленно проверить свои навыки с помощью робота Spot от Boston Dynamics в нашей лаборатории.",
  "Sovereign smart home with robonomics and home assistant": "Cуверенный умный дом с Robonomics и home assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "В этом курсе вы пройдете все шаги, необходимые для того, чтобы построить свой собственный суверенный умный дом, главным преимуществом которого является безопасность/конфиденциальность пользовательских данных.",
  "Shop": "Магазин",
  "Science papers": "Научные статьи",
  "Books": "Книги",
  "Logo and assets": "Логотип и ассеты",
  "Wallpapers": "Обои",
  "Blog": "Блог",
  "Cases": "Кейсы",
  "Ambassador program": "Амбассадорская программа",
  "Contacts": "Контакты",
  "Robonomics is 100% open-source.": "Robonomics - это 100% открытый исходный код.",
  "Anyone can contribute to": "Любой может внести свой вклад в",
  "the code base": "базу кода",
  "or": "или",
  "build services with Robonomics": "создавать сервисы с помощью Robonomics",
  "White Paper 2022": "Белая книга 2022",
  "Timeline": "Таймлайн",
  "Tokenomics": "Токеномика",
  "Parachain": "Парачейн",
  "User (D)App": "Пользовательское (D)App",
  "Function request": "Запрос функции",
  "Report": "Отчет",
  "Control": "Контроль",
  "Log": "Журнал",
  "IoT Device": "Устройство IoT",
  "Decentralized application": "Децентрализованное приложение",
  "Digital twin": "Цифровой двойник",
  "IoT / Smart device": "IoT / Умное устройство",
  "Robonomics tokenomics": "Токеномика Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "- это утилитарный токен, который позволит контролировать устройства IoT на основе сети Ethereum и парачейна Robonomics в экосистеме Polkadot.",
  "Token distribution": "Дистрибуция токена",
  "The task": "Задача",
  "Try our Dapp": "Попробуйте наш Dapp",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "вы можете работать с XRT в блокчейнах, используя инструменты, предоставленные различными независимыми командами в сообществах Polkadot (Kusama) и Ethereum.",
  "Within the Kusama network, you have the capability use": "В рамках сети Kusama у вас есть возможность использовать",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "коммуникацию между парачейном Robonomics и другими парачейнами с использованием различных децентрализованных приложений (dApps):",
  "Attention please": "Внимание, пожалуйста",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Если вы использовали сервис Multichain для мостовых транзакций, пожалуйста, воздержитесь от его использования на данный момент, так как это было",
  "announced": "объявлено",
  "on the official Twitter of The Multichain.": "в официальном Twitter The Multichain.",
  "Be aware of scammers": "Остерегайтесь мошенников",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "пожалуйста, используйте только известные рынки для обмена XRT. Не отправляйте свои токены на аккаунты, отправленные вам в личных сообщениях, какую бы транзакцию вы ни хотели совершить (купить или продать токен). Если вы получили какие-либо «громкие заявления» о токене Robonomics (мошенники часто используют что-то вроде объявления об airdrop), пожалуйста, проверьте этот сайт (https://robonomics.network/) или наш",
  "for official updates. Be careful, be safe.": "для получения официальных обновлений. Будьте осторожны, будьте в безопасности.",
  "XRT in Ethereum": "XRT в Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реализуя проект Robonomics в 2015-2018, команде проекта необходимо было найти связь между обеспечением сетью Robonomics полезной функции, а именно запуском IoT-устройств по модели «робот как услуга», и возмещением затрат провайдеров Robonomics на комиссию за газ в Ethereum. Нам нужно было подумать о жизненном цикле обязательства каждого отдельного смарт-устройства за выполнение услуги. В результате ранних исследований и разработок в Robonomics команда разработала механизм майнинга новых токенов для вознаграждения каждого созданного смарт-контракта формата «робот как услуга». Эта модель остается жизнеспособной для будущего Robonomics на Ethereum, но только со значительными улучшениями в Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочтите это, чтобы узнать историю и долгосрочные планы команды на XRT в экосистеме Ethereum.",
  "Etherscan profile": "Etherscan профиль",
  "View token smart contract and transactions in Ethereum network here.": "Посмотреть смарт-контракт токена и транзакции в сети Ethereum можно здесь",
  "Coingecko markets": "Биржи Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Здесь вы можете найти биржи CEX и DEX для торговли XRT.",
  "XRT In Polkadot": "XRT в Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходя от Ethereum к Polkadot, нам нужно «масштабироваться» в токеномике. Парачейны в экосистеме Polkadot не являются эквивалентами смарт-контрактов, а представляют собой полностью программируемый блокчейн, арендующий сегмент всей сети.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактический платеж со стороны парачейнов Polkadot и Kusama — это долгосрочное связывание нативных токенов Relay chain (DOT/KSM) в количестве, достаточном для победы в одном из аукционов. XRT в парачейне Robonomics поддерживает обновление слотов и вознаграждения для стейкхолдеров. Механизм сжигания XRT, лежащий в основе активации IoT-подписок, призван снизить инфляцию до минимума, а в случае повышенного интереса до нуля.",
  "Learn more": "Узнайте больше",
  "in Twitter thread from our network architect.": "в твиттер-треде от нашего архитектора сети.",
  "Usage:": "Использование:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можно использовать как для оплаты комиссий за выполнение транзакций в парачейне, так и для покупки IoT-подписки, которая гарантирует приоритетную обработку IoT-транзакций устройств или пользователей.",
  "Rewards:": "Вознаграждения:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "В течение года парачейн выпускает небольшое количество XRT, чтобы стимулировать коллаторов парачейна.",
  "The parameter of the total reward": "Параметр общего вознаграждения",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для коллаторов за год определяется ончейн-голосованием держателей токенов и может быть изменен путем проведения референдума.",
  "Use XRT": "Используйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купите IoT-подписку в нашем децентрализованном приложении. Управляйте своими умными устройствами через блокчейн без наблюдения какой-либо централизованной корпорацией.",
  "Subscan profile": "Subscan профиль",
  "View token statistics on top of Polkadot ecosystem.": "Просматривайте статистику токенов в экосистеме Polkadot.",
  "Other questions": "Другие вопросы",
  "What is RWS?": "Что такое RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Разрабатывается основная функциональность] Для инженеров команда Core Dev попытается создать различные модели использования Robonomics, и первым шагом на этом пути будет запуск токена пожизненной подписки — токена RWS. Каждый токен RWS дает вам 1 транзакцию в секунду (tps) с/на ваше IoT-устройство через парачейн Robonomics. Активируйте свой токен RWS и совершайте транзакции с «бесплатным газом» с предварительным выполнением и предсказуемой задержкой. Деактивируйте токен RWS и обменяйте его на DEX.",
  "What is AIRA/AIR ID?": "Что такое AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT токен был распространен в 2017 году как автономная часть будущей инфраструктуры Robonomics на Ethereum. После успешного запуска Robonomics над Ethereum в 2019 году токены AIRA были подключены к созданной инфраструктуре проекта через",
  "ambix smart contract": "смарт-контракт ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "который гарантировал автономный и независимый процесс обмена pre-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "токена Robonomics — обеспечить работу децентрализованной сети для обслуживания Умных городов и Индустрии 4.0 в инфраструктуре блокчейна. Для достижения этой цели экономика токена должна отражать стимулы для реализации сети.",
  "In addition": "Кроме того",
  "Within the Ethereum network you can use decentralized application powered by the": "В рамках сети Ethereum вы можете использовать децентрализованные приложения, работающие на основе",
  "Translation was executed by AI so there may be some inaccuracies": "Перевод был выполнен искусственным интеллектом, поэтому могут быть некоторые неточности",
  "Inform us": "Сообщите нам",
  "please": "пожалуйста",
  "if you find any": "если вы найдете какие-либо",
  "Scientific Papers with Robonomics": "Научные статьи с Робономикой",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Децентрализованное приложение (dapp) работает в рамках Blockchain. Оно имеет открытый исходный код, а его данные хранятся на IPFS и Github. Эти технологии позволяют приложению быть безопасным и прозрачным одновременно. Наши разработчики работают как над созданием приложения Robonomics, так и над библиотеками, которые вы можете использовать при создании своего собственного dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Цифровой двойник — это один из инструментов, предоставляемых Robonomics Web Services (RWS). Он действует как цифровая версия реального оборудования и копирует все его технические характеристики. Это позволяет сделать децентрализованное приложение более отзывчивым на команды пользователя.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Вы можете использовать Robonomics с широким спектром умных устройств Zigbee для автоматизации и управления различными аспектами вашего дома/офиса или использовать ее с робототехникой на основе ROS для более сложных промышленных задач.",
  "Robot and electrics sheep artboard": "Робот и художественная доска с овцами",
  "Robot and apple artboard": "Робот и художественная доска с яблоком",
  "Robot and cosmonaut artboard": "Робот и художественная доска с космонавтом",
  "Robot and cat artboard": "Робот и художественная доска с кошкой",
  "Space travelers artboard": "Художественная доска для космических путешественников",
  "Coloured astronaut artboard": "Цветной астронавт на художественной доске",
  "Black and white astronaut artboard": "Черно-белый астронавт на художественной доске",
  "icons for macos": "Иконки для macOS",
  "icons for windows": "Иконки для Windows",
  "Do Androids Dream of Electric Sheep?": "Мечтают ли Андроиды об Электроовцах?",
  "Sleeping Mew Space": "Спящий Мяу-Космос",
  "Are you ready for Mars?": "А вы готовы к Марсу?",
  "Shiva Robot": "Шива-робот",
  "Space Travelers": "Космические Путешественники",
  "Retro Astronaut": "Ретро Астронавт",
  "New Newton": "Новый Ньютон",
  "White Paper / May 12, 2018": "Белая бумага / 12 мая 2018 года",
  "If you want to go deeper into learning Robonomics Network, read this document (.pdf ~ 2 MB).": "Если вы хотите углубиться в изучение сети Робономики, прочитайте этот документ (.pdf ~ 2 МБ).",
  "2021, Robot-as-a-Service: From Cloud to Peering Technologies": "2021 год, Робот-как-сервис: от облачных до пиринговых технологий",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Александр Капитонов, Сергей Лоншаков, Виталий Булатов, Бабак Киа Монтазам, Джеймс Уайт",
  "2020, Trustable Environmental Monitoring by means of Sensors Networks on Swarming Autonomous Marine Vessels and Distributed Ledger Technology": "2020 год, Доверительный мониторинг окружающей среды с помощью сетей датчиков на автономных морских судах и технологии распределенного реестра",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Иван Берман, Энрика Зерейк, Александр Капитонов, Фабио Бонсиньорио, Алишер Хасанов, Азиза Орипова, Сергей Лоншаков, Виталий Булатов",
  "2019, Digital Passport for Unmanned Vehicles": "2019 год, Цифровой паспорт для беспилотных транспортных средств",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Вадим Манаенко, Александр Капитонов, Иван Берман",
  "2019, Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "2019 год, Робономика как блокчейн-платформа для управления беспилотным движением мобильных транспортных средств",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Александр Капитонов; Иван Берман; Вадим Манаенко; Вячеслав Ржевский; Виталий Булатов; Артемий Зенкин",
  "2019, Towards Blockchain-based Multi-Agent Robotic Systems: Analysis, Classification and Applications": "2019 год, К блокчейн-ориентированным мультиагентным робототехническим системам: анализ, классификация и применение",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Илья Афанасьев, Александр Колотов, Руслан Резин, Константин Данилов, Мануэль Маззара, Субхам Чакраборти, Алексей Кашевник, Андрей Чечулин, Александр Капитонов, Владимир Йоцов, Андон Топалов, Никола Шакев, Севиль Ахмед",
  "2019, Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "2019 год, Робототехнические сервисы для новых парадигм умных городов на основе децентрализованных технологий",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Александр Капитонов, Сергей Лоншаков, Иван Берман, Эдуардо Кастельо Феррер, Фабио П. Бонсиньорио, Виталий Булатов, Александр Свистов",
  "2019, Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "2019 год, Протокол для организации децентрализованной автономной агентской сети на фабриках с использованием рыночных механизмов",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Александр Капитонов, Иван Берман, Сергей Лоншаков, Александр Крупенкин, Виталий Булатов",
  "2018, Towards Blockchain-Based Robonomics: Autonomous Agents Behavior Validation": "2018 год, К блокчейн-ориентированной Робономике: проверка поведения автономных агентов",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Константин Данилов; Руслан Резин; Илья Афанасьев; Александр Колотов",
  "2018, Transforming climate finance and green investment with blockchains": "2018 год, Преобразование климатического финансирования и зеленых инвестиций с помощью блокчейнов",
  "Alastair Marke": "Аластер Марке",
  "2018, Robonomics: platform for integration of cyber physical systems into human economy": "2018 год, Робономика: платформа для интеграции киберфизических систем в человеческую экономику",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Сергей Лоншаков, Александр Крупенкин, Александр Капитонов, Евгений Радченко, Алишер Хасанов, Александр Старостин",
  "2018, Blockchain based protocol for economical communication in industry 4.0": "2018 год, Протокол на основе блокчейна для экономического общения в промышленности 4.0",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Александр Капитонов, Иван Берман, Сергей Лоншаков, Александр Крупенкин",
  "2018, Robonomics based on blockchain as a principle of creating smart factories": "2018 год, Робономика на основе блокчейна как принцип создания умных фабрик",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Александр Капитонов, Иван Берман, Виталий Булатов, Сергей Лоншаков, Александр Крупенкин",
  "2018, Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "2018 год, Экосистема блокчейна для рынков углерода, экологических активов, прав и обязательств: концепт-дизайн и реализация",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Антон Галенович, Сергей Лоншаков, Алексей Шадрин",
  "2017, Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "2017 год, Протокол на основе блокчейна для автономной бизнес-деятельности мультиагентных систем, состоящих из БПЛА",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Александр Капитонов, Сергей Лоншаков, Александр Крупенкин, Иван Берман",
  "The latest Robonomics news here.": "Последние новости Робономики здесь.",
  "Follow us": "Следуйте за нами",
  "Video tutorials, screencasts, interviews, events.": "Видеоуроки, скринкасты, интервью, мероприятия.",
  "Watch videos": "Смотреть видео",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "Общайтесь с нами и нашим сообществом. Не стесняйтесь задавать вопросы и обсуждать свои предложения.",
  "Join chat": "Присоединиться к чату",
  "Medium Blog": "Блог Medium",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "Наше видение прошлого, настоящего и будущего Робономики, сетей Ethereum, Polkadot, зеленых рынков, робототехники и всего, что связано с Робономикой.",
  "Read": "Читать",
  "Telegram chat": "Чат в Telegram",
  "Local communities & news. You are welcome!": "Местные сообщества и новости. Добро пожаловать!",
  "Updated use cases for connected robots within web3 technologies.": "Обновленные примеры использования связанных роботов с использованием технологий web3.",
  "17 use cases for connected robots within Polkadot and Ethereum.": "17 примеров использования связанных роботов с использованием Polkadot и Ethereum.",
  "Here, we are explaining the idea of a cyber-physical system, how it can assist with scaling manufacturing, and what to do about the liabilities of robots.": "Здесь мы объясняем идею кибер-физической системы, как она может помочь в масштабировании производства и что делать с обязательствами роботов.",
  "The baseline here is that free economic principles are enough for living in an automated world. Robots can be our friends, and we don't need centralization to make it comfortable and reliable.": "Основная идея здесь заключается в том, что свободные экономические принципы достаточны для жизни в автоматизированном мире. Роботы могут быть нашими друзьями, и нам не нужна централизация, чтобы сделать это комфортным и надежным.",
  "Additional icons for the wallpaper:": "Дополнительные иконки для обоев:",
  "Want emails from robonomics": "Хотите получать электронные письма от Robonomics",
  "Adding you to our special list...": "Добавление вас в наш специальный список...",
  "Nice, you are in the list": "Отлично, вы в списке",
  "Something went  wrong. Try again later": "Что-то пошло не так. Попробуйте позже",
  "Our library": "Наша библиотека",
  "Free E-Books": "Бесплатные электронные книги",
  "Our recommendations": "Наши рекомендации",
  "We recommend these books if you want to become more involved, inspired, and self-educated in robotics, advance in the field, and understand the economics behind it. You can download or purchase these books from other sources.": "Мы рекомендуем эти книги, если вы хотите быть более вовлеченными, вдохновленными и самообразованными в области робототехники, продвигаться в этой сфере и понимать экономику, лежащую в ее основе. Вы можете скачать или приобрести эти книги из других источников.",
  "Community & Contacts": "Сообщество и контакты",
  "Get latest updates": "Получайте последние обновления",
  "Your email": "Ваш адрес электронной почты",
  "Tell us something if you want": "Расскажите нам что-нибудь, если хотите",
  "Submit": "Отправить",
  "Something went  wrong :( Try again later": "Что-то пошло не так :( Попробуйте позже",
  "Robonomics nfts": "Robonomics NFT",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Здесь мы собрали коллекцию NFT, созданных во время нашего обширного крипто-путешествия, как независимо, так и с великими командами. Эти уникальные токены предлагают проверяемую собственность на блокчейне и являются отличным украшением для вашего блокчейн-аккаунта. Вы можете делать ставки на некоторые из них на аукционе или даже создавать свои собственные уникальные произведения.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Во время нашей первоначальной кампании по сбору средств на Kusama мы приняли решение вознаградить наших крипто-пионеров не только токенами, но и подарить им красочный NFT. Эта карточка имеет большое значение для нас, и если кто-то ее владеет, мы знаем, что он является фантастическим сторонником ценностей Robonomics: свободы и децентрализации.",
  "Robonomics crypto girls": "Robonomics Crypto Girls",
  "2. Robonomics crypto girls": "2. Robonomics Crypto Girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Мы рады представить нашу специальную серию цифровых активов - Robonomics Crypto Girls, созданных командой Robonomics Art&Science. Каждый NFT в этой коллекции является уникальным графическим представлением технологии, используемой в Robonomics или созданной на основе применения Robonomics. Наши талантливые художники нарисовали каждую девушку в характерном стиле Robonomics. Вы можете выбрать ту, которая вам нравится, или собрать всю серию! Приобретая эти NFT, вы не только добавляете стильное дополнение к своей коллекции, но и поддерживаете нас в продолжении инноваций и реализации децентрализованной связи для роботов. Следите за новыми добавлениями в коллекцию!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. СЕЗОННЫЕ КОЛЛЕКЦИИ NFT",
  "On demand minting": "Минтирование по требованию",
  "SEASONAL SPOT NFT COLLECTIONS": "СЕЗОННЫЕ КОЛЛЕКЦИИ NFT",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Эти сезонные коллекции NFT представляют собой уникальный цифровой актив, который запечатлевает уникальное взаимодействие между пользователем и Spot в парачейне Robonomics. Пользователи могут рисовать что угодно в браузере, и робот будет повторять их движения, чтобы создать рисунок, нарисованный от руки. После завершения взаимодействия NFT монтируется на рынке Singular для полкадот-аккаунта пользователя. Теперь любой может взаимодействовать с реальным роботом, находящимся в лаборатории в Калифорнии, чтобы создавать персонализированные и уникальные цифровые активы, которыми можно владеть, покупать и продавать, как и любой другой цифровой актив.",
  "Create your NFT": "Создайте свой NFT",
  "4. automated telescope collection": "4. Коллекция автоматизированных телескопов",
  "automated telescope collection": "Коллекция автоматизированных телескопов",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Находящийся в пустыне Атакама, Чили, физический телескоп может быть доступен через децентрализованное приложение для получения изображений астрономических объектов в реальном времени в глубоком космосе. Любой пользователь с интернет-соединением может получить доступ к нему с помощью токенов $STRGZN, которые можно приобрести в приложении с использованием кредитной карты. Выберите астрономический объект, отправьте команду телескопу сделать снимок и дождитесь монтирования NFT на платформе Singular. Обратите внимание, что приложение доступно только для использования с 23:00 до 6:00 по GMT-3 из-за рабочих часов телескопа.",
  "Try yourself": "Попробуйте сами",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "В сотрудничестве с Polkapets",
  "and": "и",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Как гордый участник экосистемы Polkadot, Robonomics принял участие в Polka Pets World. Вместе с командой Polka Pets мы создали 1200 NFT с уникальной концепцией дизайна, которая демонстрирует нашу основную идею связности. Чтобы воплотить эту идею в жизнь, мы создали персонажа: андроида, специализирующегося на помощи людям взаимодействовать с любой робототехнической сущностью.",
  "6. Mecha Arm Jetpack": "6. Механический реактивный ранец",
  "Mecha Arm Jetpack": "Механический реактивный ранец",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "В 2021 году Robonomics начал поддержку добавления палет RMRK в свою среду выполнения, что привело к нативной интеграции с самой передовой логикой NFT в мире. Чтобы отпраздновать этот знаменательный момент, мы запустили специальный совместимый с Kanaria предмет - дочерний NFT, который можно экипировать на птицу Kanaria и который может давать преимущества в метавселенной RMRK.",
  "RMRK Partnerships": "Партнерства RMRK",
  "Robonomics wallpapers": "Обои Robonomics",
  "Regular wallpapers": "Обычные обои",
  "Wallpapers for phones": "Обои для телефонов",
  "Hidden wallpapers": "Скрытые обои",
  "Robonomics art shop": "Арт-магазин Robonomics",
  "Welcome to our brand new online shop on": " Добро пожаловать в наш новый интернет-магазин на",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "В нашем магазине представлена одежда, аксессуары, предметы интерьера и другие товары, которые демонстрируют нашу любовь к робототехнике, технологиям и искусству. Вы можете найти футболки, лонгсливы, толстовки, занавески для ванной, подушки, одеяла и другие полезные товары с уникальным дизайном, созданным художниками Robonomics, а производство и доставка осуществляются сотрудниками Threadless. Наслаждайтесь!",
  "Shop now on threadless": "Купить сейчас на threadless",
  "alternative shop": "альтернативный магазин",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Год начался с крупного достижения — Robonomics выиграла 20-й аукцион слотов парачейна и",
  "officially became": "официально стала",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "парачейном с ID 2048 в сети Kusama. Функции launch, datalog, DigitalTwin, liability и IoT-подписки стали доступны всем пользователям экосистемы. Чтобы предоставить подробную информацию об этом этапе проекта, команда разработчиков опубликовала первые главы",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 на Substrate была выпущена с поддержкой XCM-сообщений, и мы начали открывать HRMP-каналы с другими парачейнами (такими как Crust Shadow и Darwinia), функционал которых нам крайне полезен.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "В то же время мы разблокировали стратегию внедрения нашего протокола на рынок IoT. Наши эксперименты с IoT-оборудованием привели нас к концепции суверенного умного дома, независимого от централизованных поставщиков облачных услуг. Мы разработали свою",
  "integration": "интеграцию",
  "with the Home Assistant automation system, and also designed our own": "с системой автоматизации Home Assistant, а также разработали собственный",
  "IoT gateway": "IoT-шлюз",
  "for connecting smart devices.": "для подключения умных устройств.",
  "We have launched two big initiatives in order to increase community engagement —": "Мы запустили две большие инициативы для повышения вовлеченности сообщества —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Кроме того, осенью был проведен ",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "для того чтобы сообщество Robonomics могло впервые опробовать наши механизмы управления. Недавно команда Robonomics помогла проекту DAO IPCI получить слот для парачейна, чтобы презентовать сервис по компенсации выбросов углерода для умных зданий.",
  "In 2021, our": "В 2021 году наше",
  "main focus": "основное внимание",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "переключилось на подготовку проекта к использованию IoT-приложений с помощью нашего парачейна в сети Kusama. Была выпущена Robonomics 1.0 на Substrate, протестировано подключение датчиков к парачейну с целью отправки их телеметрии, а также разработаны функции цифрового двойника. В середине года мы решили протестировать полный цикл нашей сети и создали собственный релей-чейн под названием",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "в который был интегрирован парачейн Robonomics (до миграции в Kusama). Большой фокус был сконцентрирован на получении слота парачейна в Kusama, для чего мы организовали несколько краудлоан-кампаний.",
  "There have been two big changes for the community. First, we launched the": "В сообществе произошли два больших изменения. Во-первых, мы запустили",
  "Robonomics Grant Program": "грантовую программу Robonomics",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "которая позволяет проектам в области робототехники, web3 и IoT получать финансирование для R&D задач. К концу года в программе участвовали четыре активных проекта. Во-вторых, команда запустила",
  "Exodus process": "процесс Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "позволив держателям токенов Ethereum переместить свои токены XRT в парачейн.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Среди коллабораций можно упомянуть примечательное появление Boston Dynamics Spot у MerkleBot, для которого была разработана",
  "rental remote control system": "система аренды удаленного управления роботом",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Также стоит упомянуть о появлении компании Multi-Agent Systems, которая является личным проектом команды инженеров Robonomics. Они разработали робота-повара под названием Eisenkoch, который может выпекать вафли для посетителей кофеен.",
  "There came a time when the existing limitations of Ethereum": "В этот период",
  "began to stand out clearly": "стали отчетливо выделяться",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "существующие ограничения сети Ethereum (в частности, плохая масштабируемость, низкая скорость и очень высокая стоимость транзакций). Обновление до ETH2.0 должно было исправить ситуацию, но это обновление неоднократно откладывалось. Мы не хотели покидать сеть Ethereum, но поняли, что в текущей ситуации сложно реализовать наши сценарии применения, и начали искать альтернативную сеть. Этой альтернативой стала сегментированная блокчейн-экосистема Polkadot. Мы начали эксперементировать с фреймворком Substrate, чтобы перенести основные функции Robonomics и развернуть собственную тестовую сеть. К концу этого этапа мы развернули наш парачейн в тестовой сети Rococo и начали подготовку к получению слота в сети Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Продолжая изучать IoT-системы, мы определили основной функционал Robonomics, который может принести ценность пользователям — функцию децентрализованного облака для IoT. Эта идея легла в основу",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Инфраструктура RWS взяла на себя все функции типичного централизованного облака, но без стандартных проблем глобальной доступности, безопасности и конфиденциальности. Кроме того, мы предложили идею IoT-подписок для парачейна, которая позволяет держателям подписки использовать блокчейн-сеть без необходимости платить комиссию за каждую транзакцию. Первым экспериментом с IoT-подписками стала эмиссия токена RWS, который позволяет его владельцу отправлять 1 транзакцию на блок парачейна. Кроме того, мы начали делать первые шаги по разработке собственного аппаратного набора для управления умными устройствами (концепция DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Разумеется, поддержка Robonomics на Ethereum не прекратилась. Коммуникационный стек Robonomics был доработан до версии",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Токен XRT начал торговаться на нескольких биржах (в частности, Uniswap DEX), а также была запущена программа поддержки ликвидности.",
  "The team actively developed ways to interact with the community. The first version of our": "Команда активно разрабатывала способы взаимодействия с сообществом. Была запущена первая версия нашего",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "и Robonomics Wiki. Для более прозрачного и удобного управления проектами мы начали использовать ",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "В 2019 году мы провели",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "для новичков в проекте.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Сотрудничество с дружественными проектами также было продолжено. Robonomics и проект DAO IPCI представили сервис для сбора и анализа сенсорных данных - ",
  "Robonomics became the foundation for the": "Robonomics стала основой для проекта",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "разрабатывающего систему умного лизинга роботизированного оборудования.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Мы понимали, что автономным агентам нужна среда, обеспечивающая их надежную техническую и экономическую деятельность. Несколько лет мы разрабатывали протокол для создания децентрализованной сети провайдеров, которые помогают роботам-агентам предоставлять свои услуги. Были разработаны инструменты для обслуживания сети и коммуникационный стек между Ethereum и ROS. В 2018 году мы опубликовали",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "после чего была запущена альфа-версия сети Robonomics в Ethereum. Мы продолжили активную подготовку к генерации токенов XRT (которая в итоге задержалась до весны 2019 года из-за первой криптозимы).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "С этого периода Robonomics начала динамично разрабатывать сценарии применения, связанные с Индустрией 4.0 — умные фабрики, умные города и умные дома — и это привлекло наше пристальное внимание к миру Интернета вещей. В поисках инноваций команда представила несколько крупных и уникальных R&D демонстраций: гражданская",
  "sensor network": "сеть датчиков",
  "a water drone": "водный дрон",
  "for environmental monitoring (supported by a sensor systems manufacturer": "для мониторинга окружающей среды (при поддержке производителя сенсорных систем",
  "a smart factory model": "модель умной фабрики",
  "a self-employed": "зарабатывающий независимо от человека",
  "robot artist Gaka-chu": "робот-художник Gaka-chu",
  "and a": "и",
  "drone traffic management system": "система управления трафиком дронов",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics начала сотрудничество с проектом DAO IPCI по управлению экологическими активами с использованием технологий web3 и IoT-устройств.",
  "Important news &amp; announcements": "Важные новости и объявления",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Это был период активной R&D деятельности, в ходе которой мы определили круг задач, в которых p2p-технологии обладают возможностями, недоступными ранее для робототехники. Объединив компьютер Ethereum, файловое хранилище IPFS и Robot Operating System (ROS), мы поняли, что любое устройство потенциально может стать",
  "autonomous intelligent robot agent": "автономным умным роботом-агентом",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "В свою очередь, это открыло нам путь к концепциям Robot-as-a-Service и экономики роботов.",
  "Our publications in scientific journals of this period are available in the": "Наши публикации в научных журналах этого периода доступны в разделе",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Все R&D проекты за эти годы доступны в ",
  "a handy book": "удобной книге",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Все началось с идеи, которая пришла в голову основателям проекта, когда Ethereum только запустил свою основную сеть. Что если робот будет выполнять работу для клиента за криптовалюту, а его логика управляется смарт-контрактом?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Чтобы проверить идею, мы сделали демонстрацию, в которой дрон, управляемый компьютером Ethereum, запускался для достижения заданных GPS-координат после того, как пользователь совершил платежную транзакцию.",
  "The demo is available on": "Демо доступно на",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "ТАЙМЛАЙН РАЗРАБОТКИ ИНФРАСТРУКТУРЫ И ТЕХНОЛОГИЙ",
  "Notable events": "Примечательные события",
  "World Economic Forum Annual Meeting 2022": "World Economic Forum Annual Meeting 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "На пути к автоматизации суверенного дома",
  "Becoming a Parachain for IoT Applications": "Становление парачейном для IoT-приложений",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (при поддержке Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (организованная Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Трансформация в мультисеть — И пришел Polkadot",
  "The Rise of Robonomics Network": "Расцвет сети Robonomics",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop 'The Economy of Robots'": "Семинар на тему 'Экономика Роботов' в Европарламенте",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Symposium on Blockchain for Robotic Systems at MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics Summer School 2018, организованная командой Robonomics",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Объединение web3-технологий и фреймворков робототехники",
  "Playing with Human-Machine Interaction through Ethereum": "Развлекаясь с человеко-машинным взаимодействием через Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Гайд по Robonomics White Paper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Мы разработали протокол техникоэкономической коммуникации машин, работающий поверх Ethereum и IPFS, и дополнили его элементами облачной IoT-платформы на базе парачейна Polkadot. Сегодня мы имеем гибридную платформу для создания футуристичных IoT-приложений. Она обеспечивает взаимодействие с устройствами, находящимися под управлением мирового децентрализованного компьютера. Прежде чем использовать платформу Robonomics, погрузимся немного в теорию.",
  "The first two chapters of the Robonomics white paper are already available to users.": "Для пользователей уже доступны первые 2 главы robonomics white paper.",
  "Chapter 1.": "Глава 1.",
  "At the intersection of cybernetics and economics": "На стыке кибернетики и экономики",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Мы представили экономическую систему, в которой робототехнические устройства выступают как независимые агенты, способные к выполнению ключевых экономических активностей, ранее присущих только человеку. В этой главе мы осветим актуальность появления экономики роботов, которая в будущем может стать важной частью жизни людей и изменить текущий уровень экономики в полностью автоматизированные сервисы.",
  "In this chapter you will learn": "В этой главе вы узнаете\r \r",
  "Ronald Coase and The Nature of the Firm": "Рональд Коуз и природа фирмы\r \r",
  "CPS - cyber-physical system": "КФС – кибер-физическая система\r \r",
  "Norbert Wiener and the search for patterns in living and machine": "Норберт Винер и поиск закономерностей в живом и машинном\r \r",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Четвёртая промышленная революция, деньги для роботов и Bitcoin\r \r",
  "Ethereum Smart Contracts": "Умные контракты Ethereum\r \r",
  "Polkadot Parachains": "Парачейны Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Открытые вопросы телеологии и работа Мизеса",
  "Read chapter 1": "Читать главу 1",
  "Chapter 2.": "Глава 2.",
  "Robonomics architecture": "Архитектура robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Во 2 главе вы узнаете о взаимодействии людей и машин с использованием современных интернет-технологий – от IoT-устройств к децентрализованной и глобально доступной сети провайдеров. Мы осветим основы Интернета вещей, чтобы выделить проблематику и ключевые вызовы, с которыми сталкиваются создатели IoT-систем и на решение которых направлена Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Обзор состояния Интернета вещей",
  "Classification of IoT devices": "Классификация IoT-устройств\r",
  "Embedded IoT systems": "Встраиваемые IoT-системы\r",
  "Edge-systems: IoT gateways and controllers": "Edge-системы: IoT-шлюзы и контроллеры\r",
  "Autonomous Systems": "Автономные системы\r",
  "Internet of Things providers": "Провайдеры Интернета вещей\r",
  "Digital twins are the heart of the Internet of Things": "Цифровые двойники — сердце Интернета вещей\r",
  "IoT data flows in cloud service": "Потоки IoT-данных в облачных сервисах\r\r",
  "Popular examples of IoT solutions": "Популярные примеры IoT-решений\r\r",
  "Current problems of building IoT solutions": "Актуальные проблемы построения IoT-решений\r\r",
  "Main tasks of Robonomics architecture": "Основные задачи архитектуры Robonomics",
  "Basic components of Robonomics architecture": "Базовые компоненты архитектуры Робономики\r\r",
  "A simple representation of Robonomics architecture": "Простое представление архитектуры Robonomics",
  "Read chapter 2": "Читать главу 2",
  "We continue to update the white paper of Robonomics": "Мы продолжаем дополнять белую бумагу Robonomics,",
  "stay tuned for new parts on our website and in Discord": "следите за выходом новых частей на сайте и в Discord",
  "Join our discord": "Присоединяйтесь к нашему discord",
  "Robonomics logos and usage": "Логотипы Robonomics и их использование",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Мы собрали логотипы Robonomics, а также руководства по их использованию.",
  "Download Robonomics logo": "Скачать логотип Robonomics",
  "Download RWS logo": "Скачать логотип RWS",
  "Download wiki logo": "Скачать логотип wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Используйте эти разрешенные логотипы для ссылки на Robonomics, RWS или Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Используйте разрешенный логотип Robonomics, чтобы сообщить, что вы интегрированы с Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Используйте разрешенные логотипы для постов в блоге, статьях и презентациях о технологии Robonomics и интегрированных проектах.",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Не модифицируйте разрешенные логотипы Robonomics, в том числе не изменяйте цвет, размеры и не комбинируйте их с другими словами или элементами дизайна",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Не используйте логотип и название Robonomics таким образом, который предполагает, что вы представляете Robonomics, что ваше предложение или проект принадлежат Robonomics или что Robonomics поддерживает вас или ваше предложение/проект, если они не были одобрены Robonomics DAO",
  "Robonomics Color pallet": "Цветовая палитра Robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Эти цвета мы используем в наших интерфейсах, принтах и других визуальных элементах. </br> Используйте эту палитру для своих презентаций, баннеров для постов и т. д., рассказывающих о Robonomics."
}