{
  "What is Robonomics network?": "Что такое сеть Robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics - это платформа с открытым исходным кодом для приложений IoT, которая позволяет обмениваться технической и экономической информацией в форме атомных транзакций между пользовательскими приложениями, IoT-сервисами и сложными робототехническими системами.",
  "Get started": "Начать",
  "Explore Robonomics": "Исследуйте Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics - это технология с открытым исходным кодом для рынка IoT, доступная каждому. Прочтите краткое изложение, чтобы узнать больше",
  "Get XRT": "Получить XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT - это утилитарный токен, который позволяет управлять устройствами IoT на основе сети Ethereum и Robonomics parachain",
  "Use a Dapp": "Использовать Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Ознакомьтесь с бета-версией децентрализованного приложения для управления устройствами IoT",
  "Start building": "Начать создание",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Изучайте Robonomics с помощью учебных пособий и практически полезных экспериментов в Robonomics WIKI",
  "Robonomics objectives": "Цели Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Основываясь на достижениях облачных платформ, Robonomics стремится предложить рынку IoT более безопасные и передовые интернет-решения на каждом этапе взаимодействия человека и машины. Вот основные задачи, для которых разрабатывается Robonomics",
  "IoT device management with a decentralized cloud": "Управление устройствами IoT с децентрализованной облачной платформой",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Блокчейн-сети имеют все параметры для обеспечения высочайшего уровня безопасности при запуске устройства и получении телеметрии. Взаимодействие с устройством фактически может быть описано изменением состояния цифрового двойника, хранящегося в блокчейн-сети, и передачей информации об этих изменениях на физическое устройство. В случае использования блокчейна без разрешения, мы можем быть уверены в глобальной доступности провайдеров, а также в высоком уровне защиты данных цифрового двойника от нежелательных изменений.",
  "Techno-economic transactions between humans and machines": "Техно-экономические транзакции между людьми и машинами",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Мы можем говорить об институциональных достижениях в терминах доступа автоматизированных систем непосредственно к цифровым рынкам через криптовалюты и смарт-контракты. Например, Ethereum уже реализует большинство основных инструментов экономической деятельности. Приложения, созданные сегодня для связи конечного пользователя и устройств IoT, будут гораздо эффективнее, если оплата и условия обслуживания неразрывно связаны с параметрами запуска устройства.",
  "Serverless IoT applications for users": "Бессерверные приложения IoT для пользователей",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Вопрос о конфиденциальности пользователей современных приложений не должен застревать в неспособности компаний использовать современные достижения в области web3. Нет необходимости аутентифицироваться или требовать подключения к конкретным серверам для доступа к телеметрии и управлению устройством.",
  "Learn with Robonomics": "Учиться с Robonomics",
  "Introduction course": "Вводный курс",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Погрузитесь в проблемы, возникающие при создании современных приложений Интернета вещей и возможные решения с использованием технологий web3 и инструментов Robonomics для разработчиков и пользователей IoT.",
  "Boston dynamics spot software developing": "Разработка программного обеспечения для робота Boston Dynamics Spot",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Мы рады представить вам образовательную программу Spot SDK! Наша цель - познакомить вас с SDK Spot и позволить вам проверить свои навыки удаленно, используя робота Boston Dynamics Spot в нашей лаборатории.",
  "Sovereign smart home with robonomics and home assistant": "Суверенный умный дом с помощью Robonomics и Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "В этом курсе вы пройдете все необходимые шаги для создания своего собственного суверенного умного дома, основным преимуществом которого является безопасность/конфиденциальность пользовательских данных.",
  "Shop": "Магазин",
  "Science papers": "Научные статьи",
  "Books": "Книги",
  "Logo and assets": "Логотип и ресурсы",
  "Wallpapers": "Обои",
  "Blog": "Блог",
  "Cases": "Кейсы",
  "Ambassador program": "Программа посла",
  "Contacts": "Контакты",
  "Robonomics is 100% open-source.": "Robonomics - это 100% открытый исходный код.",
  "Anyone can contribute to": "Любой может внести свой вклад в",
  "the code base": "базу кода",
  "or": "или",
  "build services with Robonomics": "создавать сервисы с помощью Robonomics",
  "White Paper 2022": "Белая книга 2022",
  "Timeline": "Хронология",
  "Tokenomics": "Токеномика",
  "Parachain": "Парачейн",
  "User (D)App": "Пользовательское (D)App",
  "Function request": "Запрос функции",
  "Report": "Отчет",
  "Control": "Контроль",
  "Log": "Журнал",
  "IoT Device": "Устройство IoT",
  "Decentralized application": "Децентрализованное приложение",
  "Digital twin": "Цифровой двойник",
  "IoT / Smart device": "IoT / Умное устройство",
  "Robonomics tokenomics": "Токеномика Robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "- это утилитарный токен, который позволит контролировать устройства IoT на основе сети Ethereum и парачейна Robonomics в экосистеме Polkadot.",
  "Token distribution": "Распределение токенов",
  "The task": "Задача",
  "Try our Dapp": "Попробуйте наш Dapp",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "вы можете работать с XRT в блокчейнах, используя инструменты, предоставленные различными независимыми командами в сообществах Polkadot (Kusama) и Ethereum.",
  "Within the Kusama network, you have the capability use": "В рамках сети Kusama у вас есть возможность использовать",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "коммуникацию между парачейном Robonomics и другими парачейнами с использованием различных децентрализованных приложений (dApps):",
  "Attention please": "Внимание, пожалуйста",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Если вы использовали сервис Multichain для мостовых транзакций, пожалуйста, воздержитесь от его использования на данный момент, так как это было",
  "announced": "объявлено",
  "on the official Twitter of The Multichain.": "в официальном Twitter The Multichain.",
  "Be aware of scammers": "Будьте осторожны с мошенниками",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "пожалуйста, используйте только известные рынки для обмена XRT. Не отправляйте свои токены на счета, которые вам предлагают в личных сообщениях, независимо от того, какую транзакцию вы хотите выполнить (покупку или продажу токенов). Если вы получили какие-либо «громкие заявления» о токене Robonomics (мошенники часто используют что-то вроде объявления о раздаче), пожалуйста, проверьте этот веб-сайт (https://robonomics.network/) или наш",
  "for official updates. Be careful, be safe.": "для официальных обновлений. Будьте осторожны, будьте в безопасности.",
  "XRT in Ethereum": "XRT в Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реализуя проект Robonomics в 2015-2018 годах, команде проекта потребовалось найти связь между предоставлением полезной функции Robonomics Network, а именно запуском устройств IoT в соответствии с моделью робота-как-сервиса, и возмещением затрат поставщикам Robonomics на комиссии за газ в Ethereum. Нам нужно было подумать о жизненном цикле ответственности каждого отдельного умного устройства за выполнение услуги. В результате ранних исследований и разработок в Robonomics команда пришла к механизму добычи новых токенов для вознаграждения каждого созданного умного контракта робота-как-сервиса. Эта модель остается жизнеспособной для будущего Robonomics в Ethereum, но только с существенными улучшениями в Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочтите это, чтобы узнать историческую справку и долгосрочные планы команды для XRT в экосистеме Ethereum.",
  "Etherscan profile": "Профиль Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Просмотрите умный контракт токена и транзакции в сети Ethereum здесь.",
  "Coingecko markets": "Рынки Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Здесь вы можете найти рынки CEX и DEX для торговли XRT.",
  "XRT In Polkadot": "XRT в Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходя от Ethereum к Polkadot, нам нужно сделать «масштабирование» в токеномике. Парачейны в экосистеме Polkadot не являются эквивалентом смарт-контракта, а являются полностью программируемым блокчейном, который арендует сегмент общей сети.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактическим платежом со стороны парачейнов Polkadot и Kusama является долгосрочное заблаговременное связывание местных токенов Relay chain (DOT / KSM) в достаточном количестве для выигрыша одного из аукционов. XRT в парачейне Robonomics поддерживает обновление слота и вознаграждения за заинтересованных сторон. Механизм сжигания XRT, лежащий в основе активации подписок IoT, разработан для минимизации инфляции и в случае увеличения интереса - до нуля.",
  "Learn more": "Узнайте больше",
  "in Twitter thread from our network architect.": "в твиттер-треде от нашего архитектора сети.",
  "Usage:": "Использование:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можно использовать как для оплаты комиссий за выполнение транзакций на парачейне, так и для покупки подписки IoT, которая гарантирует приоритетную обработку транзакций устройств или пользователей IoT.",
  "Rewards:": "Вознаграждения:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "На протяжении года парачейн выпускает небольшое количество XRT для стимулирования коллаторов парачейна.",
  "The parameter of the total reward": "Параметр общего вознаграждения",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для коллаторов на год определяется голосованием держателей токенов и может быть изменен путем проведения референдума.",
  "Use XRT": "Используйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купите подписку IoT в нашем децентрализованном приложении. Управляйте своими умными устройствами через блокчейн без участия централизованной корпорации.",
  "Subscan profile": "Профиль Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Просмотр статистики токена в экосистеме Polkadot.",
  "Other questions": "Другие вопросы",
  "What is RWS?": "Что такое RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[В разработке основной функциональности] Для инженеров команды Core Dev попытается создать различные модели использования Robonomics, и первый шаг в этом направлении - запуск токена подписки на всю жизнь - токена RWS. Каждый токен RWS дает вам 1 транзакцию в секунду (tps) от/к вашему устройству IoT через парачейн Robonomics. Активируйте свой токен RWS и совершайте транзакции с «бесплатным газом» с предварительным выполнением и предсказуемой задержкой. Деактивируйте токен RWS и торгуйте им на DEX.",
  "What is AIRA/AIR ID?": "Что такое AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Пред-XRT токен был распределен в 2017 году как автономная часть дальнейшей инфраструктуры Robonomics на Ethereum. После успешного запуска Robonomics на Ethereum в 2019 году токены AIRA были подключены к созданной инфраструктуре проекта через",
  "ambix smart contract": "умный контракт ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "который гарантировал автономный и независимый процесс обмена пред-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Цель токена Robonomics - обеспечить работу децентрализованной сети для обслуживания умных городов и промышленности 4.0 на блокчейн-инфраструктуре. Для достижения этой цели экономика токена должна отражать стимулы для внедрения сети.",
  "In addition": "Кроме того",
  "Within the Ethereum network you can use decentralized application powered by the": "В рамках сети Ethereum вы можете использовать децентрализованные приложения, работающие на основе",
  "Translation was executed by AI so there may be some inaccuracies": "Перевод был выполнен искусственным интеллектом, поэтому могут быть некоторые неточности",
  "Inform us": "Сообщите нам",
  "please": "пожалуйста",
  "if you find any": "если вы найдете какие-либо"
}