{
  "What is Robonomics network?": "¿Qué es Robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics es una plataforma de código abierto para aplicaciones IoT. Apoyamos una nueva generación de tecnologías de Internet (Web3) que implementa el intercambio de información técnica y económica en forma de transacciones atómicas entre aplicaciones de usuario, servicios IoT y robótica compleja.",
  "Serverless IoT applications for users": "Aplicaciones de IoT sin servidor para usuarios",
  "Timeline": "Línea de tiempo",
  "User (D)App": "D(App) de usuario",
  "Function request": "Solicitud de función",
  "Report": "Reporte",
  "Control": "Control",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Aplicación descentralizada",
  "Digital twin": "Gemelo digital",
  "IoT / Smart device": "IoT / Dispositivo inteligente",
  "Robonomics tokenomics": "Tokenomics de robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "es el token de utilidad que permitirá controlar los dispositivos IoT sobre la red Ethereum y la parachain de Robonomics en el ecosistema Polkadot.",
  "Token distribution": "Distribución de tokens",
  "Be aware of scammers": "Tenga cuidado con los estafadores",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "use solo exchange bien conocidos para intercambiar XRT. No envíes tus tokens a cuentas que te den en mensajes privados sea cual sea la transacción que quieras realizar (comprar o vender token). Si recibió alguna 'declaración fuerte' sobre el token de Robonomics (los estafadores a menudo usan algo como un anuncio de airdrop), consulte este sitio web (https://robonomics.network/) o nuestro ",
  "for official updates. Be careful, be safe.": "para obtener actualizaciones oficiales. Ten cuidado, mantente a salvo.",
  "XRT in Ethereum": "XRT en Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Al implementar el proyecto Robonomics entre 2015 y 2018, el equipo del proyecto necesitaba encontrar una conexión entre la provisión de una función útil por parte de Robonomics Network, a saber, el lanzamiento de dispositivos IoT según el modelo de robot como servicio, y el reembolso del costos a proveedores de Robonomics por tarifas de gas en Ethereum. Necesitábamos pensar en el ciclo de vida de la responsabilidad de cada dispositivo inteligente individual para realizar un servicio. Como resultado de la I+D inicial en Robonomics, el equipo ideó un mecanismo para extraer nuevos tokens para recompensar cada contrato inteligente de robot como servicio creado. Este modelo sigue siendo viable para el futuro de Robonomics en Ethereum, pero solo con mejoras significativas en Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lea esto para conocer los antecedentes históricos y los planes a largo plazo del equipo para XRT en el ecosistema Ethereum.",
  "Etherscan profile": "perfil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Vea el contrato inteligente de token y las transacciones en la red Ethereum aquí.",
  "Coingecko markets": "Mercados en Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Aquí puede encontrar los mercados CEX y DEX para operar con XRT.",
  "XRT In Polkadot": "XRT en Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Pasando de Ethereum a Polkadot, necesitamos hacer una 'ampliación' en el tokenomics. Las parachains en el ecosistema de Polkadot no son el equivalente a un contrato inteligente, pero son blockchain completamente programable que arrienda un segmento de la red general.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "El pago real por parte de las parachains de Polkadot y Kusama es la vinculación a largo plazo de tokens de la Relay Chain nativa (DOT/KSM) en cantidad suficiente para ganar una de las subastas. El XRT en Robonomics parachain admite la renovación del slot y recompensas para las partes interesadas. El mecanismo de quema de XRT subyacente a la activación de las suscripciones de IoT está diseñado para reducir la inflación al mínimo y, en caso de que aumente el interés, a cero.",
  "Learn more": "Obtenga más información",
  "in Twitter thread from our network architect.": "en el hilo de Twitter de nuestro arquitecto de red.",
  "Usage:": "Uso:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT se puede usar tanto para pagar tarifas por realizar transacciones en la parachain como para comprar una suscripción IoT que garantiza el procesamiento prioritario de transacciones IoT de dispositivos o usuarios.",
  "Rewards:": "Recompensas:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "A lo largo del año, la parachain emite una pequeña cantidad de XRT para incentivar a los collator de la parachain.",
  "The parameter of the total reward": "El parámetro de la recompensa total",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "para los collators para el año se determina mediante la votación en cadena de los poseedores de token y se puede cambiar mediante la celebración de un referéndum.",
  "Use XRT": "Usar XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Compre una suscripción IoT en nuestra aplicación descentralizada. Controle sus dispositivos inteligentes a través de la blockchain sin que ninguna corporación centralizada los observe.",
  "Subscan profile": "Perfil Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Ver estadísticas de tokens en la parte superior del ecosistema de Polkadot.",
  "Other questions": "Otras preguntas",
  "What is RWS?": "¿Qué es RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[En desarrollo de la funcionalidad central] Para los ingenieros, el equipo Core Dev intentará crear diferentes modelos de uso de Robonomics y el primer paso de esta manera es lanzar un token de suscripción de por vida: token RWS. Cada token RWS le dará 1 transacción por segundo (tps) desde/hacia su dispositivo IoT a través de Robonomics Parachain. Active su token RWS y realice transacciones de 'gas gratis' con una latencia predecible y previa a la ejecución. Desactive el token RWS y cámbielo en un DEX.",
  "What is AIRA/AIR ID?": "¿Qué es AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Token anterior a XRT distribuido en 2017 como parte autónoma de una mayor infraestructura de Robonomics en Ethereum. Después del lanzamiento exitoso de Robonomics sobre Ethereum en 2019, los tokens AIRA se conectaron a la infraestructura creada del proyecto a través del",
  "ambix smart contract": "contrato inteligente ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "que garantizaba un proceso autónomo e independiente de intercambio de pre-XRT a ERC-20 XRT.",
  "The task": "La tarea",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "del token de Robonomics es asegurar el funcionamiento de una red descentralizada para el mantenimiento de las Ciudades Inteligentes y la Industria 4.0 en la infraestructura blockchain. Para lograr este objetivo, la economía de los token debe reflejar los incentivos para la implementación de la red.",
  "Try our Dapp": "Prueba nuestra Dapp",
  "In addition": "Además",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "puedes operar XRT dentro de las blockchains utilizando herramientas proporcionadas por diferentes equipos independientes en las comunidades de Polkadot (Kusama) y Ethereum.",
  "Within the Kusama network, you have the capability use": "Dentro de la red Kusama, tienes la capacidad de usar",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "comunicación entre la parachain de Robonomics y otras parachains utilizando varias aplicaciones descentralizadas (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "Dentro de la red Ethereum puedes usar aplicaciones descentralizadas impulsadas por",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "La aplicación descentralizada (dapp) funciona dentro de Blockchain. Es de código abierto y sus datos se sirven en IPFS y Github. Estas tecnologías permiten que la aplicación sea segura y transparente al mismo tiempo. Nuestros desarrolladores están trabajando tanto en el desarrollo de la aplicación Robonomics y en las bibliotecas que se pueden utilizar al construir su propia dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin (gemelo  digital) es uno de los instrumentos proporcionados por Robonomics Web Services (RWS). Actúa como una versión digital del equipo del mundo real y copia todas sus características técnicas. Permite hacer que una aplicación descentralizada responda mejor a los comandos del usuario.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Puede usar Robonomics con una amplia gama de dispositivos inteligentes Zigbee para automatizar y controlar varios aspectos de su hogar/oficina o usarlo con robótica basada en ROS para tareas industriales más complejas.",
  "Do Androids Dream of Electric Sheep?": "¿Los androides sueñan con ovejas eléctricas?",
  "Your email": "Tu email",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "El año comenzó con un gran logro: Robonomics ganó la vigésima subasta de slot parachain y",
  "officially became": "se convirtió oficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "en la parachain con ID 2048 en la red de Kusama. El lanzamiento, el registro de datos, DigitalTwin, las funciones de responsabilidad y las suscripciones IoT están disponibles para todos los usuarios del ecosistema. Para proporcionar detalles sobre esta fase del proyecto, el equipo central ha publicado los primeros capítulos del",
  "Robonomics Whitepaper 2.0.": "Whitepaper de Robonomics 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0  en Substrate con soporte para mensajes XCM, y comenzamos a abrir canales HRMP con otras parachains (como Crust Shadow y Darwinia), cuya funcionalidad nos resulta de gran utilidad.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Al mismo tiempo, hemos desbloqueado una estrategia para introducir el mercado de IoT a nuestro protocolo. Nuestros experimentos con equipos IoT nos llevaron al concepto de un hogar inteligente soberano, que es independiente de los proveedores de servicios de nube centralizados. Hemos desarrollado nuestra",
  "integration": "integración",
  "with the Home Assistant automation system, and also designed our own": "con el sistema de automatización Home Assistant, y también hemos diseñado nuestra propia",
  "IoT gateway": "puerta de enlace IoT",
  "for connecting smart devices.": "para conectar dispositivos inteligentes.",
  "We have launched two big initiatives in order to increase community engagement —": "Hemos lanzado dos grandes iniciativas para aumentar la participación de la comunidad: ",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Además,",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "se llevó a cabo en otoño para que la comunidad de Robonomics pudiera probar nuestros mecanismos de gobernanza por primera vez. Recientemente, el equipo de Robonomics ayudó al proyecto DAO IPCI a obtener un slot parachain para presentar el servicio de compensación de carbono.",
  "In 2021, our": "En 2021, nuestro",
  "main focus": "enfoque principal",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "cambió a preparar el proyecto para que las aplicaciones de IoT pudieran usarse a través de nuestra parachain en Kusama Network. Se lanzó Robonomics 1.0 en Substrate, y hemos estado probando la conexión de sensores a la parachain para enviar sus datos de telemetría, además de desarrollar la funcionalidad de digital twin. A mediados de año, decidimos probar el ciclo completo de nuestra red y creamos nuestra propia Relay Chain llamada",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "a la que se integró la Robonomics Parachain (antes de migrar a la Kusama Relay Chain). Se ha prestado mucha atención a obtener un espacio para parachain en Kusama, para lo cual organizamos varias campañas de crowdloans.",
  "There have been two big changes for the community. First, we launched the": "Ha habido dos grandes cambios para la comunidad. Primero, lanzamos el",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "que permite que los proyectos de robótica Web3 e IoT reciban financiamiento para tareas de R&D. Al cierre del año, cuatro proyectos activos participaron del programa. En segundo lugar, el equipo inició",
  "Exodus process": "el proceso Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "lo que permitió a los holders de tokens de Ethereum mover sus tokens XRT a la parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Entre las colaboraciones, podemos recordar la aparición destacada de Boston Dynamics Spot en MerkleBot, para el que se desarrolló",
  "rental remote control system": "un sistema de control remoto de alquiler",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "También nos gustaría informaros de la empresa Multi-Agent Systems que es un proyecto personal formado por un equipo de ingenieros de Robonomics. Han desarrollado una gofrera robótica llamada Eisenkoch que realiza tareas de cocina para los propietarios de cafeterías.",
  "There came a time when the existing limitations of Ethereum": "Llegó un momento en que las limitaciones existentes de Ethereum",
  "began to stand out clearly": "comenzaron a destacarse claramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(en particular, poca escalabilidad, baja velocidad y altísimo costo de las transacciones). Se suponía que la actualización a ETH2.0 solucionaría la situación, pero esta actualización se retrasó repetidamente. Si bien no queríamos dejar Ethereum, nos dimos cuenta de que en la situación actual era difícil implementar nuestros casos de uso y comenzamos a buscar una red alternativa. El ecosistema de blockchain fragmentadа de Polkadot se convirtió en esta alternativa. Comenzamos experimentando con el marco Substrate para migrar las funciones principales de Robonomics e implementar nuestra propia testnet. Al final de esta etapa, habíamos implementado nuestra parachain en la Rococo Testnet y comenzamos a prepararnos para obtener un slot en Kusama Network.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando con el estudio de los sistemas IoT, hemos identificado la funcionalidad principal de Robonomics, que puede agregar valor a los usuarios: la función de nube descentralizada para IoT. Esta idea formó la base de",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "La infraestructura de RWS asumió todas las funciones de una nube centralizada típica, pero sin los problemas estándar de disponibilidad global, seguridad y privacidad. Además, se nos ocurrió la idea de las suscripciones de IoT parachain que permiten a los holders de suscripciones utilizar la blockchain sin tener que pagar una tarifa por cada transacción. El primer experimento con suscripciones IoT fue la emisión del token RWS, que permite a su propietario enviar 1 transacción por bloque. Además, comenzamos a dar los primeros pasos para desarrollar nuestro propio kit de hardware para el control de dispositivos inteligentes (el concepto DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Por supuesto, el soporte para Robonomics en Ethereum no se ha detenido. La pila de comunicación de Robonomics se finalizó a la versión",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "El token XRT comenzó a cotizar en varios intercambios (en particular, Uniswap DEX) y se lanzó el programa de incentivos de liquidez.",
  "The team actively developed ways to interact with the community. The first version of our": "El equipo desarrolló activamente formas de interactuar con la comunidad. Se ha lanzado la primera versión de nuestra",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "y Robonomics Wiki. Para una gestión de proyectos más transparente y cómoda, empezamos a utilizar",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Organizamos",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "en 2019 para los recién llegados al proyecto.",
  "Robonomics became the foundation for the": " Robonomics se convirtió en la base del proyecto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "que está desarrollando un sistema para el arrendamiento inteligente de equipos robóticos.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Entendimos que los agentes autónomos necesitan un entorno que garantice su funcionamiento técnico y económico fiable. Llevamos varios años desarrollando un protocolo para crear una red descentralizada de proveedores que ayudan a los agentes robóticos a prestar sus servicios. Se han desarrollado herramientas para el mantenimiento de la red y para la pila de comunicación entre Ethereum y ROS. En 2018, publicamos el",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "y se lanzó la versión alfa de Robonomics Network en la Ethereum Mainnet. Los preparativos activos continuaron para el evento de generación de tokens XRT (que finalmente sucedió en la primavera de 2019 debido al primer criptoinvierno).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "A partir de este período, Robonomics comenzó a desarrollar dinámicamente casos de uso relacionados con la Industry 4.0 (fábricas inteligentes, ciudades inteligentes y hogares inteligentes) y esto atrajo nuestra atención al mundo IoT. En busca de innovación, el equipo ha presentado varias demostraciones de R&D únicas y de gran tamaño: una",
  "sensor network": "red de sensores civiles",
  "a water drone": "un dron de agua",
  "for environmental monitoring (supported by a sensor systems manufacturer": "para el control medioambiental (apoyado por un fabricante de sistemas de sensores",
  "a smart factory model": "un modelo de fábrica inteligente",
  "a self-employed": "un trabajador autónomo",
  "robot artist Gaka-chu": "un obot artista autónomo Gaka-Chu",
  "and a": "y un ",
  "drone traffic management system": "sistema de gestión de tráfico de drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Robonomics comenzó a cooperar con el proyecto DAO IPCI en la gestión de activos ambientales utilizando tecnologías Web3 y dispositivos IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Este fue un período de investigación y desarrollo activo durante el cual identificamos una variedad de tareas en las que las tecnologías P2P tienen capacidades que antes no estaban disponibles para la robótica. Al combinar la computadora Ethereum, el almacenamiento de archivos IPFS y Robot Operating System (ROS), nos dimos cuenta de que cualquier dispositivo podría convertirse potencialmente en un",
  "autonomous intelligent robot agent": "agente robot inteligente autónomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "A su vez, esto nos abrió el camino a los conceptos de Robot-as-a-Service y la economía del robot.",
  "Our publications in scientific journals of this period are available in the": "Nuestras publicaciones en revistas científicas de este período están disponibles en la sección",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Hemos recopilado todos los proyectos de I+D a lo largo de los años en un",
  "a handy book": "práctico libro",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Todo comenzó con una idea que se les ocurrió a los fundadores cuando Ethereum acababa de lanzar su red principal. ¿Qué sucede si el robot realiza una tarea para un cliente de criptomonedas y su lógica está controlada por un contrato inteligente?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Para probar la idea, hicimos una demostración en la que se lanzó un dron controlado por una computadora Ethereum para lograr las coordenadas GPS especificadas después de que el usuario completara una transacción de pago.",
  "The demo is available on": "La demostración está disponible en",
  "YouTube": "YouTube",
  "Notable events": "Eventos notables",
  "Robonomics whitepaper 2022 welcome guide": "Guía de bienvenida de Robonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Hemos desarrollado un protocolo de comunicación de máquina tecnoeconómico que se ejecuta sobre Ethereum e IPFS, y lo complementamos con elementos de una plataforma IoT basada en la nube, que esta basada en la parachain de Polkadot. Hoy ya contamos con una plataforma híbrida para crear aplicaciones IoT futuristas. Proporciona interacción con dispositivos bajo el control de una computadora descentralizada global. Antes de comenzar a crear aplicaciones IoT seguras, sin servidor y futuristas utilizando la plataforma Robonomics, profundicemos un poco en la teoría...",
  "Chapter 1.": "Capítulo 1.",
  "At the intersection of cybernetics and economics": "En la intersección de la cibernética y la economía",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Presentamos un sistema económico en el que los dispositivos robóticos actúan como agentes independientes capaces de realizar actividades económicas clave, antes reservadas para los humanos. En este capítulo, hablaremos sobre la relevancia de la economía robótica, que puede convertirse en una parte importante de la vida de las personas y cambiar el nivel actual de la economía en servicios totalmente automatizados en el futuro.",
  "In this chapter you will learn": "En este capítulo aprenderás",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase y la naturaleza de la empresa",
  "CPS - cyber-physical system": "PS - sistema ciberfísico",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener y la búsqueda de patrones en la vida y la máquina",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "La Cuarta Revolución Industrial, Dinero para Robots y Bitcoin",
  "Ethereum Smart Contracts": "Contratos inteligentes de Ethereum",
  "Polkadot Parachains": "Parachains de Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Preguntas abiertas de la teleología y el trabajo de Mises",
  "Read chapter 1": "Lea el capítulo 1",
  "Chapter 2.": "Capítulo 2.",
  "Robonomics architecture": "Arquitectura de Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "En el segundo capítulo, leerá sobre la interacción hombre-máquina utilizando la tecnología moderna de Internet, desde dispositivos IoT hasta una red de proveedores descentralizada y accesible a nivel mundial. Veremos los fundamentos del Internet de las Cosas para resaltar los problemas y principales retos a los que se enfrentan los creadores de sistemas IoT y la solución a la que ya se dirige Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Resumen del estado del Internet de las cosas (IoT)",
  "Classification of IoT devices": "Clasificación de dispositivos IoT",
  "Embedded IoT systems": "Sistemas IoT integrados",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: puertas de enlace y controladores IoT",
  "Autonomous Systems": "Sistemas Autónomos",
  "Internet of Things providers": "Proveedores de Internet de las cosas",
  "Digital twins are the heart of the Internet of Things": "Los gemelos digitales son el corazón del Internet de las Cosas",
  "IoT data flows in cloud service": "Flujos de datos de IoT en servicio en la nube",
  "Popular examples of IoT solutions": "Ejemplos populares de soluciones IoT",
  "Current problems of building IoT solutions": "Problemas actuales de construcción de soluciones IoT",
  "Main tasks of Robonomics architecture": "Tareas principales de la arquitectura de Robonomics",
  "Basic components of Robonomics architecture": "Componentes básicos de la arquitectura de Robonomics",
  "A simple representation of Robonomics architecture": "Una representación simple de la arquitectura de Robonomics",
  "Read chapter 2": "Lea el capítulo 2",
  "We continue to update the white paper of Robonomics": "Seguimos actualizando el Whitepaper de Robonomics",
  "stay tuned for new parts on our website and in Discord": "estén atentos a las nuevas partes en nuestro sitio web y en Discord",
  "Join our discord": "Únase a nuestro Discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "A continuación, nos gustaría mostrarle las áreas prácticas de la interacción hombre-máquina utilizando la tecnología moderna de Internet. Pasaremos de la arquitectura familiar de dispositivos IoT de intercambio de información técnica a través de servicios en la nube, a la organización de la interacción técnico-económica a través de una red descentralizada de proveedores y accesible a nivel mundial.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Para empezar, necesitamos hacer una excursión al área que está más claramente relacionada con la conexión a la red de los sistemas automatizados. A continuación, veremos los fundamentos del Internet de las Cosas para destacar los problemas y principales retos a los que se enfrentan los creadores de sistemas IoT y la solución a la que se dirige Robonomics.",
  "Overview of the state of the internet of things (IoT)": "Descripción general del estado de internet de las cosas (IoT)",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "en los años 60 y 70. Es muy conocido cómo la máquina expendedora de Coca-Cola se conectó a ARPANET en la década de 1980 para que las máquinas reportaran la disponibilidad de bebidas y su temperatura.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Pero aún así, el desarrollo real de IoT está ocurriendo hoy, debido al uso generalizado de tecnologías habilitadoras. Los principales impulsores de la rápida evolución de las aplicaciones de Internet de las cosas son los resultados del desarrollo de muchas áreas, desde comunicaciones inalámbricas de diversos rangos y dispositivos integrados hasta análisis en la nube y aprendizaje automático. La cantidad de dispositivos IoT ha crecido constantemente durante los últimos 10 años (con un pronóstico de 25 mil millones de unidades para 2030), y esto ha estimulado a los investigadores y desarrolladores a crear nuevas aplicaciones IoT en diversas áreas, como atención médica, automatización del hogar, agroindustria, protección del medio ambiente.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Estamos más interesados ​​en el proceso de construcción de sistemas IoT y las     tareas que surgen en este proceso. A lo largo de los años de investigación, se han propuesto muchas arquitecturas diferentes y, al promediarlas, podemos distinguir tres componentes básicos de un sistema IoT: dispositivos, infraestructura de red, máquinas analíticas, informáticas y de control.",
  "New challenges": "Nuevos desafios",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Otro desafío reciente para construir IoT ha sido el concepto de gemelo digital: una versión digital de un equipo real que copia sus especificaciones y datos históricos. Este concepto es mejor en áreas donde es necesario tener una especificación precisa y completa de un proceso y poder predecir su desarrollo. El Internet de las cosas actúa como el principal integrador de los gemelos digitales, pero esta tarea es mucho más profunda que la conectividad habitual de los dispositivos IoT.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "En este momento estamos presenciando un segmento completo de la red, diseñado y conveniente no para las personas, sino para las máquinas. El Internet de las cosas ya no es solo la mecánica de conectar un dispositivo a la red, sino más servicios, creados y disponibles específicamente para los dispositivos. El Internet de las cosas no solo conecta al usuario y el dispositivo, sino que también ayuda a los dispositivos a manejar las tareas de brindar un servicio a la persona, pero de forma autónoma.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Dichos sistemas no tienen interfaces de usuario y, por lo general, se utilizan en el nivel más bajo de los ecosistemas de IoT para proporcionar una funcionalidad básica. Tiene que ser energéticamente eficiente y pequeño. Disponer de recursos informáticos y de comunicación limitados. Las puertas de enlace o controladores de IoT suelen actuar como receptores de señales.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Estos sistemas actúan como enlace entre los sistemas integrados accesibles localmente y la Internet global. Por lo general, admiten múltiples protocolos de comunicación de sistemas integrados y transfieren la telemetría de los dispositivos a la nube y controlan las señales hacia atrás. A menudo, estos dispositivos son una versión más sofisticada del enrutador WiFi, equipados con una computadora de placa única para realizar el procesamiento principal de la información de los dispositivos sin salir de la red local.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Esta clase incluye autómatas complejos (como Spot de Boston Dynamics), que tienen un componente de control al nivel de una computadora completa con un procesador de alto rendimiento y una gran cantidad de memoria. En tales casos, el robot se conecta a Internet sin soluciones intermedias adicionales (sistemas EDGE ). El software necesario para acceder a Internet de las Cosas se instala directamente en la computadora del sistema autónomo. Los datos se recopilan y parcialmente procesado localmente, luego se transmiten a Internet de manera similar a cualquier dispositivo de red completo.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "El trabajo principal de los proveedores de IoT es proporcionar a los usuarios acceso remoto a datos y análisis, así como la gestión de dispositivos inteligentes a través de Internet. Los principales criterios de calidad del proveedor son la seguridad de las operaciones, la estabilidad de la conexión y la disponibilidad del proveedor desde cualquier parte del mundo.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "El esquema estándar para trabajar con un proveedor de IoT incluye: instalar software compatible con el dispositivo inteligente en la nube, configurar servicios de administración del lado de la nube después de la primera conexión exitosa de un dispositivo, conexión de varios tipos de servicios analíticos.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Hablando de gemelos digitales, cabe señalar que arquitectónicamente se requiere su implementación; como un rechazo a dar al usuario acceso directo a los dispositivos de control y cambiar sus estados. De las razones más obvias para el rechazo están, en primer lugar, la presencia de sus propios requisitos y condiciones en los dispositivos justo antes del lanzamiento. En segundo lugar, si varios dispositivos de usuario deben acceder a una única fuente de datos, puede ser fundamental dar un control personalizado a cada usuario. Por último, es de gran utilidad tener disponible el último estado real del dispositivo en caso de que se quede fuera de servicio.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Como resultado, tenemos una separación del bucle de intercambio de información con el usuario y la generación actual de datos reales por parte de los sensores. Para ilustrar este principio, a continuación se muestra el proceso del usuario que trabaja con un dispositivo IoT utilizando un gemelo digital.",
  "IoT data flows in cloud services": "Flujos de datos IoT en servicios en la nube",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Valores de entrada para disparadores de nube. Por ejemplo, el servicio en la nube envía varias notificaciones al usuario en caso de un informe de un sensor de alarma de automóvil acerca de una huelga.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Datos de salida para análisis complejos que no se pueden producir en el nivel de borde. Por ejemplo, al procesar video para reconocimiento facial en una multitud.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "La base para formar un gemelo digital del dispositivo para crear un molde de su estado. Por ejemplo, a petición del usuario en la aplicación móvil o en el sitio web.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Un sistema doméstico inteligente típico ofrece una amplia gama de opciones para controlar su espacio vital. Con su ayuda, puede controlar de forma remota las cerraduras de las puertas, configurando el acceso único o regular a la habitación como familiares y amigos, y para el personal de mantenimiento o entrega. Con numerosos sensores y dispositivos de grabación, el sistema puede incluir grabación de video al activar los sensores de movimiento, tomar decisiones de forma autónoma para cerrar el suministro de agua cuando se detecta una fuga en el sistema, iniciar una aspiradora robot programada y proporcionar un informe de limpieza a la aplicación de usuario, cambiar la temperatura ambiente al valor óptimo según su horario.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Coches inteligentes. Al proporcionar a la electrónica a bordo del automóvil acceso a Internet móvil, el usuario obtiene acceso al control remoto de varias funciones del automóvil directamente desde su teléfono inteligente: abrir puertas, encender el aire acondicionado, controlar los faros. Si dichos automóviles se utilizan como autos compartidos, puede crear un mapa interactivo de la ubicación de los automóviles con su estado, el combustible restante, etc. para los clientes de este servicio",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Sistema inteligente de arrendamiento de equipos. La empresa instala manipuladores robóticos en la línea transportadora bajo un contrato con pago por el número de operaciones o por el tiempo del robot. Los manipuladores proporcionan regularmente un registro de las operaciones realizadas, errores y advertencias. La tarifa de arrendamiento del robot se calcula sobre esta base, así como el mantenimiento predictivo de los robots por parte del proveedor.",
  "Global availability": "Disponibilidad global",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "La arquitectura cliente-servidor estándar requiere la especificación de puntos finales al enrutar mensajes desde dispositivos IoT. Así, durante la vida de un dispositivo inteligente, la falta de conexión supondrá una limitación en la capacidad de control e interacción con el dispositivo.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Por ejemplo, la guerra comercial entre China y Estados Unidos ya es una espada de Damocles que se cierne sobre miles de consumidores de electrodomésticos inteligentes chinos en Estados Unidos y viceversa. En cualquier momento, el bloqueo de los servidores de Xiaomi por parte de las autoridades estadounidenses podría afectar a los usuarios de dispositivos que se conectan a los servicios en la nube del fabricante.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Al estar en las inmediaciones de un dispositivo IoT, no puede controlarlo desde una aplicación móvil si no hay conexión a los servidores, a través de los cuales se proporciona la autenticación de usuario y la recopilación de la telemetría de los propios dispositivos. Es decir, el dispositivo en realidad está controlado por la nube, no por el usuario.",
  "Cybersecurity": "Seguridad cibernética",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "La razón más importante de la baja ciberseguridad de la mayoría de las soluciones de IoT se deriva del legado problemático de la arquitectura cliente-servidor en la nube. Por ejemplo, la arquitectura de un hogar inteligente más común en este momento suele ser un centro de IoT, conectado a un servicio en la nube. Por lo tanto, un sistema IoT típico es un elemento de control central conectado a múltiples sistemas externos. Ciertamente, el servicio en la nube es más seguro que los dispositivos de bajo nivel, pero la consolidación del control centralizado sobre cientos de miles de estos sistemas hace que cualquier brecha de seguridad y fuga sea un desa",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Los servidores de servicios en la nube están sujetos a todos los problemas típicos de ciberseguridad: ataques a la red, ataques DoS (que hacen que el sistema falle), modificaciones maliciosas, secuestro de la sesión del usuario, etc. Pero las amenazas fuertes también incluyen problemas no intencionales como errores de diseño, mal uso o desastres que hacen que los servidores fallen. También otro punto definitivamente importante es la necesidad en principio de confiar en la nube y en las personas que la mantienen.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Todo esto se ve exacerbado por la escala de las soluciones de IoT. El número de sistemas IoT. Ciertamente, el servicio en la nube es más seguro que los dispositivos de bajo nivel, pero la consolidación del control centralizado sobre cientos de miles de estos sistemas hace que cualquier brecha de seguridad y fuga sea un desastre masivo.",
  "Data privacy": "Privacidad de datos",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "El punto de privacidad debe separarse de la ciberseguridad, porque este problema es específico de los sistemas IoT. Debido a la gran cantidad y variedad de tipos de dispositivos que están mucho más integrados en el mundo físico que solo computadoras y teléfonos inteligentes, la gama de tipos de datos privados se multiplica. Ya no es solo ubicación GPS, registros de compras, transacciones financieras y fotos, sino también un registro permanente de video y conversaciones, huellas de voz, condiciones de salud e incluso una lista de los hábitos de una persona. Entre los tipos de amenazas relacionadas con la privacidad se encuentran: identificación de información, localización y seguimiento, creación de perfiles, ataque de inventario, ataque de enlace de datos.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "La parte más espeluznante es que los usuarios tienen poca o ninguna conciencia de que están renunciando a su privacidad porque casi no tienen idea de qué datos se recopilan y cómo se utilizan. La amenaza a la privacidad aumenta no solo de los intrusos, sino también de las organizaciones y agencias gubernamentales precisamente por esto. Los servicios de IoT en la nube generalmente requieren la máxima transferencia de datos desde los dispositivos, y no hay formas de prohibir o restringir la transferencia de datos ('Aceptar los términos o enojarse'). Además, a pesar de que los datos recopilados son un activo y tienen un valor real, a la persona de la que se recopilan no solo se le niega el derecho a disponer activamente de esos datos, sino que incluso se le niega cualquier compensación por la recopilación y el uso de sus propios datos.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Sobre la base de los logros y desafíos de las plataformas en la nube, Robonomics tiene como objetivo ofrecer al mercado de IoT soluciones de Internet más seguras y avanzadas en cada etapa de la comunicación hombre-máquina. A continuación se detallan las principales tareas a las que se dirige Robonomics:",
  "Managing an IoT device using a decentralized cloud": "Gestión de un dispositivo iot mediante una nube descentralizada",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Las Blockchain tienen todas las capacidades para proporcionar el más alto grado de seguridad para ejecutar un dispositivo y obtener su telemetría. La interacción con el dispositivo en realidad se puede describir cambiando el estado del gemelo digital almacenado en la blockchain y enviando información sobre estos cambios. En el caso de una blockchain sin permiso, podemos hablar de las garantías de disponibilidad global de los proveedores para IoT, así como de un alto nivel de protección de los datos del gemelo digital frente a cambios no deseados.",
  "Performing technical and economic transaction between people and machines": "Realización de transacciones técnicas y económicas entre personas y máquinas",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Gracias al mecanismo de las criptomonedas y los contratos inteligentes, podemos brindar acceso a sistemas automatizados directamente a los mercados digitales. Por ejemplo, Ethereum ya implementa la mayoría de las herramientas básicas de actividad económica que se pueden utilizar en la operación de dispositivos autónomos. Las aplicaciones creadas para la interacción entre el usuario final y el dispositivo IoT serán mucho más efectivas si los términos de servicio y el pago del mismo son inseparables de los parámetros de lanzamiento del dispositivo.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Los avances modernos en la tecnología Web3 pueden resolver el problema de la privacidad del usuario. Con Web3 no es necesario autenticarse ni requerir conexión a servidores específicos para acceder a la telemetría y controlar el dispositivo.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics es una nube descentralizada para gemelos digitales de dispositivos IoT. Robonomics admite el formato tecnoeconómico para la comunicación, además de proporcionar aplicaciones privadas para los usuarios.",
  "A human interface to access the system": "Una interfaz humana para acceder al sistema.",
  "A communication protocol": "Un protocolo de comunicación",
  "A machine interface": "Una interfaz de máquina",
  "Human interface": "Interfaz humana",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Proponemos el uso de aplicaciones descentralizadas (dapps) como la principal forma de conectar a los usuarios para controlar dispositivos inteligentes a través de Internet. Por lo tanto, podremos proporcionar la interfaz de usuario más segura (en términos de datos) para el sistema, que podrá funcionar simultáneamente en las condiciones de la red local de la ciudad y a través de una red global común.",
  "Communication protocol": "Protocolo de comunicación",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Este rol lo desempeña la red de Robonomics, una especificación desarrollada por el equipo del proyecto que implementa una red descentralizada de proveedores que proporcionan la transmisión, el procesamiento y el almacenamiento de la información necesaria para ejecutar dispositivos IoT. De hecho, es una implementación de un nodo específico de función para redes IPFS, Ethereum y Polkadot.",
  "Machine interface": "Interfaz de la máquina",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Aquí hay un diagrama general del ciclo completo de inicio del dispositivo utilizando la plataforma de Robonomics:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "La aplicación descentralizada del usuario envía una solicitud para una función de control del dispositivo a través de la red de Robonomics.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "La red de Robonomics proporciona traducción de solicitudes utilizando libP2P y captura eventos en la blockchain de Ethereum o Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "El control del dispositivo lo proporciona una red descentralizada, que garantiza almacenar la información necesaria para ejecutar el dispositivo IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "El dispositivo IoT recibe información de forma independiente de las redes Ethereum y Polkadot sobre el estado actual del gemelo digital. Esto garantiza que el dispositivo pueda iniciarse de manera segura solo después de que se hayan establecido los parámetros técnicos y económicos de puesta en marcha.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "Como resultado de la operación, el dispositivo IoT publica un registro de operaciones completadas, que se puede utilizar como evidencia del servicio prestado o para la depuración de errores.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "El registro se transforma en un informe para el usuario y está disponible en su dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Construir dApps y servicios web para IoT en la parachain de Robonomics",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, software architect",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Recordemos que la máquina automática es el equivalente económico preciso del trabajo esclavo. Cualquier trabajo que compite con el trabajo esclavo debe aceptar las consecuencias económicas de este",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "cibernético",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Los robots son como niños adultos hoy en día: ya pueden administrar el dinero y entablar relaciones legales, ser independientes.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": " El futuro de la humanidad depende de cómo enseñemos a los robots a manejar sus capacidades.",
  "Robonomics tools": "Herramientas de Robonomics",
  "Operate with digital twins of IoT devices": "Opere con gemelos digitales de dispositivos IoT",
  "The first tools of the robot economy: money for robots, contracts for robots": "Las primeras herramientas de la economía robótica: dinero y contratos para robot",
  "Software for connecting devices to a decentralized cloud": "Software para conectar dispositivos a una nube descentralizada",
  "API library for custom IoT applications": "Biblioteca de API para aplicaciones personalizadas de IoT",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics contiene un conjunto completo de herramientas para desarrollar aplicaciones de IoT, tanto en la robótica como en la interfaz de usuario. La comunicación entre el usuario y el dispositivo sucede a través las tecnologías más exitosas del mundo Web3: IPFS, Ethereum y Polkadot. Por lo tanto, los desarrolladores pueden crear aplicaciones modernas y seguras para Smart Cities e Industry 4.0.",
  "Robonomics Connectivity": "Conectividad de Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Para comodidad de los desarrolladores, Robonomics contiene un conjunto de software para conectar: dispositivos IoT que utilizan el protocolo HTTP/MQTT, sistemas robóticos complejos que utilizan el sistema operativo de robot (ROS, por sus siglas en inglés).",
  "Connect a sensor": "Conecte un sensor",
  "to the Robonomics network": "a la red de Robonomics",
  "Try": "Pruebe",
  "a simple prototyping tool": "herramienta de creación de prototipos simple",
  "Start building your own cyber physical system with": "Comience a construir su propio sistema físico cibernético con",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics es compatible con cientos de robots listo para usar",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Los usuarios de la plataforma pueden conectar robots compatibles con ROS a la economía digital en cuestión de minutos. A fin de obtener una lista completa de los robots compatibles, siga el enlace",
  "Decentralized Cloud infrastructure for IoT": "Infraestructura de nube descentralizada para IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) es el servicio de infraestructura básico para la robótica e IoT además de Robonomics Parachain e IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Dapp de Robonomics",
  "economy of robots": "Economía de robots",
  "Core RWS features available for IoT today": "Funciones básicas de RWS disponibles para IoT en la actualidad",
  "RWS PubSub Message Broker": "RWS agente de mensajes PubSub",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Utilice mensajería ilimitada a través de una red P2P basada en el protocolo IPFS",
  "RWS Data Blockchainization Service": "RWS servicio de blockchainización de datos",
  "RWS Robot Actions": "RWS acciones del robot",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Encender o apagar; inicie o detenga sus dispositivos IoT bajo el control de una computadora descentralizada",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "El corazón de su aplicación de IoT: gemelo digital en blockchain",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "En la arquitectura técnica, los gemelos digitales de IoT brindan visibilidad y monitoreo de cosas y eventos relacionados (p. ej., mediante dispositivos de IoT para capturar automáticamente el origen de un producto), y blockchain permite la versión única compartida de la verdad en cuanto al estado de estas cosas a lo largo de sus ciclos de vida y eventos comerciales asociados",
  "from Gartner research": "de la investigación de Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachain brinda la oportunidad de crear un modelo de gemelo digital y actualizar su estado cada 6 segundos.",
  "Secure": "Seguras ",
  "Serverless": "sin servidor",
  "Futuristic": "futuristas",
  "IoT applications": "Aplicaciones IoT",
  "Robonomics network vision": "Visión de Robonomics network",
  "At the frontier of cybernetics and economics": " En la frontera de la cibernética y la economía",
  "Build your IoT services on Robonomics platform": "Construya sus servicios iot en la plataforma de robonomics",
  "taking full advantage of decentralized architecture": "Aprovechando al máximo la arquitectura descentralizada",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics permite a los usuarios conectarse a dispositivos inteligentes utilizandoaplicaciones descentralizadas (dapp) que no requieren la transferencia de datosdel usuario para la autenticación. La comunicación se lleva a cabo a través deuna red descentralizada de proveedores sin un solo punto de falla, y el dispositivoobtiene información de forma independiente de la blockchain para ejecutar o transmitirdatos de forma remota. Por lo tanto, Robonomics brinda un alto nivel de ciberseguridaddel dispositivo y privacidad de los datos del usuario en todas las etapas de lacomunicación, desde la aplicación del usuario hasta el lanzamiento del dispositivointeligente.",
  "From smart contracts to cross chain IoT platform": "De los contratos inteligentes a la plataforma iot de cadena cruzada",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "El proyecto Robonomics tiene más de 6 años. Comenzamos a prepararnos para elprimer experimento que demostró la comunicación hombre-máquina utilizando unared de proveedor descentralizada independiente en 2015, desde los primeros díasde la red Ethereum. A principios de 2021, el equipo del proyecto logró crear unprotocolo de comunicación de máquina tecnoeconómico que se ejecuta sobre Ethereume IPFS, y lo complementó con elementos de una plataforma IoT (basada en la nube)basada en la parachain de Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Como resultado, hoy ya contamos con una plataforma híbrida para crear aplicacionesIoT futuristas que permiten la interacción con dispositivos bajo el control deuna computadora descentralizada global.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Los creadores de Robonomics son experimentadores, ingenieros y científicos quese preocupan por comprender la validez científica del enfoque y lograr claridadal presentar los principios que deben formar la base de toda la arquitectura dela solución de software.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "En nuestros artículos entre 2017 y 2020, presentamos a la comunidad científicamuchos conceptos y soluciones unidos en torno a la idea de la economía robótica,un sistema económico en el que los dispositivos robóticos actúan como agentesindependientes capaces de realizar actividades económicas clave, antes reservadaspara los humanos. Puedes leer los artículos científicos",
  "this link": "en este enlace",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Nos gustaría justificar el surgimiento de la economía robótica y explicar entérminos generales por qué creemos que este concepto es la respuesta inevitabley obvia al funcionamiento de los sistemas robóticos a gran escala de la nuevarevolución industrial.",
  "Move towards the factory of the future": "Avanza hacia la fábrica del futuro",
  "Inspired by Ronald Coase": " Inspirado por Ronald Coase",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "El premio Nobel de economía Ronald Coase en su obra de 1937 “La naturaleza dela empresa” demostró mejor la dicotomía «jerarquía vs libre mercado» y dio unaexplicación de las razones de la existencia de las organizaciones, en particularlas empresas. Coase analiza el impacto de los costos de transacción (el costode recopilar y procesar información) para tomar decisiones sobre la conclusiónde un contrato y monitorear su implementación. La empresa, con toda su estructurajerárquica extra-mercado, se constituye como la forma más eficiente de brindaral consumidor el producto objetivo con los menores costos de transacción en elmomento, cuando el esfuerzo transaccional de crear el mismo producto a travésde múltiples intercambios en el mercado entre los individuos se vuelve mucho mayor.Para visualizar mejor este proceso, mire el ejemplo ilustrativo de comprar unautomóvil. Intente comprar un automóvil por partes y calcule cuánto dinero y tiempogastará solo para ensamblar todos los componentes en su garaje. Los riesgos ylos costos de negociación de la compra de piezas son demasiado altos en comparacióncon el Modelo X listo para usar de Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Sin embargo, esto no conduce al surgimiento de la única empresa del mundo parala producción de todo. El punto es que los mismos costos de transacción tambiénimponen restricciones sobre el tamaño de las empresas. Coase escribe:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...una empresa tenderá a expandirse hasta que los costos de organizar una transacciónadicional dentro de la empresa sean iguales a los costos de realizar la mismatransacción mediante un intercambio en el mercado abierto...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "En otras palabras, cuanto más compleja es la jerarquía dentro de la empresa,mayores son los costos internos y, en algún momento, resultan excesivos en comparacióncon los costos de regresar al mercado. Por lo tanto, para asegurar su crecimientocomo uno de los motores, los empresarios buscan formas de reducir estos costos.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "La idea de reducir los costos de transacción a través de la capacidad de todoslos participantes en el proceso comercial (producción, logística, consumo) paraunirse en un nivel más cercano se",
  "clearly correlates": "correlaciona claramente",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "con los problemas y desafíos que enfrentan los fabricantes de soluciones deautomatización. Durante los últimos 50 años, las operaciones estándar/regularesde la mayoría de los procesos comerciales de las grandes empresas se han automatizadocasi por completo. Los fabricantes se quedan esencialmente con la tarea de construiruna comunicación segura entre las partes totalmente automatizadas de la cadenade suministro, y esta tarea es un factor que frena una mayor reducción de loscostos de transacción a través de la automatización. El deseo de comercializarproductos o servicios más competitivos en comparación con las empresas parcialmenteautomatizadas",
  "firms spurs the search for solutions to": "estimula la búsqueda de soluciones",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "para estos desafíos. Parece que todo se encamina hacia el surgimiento de lasroboempresas, organizaciones en las que todo el ciclo del proceso comercial estácompletamente automatizado y no requiere la participación humana, excepto comobeneficiarios y consumidores.",
  "Get rid of transaction costs": "Libérese de los costos de transacción",
  "Our future in smart cities": "Nuestro futuro en las ciudades inteligentes",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "La tarea a la que se enfrentan los fabricantes de automatización hoy en díatiene un nombre específico: la construcción de sistemas ciberfísicos (abreviadoscomo CPS). Po",
  "definition,": "definición,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "un CPS es una fuerte unificación e integración mutua de múltiples procesos informáticos, de red y físicos.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Las tareas de construcción de CPS son centrales para cualquier idea descritaen la nueva (cuarta) revolución industrial. Por lo tanto, CPS es la piedra angularde nuestra vida futura en Smart Cities, manifestándose en todas partes. Ejemplosde sistemas ciberfísicos del futuro son: piloto automático de Uber, selfies condrones, red de impresoras 3D en estaciones de metro.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "CPS es una estructura compleja de muchos elementos conectados: desde la aplicaciónen el teléfono, se extiende para controlar el dron en vuelo sobre la ciudad yluego procede a publicar las fotos resultantes en Instagram, pero solo despuésde procesarlas en la nube AI.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Lo más importante en el proceso de diseño de CPS es encontrar la delgada líneaentre un número suficiente y excesivo de elementos automatizados en la cadenade suministro del usuario del servicio. En otras palabras, ¿dónde está el límitede tamaño de la CPS? Para responder a esta pregunta, debemos recurrir al famosomatemático Norbert Wiener.",
  "Self-regulating systems": "Sistemas autorreguladores",
  "Inspired by Norbert Wiener": "Inspirado por Norbert Wiener",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener habla sobre la viabilidad del enfoque científico interdisciplinario.Por ejemplo, trazó los paralelismos entre los sistemas de control automatizadosy los desafíos de escalar y aumentar la complejidad de la sociedad humana.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Entonces, en otras palabras, el enfoque cibernético se puede aplicar por iguala la psicoterapia, la biología y la navegación automatizada. Se basa en la funcióndel sistema, cómo se controlan las acciones individuales y cómo los nodos individualesinteractúan entre sí.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Teniendo en cuenta las publicaciones de Ronald Coase y Norbert Wiener, siguiendoel desarrollo de la Industria 4.0, podemos considerar utilizar CPS como agenteeconómico, al diseñar servicios robotizados. Para regular el tamaño de los CPSy adaptarnos a las necesidades cambiantes de los individuos podemos utilizar mecanismosde mercado.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Las roboempresas son una representación ideal para los sistemas ciberfísicos.Son una unidad bastante autónoma capaz de prestar servicios tanto a humanos comoa otros robots a cambio de dinero. Como resultado, la economía de los robots nosparece un conjunto general de CPS que brindan servicios y bienes directamenteal mercado.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Dinero para robots",
  "Industry 1.0": "Industria 1.0",
  "Mechanization:": "Mecanización",
  "replacement of muscle power with steam energy.": "reemplazo de la fuerza muscular con energía de vapor.",
  "1784 y.": "1784",
  "Industry 2.0": "Industria 2.0",
  "Electrification:": "Electrificación:",
  "introduction of assembly-line production.": "introducción de la producción en cadena.",
  "1870 y.": "1870",
  "Industry 3.0": "Industria 3.0",
  "Automation:": "Automatización",
  "introduction of automated systems with CNC.": "introducción de sistemas automatizados con CNC.",
  "1969 y.": "1969",
  "Industry 4.0": "Industria 4.0",
  "Smart production:": "Producción inteligente:",
  "development of cyber physical systems.": "desarrollo de sistemas ciberfísicos.",
  "Now": "Ahora",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "En el mundo de las roboempresas resulta natural proporcionar a los robots acceso a instituciones sociales que antes solo necesitaban los humanos.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Las instituciones sociales no surgen porque la gente no pueda vivir sin bancos, contratos y otros instrumentos de la sociedad. Surgen sólo porque una persona en algún momento entró en el camino de relaciones más complejas en la sociedad y dio un paso importante para acelerar los procesos circundantes.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "El dinero y los contratos deberían estar disponibles para los robots, no porqueesta sea una fantasía enfermiza de los fanáticos de los robots que han olvidadoqué es Skynet. Pero solo porque la nueva revolución industrial se impone la tareade construir cadenas automatizadas complejas, cuyos procesos afectarán el intercambiode información técnica y económica, y también avanzarán a una velocidad inaccesiblepara los humanos.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Los robots necesitan dinero que estará directamente disponible para ellos parapoder realizar operaciones sin una persona a la velocidad con la que solo lasmáquinas pueden tomar decisiones. ¡Y todo esto es únicamente para que una personadisfrute de la vida en la Ciudad Inteligente!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "Y aquí llegamos sin problemas al primer efectivo electrónico: Bitcoin. El hechode que Bitcoin pueda almacenarse en su cuenta según el principio de que no esun banco, sino efectivo en su billetera, lo convierte en el primer dinero queel robot puede administrar de forma independiente, más precisamente de forma autónoma.Al mismo tiempo, hoy ya podemos decir que Bitcoin no es solo dinero electrónico,sino una institución financiera verdaderamente global.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Como resultado: un evento no inventado por nosotros, pero que cae claramenteen nuestra visión, convierte a Bitcoin en el primer dinero para los robots o,si miramos aún más profundamente, es precisamente esa institución social la queayudará a la formación de empresas robóticas.",
  "Smart contracts": "Contratos inteligentes",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin se convirtió en el primer dinero disponible para los robots. Mientrastanto, no podemos hablar de Bitcoin en su forma actual como una herramienta parael intercambio técnico y económico completo.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Ahora ya tenemos contratos inteligentes, mercados DeFi y una infraestructuradescentralizada para intercambiar mensajes entre robots que abren la posibilidadde que la humanidad cree una parte totalmente automatizada de la economía humana:la economía robótica.",
  "One of the great opportunity to build the economy of robots is": "Una de las grandes oportunidades para construir la economía de los robots es la tecnología",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Con la funcionalidad de Ethereum, los robots no solo pueden intercambiar dinero, sino también celebrar contratos con humanos y entre ellos.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Pero, ¿cuál es el punto de la comunicación basada en contratos de máquina amáquina (m2m)? ¡Esa es una gran pregunta! Volvamos a CPS. Cuando hablamos de comunicacionesdirectas entre sensores, equipos de máquinas o cualquier otro elemento, seguimoshablando de colaboración dentro de un sistema regulado. Pero si queremos que losservicios de las ciudades inteligentes estén vivos (o incluso el hogar inteligenteen algunos casos), debemos establecer comunicación con varios elementos de terceros.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Imaginemos el servicio de entrega de drones. Si un dron, por ejemplo, es propiedadde DHL, ¿cómo puede acceder a los almacenes de Amazon o acceder a todo el espacioaéreo de la ciudad? ¿Será un monopolio? ¡Este es un gran desafío para muchas iniciativasde la cuarta revolución industrial!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "La mayoría de las corporaciones dicen que necesitan derechos casi completossobre su entorno porque no saben cómo configurar de forma segura el intercambiode información técnica entre sistemas automatizados fuera de su propia estructuracorporativa interna. Al mismo tiempo, si observa los procesos en los que trabajauna persona, vemos que la cooperación de diferentes corporaciones ha existidodurante mucho tiempo y con éxito. Puede solicitar fácilmente la entrega puertaa puerta de los productos comprados en el sitio web de Amazon, y el servicio demensajería podrá conducir un automóvil por las calles de la ciudad, recibir unpedido en el almacén y entregárselo.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "¿Cuál es la diferencia? En el primer caso no hay forma de construir una relacióncontractual entre máquinas, y en el segundo caso, en el mundo de las personas,las relaciones contractuales ya existen.",
  "Parachains": "Parachains",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "La principal dificultad que enfrenta Robonomics hoy en día es el alto preciopor lanzar un dispositivo IoT usando Ethereum. En Ethereum, debe pagar una comisiónpor cada transacción en términos de dólares estadounidenses en el rango de $ 10a $ 100. Es bastante caro para la mayoría de los casos de la economía real, yasea un viaje para compartir un automóvil, alquilar un apartamento inteligente,entrega de drones o imprimir en 3D a pedido su héroe de anime favorito.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Para ser justos, nos gustaría señalar que existen escenarios rentables inclusocon tarifas de transacción en la red Ethereum de 2018 - 2019. Por ejemplo, transaccionesautomatizadas de compensación de huella de carbono o transferencia del pedidodesde el sitio web directamente a la producción. Pero aún así, para la aplicaciónmasiva de las tecnologías Web3 en el campo del IoT, se requiere una reduccióndel precio que cobra la nube desde el dispositivo conectado.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "En busca de una oportunidad para reducir el costo de interactuar con un dispositivoIoT, los desarrolladores de Robonomics han estudiado desarrollos alternativosa Ethereum. Nuestra elección se basó en",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": "la arquitectura Polkadot, que nos permitiría ejecutar nuestra propia blockchain,dentro de una red común, en la que la seguridad está garantizada por validadoresindependientes de nuestro proyecto.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Red blockchain heterogénea",
  "Homogeneous Shard Network": "Red fragmentada homogénea",
  "On-chain protocol control": "Control de protocolo en cadena",
  "Protection against the tyranny of the crowd": "Protección contra la tiranía de la multitud.",
  "Auction of bandwidth in the common network": "Subasta de ancho de banda en la red común",
  "Payment for gas by users": "Pago de gas por parte de los usuarios.",
  "Have you read this?": "¿Has leído esto?",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "Yo, Robot",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "El hombre bicentenario",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Preguntas abiertas de la teleología",
  "and a treatise by L. von Mises": "y un tratado de L. von Mises",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Para concluir, nos gustaría mencionar preguntas que permanecen abiertas desde un punto de vista global. ¿Cuál es el objetivo de los robots?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "La praxeología nos inspira ideas interesantes sobre el comportamiento humanosin dependencia directa de los propósitos. Esto nos da la oportunidad de trabajaren los procesos de la economía de los robots condicionalmente como con una cajanegra sin profundizar en los objetivos finales. Al mismo tiempo, la teleologíaplantea un desafío para explicar las causas.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Esperamos que en algún lugar de la unión de los trabajos de Mises y Wiener sepueda encontrar un punto para un mayor desarrollo de la economía del robot, nosolo como un protocolo de interacción entre personas y máquinas de naturalezapraxeológica, sino teniendo en cuenta los elementos teleológicos de la construcciónde la comunicación entre especies.",
  "This page is out of your space": "Esta pagina no encontrada",
  "No posts yet": "Si quieres ayudarnos con la traducción",
  "or": "o",
  "Github": "Github",
  "Important news &amp; announcements": "Noticias importantes y anuncios",
  "All posts": "Todas las publicaciones",
  "R&D cases": "Casos de I+D",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Colaboración con un desarrollador inmobiliario en Chipre para rastrear la distribución diaria, el consumo y compensar cualquier exceso de huella de carbono.",
  "Check url once more or create an": "Verifica la URL una vez más o crea un",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "informándonos que has obtenido un error 404 (no olvides mencionar la URL actual)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "El problema de la accesibilidad de red de dispositivos automáticos se ha discutido en todo el planeta desde los años 60, y ya en ese momento se hicieron intentos bastante serios para resolverlo. Por ejemplo, el cibernético soviético Viktor Glushkov propuso e implementó parcialmente la recopilación automatizada de información sobre los volúmenes de producción de una planta individual como parte del diseño de los",
  "Embedded iot systems": "Sistemas iot integrados",
  "Autonomous systems": "Sistemas autónomos",
  "Digital twins are the heart of the internet of things": "Los gemelos digitales son el corazón de Internet de las cosas",
  "\"Main tasks of robonomics architecture": "Principales tareas de la arquitectura de Robonomics",
  "If you want to help us with translation": "Si quieres ayudarnos con la traducción",
  "contact us at": "contáctanos en",
  "send": "envía",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics es una plataforma de IoT 100% de código abierto, segura, rentable y futurista para conectar la robótica bajo el control de Polkadot y Ethereum. Cualquiera puede construir servicios con Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "A continuación se muestra una lista de nuestras aplicaciones probadas de tecnologías modernas de robótica.",
  "By interest:": "Por interés:",
  "Sort by progress:": "Ordenar por progreso:",
  "Any progress": "Cualquier progreso",
  "Complete": "Completo",
  "Proceeding": "En curso",
  "Sort by time:": "Ordenar por tiempo:",
  "Recent": "Reciente",
  "Earliest": "Más temprano",
  "Show more": "Mostrar más",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Coloque datos en IPFS y almacene hashes en una cadena de bloques pública",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Aquí, hemos reunido una colección de NFT acuñados durante nuestro extenso viaje criptográfico, tanto de forma independiente como con grandes equipos. Estos tokens únicos ofrecen propiedad verificable en la cadena de bloques y son excelentes para adornar su cuenta de blockchain. Puede hacer una oferta por algunos de ellos en una subasta o incluso acuñar su propia pieza única.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Durante nuestra campaña inicial de crowdloan en Kusama, tomamos la decisión de recompensar a los contribuyentes pioneros de nuestra criptomoneda con algo más que tokens, también les regalamos un colorido NFT. Esta tarjeta tiene un gran significado para nosotros y si alguien la posee, sabemos que son un fantástico seguidor de los valores de Robonomics: libertad y descentralización.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Nos complace presentar nuestra serie especial de activos digitales: Robonomics Crypto Girls, creadas por el equipo de Robonomics Art&Science. Cada NFT de esta colección es una representación gráfica única de la tecnología utilizada en Robonomics o construida sobre casos de uso de Robonomics. Nuestros talentosos artistas han dibujado a mano cada chica en el estilo característico de Robonomics. ¡Puede elegir la que más le guste o coleccionar toda la serie! Al comprar estos NFT, no solo agrega una adición elegante a su colección, sino que también nos apoya en continuar innovando e implementando conectividad descentralizada para robots. ¡Estén atentos a nuevas incorporaciones a la colección!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. COLECCIONES DE NFT DE TEMPORADA",
  "On demand minting": "Acuñación bajo demanda",
  "SEASONAL SPOT NFT COLLECTIONS": "COLECCIONES DE NFT DE TEMPORADA",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Estas colecciones de NFT de temporada representan un activo digital único que captura la interacción única entre el usuario y Spot dentro de la parachain de Robonomics. Los usuarios pueden dibujar cualquier cosa en el navegador y el robot replicará sus movimientos para crear una imagen dibujada a mano. Una vez que se completa la interacción, el NFT se acuña en el mercado Singular para la cuenta de Polkadot del usuario. Ahora, cualquier persona puede interactuar con un robot en la vida real ubicado en un laboratorio en California para crear activos digitales personalizados y únicos que se pueden poseer, comprar y vender como cualquier otro activo digital.",
  "Create your NFT": "Crea tu NFT",
  "4. automated telescope collection": "4. colección de telescopios automatizados",
  "automated telescope collection": "colección de telescopios automatizados",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Ubicado en el Desierto de Atacama, Chile, se puede acceder a un telescopio físico a través de una aplicación descentralizada para capturar imágenes en tiempo real de objetos astronómicos en el espacio profundo. Cualquier usuario con conexión a Internet puede acceder a él con tokens $STRGZN, que están disponibles para su compra en la aplicación utilizando una tarjeta de crédito. Seleccione un objeto astronómico, envíe un comando al telescopio para tomar una foto y espere el NFT acuñado en la plataforma Singular. Tenga en cuenta que la aplicación solo está disponible para su uso de 11 pm a 6 am GMT-3 debido al horario de funcionamiento del telescopio.",
  "Try yourself": "Pruébalo tú mismo",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "En colaboración con Polkapets",
  "and": "y",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Como miembro orgulloso del ecosistema Polkadot, Robonomics participó en Polka Pets World. Junto con el equipo de Polka Pets, acuñamos 1200 NFT con un concepto de diseño único que muestra nuestra idea central de conectividad. Para dar vida a esta idea, creamos una personalidad: un androide que se especializa en ayudar a los humanos a conectarse con cualquier entidad robótica.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "En 2021, Robonomics comenzó el compromiso de apoyar la adición de los palets de RMRK en su tiempo de ejecución, lo que resultaría en una integración nativa con la lógica de NFT más avanzada del mundo. Para celebrar este hito notable, lanzamos un artículo especial compatible con Kanaria: un NFT infantil que se puede equipar en el pájaro Kanaria de uno y puede proporcionar ventajas en el metaverso de RMRK.",
  "RMRK Partnerships": "Asociaciones de RMRK",
  "This page has moved to a": "Esta página se ha trasladado a una nueva dirección",
  "Automatic redirecting": "Redirección automática",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "En 1948, el profesor de matemáticas del MIT Norbert Wiener publicó una de las obras más influyentes \"Cibernética: o el control y comunicación en el animal y la máquina\". Utilizó el término \"cibernética\" para referirse a los mecanismos de autorregulación por primera vez y, por lo tanto, esta publicación se considera el cumpleaños reconocido de la cibernética.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Los grandes libros conducen a grandes ideas. Si buscas más inspiración sobre la comunicación entre humanos y máquinas, prueba a leer libros de ciencia ficción. Marca los libros que ya has leído y descubre qué más podemos ofrecerte para una reflexión más profunda.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "De hecho, la economía de las personas a menudo se asocia con la conciencia de realizar tareas dentro del marco del contrato, el deseo de las partes de lograr un resultado, el comportamiento oportunista y altruista del individuo en la sociedad. Todos estos principios son difíciles de aplicar a la economía de los robots. ¿Cuáles son los motivos de la economía de los robots? Es una pregunta abierta que debemos investigar y discutir en la sociedad para comprender y aplicar mejor los robots.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "Para empezar, sugerimos leer el trabajo de Mises \"Acción Humana: Un Tratado de Economía\" (enfoque praxeológico) y el primer artículo de Norbert Wiener \"Comportamiento, Propósito y Teleología\" (visión teleológica).",
  "Establishing democracy with smart contracts": "Estableciendo la democracia con contratos inteligentes",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Imaginemos una pequeña oficina con un equipo de 10-15 personas. Mientras todos están enfocados en sus propias fechas límite para sus tareas profesionales principales, a nadie parece importarle el mantenimiento del espacio de la oficina. La solución más común para evitar caer en el caos es contratar a terceros para recibir apoyo. Otra opción es tomar la iniciativa e imponer penalizaciones a aquellos que crean desorden o agotan los suministros sin reponerlos. Sin embargo, ¿es ético vivir bajo la tiranía en nuestro futuro mundo cripto-anarquista, donde se espera que todos sean responsables y disfruten de la libertad? Luchemos por crear una sociedad más democrática utilizando contratos inteligentes y la nueva generación de tecnologías de Internet (a menudo conocidas como Web3). Necesitamos herramientas que nos ayuden a tomar decisiones juntos y luego asegurarnos de que funcionen correctamente sin que los humanos tengan que involucrarse directamente.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'¿Quién se bebió todo el café?!' o la tragedia de los bienes comunes",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Existe un concepto ampliamente discutido en economía, ecología y otras ciencias conocido como la 'tragedia de los bienes comunes'. Esto se refiere a un escenario en el que las personas que tienen acceso a un recurso compartido priorizan sus propios intereses, agotando finalmente el recurso. El café se asemeja mucho a este tipo de recurso, ya que se deteriora debido al consumo descontrolado en la oficina. Sin embargo, al mismo tiempo, generalmente ninguno de los miembros del equipo está inclinado a invertir su tiempo y dinero en obtener un paquete adicional de granos de café. Entonces, siguen bebiendo café sin obtener nuevos suministros.",
  "How to formulate the task in numbers.": "Cómo formular la tarea en números.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Suponiendo un presupuesto mensual de café de $100, que equivale aproximadamente a 150 tazas para nuestro equipo de 10 personas, esto deja a cada persona con 1 taza cada 2 días. Ahora, adentrémonos en los detalles técnicos. La pregunta es: ¿cómo podemos dar vida a una máquina de café autónoma en la oficina?",
  "Step 1: automated coffee bean ordering": "Paso 1: pedido automatizado de granos de café",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Hemos llegado a un acuerdo con el barista, Nikita, que está cerca de la oficina. Él nos suministrará granos de café cuando reciba una alerta del bot. El bot envía un mensaje cuando el café está escaseando, especificando la cantidad de café (en kilogramos) necesaria para el pedido y el monto de pago correspondiente determinado por el equipo. Con estos detalles, Nikita puede seleccionar el café según su preferencia.",
  "Step 2: automatic access to smart office.": "Paso 2: acceso automático a la oficina inteligente.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Simultáneamente con el pedido, la máquina de café genera un código QR. Luego, Nikita presenta este código QR a la cámara para ingresar a la oficina.",
  "Step 3: distribution of coffee tokens to the team.": "Paso 3: distribución de tokens de café al equipo.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Una vez que la cámara local escanea el código QR, el sistema de gestión del hogar inteligente inicia un pago a Nikita y distribuye nuevos tokens de café entre los miembros del equipo.",
  "Step 4: drink coffee!": "Paso 4: ¡beber café!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Para recibir una taza de café fresca, un miembro del equipo necesita enviar un token de café a la dirección de la máquina de café.",
  "Coffee beans delivery process:": "Proceso de entrega de granos de café:",
  "Unlock new possibilities with this concept": "Desbloquea nuevas posibilidades con este concepto",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Además, una máquina de café automatizada introduce diversas dimensiones económicas y sociales. Echemos un vistazo a ellas:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Los desarrolladores pueden depositar tokens de café adicionales cuando el consumo cae por debajo del límite. Esto crea un sistema transparente para el uso variado de café dentro del límite.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "La máquina de café podría mantener una cuenta compartida, lo que permite a los miembros de la oficina contribuir fondos desde sus cuentas personales para una experiencia de café de mayor calidad la próxima vez.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "El equipo decide colectivamente la cantidad de café que la máquina ordenará cada vez a través de una votación de DAO. Esto proporciona libertad para abordar el desafío con recursos limitados.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Los procesos programables reducen la influencia de los factores humanos y también ofrecen una mayor flexibilidad para adaptar la configuración a equipos específicos.",
  "How we smarten up our coffee machine in real life": "Cómo hacemos más inteligente nuestra máquina de café en la vida real",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Para lograr un control práctico de la máquina de café, integramos una computadora de placa única, específicamente la Raspberry Pi 4, junto con una máquina de café de mercado masivo comúnmente disponible que admitía conexión GPIO. Nuestra preferencia fue la",
  "selected for its affordability and the convenience of its easily removable front panel.": "seleccionada por su asequibilidad y la comodidad de su panel frontal fácilmente extraíble.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "A continuación, trabajamos en los detalles operativos, específicamente en relación a qué tokens pueden enviar los usuarios y el algoritmo subyacente. Aquí está el resultado:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Para disfrutar de una taza de delicioso café, los usuarios deben enviar una cierta cantidad de fondos (en nuestro caso, 1 token ACT de Statemine, id=3077) a la dirección de la máquina de café desde una parachain (Statemine). Después, comienza el proceso de verter café y posteriormente se publica un registro de acciones en",
  "via the Datalog function": "a través de la función Datalog",
  "When the concept extends beyond the office": "Cuando el concepto se extiende más allá de la oficina",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Este concepto ofrece numerosas vías para expandir la idea. Se implementó con éxito en el Polkadot Web3 Hub durante el Foro Económico Mundial de 2022 en Davos. Los participantes pudieron hacer pedidos de café y especificar su tipo de café deseado (por ejemplo, espresso, americano, cappuccino) enviando una cierta cantidad de tokens. Compartamos fotos y videos de este evento:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Nuestra cafetera blockchain haciendo café en el Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "Hazlo tú mismo o cómo construir tu propia máquina de café inteligente blockchain",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Puedes encontrar un tutorial detallado y especificaciones técnicas en el repositorio de GitHub de código abierto. Ten en cuenta que puedes usar cualquier máquina de café que prefieras y casi cualquier token de tu elección para dar vida a este proyecto en tu propio espacio.",
  "In a nutshell": "En pocas palabras",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Hoy en día, se vuelve cada vez más claro que el consumo de energía es un importante contribuyente a la huella de carbono, por lo que es cada vez más importante encontrar formas de reducir nuestro impacto ambiental. Las oficinas y edificios comerciales juegan un papel significativo en este consumo de energía. Los ingenieros de Robonomics han instalado un sistema en la oficina de BBF, un desarrollador inmobiliario con sede en Chipre, para rastrear y recopilar mediciones de electricidad. Este sistema también proporciona una forma práctica de compensar la huella de carbono.",
  "1. Monitoring surplus energy generation": "1. Monitoreo de la generación de energía excedente",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "En el edificio de oficinas de la empresa BBF, se han instalado varios paneles solares que se han integrado en el sistema Solarweb, lo que permite una fácil recopilación de análisis. El sistema proporciona datos sobre el consumo total de electricidad del edificio y la electricidad generada por los paneles solares. Sin embargo, una característica crucial que falta es la capacidad de compensar la huella de carbono resultante de la electricidad consumida más allá de lo que generan los paneles solares.",
  "2. Converting excess energy power to CO2 offset": "2. Conversión del exceso de energía en compensación de CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Tener datos sobre el consumo total de electricidad y la producción de electricidad de los paneles solares permite un cálculo sencillo de la huella de carbono. Se asume que la electricidad de los paneles solares tiene una huella de carbono de 0, lo que significa que solo es necesario compensar la electricidad consumida en exceso de lo que generan los paneles solares.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "Cabe destacar que las emisiones de CO2 difieren según los países. En Chipre, la contaminación promedio es de 587 g/kWh, según Hannah Ritchie, Max Roser y Pablo Rosado (2022) - \"Energía\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Para compensar la huella de carbono, se utilizan créditos de carbono, siendo cada crédito equivalente a 1 tonelada de CO2. Estos créditos desempeñan un papel vital en la compensación del impacto ambiental causado por el consumo de electricidad más allá de la contribución de los paneles solares.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Así, armados con datos sobre el consumo de energía, la producción de paneles solares y el coeficiente de Chipre, se vuelve fácil determinar la cantidad de tokens necesarios para compensar la huella de carbono.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Para lograr esto, incorporamos una Raspberry Pi, configuramos Home Assistant para recopilar datos analíticos y desarrollamos una integración para compensar la huella. El panel de energía de Home Assistant muestra los siguientes detalles:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Además, nuestra integración mejora el sistema al ofrecer un panel de control conveniente para ver estadísticas y activar la compensación:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "A continuación se muestra un ejemplo ilustrativo de cómo se produce la compensación de la huella de carbono a través de nuestra integración. Al completarse con éxito, la",
  "transaction": "transacción",
  "unfolds as follows:": "se desarrolla de la siguiente manera:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Reducir el consumo de energía en la oficina es tan importante como compensar las emisiones de carbono. Podemos lograr esto haciendo pequeños cambios como usar iluminación y electrodomésticos eficientes en energía y mantener el equipo de oficina en buen estado.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "El consumo de energía es una gran parte de nuestra huella de carbono y las empresas deben hacer su parte para ser más respetuosas con el medio ambiente. Tener un sistema que rastree el consumo de energía y ayude a compensar las emisiones de carbono puede reducir en gran medida el impacto de un edificio de oficinas en el medio ambiente. Adoptando el enfoque correcto, las empresas pueden contribuir a un futuro más verde.",
  "The way forward": "El camino a seguir",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Estrategia para transformar la máquina de café en un dispositivo robótico autónomo",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov",
  "Alastair Marke": "Alastair Marke",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman",
  "On the Way to Sovereign Home Automation": "En camino hacia la automatización del hogar soberano",
  "World Economic Forum Annual Meeting 2022": "Reunión Anual del Foro Económico Mundial 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Convirtiéndose en una Parachain para Aplicaciones de IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (patrocinado por Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Escuela de Invierno Robonomics 2021 (organizada por Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transición a Multired - Llegó Polkadot",
  "The Rise of Robonomics Network": "El surgimiento de la Red Robonomics",
  "Crypto Valley Conference 2018": "Conferencia Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Taller del Parlamento Europeo 'La Economía de los Robots'",
  "Consensus 2018 conference": "Conferencia Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simposio sobre Blockchain para Sistemas Robóticos en el MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics.": "Escuela de verano Robonomics-2018 organizada por Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Integración de Fronius Solar.web con Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Uno de nuestros objetivos al desarrollar este caso es convertir Robonomics en Middleware de ROS 2. ¡Esto nos permitirá usar Robonomics en Substrate para crear una aplicación descentralizada que pueda ejecutar ROS 2 directamente desde el navegador!",
  "Eisenkoch, the robot chef": "Eisenkoch, el chef robot",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Caso real para el robot equipado con dos planchas de gofres y horneando 6 gofres al mismo tiempo en 5-7 minutos.",
  "Blockchain-powered smart coffee machine": "Máquina de café inteligente alimentada por blockchain",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Robonomics coffee - es una máquina de café inteligente integrada en la Red Robonomics. Este proyecto tiene como objetivo mostrar el potencial de Robonomics en la esfera de IoT mediante un ejemplo del mundo real.",
  "Water environmental inspector": "Inspector ambiental de agua",
  "Air monitoring network": "Red de monitoreo del aire",
  "Production quality control platform “Feecc”": "Plataforma de control de calidad de producción “Feecc”",
  "Backup and archiving service for robotics companies": "Servicio de respaldo y archivado para empresas de robótica",
  "Public lab with Boston Dynamics Spot": "Laboratorio público con Boston Dynamics Spot",
  "Autonomous telescope service": "Servicio de telescopio autónomo",
  "Smart home secure remote control and backup service": "Control remoto seguro y servicio de respaldo para hogares inteligentes",
  "Blockchain as quality control system for chemistry": "Blockchain como sistema de control de calidad para la química",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Reducción real de emisiones de CO2 con certificados probados por blockchain",
  "Robot-artist Gaka-Chu": "Robot-artista Gaka-Chu",
  "Demo “Get the weather of Fuji mountain”": "Demostración “Obtener el clima del monte Fuji”",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "La idea principal que los autores de Robonomics intentaron transmitir antes es la evolución natural, lógica y aparentemente inevitable desde el nivel actual de la economía hacia servicios completamente automatizados. Los servicios automatizados necesitarán tener tanto la capacidad de hablar el lenguaje de la economía humana como la economía propia de las máquinas para realizar diversas operaciones en el mundo que los rodea a una velocidad no disponible para los humanos.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "El desarrollo y la aplicación de Internet de las cosas han demostrado que resolver problemas típicos no es suficiente. Han surgido conceptos y principios completamente nuevos, basados en errores anteriores y deficiencias identificadas, hasta el día de hoy. Este enfoque conveniente de utilizar servicios en la nube resultó tener una serie de deficiencias críticas relacionadas con la escalabilidad, la privacidad y la seguridad. En un esfuerzo por resolver estos problemas, se propuso acercar el procesamiento de datos, la lógica y los cálculos al lugar inmediato donde se utilizan. Así surgieron los conceptos de computación en la niebla y en el borde, con sistemas intermedios entre la nube y los dispositivos que asumen algunas de las funciones de la nube. Por lo tanto, la creación de sistemas en el borde se ha convertido en uno de los nuevos desafíos de la construcción de Internet de las cosas.",
  "the Robonomics Parachain portal": "el portal de Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Gestión de la compensación de la huella de carbono verificada por blockchain",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Las colaboraciones con proyectos afines también continuaron. Robonomics y DAO IPCI presentaron un servicio para recopilar y analizar datos sensoriales —",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "Y lo que es científicamente interesante, tomando como base la idea de las restricciones impuestas por el mercado al tamaño de la empresa, podemos decir que el límite del aumento en CPS siempre estará determinado por el mercado y no se requiere nada más para esto.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Uno de los ejemplos de nuestros experimentos: negociar el espacio vial y los pagos por derecho de paso para vehículos autónomos para reducir la congestión. Lo que una persona absolutamente no haría en el tráfico, el automóvil lo hará por ti sin dificultades: quieres cambiar de carril, tu automóvil y el automóvil de tu vecino intercambian ofertas sobre el costo de dicha operación a una velocidad de cientos de mensajes por segundo, revelarán un precio de equilibrio y así ya estás en el siguiente carril más rápido. Esto significa que ahora será posible \"cargar\" tu viaje con Uber y hacerlo más rápido.",
  "Robonomics White Paper": "Robonomics White Paper",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Aquí puedes encontrar y descargar (completamente gratis, por supuesto) el primer white paper de Robonomics, que se presentó en mayo de 2018. Aunque mucho ha evolucionado desde entonces, los fundamentos de Robonomics todavía se describen en este documento.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Un robot artista autónomo y autónomo",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Localización y seguimiento cooperativo sin gradiente de límites ambientales en movimiento por equipos de robots no holonómicos",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Robot como servicio: de la nube a las tecnologías de interconexión",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Monitorización ambiental confiable mediante redes de sensores en embarcaciones marinas autónomas en enjambre y tecnología de contabilidad distribuida",
  "Digital Passport for Unmanned Vehicles": "Pasaporte digital para vehículos no tripulados",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics como plataforma basada en blockchain para la gestión de tráfico no tripulado de vehículos móviles",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Hacia sistemas robóticos multiagente basados en blockchain: análisis, clasificación y aplicaciones",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Servicios robóticos para ciudades inteligentes de nuevo paradigma basadas en tecnologías descentralizadas",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Protocolo para la organización de una red de agentes autónomos descentralizados en fábricas utilizando mecanismos de mercado",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Hacia Robonomics basado en blockchain: validación del comportamiento de agentes autónomos",
  "Transforming Climate Finance and Green Investment with Blockchains": "Transformando las finanzas climáticas y la inversión verde con blockchains",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: plataforma para la integración de sistemas ciberfísicos en la economía humana",
  "Blockchain based protocol for economical communication in industry 4.0": "Protocolo basado en blockchain para la comunicación económica en la industria 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics basado en blockchain como principio de creación de fábricas inteligentes",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Ecosistema blockchain para mercados de carbono, activos ambientales, derechos y responsabilidades: diseño conceptual e implementación",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Protocolo basado en blockchain de actividad empresarial autónoma para sistemas multiagente compuestos por UAV",
  "English": "Inglés",
  "Russian": "Ruso",
  "Chinese": "Chino",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics es una plataforma de código abierto que facilita tanto servicios simples de IoT como robótica compleja, permitiendo una comunicación efectiva entre agentes, ya sean humanos o robóticos. Para integrar robots en este sistema, utilizamos ROS. En este artículo, nuestro objetivo es proporcionar una visión general de nuestro proceso para integrar Robonomics en ROS 2.",
  "Why ROS 2 in Robonomics?": "¿Por qué ROS 2 en Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, el Sistema Operativo de Robots, es uno de los marcos de código abierto más antiguos para la robótica. Es una colección de bibliotecas de software y herramientas para hacer que los robots funcionen. Tiene desde lo básico hasta características avanzadas y viene con herramientas útiles para programadores. Es ampliamente utilizado por universidades de todo el mundo para la enseñanza e investigación en robótica, por lo que está bien establecido, funciona con muchos tipos de robots y tiene una gran comunidad de desarrolladores.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "Desde que se inició ROS en 2007, han ocurrido cambios significativos en el campo de la robótica y dentro de la comunidad de ROS. Como respuesta a estos desarrollos, se introdujo ROS 2 con el objetivo de adaptarse a estos cambios. Se basa en las fortalezas de ROS 1 mientras aborda sus limitaciones. Hemos estado utilizando ROS en Robonomics desde el principio, y ahora es el momento de migrar a ROS 2.",
  "You might find this interesting": "Esto podría resultarte interesante",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Existen numerosos robots de código abierto y plataformas robóticas complejas que admiten ROS. Esto significa que puedes crear un impresionante sistema multirobot para alcanzar tus objetivos específicos. Para",
  "the most current list of supported robots": "obtener la lista más actualizada de robots compatibles,",
  "please visit the ROS website.": "visita el sitio web de ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Veamos cómo se utiliza ROS dentro del marco de Robonomics al representar todo el sistema con Robonomics actuando como diferentes capas:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "En la capa de 'Interfaz de máquina', necesitamos herramientas para conectar sin problemas los robots con el software. ROS 2 proporciona un conjunto robusto de herramientas de desarrollo perfectamente adecuadas para esta tarea.",
  "Robonomics packages for ROS and ROS 2": "Paquetes de Robonomics para ROS y ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "La construcción de un sistema multi-robótico a menudo implica el desafío de conectar dispositivos de varios proveedores, o incluso dispositivos dentro de un solo proveedor, cada uno utilizando diferentes protocolos. Ya sea para una configuración de hogar inteligente o fabricación automatizada, la comunicación efectiva entre sus máquinas es crucial. ROS (y, por supuesto, ROS 2) ofrece varios modos para abordar esto. ¿Qué pasaría si pudiera personalizar tareas mientras ROS gestiona la comunicación entre nodos?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "El equipo de Robonomics ha creado varios paquetes para ROS para hacer que los robots sean más inteligentes y manejar tareas específicas según sea necesario. Para ver las tareas que hemos realizado con ROS, consulte nuestra página de casos de I+D. Casi todas las interacciones con un robot dependen de ROS. Puede encontrar nuestros paquetes de Robonomics de código abierto para ROS en GitHub, y aquí hay algunos de ellos:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "La pila de comunicación de Robonomics contiene un conjunto de paquetes de ROS para fines de comunicación económica.",
  "Robonomics' contribution in the ROS 2 community": "La contribución de Robonomics en la comunidad de ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics combina la robótica con las tecnologías Web3, y nuestro objetivo es crecer en estas áreas. Desde la introducción de ROS 2, hemos identificado tres desafíos principales que implican el apoyo a la comunidad de ROS 2 y mejorar las capacidades de Robonomics:",
  "Creating ROS 2 tools for Rust:": "Creación de herramientas ROS 2 para Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Estas herramientas permiten a los desarrolladores escribir aplicaciones ROS 2 utilizando Rust. Para descubrir más sobre por qué elegimos Rust y la importancia de este proyecto para nosotros, puede encontrar",
  "additional details": "detalles adicionales",
  "Developing Robonomics Middleware for ROS 2:": "Desarrollo de Middleware Robonomics para ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Esto juega un papel importante en garantizar la integración perfecta de Robonomics en varios sistemas de robótica de múltiples agentes utilizando ROS 2. Puede facilitar la integración de robots en tecnologías de blockchain Web 3, al tiempo que reduce los errores durante el proceso de integración, ahorrando así tiempo y costos.",
  "Creating a robotics lab with ROS 2:": "Creación de un laboratorio de robótica con ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "A medida que ROS 2 gana popularidad en la comunidad de robótica, estamos ansiosos por ver más robots y hardware trabajando con ROS 2. Nuestro objetivo es conectarlos al ecosistema Web3 utilizando Robonomics.",
  "Research papers": "Documentos de investigación",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Sin investigación académica, el avance de sistemas complejos que se pueden integrar en nuestra vida diaria puede perder su propósito o incluso plantear riesgos. Debemos contemplar cuidadosamente nuestra dirección, objetivos y posibles consecuencias. Las esferas en las que opera Robonomics, específicamente la robótica, las relaciones económicas y las tecnologías Web3, merecen ser estudiadas individualmente, explorando cómo pueden integrarse entre sí y evaluando su impacto potencial en nuestras vidas.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Este caso está actualmente en movimiento; no te pierdas las noticias, suscríbete para recibir actualizaciones en el cuadro de abajo",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "La 'Robonomics Coffee' es una máquina de café inteligente integrada en la Red Robonomics. Este proyecto tiene como objetivo ilustrar el potencial de Robonomics en la esfera de IoT a través de un ejemplo del mundo real.",
  "logos and assets": "logos y activos",
  "Download the Robonomics logos here. We've got two options for your": "Descarga los logotipos de Robonomics aquí. Tenemos dos opciones para tus",
  "basic needs": "necesidades básicas",
  "and one designed for": "y uno diseñado para",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "token. Además, descubre la paleta de colores óptima",
  "color palette": "para la distinguida marca Robonomics",
  "for the distinguished Robonomics brand": "Logotipos de Robonomics",
  "Robonomics logos": "Descarga todos los",
  "Download all": "logotipos de XRT",
  "XRT logos": "Paleta de colores recomendada",
  "Recommended color palette": "Paleta de colores recomendada",
  "RWS logos": "logotipos de RWS",
  "You are currently opted out. Click here to opt in.": "Actualmente estás excluido. Haz clic aquí para optar por participar.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "La exclusión se ha completado; tus visitas a este sitio web no serán registradas por la herramienta de análisis web. Ten en cuenta que si borras tus cookies, eliminas la cookie de exclusión o cambias de computadora o navegador web, deberás realizar el procedimiento de exclusión nuevamente.",
  "Please click below to opt in:": "Haz clic a continuación para optar por participar:",
  "You are currently opted in. Click here to opt out.": "Actualmente estás incluido. Haz clic aquí para optar por excluirte.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Puedes optar por no tener asignado un número de identificación de cookie de análisis web único en tu computadora para evitar la agregación y análisis de datos recopilados en este sitio web.",
  "To make that choice, please click below to receive an opt-out cookie": "Para tomar esa decisión, haz clic a continuación para recibir una cookie de exclusión.",
  "Privacy Policy": "Política de privacidad",
  "Robonomics Middleware Framework for ROS 2": "Robonomics Middleware Framework para ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Reuniendo tecnologías Web3 y marcos robóticos",
  "Playing with Human-Machine Interaction through Ethereum": "Jugando con la interacción humano-máquina a través de Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Esta información de estudio ha caducado. Para lecciones y talleres actualizados, visite nuestra",
  "academy": "academia",
  "Home assistant themes": "Temas de Home Assistant",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Personaliza tu Home Assistant con nuestros temas gratuitos para usar. Sigue las instrucciones de instalación en",
  "Do you want": "¿Quieres",
  "to dive even deeper?": "sumergirte aún más?",
  "Our": "Nuestro",
  "White Paper": "Libro Blanco",
  "Science": "Ciencia",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Creemos que leer libros realmente puede abrir tu mente. Ya sea ideas simples pero inteligentes o más complejas, los libros son la mejor manera para que tu cerebro absorba todo. Puedes obtener nuestros libros de forma gratuita y consultar nuestra lista de lecturas recomendadas para sumergirte en el emocionante mundo de la robótica!",
  "Download books about Robonomics": "Descarga libros sobre Robonomics",
  "Open your mind [list of recommendations]": "Abre tu mente [lista de recomendaciones]",
  "Robonomics R&D": "Robonomics R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Economía de robots",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Obtén tu mercancía con arte único de Robonomics pintado por nuestras hermosas chicas. Creamos tiendas en los mayores mercados en línea para artistas, échale un vistazo y encuentra camisetas, mangas largas, sudaderas con capucha, cortinas de ducha, almohadas, mantas y otros artículos útiles.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Hemos elegido el marco de robótica más conocido llamado Robot Operating System (ROS) como la interfaz estándar para integrar cualquier sistema ciberfísico compatible. Robonomics admite varios usos para ROS. La implementación de Robonomics para la red Ethereum se presenta en forma del paquete ROS robonomics_comm. Para la arquitectura ROS 2, implementamos el soporte para Robonomics como una capa de middleware (consulte «Robonomics como Middleware de ROS 2» para más detalles). Cuando el uso de ROS es redundante (por ejemplo, al trabajar con dispositivos IoT), se ha desarrollado un módulo de interfaz robonomics-interface en Python. Ayuda a acceder a las funciones de Robonomics de forma nativa y funciona tanto con nodos locales y privados como con nodos remotos y públicos.",
  "read our almanac": "lee nuestro almanaque",
  "Begin your adventure in the world of cyberpunks": "Comienza tu aventura en el mundo de los cyberpunks",
  "Pure open source": "Fuente abierta pura",
  "Local and Global Availability": "Disponibilidad local y global",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Al utilizar código abierto, P2P y Web3, no hay lugar para trucos corporativos, asegurando que tus datos personales estén protegidos. Toda la información se almacena localmente o encriptada con tu clave personal en la nube Web3.",
  "Interested in how the team reached this stage?": "¿Interesado en cómo el equipo llegó a esta etapa?",
  "The Robonomics Timeline": "La línea de tiempo de Robonomics",
  "can guide you through our journey": "puede guiarte a través de nuestro viaje",
  "Device Design and Development": "Diseño y desarrollo de dispositivos",
  "Smart devices": "Dispositivos inteligentes",
  "Wearable merch": "Mercancía usable",
  "Academy": "Academia",
  "Wiki": "Wiki",
  "Science & White paper": "Ciencia y Libro blanco",
  "Tokenomics": "Tokenómica",
  "Cases": "Casos",
  "Brand assets": "Activos de marca",
  "Wallpapers": "Fondos de pantalla",
  "NFT": "NFT",
  "Blog": "Blog",
  "Contacts": "Contactos",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Conviértete en proveedor de datos ambientales para tus amigos y vecinos en la zona. Accede a mediciones verdaderamente descentralizadas de la calidad del aire, ruido, temperatura y otras condiciones ambientales en el mapa de sensores.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "El servidor doméstico inteligente más de código abierto, alimentado por RISC-V, con una nube Web3 reemplazando los servidores de Google bajo el capó.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Dispositivos WI-FI MQTT inteligentes con firmware de código abierto Tasmota en la placa totalmente compatible con Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Conecta tu hogar inteligente y ropa inteligente al Hikikomori para monitorear datos de sensores, justo en tus dedos. Literalmente.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Conoce dispositivos inteligentes y hardware futurista de un equipo autónomo con amplia experiencia en robótica, blockchain y IoT",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "El procesamiento de datos siempre es un tema sensible. Por eso ofrecemos un módulo de conectividad completamente de código abierto",
  "connectivity module": "dándote la libertad de elegir qué servidores usar para el procesamiento. Sin nubes cerradas, sin código opaco.",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Robonomics estableció tres centros de Conectividad para garantizar una conexión estable. Esta opción está activada por defecto en la estación.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Puedes lanzar tu propio centro para recibir datos de la Estación Civil Altruista y procesarlos más adelante.",
  "Steps to set up your Connectivity": "Pasos para configurar tu Conectividad",
  "Deploy Connectivity": "Implementar Conectividad",
  "Technical requirements:": "Requisitos técnicos:",
  "2 CPU cores;": "2 núcleos de CPU;",
  "4 GB RAM;": "4 GB de RAM;",
  "40 GB storage;": "40 GB de almacenamiento;",
  "Static IP": "IP estática",
  "Than set up": "Luego configurar",
  "and follow": "y seguir",
  "the instructions": "las instrucciones",
  "Connect a station to your connectivity": "Conecta una estación a tu conectividad",
  "Open your sensor settings by its IP.": "Abre la configuración de tu sensor por su IP.",
  "Go to APIs settings": "Ve a la configuración de APIs",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Marca la casilla para enviar datos a API personalizada y completa los campos correspondientes (IP del servidor, puertos, etc.).",
  "Join with your setup to global map (optional)": "Únete con tu configuración al mapa global (opcional)",
  "If you want to publish data to": "Si deseas publicar datos en",
  "the global map": "el mapa global",
  "you need to make two pull requests:": "necesitas hacer dos solicitudes de extracción:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Agrega la ID de IPFS de tu Conectividad a la lista de agentes del mapa de sensores:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Agrega la dirección de la paracadena de tu Conectividad a la lista de agentes de plantilla del servidor de almacenamiento a largo plazo:",
  "Steps for launching your own map": "Pasos para lanzar tu propio mapa",
  "Deploy web interface": "Implementar interfaz web",
  "Fork the map repository:": "Clonar el repositorio del mapa:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Editar la configuración para personalizar tu mapa, incluyendo el dominio, proveedor, punto de vista inicial y tu ID de conectividad IPFS para la lista de agentes.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Implementar tu propia versión de la interfaz web y comenzar a recibir datos en tiempo real de tu sensor.",
  "Full guide here:": "Guía completa aquí:",
  "Launch long-term storage": "Lanzamiento de almacenamiento a largo plazo",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Simplemente recopilar datos de sensores no es suficiente; necesita ser procesado. Ajuste un servidor para recopilar datos de sensores basado en software de node.js de código abierto",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "y obtenga su propio servidor de trabajo para el almacenamiento de datos de mapas a largo plazo.",
  "Static IP.": "IP estática.",
  "Steps for launching a storage:": "Pasos para lanzar un almacenamiento:",
  "Fork the RoSeMAN repository:": "Hacer un fork del repositorio RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Elegir la versión de Docker o Node.js (se requiere base de datos MongoDB).",
  "Add a parachain address of your Connectivity to agents list.": "Agregar una dirección de paracadena de su Conectividad a la lista de agentes.",
  "Run the project.": "Ejecutar el proyecto.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "El primer servidor para un hogar inteligente construido completamente en código abierto, desde la CPU hasta la nube descentralizada.",
  "Processor:": "Procesador:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 con CPU RISC-V de 4 núcleos, 2 MB de caché L2, hasta 1.5 GHz, soporte ISA RV64GC",
  "GPU:": "GPU:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, hasta 600 MHz",
  "Memory:": "Memoria:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 GB LPDDR4 SDRAM, hasta 2800 Mbps",
  "Storage:": "Almacenamiento:",
  "32 GB TF card (minimum)": "Tarjeta TF de 32 GB (mínimo)",
  "Interfaces:": "Interfaces:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2 puertos Ethernet Gigabit, 4 puertos USB 3.0 Tipo-A, encabezado GPIO de 40 pines, conector M.2, zócalo eMMC, encabezado de ventilador de 2 pines",
  "Power:": "Energía:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5V DC a través de USB-C, hasta 30 W (mínimo 3 A) o entrada de 5V a través de GPIO de 40 pines",
  "OS:": "SO:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Instalación de Home Assistant Core",
  "Robonomics Integration Installation": "Instalación de Integración de Robonomics",
  "Zigbee Devices in Zigbee2MQTT": "Dispositivos Zigbee en Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Agregar el dominio RoSeMAN al proveedor remoto de mapas.",
  "All hardware": "Todo el hardware",
  "Use it": "Úsalo",
  "Learn": "Aprende",
  "Explore website": "Explora el sitio web",
  "Timeline since 2015": "Línea de tiempo desde 2015",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "El equipo está adquiriendo nuevas habilidades en el diseño y programación de dispositivos inteligentes desde cero. Los",
  "sensors.social": "sensores sociales",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "Se ha creado una red donde operan dispositivos de prueba desarrollados por ingenieros de Robonomics. También se ha desarrollado una línea de dispositivos inteligentes para el hogar basados en Tasmota Wi-Fi, y desde el verano de 2024, esta línea ha estado en proceso de certificación para el mercado de la UE. En otoño de 2024, el equipo del proyecto presentará una línea de dispositivos de código abierto alimentados por tecnologías Web3, bajo el nombre \"Hardware for Cryptopunks\".",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Robonomics continúa creciendo dentro del ecosistema de Polkadot. La parachain de la red Kusama ha estado funcionando durante más de dos años, y a partir del otoño de 2024, también se lanzará una parachain en la red Polkadot. Se han registrado más de 5 millones de transacciones de dispositivos de usuario en la red. El equipo continúa explorando posibilidades para integrar sus implementaciones en Ethereum y Polkadot.",
  "Robo Smart Devices:": "Dispositivos inteligentes Robo:",
  "Read books": "Leer libros",
  "Robonomics merch": "Mercancía de Robonomics",
  "Desktop": "Escritorio",
  "Smartphone": "Teléfono inteligente",
  "our robo art wallpapers": "nuestros fondos de pantalla de arte robótico",
  "Space monkey devcon 2024 special": "Space monkey devcon 2024 especial",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Descarga esta imagen en tu dispositivo y únete a nuestra búsqueda especial Devcon 2024 en emocionantes lugares alrededor de Bangkok!",
  "Free Wallpapers for you from our artists": "Fondos de pantalla gratuitos para ti de nuestros artistas",
  "Hide your folder with secret wallpaper": "Oculta tu carpeta con un fondo de pantalla secreto",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "¡Hemos creado fondos de pantalla secretos solo para ti! Descarga el fondo de pantalla y los iconos de carpeta, y tus carpetas se mezclarán perfectamente en tu pantalla de inicio, dejando solo visible una hermosa obra de arte.",
  "Desktop background": "Fondo de escritorio",
  "Mac OS icons": "Iconos de Mac OS",
  "Windows icons": "Iconos de Windows",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "Outdoor sensor “Altruist“": "Sensor exterior 'Altruist'",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Un dispositivo no invasivo para instalar en paneles eléctricos con montaje en riel DIN. Construido en el chip Espressif ESP32C6 con arquitectura RISC-V abierta.",
  "Sign up for updates": "Regístrese para recibir actualizaciones",
  "Hardware for cyberpunks": "Hardware para ciberpunks",
  "Tech Blog & Updates": "Blog y actualizaciones tecnológicas",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Comparta y acceda a datos de ruido, polvo y temperatura de otros sensores independientes cercanos. Olvídese de los servidores corporativos, estos datos se distribuyen de forma segura en todo el mundo a través de la innovadora tecnología Web3.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Experimente el poder de DePIN (Red de Infraestructura Física Descentralizada) real: un movimiento tecnológico revolucionario que ha cobrado vida y prospera desde hace años en nuestro",
  "decentralized sensor map": "mapa de sensores descentralizado",
  "3 ways to use it": "3 formas de usarlo",
  "Access": "Acceso",
  "noise, dust, and temperature data": "datos de ruido, polvo y temperatura",
  "from other independent sensors on our": "de otros sensores independientes en nuestro",
  "Connect your device as simple as other smart devices and share your environmental outdoor data with community.": "Conecte su dispositivo tan fácilmente como otros dispositivos inteligentes y comparta sus datos ambientales exteriores con la comunidad.",
  "Check open-source sensor firmware on GitHub": "Consulte el firmware del sensor de código abierto en GitHub",
  "Operate your own Data Server": "Opere su propio servidor de datos",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "dándole la libertad de elegir qué servidores utilizar para el procesamiento. Sin nubes propietarias, sin código oculto.",
  "Keep in mind, you can join the": "Tenga en cuenta que puede unirse al",
  "global decentralized sensor map": "mapa global de sensores descentralizados",
  "even with a sensor connected through your own server!": "¡incluso con un sensor conectado a través de su propio servidor!",
  "Run your own Interactive Map": "Ejecute su propio mapa interactivo",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "¿Le encanta la idea de un mapa descentralizado pero desea personalizarlo con diseños adicionales y convertirse en administrador de una nueva infraestructura de sensores soberanos? Puede implementar",
  "your own version by forking": "su propia versión bifurcando",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "nuestro código de código abierto en GitHub (asegúrese de verificar el tipo de licencia). Recuerde utilizar los recursos de código abierto de manera responsable.",
  "Device Specifications": "Especificaciones del dispositivo",
  "Input Voltage:": "Voltaje de entrada:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Hz",
  "Wireless protocol:": "Protocolo inalámbrico:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Soporta Wi-Fi 6 de 2.4GHz (802.11 b/g/n) y Bluetooth 5 (LE), Zigbee con antena incorporada",
  "Equipped with a high-performance": "Equipado con un procesador RISC-V de",
  "32-bit RISC-V processor": "32 bits de alto rendimiento",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "con velocidad de reloj de hasta 160 MHz, y un procesador RISC-V de 32 bits de bajo consumo con velocidad de reloj de hasta 20MHz",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320KB ROM, 512KB de HP SRAM, 16KB LP SRAM y 4MB de memoria Flash",
  "USB-C": "USB-C",
  "for firmware development and updates": "para desarrollo y actualizaciones de firmware",
  "PM sensor:": "Sensor PM:",
  "SDS011 laser PM2.5/PM10 sensor": "Sensor láser SDS011 PM2.5/PM10",
  "Supported sensors:": "Sensores compatibles:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X, BME280, HTU21D; Sensor de nivel de ruido: I2S INMP441; Contador Geiger: Radsens.",
  "Help & support": "Ayuda y soporte",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "Con el mapa descentralizado de Robonomics puede utilizar la Conectividad de Robonomics o crear su propio Servicio de Conectividad.",
  "Your own Connectivity": "Su propia Conectividad",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Un asistente doméstico inteligente que disfrutará cuidando, incluso cuando esté ausente. Solo para desarrolladores.",
  "Robonomics open-source hardware": "Hardware de código abierto de Robonomics",
  "Open-source hardware": "Hardware de código abierto",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Experimente el poder de DePIN (Red de Infraestructura Física Descentralizada) real: un movimiento tecnológico revolucionario que ha cobrado vida y prospera con Robonomics",
  "Home server with Web3 cloud": "Servidor doméstico con nube Web3",
  "Home server on RISC V": "Servidor doméstico en RISC V",
  "Supports": "Soporta",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "Wi-Fi 6 de 2.4GHz (802.11 b/g/n) y Bluetooth 5 (LE), con antena incorporada",
  "Built in": "Incorporado",
  "Onboard": "A bordo",
  "1.47inch LCD display, 172x320 resolution, 262K color": "Pantalla LCD de 1.47 pulgadas, resolución de 172x320, 262K colores",
  "Adapting": "Adaptando",
  "integrates": "integra",
  "full-speed USB-С port": "puerto USB-С de alta velocidad",
  "Onboard TF card slot": "Ranura para tarjeta TF a bordo",
  "for external TF card storage of pictures or files": "para almacenamiento externo de tarjetas TF de imágenes o archivos",
  "Supports accurate control": "Soporta control preciso",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "como reloj flexible y múltiples modos de energía para lograr un bajo consumo de energía en diferentes escenarios",
  "Built-in RGB LED": "LED RGB incorporado",
  "with clear acrylic sandwich panel for cool lighting effect": "con panel de acrílico transparente para un efecto de iluminación genial",
  "Battery Level Gauge": "Indicador de nivel de batería",
  "Low-Power I2C Temperature sensor": "Sensor de temperatura I2C de bajo consumo",
  "RV-3032-C7 Real-Time Clock Module": "Módulo de reloj en tiempo real RV-3032-C7",
  "Battery 180mA": "Batería 180mA",
  "Measuring Range:": "Para configurar el dispositivo, por favor visite:",
  "0.1-80A": "0.1-80A",
  "Wireless Protocol:": "Protocolo inalámbrico:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (Wi-Fi de 2.4 GHz)",
  "CPU:": "CPU:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "ESP32-S3 MCU basado en sistema en un chip (SoC) microprocesador de doble núcleo (Xtensa 32 bits LX7), hasta 240 MHz",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 KB ROM, 520 KB SRAM, 8 MB FLASH",
  "for development and updates": "para desarrollo y actualizaciones",
  "To configure the device, please visit:": "Para configurar el dispositivo, visite:",
  "multiple IO interfaces,": "múltiples interfaces de E/S,",
  "Early bird price": "Precio de venta anticipada",
  "Get updates about smart devices": "Recibe actualizaciones sobre dispositivos inteligentes",
  "Receive regular emails from Robonomics": "Recibe correos electrónicos regulares de Robonomics",
  "Thanks for your submission!": "¡Gracias por tu envío!",
  "Not submitted": "No enviado",
  "Notify me when available": "Notifícame cuando esté disponible",
  "Captcha is not verified. Please, check your internet connection": "El Captcha no está verificado. Por favor, verifica tu conexión a internet",
  "Thanks for the submition!": "¡Gracias por la presentación!",
  "Submitting": "Presentando",
  "Submit": "Presentar",
  "Follow for latest news and important updates": "Sigue para conocer las últimas noticias y actualizaciones importantes",
  "The best way to check open-source project": "La mejor manera de verificar proyectos de código abierto",
  "Useful, serious, cute videos, teasers etc.": "Videos útiles, serios, lindos, avances, etc.",
  "Chat for engineers and developers": "Chat para ingenieros y desarrolladores",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Chat no oficial para compañeros de criptomonedas",
  "Use cases": "Casos de uso",
  "Coming in early 2025": "Llegando a principios de 2025",
  "Rent in California, USA": "Alquiler en California, EE. UU.",
  "Available by the Hour, Day, or Week": "Disponible por hora, día o semana",
  "Your name": "Tu nombre",
  "Your comment": "Tu comentario",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Al hacer clic en este botón, aceptas recibir un correo electrónico sobre el alquiler del robot humanoide Unitree G1.",
  "We'll get in touch shortly!": "¡Nos pondremos en contacto pronto!",
  "Contact me": "Contáctame",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Un sensor inteligente que recopila datos ambientales e los integra en un mapa de sensores descentralizado.",
  "Smart Tamagotchi “Hikikomori“": "Smart Tamagotchi 'Hikikomori'",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Una placa de desarrollo de microcontrolador diseñada para integrarse con sistemas Web3. Puede ser tu tamagotchi de casa inteligente, un controlador de juegos, una herramienta educativa, ¡cualquier cosa que diseñes!",
  "Energy monitor with USB-C": "Monitor de energía con USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Un dispositivo no invasivo diseñado para montaje en riel DIN en paneles eléctricos, rastrea el consumo y la generación de electricidad.",
  "Smart devices from Robonomics": "Dispositivos inteligentes de Robonomics",
  "Our values": "Nuestros valores",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Nuestros dispositivos están diseñados para una transparencia total. Cada producto viene con un procesador RISC-V abierto, código fuente y esquemas de circuitos de código abierto, e instrucciones de actualización locales, sin necesidad de conexiones en la nube. Tienes el poder de entender, personalizar y confiar en tu tecnología desde cero",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "La combinación de comunicación P2P y nube Web3 garantiza que tus dispositivos siempre estarán conectados. ¿Sin acceso a internet? Todavía puedes conectarte directamente al dispositivo. ¿Te mudas a una nueva región o te vas de vacaciones? Tus dispositivos permanecerán en línea y accesibles donde sea que estés",
  "Privacy by design": "Privacidad por diseño",
  "Trust the Code": "Confía en el código",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Totalmente de código abierto, sin algoritmos ocultos, sin vigilancia corporativa. Es transparencia para el verdadero descentralista.",
  "Your data, your keys": "Tus datos, tus claves",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Toma el control total de tus datos con nuestro módulo de conectividad totalmente de código abierto. Elige entre Robonomics o almacenamiento en la nube Web3 seguro con tu clave personal, sin nubes cerradas, sin código opaco.",
  "Always Connected, Always Secure": "Siempre conectado, siempre seguro",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "La comunicación local P2P y la nube Web3 garantizan que tu sensor siempre sea accesible, sin importar dónde estés. Sin puntos de falla centralizados, solo una conexión pura y peer-to-peer.",
  "Join the Altruist Collective": "Únete al Colectivo Altruista",
  "Plug the device into the global,": "Conecta el dispositivo a nivel global,",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Comparte tu información ambiental con tus vecinos, tu comunidad o tu red descentralizada.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Equipado con USB-C, compatible con WiFi y Zigbee. Registra datos de consumo y generación de electricidad en la red Polkadot en intervalos de 10 minutos.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori funciona con una placa de desarrollo de microcontrolador ESP32-C6, tiene una pantalla LCD, soporte Wi-Fi 6 y BLE 5.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori es adecuado para el desarrollo rápido de aplicaciones IoT alimentadas por Web3. ¡Esto puede ser tu tamagotchi de casa inteligente, un controlador de juegos, una herramienta educativa - cualquier cosa que diseñes!",
  "Unitree G1 Humanoid Robot": "Robot Humanoide Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Alquila el robot humanoide de vanguardia para tus proyectos de investigación, programación y entretenimiento.",
  "Hour": "Hora",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Alquiler en el lugar (Oakland, CA)",
  "Suitable for short tasks": "Adecuado para tareas cortas",
  "No engineering support included": "No incluye soporte de ingeniería",
  "Day": "Día",
  "$900": "$900",
  "Suitable for bigger tasks": "Adecuado para tareas más grandes",
  "Basic engineering support included": "Incluye soporte básico de ingeniería",
  "Week+": "Semana+",
  "On demand": "A pedido",
  "Delivery to your location": "Entrega a tu ubicación",
  "Customized approach": "Enfoque personalizado",
  "Engineering support can be included": "El soporte de ingeniería puede estar incluido",
  "Enter the new era": "Ingresa a la nueva era",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "El robot humanoide G1 con sus características innovadoras ofrece versatilidad para las necesidades de investigación, programación y entretenimiento. El Unitree G1 incluye una Mano Dextrous de Control de Potencia, lo que le permite realizar tareas delicadas como manejar objetos, presionar botones y llevar a cabo otras operaciones precisas con varios elementos.",
  "Tech specification": "Especificaciones técnicas",
  "Height, Width and Thickness（Stand）": "Altura, Ancho y Grosor (Soporte)",
  "1320x450x200mm": "1320x450x200mm",
  "Height, Width and Thickness（Fold）": "Altura, Ancho y Grosor (Plegado)",
  "690x450x300mm": "690x450x300mm",
  "Weight (With Battery)": "Peso (Con Batería)",
  "About 35kg": "Aproximadamente 35kg",
  "Arm Maximum Load": "Carga Máxima del Brazo",
  "About 2Kg": "Aproximadamente 2Kg",
  "Cooling System": "Sistema de Enfriamiento",
  "Local air cooling": "Enfriamiento local por aire",
  "Smart Battery (Quick Release)": "Batería Inteligente (Liberación Rápida)",
  "9000mAh": "9000mAh",
  "Charger": "Cargador",
  "54V 5A": "54V 5A",
  "Battery Life": "Vida de la Batería",
  "About 2h": "Aproximadamente 2h",
  "Sensing Sensor": "Sensor de Detección",
  "Depth Camera+3D LiDAR": "Cámara de Profundidad + LiDAR 3D",
  "5W Speaker": "Altavoz de 5W",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6, Bluetooth 5.2",
  "Manual Controller": "Controlador Manual",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Toma el control de tus datos de casa inteligente con un servidor doméstico de código abierto en procesador RISC-V y conectividad Web3.",
  "Surveillance-free": "Libre de vigilancia",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Sin registros de datos ocultos en servidores corporativos, permitiendo al mismo tiempo un acceso remoto seguro.",
  "No vendor lock-in": "Sin bloqueo de proveedores",
  "Supports over 3000 integrations with devices from various manufacturers.": "Compatible con más de 3000 integraciones con dispositivos de varios fabricantes.",
  "Open hardware": "Hardware abierto",
  "Open processor architecture and open-source code ensure a trustless system.": "La arquitectura de procesador abierta y el código fuente abierto garantizan un sistema sin confianza.",
  "Open and efficient hardware": "Hardware abierto y eficiente",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Nuestro servidor doméstico está alimentado por un procesador RISC-V y cuenta con esquemáticos de circuito completamente transparentes. RISC-V es una arquitectura de procesador abierta y modular que viene con una licencia BSD. A diferencia de ARM propietario, ofrece flexibilidad para personalización sin restricciones de licencia, lo que lo hace ideal para dispositivos y servidores IoT sin confianza.",
  "Vendor agnostic smart home heart": "Corazón del hogar inteligente independiente del proveedor",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "El servidor viene preinstalado con Home Assistant, una plataforma de automatización del hogar de código abierto, que le brinda control total de su hogar inteligente sin depender de servicios en la nube de terceros.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Su diseño modular le permite agregar fácilmente componentes, automatizaciones e integraciones, admitiendo más de 3,000 dispositivos de varios fabricantes sin bloqueo de proveedor. Con soporte para los protocolos Zigbee y Wi-Fi, puede conectar una amplia gama de dispositivos, desde sensores de temperatura hasta monitores de consumo de energía, todo a un servidor local.",
  "Designed for privacy": "Diseñado para la privacidad",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Nuestro servidor doméstico inteligente elimina la interferencia corporativa, manteniendo sus datos locales o cifrados con su clave personal en almacenamiento descentralizado Web3. Disfrute de completa privacidad sin seguimiento, sin vigilancia, solo control seguro y sin confianza sobre su hogar inteligente.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "Con Robonomics Web3 cloud y control remoto P2P, obtiene acceso criptográfico a todas las funciones del hogar inteligente:",
  "hour": "hora",
  "hours": "horas",
  "day": "día",
  "days": "días",
  "week": "semana",
  "weeks": "semanas",
  "on demand": "a pedido",
  "Special offer": "Oferta especial",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Obtenga acceso exclusivo a uno de los primeros robots humanoides comercialmente disponibles. Opciones de alquiler flexibles para necesidades de investigación, programación y entretenimiento.",
  "With the Altruist Outdoor Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data—encrypted, mapped, and shared across a distributed network.": "Con el Sensor Exterior Altruista, te conviertes en una fuerza en la monitorización ambiental descentralizada. Captura datos de ruido, polvo y temperatura, encriptados, mapeados y compartidos a través de una red distribuida.",
  "Access current device states remotely": "Accede a los estados actuales de los dispositivos de forma remota",
  "Control devices remotely via parachain or LibP2P": "Controla los dispositivos de forma remota a través de parachain o LibP2P",
  "Manage Home Assistant users": "Administra usuarios de Home Assistant",
  "Back up and restore Home Assistant configurations": "Realiza copias de seguridad y restaura configuraciones de Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Almacena el gemelo digital de tu hogar en una nube segura y descentralizada",
  "Books": "Libros",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "En 2022, el equipo de Robonomics comenzó a colaborar con otros equipos de parachain dentro del ecosistema de Polkadot para aprovechar las fortalezas únicas de esta red descentralizada. Esta colaboración resultó en el lanzamiento de un Servicio de Copia de Seguridad y Archivo de Datos diseñado específicamente para empresas de robótica.",
  "Digital markets for robots": "Mercados digitales para robots",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "El desarrollo de la robótica y sistemas automatizados durante la Cuarta Revolución Industrial requerirá que los robots tengan la capacidad de ordenar servicios para su propio mantenimiento.",
  "Tokenization of Data of IOT devices": "Tokenización de datos de dispositivos de IoT",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "La tokenización de datos de dispositivos de IoT (Internet de las cosas) representa un desarrollo innovador en la economía digital.",
  "Industrial zone management with capital": "Gestión de zonas industriales con capital",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "Este caso explora el papel de las fábricas inteligentes en respuesta a los cambios de capital en los mercados modernos. Como parte de la transformación de la Industria 4.0, introduce un protocolo de comunicación descentralizado que utiliza sistemas ciberfísicos para mejorar la coordinación económica entre agentes industriales.",
  "Mars colonization, impossible without kusama": "Colonización de Marte, imposible sin kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Este caso de I+D explora el papel de la infraestructura descentralizada de la red Kusama en el apoyo a misiones interplanetarias, especialmente la colonización de Marte.",
  "A decentralized system for negotiating road space": "Un sistema descentralizado para negociar espacio vial",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Nuestro objetivo era desarrollar un sistema descentralizado para negociar espacio vial donde los vehículos autónomos puedan pagar por rutas y permisos.",
  "Almanac": "Almanaque",
  "Robonomics' Approach": "Enfoque de Robonomics",
  "Robonomics provides an alternative to centralized corporate-controlled cloud services. Instead of relying on such systems, it leverages public blockchain networks, such as Ethereum and Polkadot, to facilitate secure and autonomous transactions between robots and service providers.": "Robonomics ofrece una alternativa a los servicios en la nube controlados por corporaciones centralizadas. En lugar de depender de tales sistemas, aprovecha las redes blockchain públicas, como Ethereum y Polkadot, para facilitar transacciones seguras y autónomas entre robots y proveedores de servicios.",
  "How Digital Markets for Robots Work": "Cómo funcionan los mercados digitales para robots",
  "Key Benefits": "Beneficios clave",
  "Digital markets for robots represent a critical step toward supporting the next wave of automation and smart city infrastructure. Robonomics' decentralized approach ensures secure, scalable, and autonomous service management for robots.": "Los mercados digitales para robots representan un paso crítico hacia el apoyo a la próxima ola de automatización e infraestructura de ciudades inteligentes. El enfoque descentralizado de Robonomics garantiza una gestión de servicios segura, escalable y autónoma para robots.",
  "Conclusion": "Conclusión",
  "Why Smart Factories Should Respond to Capital Changes": "Por qué las fábricas inteligentes deberían responder a los cambios de capital",
  "A Decentralized Protocol for Economic Coordination": "Un protocolo descentralizado para la coordinación económica",
  "Balancing Production and Capital": "Equilibrar la producción y el capital",
  "Technical Foundation": "Fundamento técnico",
  "This R&D case presents how capital flows can act as economic signals for smart factories. By adopting Robonomics' decentralized protocol, industries can better manage production efficiency and stay aligned with the evolving standards of Industry 4.0.": "Este caso de I+D presenta cómo los flujos de capital pueden actuar como señales económicas para las fábricas inteligentes. Al adoptar el protocolo descentralizado de Robonomics, las industrias pueden gestionar mejor la eficiencia de producción y mantenerse alineadas con los estándares en evolución de la Industria 4.0.",
  "Exploring Kusama's Role in Space Exploration": "Explorando el papel de Kusama en la exploración espacial",
  "The Mars Rover Experiment": "El Experimento del Rover de Marte",
  "Technical Implementation": "Implementación técnica",
  "Use Cases and Potential Impact": "Casos de uso e impacto potencial",
  "A fun video about the use of KUSAMA on Mars:": "Un video divertido sobre el uso de KUSAMA en Marte:",
  "This R&D case demonstrates how the Kusama network can support scientific exploration, resource management, and data transparency for space missions. The decentralized architecture offers a promising foundation for the future of Mars colonization and beyond.": "Este caso de I+D demuestra cómo la red Kusama puede apoyar la exploración científica, la gestión de recursos y la transparencia de datos para misiones espaciales. La arquitectura descentralizada ofrece una base prometedora para el futuro de la colonización de Marte y más allá.",
  "The Challenge": "El desafío",
  "The Solution": "La solución",
  "Here is the project presentation during the MOBI GRAND CHALLENGE": "Aquí está la presentación del proyecto durante el MOBI GRAND CHALLENGE",
  "We want to give special thanks to the Jetbrains Team’s Mobile Robot Algorithms Laboratory for giving us access to Duckietown.": "Queremos agradecer especialmente al Laboratorio de Algoritmos de Robots Móviles del Equipo de Jetbrains por brindarnos acceso a Duckietown.",
  "Special Thanks": "Agradecimientos especiales",
  "With robots generating enormous amounts of data—including videos, raw technical data, and logs—storage can become a significant challenge, especially at scale. This new service offers an affordable and secure solution to meet these needs.": "Con los robots generando enormes cantidades de datos, incluidos videos, datos técnicos en bruto y registros, el almacenamiento puede convertirse en un desafío significativo, especialmente a gran escala. Este nuevo servicio ofrece una solución asequible y segura para satisfacer estas necesidades.",
  "Addressing the Challenge of Data Storage": "Abordando el desafío del almacenamiento de datos",
  "Our Solution: A Decentralized Approach": "Nuestra solución: Un enfoque descentralizado",
  "Key Technology Behind the Service": "Tecnología clave detrás del servicio",
  "Why This Service Is Essential": "Por qué este servicio es esencial",
  "Looking Ahead": "Mirando hacia el futuro",
  "For additional details about the collaboration between Robonomics and Crust Network and how decentralized storage is reshaping data management for robotics companies, visit the official": "Para obtener más detalles sobre la colaboración entre Robonomics y Crust Network y cómo el almacenamiento descentralizado está transformando la gestión de datos para empresas de robótica, visite el",
  "blog": "blog",
  "Learn More About the Collaboration": "Obtenga más información sobre la colaboración",
  "Send a request message and get the result from the autonomous agent. The resulting file is saved to IPFS and the resultant message requires a signature with a private key.": "Envíe un mensaje de solicitud y obtenga el resultado del agente autónomo. El archivo resultante se guarda en IPFS y el mensaje resultante requiere una firma con una clave privada.",
  "Overview": "Resumen",
  "This case study explores how Robonomics Network facilitates decentralized data access using IoT devices and blockchain technology. By leveraging the Robonomics dApp connected to a weather sensor on Fuji Mountain, users can obtain real-time weather data securely and transparently.": "Este estudio de caso explora cómo Robonomics Network facilita el acceso descentralizado a datos utilizando dispositivos de IoT y tecnología blockchain. Al aprovechar la dApp de Robonomics conectada a un sensor meteorológico en la montaña Fuji, los usuarios pueden obtener datos meteorológicos en tiempo real de forma segura y transparente.",
  "How does it work?": "¿Cómo funciona?",
  "Technical Insights": "Información técnica",
  "Here's a walkthrough video:": "Aquí hay un video explicativo:",
  "This R&D case highlights the capabilities of decentralized technologies in real-world data collection and access. Robonomics Network empowers secure, verifiable data retrieval from IoT sensors, advancing the reliability of environmental monitoring solutions.": "Este caso de I+D destaca las capacidades de las tecnologías descentralizadas en la recopilación y acceso de datos del mundo real. Robonomics Network potencia la recuperación de datos segura y verificable de sensores de IoT, avanzando en la fiabilidad de las soluciones de monitoreo ambiental.",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy. By leveraging blockchain technology, IoT devices can generate, verify, and tokenize data as units of value, creating a secure and transparent mechanism for digital asset creation.": "La tokenización de datos de dispositivos de IoT (Internet de las cosas) representa un desarrollo innovador en la economía digital. Al aprovechar la tecnología blockchain, los dispositivos de IoT pueden generar, verificar y tokenizar datos como unidades de valor, creando un mecanismo seguro y transparente para la creación de activos digitales.",
  "Background": "Antecedentes",
  "The Role of IoT Devices in Tokenization": "El papel de los dispositivos de IoT en la tokenización",
  "Key Benefits of Tokenized IoT Data": "Beneficios clave de los datos de IoT tokenizados",
  "Tokenizing IoT data through blockchain not only enhances data security and transparency but also paves the way for autonomous, machine-driven economies. This transformative approach creates a new generation of tokenized assets, unlocking immense potential for global innovation and economic growth.": "La tokenización de datos de IoT a través de blockchain no solo mejora la seguridad y transparencia de los datos, sino que también allana el camino para economías autónomas y dirigidas por máquinas. Este enfoque transformador crea una nueva generación de activos tokenizados, desbloqueando un inmenso potencial para la innovación global y el crecimiento económico.",
  "Last updated: February 03, 2025": "Última actualización: 03 de febrero de 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Esta Política de Privacidad describe nuestras políticas y procedimientos sobre la recopilación, uso y divulgación de su información cuando utiliza el Servicio y le informa sobre sus derechos de privacidad y cómo la ley lo protege.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Utilizamos sus datos personales para proporcionar y mejorar el Servicio. Al utilizar el Servicio, usted acepta la recopilación y uso de información de acuerdo con esta Política de Privacidad.",
  "Interpretation and Definitions": "Interpretación y Definiciones",
  "Interpretation": "Interpretación",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Las palabras cuya letra inicial está en mayúscula tienen significados definidos en las siguientes condiciones. Las siguientes definiciones tendrán el mismo significado independientemente de si aparecen en singular o en plural.",
  "Definitions": "Definiciones",
  "For the purposes of this Privacy Policy:": "Para los fines de esta Política de Privacidad:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(se refiere como \"el DAO\", \"Nosotros\", \"Nos\" o \"Nuestro\" en este Acuerdo) se refiere a la organización autónoma descentralizada Robonomics Network, un operador para el sitio web",
  "(referred to as": "(referido como",
  "Website": "Sitio web",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "en este Acuerdo). Para los fines del GDPR, el DAO es el Controlador de Datos.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "son pequeños archivos que se colocan en su computadora, dispositivo móvil u otro dispositivo por un sitio web, que contienen los detalles de su historial de navegación en ese sitio web entre sus muchos usos. Puede encontrar información más detallada sobre las cookies y cómo funcionan en:",
  "Country": "País",
  "refers to: Cyprus.": "se refiere a: Chipre.",
  "Data Controller": "Controlador de Datos",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "para los fines del GDPR (Reglamento General de Protección de Datos), se refiere al DAO como la persona jurídica que, sola o conjuntamente con otros, determina los fines y medios del tratamiento de Datos Personales.",
  "Device": "Dispositivo",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "significa cualquier dispositivo que puede acceder al Servicio, como una computadora, un teléfono celular o una tableta digital.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "se refiere al Reglamento General de Protección de Datos de la UE.",
  "Personal Data": "Datos Personales",
  "is any information that relates to an identified or identifiable individual.": "es cualquier información que se refiere a un individuo identificado o identificable.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Para los fines del GDPR, Datos Personales significa cualquier información relacionada con usted, como un nombre, un número de identificación, datos de ubicación, identificador en línea o uno o más factores específicos de la identidad física, fisiológica, genética, mental, económica, cultural o social.",
  "Service": "Servicio",
  "refers to the Website": "se refiere al Sitio web",
  "Service Provider": "Proveedor de Servicios",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "significa cualquier persona natural o jurídica que procesa los datos en nombre del DAO. Se refiere a empresas o individuos de terceros empleados por el DAO para facilitar el Servicio, para proporcionar el Servicio en nombre del DAO, para realizar servicios relacionados con el Servicio o para ayudar al DAO en el análisis de cómo se utiliza el Servicio. Para los fines del GDPR, los Proveedores de Servicios se consideran Procesadores de Datos.",
  "Usage Data": "Datos de Uso",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "se refiere a datos recopilados automáticamente, generados por el uso del Servicio o de la infraestructura del Servicio en sí (por ejemplo, la duración de una visita a una página).",
  "You": "Usted",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(se refiere como \"Su\" en este Acuerdo) significa el individuo que accede o utiliza el Servicio, o el DAO, u otra entidad legal en nombre de la cual dicho individuo accede o utiliza el Servicio, según corresponda.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Según el GDPR, usted puede ser referido como el Sujeto de Datos o como el Usuario ya que es el individuo que utiliza el Servicio.",
  "Collecting and Using Your Personal Data": "Recopilación y Uso de sus Datos Personales",
  "Types of Data Collected": "Tipos de Datos Recopilados",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Mientras utiliza nuestro Servicio, podemos pedirle que nos proporcione cierta información personalmente identificable que se puede utilizar para contactarlo o identificarlo. La información personalmente identificable puede incluir, pero no se limita a:",
  "Email address": "Dirección de correo electrónico",
  "First name and last name": "Nombre y apellido",
  "Usage Data is collected automatically when using the Service.": "Los Datos de Uso se recopilan automáticamente al utilizar el Servicio.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Los Datos de Uso pueden incluir información como la dirección de Protocolo de Internet de su Dispositivo (por ejemplo, dirección IP), tipo de navegador, versión del navegador, las páginas de nuestro Servicio que visita, la hora y fecha de su visita, el tiempo que pasa en esas páginas, identificadores únicos de dispositivos y otros datos de diagnóstico.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Cuando accede al Servicio a través de un dispositivo móvil, podemos recopilar cierta información automáticamente, incluyendo, pero no limitado a, el tipo de dispositivo móvil que utiliza, su ID único de dispositivo móvil, la dirección IP de su dispositivo móvil, su sistema operativo móvil, el tipo de navegador de Internet móvil que utiliza, identificadores únicos de dispositivos y otros datos de diagnóstico.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "También podemos recopilar información que su navegador envía cada vez que visita nuestro Servicio o cuando accede al Servicio a través de un dispositivo móvil.",
  "Cookies & Browser Storage": "Cookies y Almacenamiento del Navegador",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Los Sitios web pueden utilizar cookies. Utilizamos cookies y almacenamiento del navegador solo para configuraciones esenciales para mejorar su experiencia, no para rastrear. Estos ayudan a recordar sus preferencias, como la configuración de idioma o las opciones de consentimiento, para que no tenga que restablecerlas cada vez que visita.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "No utilizamos cookies para rastrear o publicidad personalizada. Puede gestionar o desactivar las cookies en la configuración de su navegador, pero algunas funciones pueden no funcionar correctamente sin ellas.",
  "Matomo Analytics": "Análisis de Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Nuestro sitio web puede utilizar Matomo, una plataforma de análisis de código abierto, para obtener información sobre el uso del sitio web. Esto incluye datos anonimizados como:",
  "Pages visited and navigation paths": "Páginas visitadas y rutas de navegación",
  "Time spent on our website": "Tiempo pasado en nuestro sitio web",
  "Whether you’re a returning or new visitor": "Si es un visitante recurrente o nuevo",
  "Your device type (desktop, mobile, etc.)": "Tipo de dispositivo (escritorio, móvil, etc.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Para proteger su privacidad, su dirección IP se anonimiza antes de ser almacenada. Los datos que recopilamos solo se utilizan para mejorar el sitio web y no se utilizan para la identificación personal.",
  "Under Art. 6(1)(f) GDPR": "Bajo el Art. 6(1)(f) del GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "procesamos estos datos en base a nuestro interés legítimo en mejorar nuestros servicios.",
  "Opt-Out Option": "Opción de exclusión",
  "You can disable Matomo tracking at any time:": "Puede desactivar el seguimiento de Matomo en cualquier momento:",
  "Use of Your Personal Data": "Uso de sus datos personales",
  "The DAO may use Personal Data for the following purposes:": "El DAO puede utilizar Datos Personales para los siguientes fines:",
  "To provide and maintain our Service": "Para proporcionar y mantener nuestro Servicio",
  "including to monitor the usage of our Service.": "incluyendo para monitorear el uso de nuestro Servicio.",
  "For the performance of a contract": "Para la ejecución de un contrato",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "el desarrollo, cumplimiento y realización del contrato de compra de los productos, artículos o servicios que ha comprado u otro contrato con Nosotros a través del Servicio.",
  "To contact You": "Para contactarlo",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Para contactarlo por correo electrónico, llamadas telefónicas, SMS u otras formas equivalentes de comunicación electrónica, como notificaciones push de aplicaciones móviles sobre actualizaciones o comunicaciones informativas relacionadas con las funcionalidades, productos o servicios contratados, incluidas las actualizaciones de seguridad, cuando sea necesario o razonable para su implementación.",
  "To provide You": "Para proporcionarle",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "con noticias, ofertas especiales e información general sobre otros bienes, servicios y eventos que ofrecemos y que son similares a los que ya ha comprado o consultado, a menos que haya optado por no recibir dicha información.",
  "To manage Your requests": "Para gestionar sus solicitudes",
  "To attend and manage Your requests to Us.": "Para atender y gestionar sus solicitudes hacia Nosotros.",
  "For other purposes": "Para otros fines",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Podemos utilizar su información para otros fines, como análisis de datos, identificación de tendencias de uso, determinación de la efectividad de nuestras campañas promocionales y para evaluar y mejorar nuestro Servicio, productos, servicios, marketing y su experiencia.",
  "We may share Your personal information in the following situations:": "Podemos compartir su información personal en las siguientes situaciones:",
  "With Service Providers": "Con Proveedores de Servicios",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Podemos compartir su información personal con Proveedores de Servicios para monitorear y analizar el uso de nuestro Servicio, para contactarlo.",
  "With Your consent": "Con su consentimiento",
  "We may disclose Your personal information for any other purpose with Your consent.": "Podemos divulgar su información personal para cualquier otro propósito con su consentimiento.",
  "Retention of Your Personal Data": "Retención de sus datos personales",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "El DAO retendrá sus Datos Personales solo durante el tiempo que sea necesario para los fines establecidos en esta Política de Privacidad. Retendremos y utilizaremos sus Datos Personales en la medida necesaria para cumplir con nuestras obligaciones legales (por ejemplo, si estamos obligados a retener sus datos para cumplir con las leyes aplicables), resolver disputas y hacer cumplir nuestros acuerdos y políticas legales.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "El DAO también retendrá Datos de Uso para fines de análisis interno. Los Datos de Uso generalmente se retienen por un período de tiempo más corto, excepto cuando estos datos se utilizan para fortalecer la seguridad o mejorar la funcionalidad de Nuestro Servicio, o estamos legalmente obligados a retener estos datos por períodos de tiempo más largos.",
  "Security of Your Personal Data": "Seguridad de sus datos personales",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "La seguridad de sus datos personales es importante para Nosotros, pero recuerde que ningún método de transmisión a través de Internet, o método de almacenamiento electrónico es 100% seguro. Si bien nos esforzamos por utilizar medios comercialmente aceptables para proteger sus datos personales, no podemos garantizar su seguridad absoluta.",
  "Detailed Information on the Processing of Your Personal Data": "Información detallada sobre el procesamiento de sus datos personales",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Su información, incluidos los Datos Personales, se procesa en el proveedor de servicios del sitio web del DAO y en cualquier otro lugar donde se encuentren las partes involucradas en el procesamiento. Esto significa que esta información puede ser transferida a — y mantenida en — computadoras ubicadas fuera de su estado, provincia, país u otra jurisdicción gubernamental donde las leyes de protección de datos pueden diferir de las de su jurisdicción.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Su consentimiento a esta Política de Privacidad seguido de su envío de dicha información representa su acuerdo con esa transferencia.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "El DAO tomará todas las medidas razonablemente necesarias para garantizar que sus datos se traten de forma segura y de acuerdo con esta Política de Privacidad y ninguna transferencia de sus Datos Personales se llevará a cabo a una organización o un país a menos que existan controles adecuados, incluida la seguridad de sus datos y otra información personal.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Tenga en cuenta que cualquier transmisión de datos por Internet (por ejemplo, comunicación por correo electrónico) generalmente no es segura y no aceptamos ninguna responsabilidad por los datos transmitidos a través de Internet. Desafortunadamente, la protección absoluta no es técnicamente posible. Esta información no se aplica al sitio web de terceros y los enlaces correspondientes proporcionados en nuestro sitio web. El DAO no asume ninguna responsabilidad y responsabilidad por estos.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Los Proveedores de Servicios que utilizamos pueden tener acceso a sus Datos Personales. Estos proveedores de terceros recopilan, almacenan, utilizan, procesan y transfieren información sobre su actividad en Nuestro Servicio de acuerdo con sus Políticas de Privacidad.",
  "Email Marketing": "Marketing por correo electrónico",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Podemos utilizar sus Datos Personales para contactarlo con boletines informativos, materiales de marketing o promocionales y otra información que pueda ser de su interés. Puede optar por no recibir ninguna, o todas, estas comunicaciones de Nosotros siguiendo el enlace de cancelación de suscripción o las instrucciones proporcionadas en cualquier correo electrónico que enviemos o contactándonos.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Podemos utilizar Proveedores de Servicios de Marketing por Correo Electrónico para gestionar y enviar correos electrónicos a Usted;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Su Política de Privacidad se puede ver en",
  "Usage, Performance and Miscellaneous": "Uso, Rendimiento y Varios",
  "We may use third-party Service Providers to maintain and improve our Service.": "Podemos utilizar Proveedores de Servicios de terceros para mantener y mejorar nuestro Servicio.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "Privacidad GDPR",
  "Legal Basis for Processing Personal Data under GDPR": "Base Legal para el Procesamiento de Datos Personales bajo el GDPR",
  "We may process Personal Data under the following conditions:": "Podemos procesar Datos Personales bajo las siguientes condiciones:",
  "Consent:": "Consentimiento:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Usted ha dado su consentimiento para el procesamiento de Datos Personales para uno o más propósitos específicos.",
  "Performance of a contract:": "Ejecución de un contrato:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "La provisión de Datos Personales es necesaria para la ejecución de un acuerdo con Usted y/o para cualquier obligación precontractual del mismo.",
  "Legal obligations:": "Obligaciones legales:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "El procesamiento de Datos Personales es necesario para el cumplimiento de una obligación legal a la que está sujeto el DAO.",
  "Vital interests:": "Intereses vitales:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "El procesamiento de Datos Personales es necesario para proteger sus intereses vitales o los de otra persona natural.",
  "Public interests:": "Intereses públicos:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "El procesamiento de Datos Personales está relacionado con una tarea que se lleva a cabo en interés público o en el ejercicio de la autoridad oficial conferida al DAO.",
  "Legitimate interests:": "Intereses legítimos:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "El procesamiento de Datos Personales es necesario para los fines de los intereses legítimos perseguidos por el DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "En cualquier caso, el DAO estará encantado de ayudar a aclarar la base legal específica que se aplica al procesamiento, y en particular si la provisión de Datos Personales es un requisito legal o contractual, o un requisito necesario para celebrar un contrato.",
  "Your Rights under the GDPR": "Sus Derechos bajo el GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "El DAO se compromete a respetar la confidencialidad de sus Datos Personales y a garantizar que pueda ejercer sus derechos.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "Usted tiene derecho bajo esta Política de Privacidad, y por ley si se encuentra dentro de la UE, a:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "El derecho de acceder, actualizar o eliminar la información que tenemos sobre Usted. Siempre que sea posible, puede acceder, actualizar o solicitar la eliminación de sus Datos Personales directamente dentro de la sección de configuración de su cuenta. Si no puede realizar estas acciones usted mismo, contáctenos para que lo ayudemos. Esto también le permite recibir una copia de los Datos Personales que tenemos sobre Usted.",
  "Request correction of the Personal Data that We hold about You.": "Solicitar la corrección de los Datos Personales que tenemos sobre Usted.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "Usted tiene derecho a que corrijamos cualquier información incompleta o inexacta que tengamos sobre Usted.",
  "Object to processing of Your Personal Data.": "Oponerse al procesamiento de sus Datos Personales.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Este derecho existe cuando nos basamos en un interés legítimo como base legal para nuestro procesamiento y hay algo en su situación particular que hace que desee oponerse a nuestro procesamiento de sus Datos Personales en este sentido. También tiene derecho a oponerse cuando estamos procesando sus Datos Personales con fines de marketing directo.",
  "Request erasure of Your Personal Data.": "Solicitar la eliminación de sus Datos Personales.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "Usted tiene derecho a pedirnos que eliminemos o eliminemos los Datos Personales cuando no haya una buena razón para que continuemos procesándolos.",
  "Request the transfer of Your Personal Data.": "Solicitar la transferencia de sus Datos Personales.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Le proporcionaremos a Usted, o a un tercero que haya elegido, sus Datos Personales en un formato estructurado, de uso común y legible por máquina. Tenga en cuenta que este derecho solo se aplica a la información automatizada que inicialmente nos proporcionó su consentimiento para usar o donde utilizamos la información para celebrar un contrato con Usted.",
  "Withdraw Your consent.": "Retirar su consentimiento.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "Usted tiene derecho a retirar su consentimiento para el uso de sus Datos Personales. Si retira su consentimiento, es posible que no podamos proporcionarle acceso a ciertas funcionalidades específicas del Servicio.",
  "Exercising of Your GDPR Data Protection Rights": "Ejercicio de sus Derechos de Protección de Datos del GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Usted puede ejercer sus derechos de acceso, rectificación, cancelación y oposición poniéndose en contacto con nosotros. Tenga en cuenta que podemos pedirle que verifique su identidad antes de responder a tales solicitudes. Si realiza una solicitud, haremos todo lo posible para responderle lo antes posible.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "Usted tiene derecho a presentar una queja ante una Autoridad de Protección de Datos sobre nuestra recopilación y uso de sus Datos Personales. Para obtener más información, si se encuentra en el Área Económica Europea (EEA), póngase en contacto con su autoridad local de protección de datos en el EEA.",
  "Children's Privacy": "Privacidad de los Niños",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Nuestro Servicio no está dirigido a personas menores de 13 años. No recopilamos de manera consciente información de identificación personal de personas menores de 13 años. Si usted es padre, madre o tutor y tiene conocimiento de que su hijo nos ha proporcionado Datos Personales, contáctenos. Si nos damos cuenta de que hemos recopilado Datos Personales de personas menores de 13 años sin verificar el consentimiento de los padres, tomamos medidas para eliminar esa información de nuestros servidores.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Si necesitamos basarnos en el consentimiento como base legal para procesar su información y su país requiere el consentimiento de un padre, podemos requerir el consentimiento de sus padres antes de recopilar y usar esa información.",
  "Links to Other Websites": "Enlaces a Otros Sitios Web",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Nuestro Servicio puede contener enlaces a otros sitios web que no son operados por nosotros. Si hace clic en un enlace de un tercero, será dirigido al sitio de ese tercero. Le recomendamos encarecidamente que revise la Política de Privacidad de cada sitio que visite.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "No tenemos control sobre y no asumimos responsabilidad por el contenido, políticas de privacidad o prácticas de ningún sitio o servicio de terceros.",
  "Changes to this Privacy Policy": "Cambios en esta Política de Privacidad",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Podemos actualizar nuestra Política de Privacidad de vez en cuando. Le notificaremos cualquier cambio publicando la nueva Política de Privacidad en esta página.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Le informaremos por correo electrónico y/o mediante un aviso destacado en nuestro Servicio, antes de que el cambio entre en vigor y actualizaremos la fecha de \"Última actualización\" en la parte superior de esta Política de Privacidad.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Se le recomienda revisar esta Política de Privacidad periódicamente para cualquier cambio. Los cambios en esta Política de Privacidad son efectivos cuando se publican en esta página.",
  "Contact Us": "Contáctenos",
  "If you have any questions about this Privacy Policy, You can contact us:": "Si tiene alguna pregunta sobre esta Política de Privacidad, puede contactarnos:",
  "By visiting this page on our website:": "Visitando esta página en nuestro sitio web:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Este Acuerdo está originalmente escrito en inglés. Esta traducción automática se proporciona solo para su referencia.",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Al hacer clic en el botón “Enviar” aceptas recibir correos electrónicos regulares de Robonomics (no más de 1 al mes) y aceptas",
  "Request access to Your Personal Data.": "Solicitar acceso a tus Datos Personales.",
  "Aira is back": "¡Aira ha vuelto!",
  "Transform your screen with our brand new wallpaper—download now!": "Transforma tu pantalla con nuestro nuevo fondo de pantalla, ¡descárgalo ahora!",
  "Outdoor sensor “ALTRUIST“": "Sensor exterior “ALTRUISTA“",
  "Now Available!": "¡Disponible ahora!",
  "Worldwide Shipping": "Envío mundial",
  "Open-Source Hardware & Software": "Hardware y software de código abierto",
  "Independent Decentralized Network Technologies": "Tecnologías de red descentralizadas e independientes",
  "Colorful 3D-Printed Cases of Your Choice": "Cajas coloridas impresas en 3D de tu elección",
  "Order Now": "Ordena ahora"
}