{
  "What is Robonomics network?": "¿Qué es Robonomics?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics es una plataforma de código abierto para aplicaciones IoT. Apoyamos una nueva generación de tecnologías de Internet (web3) que implementa el intercambio de información técnica y económica en forma de transacciones atómicas entre aplicaciones de usuario, servicios IoT y robótica compleja.",
  "Get started": "Para empezar",
  "Explore Robonomics": "Explore Robonomics",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics es una tecnología de código abierto para el mercado de IoT disponible para todos. Lea un resumen ejecutivo para aprender más",
  "Get XRT": "Obtenga XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT es el token de utilidad que hace posible el control de dispositivos IoT sobre las parachains de Ethereum y Robonomics",
  "Use a Dapp": "Utilice una Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Eche un vistazo a la versión Beta de la aplicación descentralizada para administrar dispositivos IoT",
  "Start building": "Empiece a crear",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Aprenda Robonomics a través de tutoriales y experimentos de utilidad práctica en Robonomics WIKI",
  "Robonomics objectives": "Objetivos de Robonomics",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Basándose en los logros de las plataformas en la nube, Robonomics tiene como objetivo ofrecer al mercado de IoT soluciones de Internet más seguras y avanzadas en cada etapa de la comunicación hombre-máquina. He aquí las principales tareas para las que se está desarrollando Robonomics",
  "IoT device management with a decentralized cloud": "Gestión de dispositivos IoT con una nube descentralizada",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Las redes Blockchain tienen todos los parámetros a fin de garantizar el más alto nivel de seguridad para el lanzamiento de dispositivos y la recepción de telemetría. La interacción con un dispositivo se puede describir mediante el cambio del estado del gemelo digital almacenado en la red de cadena de bloques y la entrega de información sobre estos cambios al dispositivo físico. En el caso de utilizar una cadena de bloques sin permiso, podemos estar seguros de la disponibilidad global de proveedores, así como de un alto nivel de protección de datos del gemelo digital frente a los cambios no deseados.",
  "Techno-economic transactions between humans and machines": "Transacciones tecnoeconómicas entre humanos y máquinas",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Podemos hablar de logros institucionales en términos de acceso de sistemas automatizados directamente a los mercados digitales a través de criptomonedas y contratos inteligentes. Por ejemplo, Ethereum ya implementa la mayoría de las herramientas básicas de la actividad económica. Las aplicaciones creadas hoy para conectar al usuario final y los dispositivos IoT serán mucho más efectivas si el pago y los términos de servicio son inseparables de los parámetros de lanzamiento del dispositivo.",
  "Serverless IoT applications for users": "Aplicaciones de IoT sin servidor para usuarios",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "La cuestión de la privacidad de los usuarios de las aplicaciones modernas no debe quedar estancada en la incapacidad de las empresas para utilizar los avances modernos en el campo de la web3. No es necesario autenticarse ni requerir conexión a servidores específicos para acceder a la telemetría y controlar el dispositivo.",
  "Learn with Robonomics": "Aprende con robonomics",
  "Introduction course": "Curso de Introducción",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Sumérjase en los problemas que surgen en torno a la creación de aplicaciones modernas de Internet de las cosas y las posibles soluciones con tecnologías web3 y herramientas de Robonomics para desarrolladores y usuarios IoT.",
  "Boston dynamics spot software developing": "Desarrollo de software de Boston Dynamics Spot",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "¡Nos complace presentarles el programa educativo Spot SDK! Nuestro objetivo es familiarizarlo con el SDK de Spot y permitirle probar sus habilidades de forma remota utilizando un robot Boston Dynamics Spot en nuestro laboratorio.",
  "Sovereign smart home with robonomics and home assistant": "Sovereign Smart Home con Robonomics y Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "En este curso, seguirá todos los pasos necesarios para construir su propia casa inteligente soberana, cuya principal ventaja es la seguridad/privacidad de los datos del usuario.",
  "Shop": "Comercio",
  "Science papers": "Documentos de ciencia",
  "Books": "Libros",
  "Logo and assets": "Logo y activos",
  "Blog": "Blog",
  "Ambassador program": "Programa de Embajadores",
  "Contacts": "Contactos",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Línea de tiempo",
  "Tokenomics": "Tokenomics",
  "Parachain": "Parachain",
  "User (D)App": "D(App) de usuario",
  "Function request": "Solicitud de función",
  "Report": "Reporte",
  "Control": "Control",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Decentralized application": "Aplicación descentralizada",
  "Digital twin": "Gemelo digital",
  "IoT / Smart device": "IoT / Dispositivo inteligente",
  "Robonomics tokenomics": "Tokenomics de robonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "es el token de utilidad que permitirá controlar los dispositivos IoT sobre la red Ethereum y la parachain de Robonomics en el ecosistema Polkadot.",
  "Token distribution": "Distribución de tokens",
  "Be aware of scammers": "Tenga cuidado con los estafadores",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "use solo exchange bien conocidos para intercambiar XRT. No envíes tus tokens a cuentas que te den en mensajes privados sea cual sea la transacción que quieras realizar (comprar o vender token). Si recibió alguna 'declaración fuerte' sobre el token de Robonomics (los estafadores a menudo usan algo como un anuncio de airdrop), consulte este sitio web (https://robonomics.network/) o nuestro ",
  "for official updates. Be careful, be safe.": "para obtener actualizaciones oficiales. Ten cuidado, mantente a salvo.",
  "XRT in Ethereum": "XRT en Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Al implementar el proyecto Robonomics entre 2015 y 2018, el equipo del proyecto necesitaba encontrar una conexión entre la provisión de una función útil por parte de Robonomics Network, a saber, el lanzamiento de dispositivos IoT según el modelo de robot como servicio, y el reembolso del costos a proveedores de Robonomics por tarifas de gas en Ethereum. Necesitábamos pensar en el ciclo de vida de la responsabilidad de cada dispositivo inteligente individual para realizar un servicio. Como resultado de la I+D inicial en Robonomics, el equipo ideó un mecanismo para extraer nuevos tokens para recompensar cada contrato inteligente de robot como servicio creado. Este modelo sigue siendo viable para el futuro de Robonomics en Ethereum, pero solo con mejoras significativas en Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Lea esto para conocer los antecedentes históricos y los planes a largo plazo del equipo para XRT en el ecosistema Ethereum.",
  "Etherscan profile": "perfil Etherscan",
  "View token smart contract and transactions in Ethereum network here.": "Vea el contrato inteligente de token y las transacciones en la red Ethereum aquí.",
  "Coingecko markets": "Mercados en Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Aquí puede encontrar los mercados CEX y DEX para operar con XRT.",
  "XRT In Polkadot": "XRT en Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Pasando de Ethereum a Polkadot, necesitamos hacer una 'ampliación' en el tokenomics. Las parachains en el ecosistema de Polkadot no son el equivalente a un contrato inteligente, pero son blockchain completamente programable que arrienda un segmento de la red general.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "El pago real por parte de las parachains de Polkadot y Kusama es la vinculación a largo plazo de tokens de la Relay Chain nativa (DOT/KSM) en cantidad suficiente para ganar una de las subastas. El XRT en Robonomics parachain admite la renovación del slot y recompensas para las partes interesadas. El mecanismo de quema de XRT subyacente a la activación de las suscripciones de IoT está diseñado para reducir la inflación al mínimo y, en caso de que aumente el interés, a cero.",
  "Learn more": "Obtenga más información",
  "in Twitter thread from our network architect.": "en el hilo de Twitter de nuestro arquitecto de red.",
  "Usage:": "Uso:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT se puede usar tanto para pagar tarifas por realizar transacciones en la parachain como para comprar una suscripción IoT que garantiza el procesamiento prioritario de transacciones IoT de dispositivos o usuarios.",
  "Rewards:": "Recompensas:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "A lo largo del año, la parachain emite una pequeña cantidad de XRT para incentivar a los collator de la parachain.",
  "The parameter of the total reward": "El parámetro de la recompensa total",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "para los collators para el año se determina mediante la votación en cadena de los poseedores de token y se puede cambiar mediante la celebración de un referéndum.",
  "Use XRT": "Usar XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Compre una suscripción IoT en nuestra aplicación descentralizada. Controle sus dispositivos inteligentes a través de la blockchain sin que ninguna corporación centralizada los observe.",
  "Subscan profile": "Perfil Subscan",
  "View token statistics on top of Polkadot ecosystem.": "Ver estadísticas de tokens en la parte superior del ecosistema de Polkadot.",
  "Other questions": "Otras preguntas",
  "What is RWS?": "¿Qué es RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[En desarrollo de la funcionalidad central] Para los ingenieros, el equipo Core Dev intentará crear diferentes modelos de uso de Robonomics y el primer paso de esta manera es lanzar un token de suscripción de por vida: token RWS. Cada token RWS le dará 1 transacción por segundo (tps) desde/hacia su dispositivo IoT a través de Robonomics Parachain. Active su token RWS y realice transacciones de 'gas gratis' con una latencia predecible y previa a la ejecución. Desactive el token RWS y cámbielo en un DEX.",
  "What is AIRA/AIR ID?": "¿Qué es AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Token anterior a XRT distribuido en 2017 como parte autónoma de una mayor infraestructura de Robonomics en Ethereum. Después del lanzamiento exitoso de Robonomics sobre Ethereum en 2019, los tokens AIRA se conectaron a la infraestructura creada del proyecto a través del",
  "ambix smart contract": "contrato inteligente ambix",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "que garantizaba un proceso autónomo e independiente de intercambio de pre-XRT a ERC-20 XRT.",
  "The task": "La tarea",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "del token de Robonomics es asegurar el funcionamiento de una red descentralizada para el mantenimiento de las Ciudades Inteligentes y la Industria 4.0 en la infraestructura blockchain. Para lograr este objetivo, la economía de los token debe reflejar los incentivos para la implementación de la red.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "La aplicación descentralizada (dapp) funciona dentro de Blockchain. Es de código abierto y sus datos se sirven en IPFS y Github. Estas tecnologías permiten que la aplicación sea segura y transparente al mismo tiempo. Nuestros desarrolladores están trabajando tanto en el desarrollo de la aplicación Robonomics y en las bibliotecas que se pueden utilizar al construir su propia dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin (gemelo  digital) es uno de los instrumentos proporcionados por Robonomics Web Services (RWS). Actúa como una versión digital del equipo del mundo real y copia todas sus características técnicas. Permite hacer que una aplicación descentralizada responda mejor a los comandos del usuario.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Puede usar Robonomics con una amplia gama de dispositivos inteligentes Zigbee para automatizar y controlar varios aspectos de su hogar/oficina o usarlo con robótica basada en ROS para tareas industriales más complejas.",
  "Do Androids Dream of Electric Sheep?": "¿Los androides sueñan con ovejas eléctricas?",
  "Sleeping Mew Space": "Sleeping Mew Space",
  "Are you ready for Mars?": "¿Estás listo para Marte?",
  "Shiva Robot": "Robot Shiva",
  "Space Travelers": "Viajeros del espacio",
  "Retro Astronaut": "Astronauta retro",
  "New Newton": "Nuevo Newton",
  "Want emails from robonomics": "Quiero emails de robonomics",
  "Adding you to our special list...": "Agregandote a nuestra lista especial...",
  "Nice, you are in the list": "Genial, estás en la lista.",
  "Something went  wrong. Try again later": "Algo salió mal. Vuelva a intentarlo más tarde",
  "Your email": "Tu email",
  "Robonomics art shop": "Tienda de arte de robonomics",
  "Welcome to our brand new online shop on": "¡Bienvenido a nuestra nueva tienda en línea en",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": " Nuestra tienda cuenta con ropa, accesorios, decoración del hogar y otros artículos que muestran nuestro amor por la robótica, la tecnología y el arte. Puede encontrar camisetas, camisetas de manga larga, sudaderas con capucha, cortinas de baño, almohadas, mantas y otros productos útiles con nuestros diseños únicos hechos por artistas de Robonomics y producción y envío procesados por compañeros de Threadless. ¡Disfruta!",
  "Shop now on threadless": "Comprar ahora en threadless",
  "alternative shop": "Tienda alternativa",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "El año comenzó con un gran logro: Robonomics ganó la vigésima subasta de slot parachain y",
  "officially became": "se convirtió oficialmente",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "en la parachain con ID 2048 en la red de Kusama. El lanzamiento, el registro de datos, DigitalTwin, las funciones de responsabilidad y las suscripciones IoT están disponibles para todos los usuarios del ecosistema. Para proporcionar detalles sobre esta fase del proyecto, el equipo central ha publicado los primeros capítulos del",
  "Robonomics Whitepaper 2.0.": "Whitepaper de Robonomics 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0  en Substrate con soporte para mensajes XCM, y comenzamos a abrir canales HRMP con otras parachains (como Crust Shadow y Darwinia), cuya funcionalidad nos resulta de gran utilidad.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Al mismo tiempo, hemos desbloqueado una estrategia para introducir el mercado de IoT a nuestro protocolo. Nuestros experimentos con equipos IoT nos llevaron al concepto de un hogar inteligente soberano, que es independiente de los proveedores de servicios de nube centralizados. Hemos desarrollado nuestra",
  "integration": "integración",
  "with the Home Assistant automation system, and also designed our own": "con el sistema de automatización Home Assistant, y también hemos diseñado nuestra propia",
  "IoT gateway": "puerta de enlace IoT",
  "for connecting smart devices.": "para conectar dispositivos inteligentes.",
  "We have launched two big initiatives in order to increase community engagement —": "Hemos lanzado dos grandes iniciativas para aumentar la participación de la comunidad: ",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Además,",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "se llevó a cabo en otoño para que la comunidad de Robonomics pudiera probar nuestros mecanismos de gobernanza por primera vez. Recientemente, el equipo de Robonomics ayudó al proyecto DAO IPCI a obtener un slot parachain para presentar el servicio de compensación de carbono.",
  "In 2021, our": "En 2021, nuestro",
  "main focus": "enfoque principal",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "cambió a preparar el proyecto para que las aplicaciones de IoT pudieran usarse a través de nuestra parachain en Kusama Network. Se lanzó Robonomics 1.0 en Substrate, y hemos estado probando la conexión de sensores a la parachain para enviar sus datos de telemetría, además de desarrollar la funcionalidad de digital twin. A mediados de año, decidimos probar el ciclo completo de nuestra red y creamos nuestra propia Relay Chain llamada",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "a la que se integró la Robonomics Parachain (antes de migrar a la Kusama Relay Chain). Se ha prestado mucha atención a obtener un espacio para parachain en Kusama, para lo cual organizamos varias campañas de crowdloans.",
  "There have been two big changes for the community. First, we launched the": "Ha habido dos grandes cambios para la comunidad. Primero, lanzamos el",
  "Robonomics Grant Program": "Robonomics Grant Program",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "que permite que los proyectos de robótica web3 e IoT reciban financiamiento para tareas de R&D. Al cierre del año, cuatro proyectos activos participaron del programa. En segundo lugar, el equipo inició",
  "Exodus process": "el proceso Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "lo que permitió a los holders de tokens de Ethereum mover sus tokens XRT a la parachain.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Entre las colaboraciones, podemos recordar la aparición destacada de Boston Dynamics Spot en MerkleBot, para el que se desarrolló",
  "rental remote control system": "un sistema de control remoto de alquiler",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "También nos gustaría informaros de la empresa Multi-Agent Systems que es un proyecto personal formado por un equipo de ingenieros de Robonomics. Han desarrollado una gofrera robótica llamada Eisenkoch que realiza tareas de cocina para los propietarios de cafeterías.",
  "There came a time when the existing limitations of Ethereum": "Llegó un momento en que las limitaciones existentes de Ethereum",
  "began to stand out clearly": "comenzaron a destacarse claramente",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "(en particular, poca escalabilidad, baja velocidad y altísimo costo de las transacciones). Se suponía que la actualización a ETH2.0 solucionaría la situación, pero esta actualización se retrasó repetidamente. Si bien no queríamos dejar Ethereum, nos dimos cuenta de que en la situación actual era difícil implementar nuestros casos de uso y comenzamos a buscar una red alternativa. El ecosistema de blockchain fragmentadа de Polkadot se convirtió en esta alternativa. Comenzamos experimentando con el marco Substrate para migrar las funciones principales de Robonomics e implementar nuestra propia testnet. Al final de esta etapa, habíamos implementado nuestra parachain en la Rococo Testnet y comenzamos a prepararnos para obtener un slot en Kusama Network.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Continuando con el estudio de los sistemas IoT, hemos identificado la funcionalidad principal de Robonomics, que puede agregar valor a los usuarios: la función de nube descentralizada para IoT. Esta idea formó la base de",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "La infraestructura de RWS asumió todas las funciones de una nube centralizada típica, pero sin los problemas estándar de disponibilidad global, seguridad y privacidad. Además, se nos ocurrió la idea de las suscripciones de IoT parachain que permiten a los holders de suscripciones utilizar la blockchain sin tener que pagar una tarifa por cada transacción. El primer experimento con suscripciones IoT fue la emisión del token RWS, que permite a su propietario enviar 1 transacción por bloque. Además, comenzamos a dar los primeros pasos para desarrollar nuestro propio kit de hardware para el control de dispositivos inteligentes (el concepto DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Por supuesto, el soporte para Robonomics en Ethereum no se ha detenido. La pila de comunicación de Robonomics se finalizó a la versión",
  "LTS 1.0.": "LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "El token XRT comenzó a cotizar en varios intercambios (en particular, Uniswap DEX) y se lanzó el programa de incentivos de liquidez.",
  "The team actively developed ways to interact with the community. The first version of our": "El equipo desarrolló activamente formas de interactuar con la comunidad. Se ha lanzado la primera versión de nuestra",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "y Robonomics Wiki. Para una gestión de proyectos más transparente y cómoda, empezamos a utilizar",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "Organizamos",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "en 2019 para los recién llegados al proyecto.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "También continuaron las colaboraciones con proyectos afines. Robonomics y DAO IPCI introdujeron un servicio para recopilar y analizar datos sensoriales: ",
  "Robonomics became the foundation for the": " Robonomics se convirtió en la base del proyecto",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "que está desarrollando un sistema para el arrendamiento inteligente de equipos robóticos.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Entendimos que los agentes autónomos necesitan un entorno que garantice su funcionamiento técnico y económico fiable. Llevamos varios años desarrollando un protocolo para crear una red descentralizada de proveedores que ayudan a los agentes robóticos a prestar sus servicios. Se han desarrollado herramientas para el mantenimiento de la red y para la pila de comunicación entre Ethereum y ROS. En 2018, publicamos el",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "y se lanzó la versión alfa de Robonomics Network en la Ethereum Mainnet. Los preparativos activos continuaron para el evento de generación de tokens XRT (que finalmente sucedió en la primavera de 2019 debido al primer criptoinvierno).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "A partir de este período, Robonomics comenzó a desarrollar dinámicamente casos de uso relacionados con la Industry 4.0 (fábricas inteligentes, ciudades inteligentes y hogares inteligentes) y esto atrajo nuestra atención al mundo IoT. En busca de innovación, el equipo ha presentado varias demostraciones de R&D únicas y de gran tamaño: una",
  "sensor network": "red de sensores civiles",
  "a water drone": "un dron de agua",
  "for environmental monitoring (supported by a sensor systems manufacturer": "para el control medioambiental (apoyado por un fabricante de sistemas de sensores",
  "a smart factory model": "un modelo de fábrica inteligente",
  "a self-employed": "",
  "robot artist Gaka-chu": "un obot artista autónomo Gaka-Chu",
  "and a": "y un ",
  "drone traffic management system": "sistema de gestión de tráfico de drones",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics comenzó a cooperar con el proyecto DAO IPCI en la gestión de activos ambientales utilizando tecnologías web3 y dispositivos IoT.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Este fue un período de investigación y desarrollo activo durante el cual identificamos una variedad de tareas en las que las tecnologías p2p tienen capacidades que antes no estaban disponibles para la robótica. Al combinar la computadora Ethereum, el almacenamiento de archivos IPFS y Robot Operating System (ROS), nos dimos cuenta de que cualquier dispositivo podría convertirse potencialmente en un",
  "autonomous intelligent robot agent": "agente robot inteligente autónomo",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "A su vez, esto nos abrió el camino a los conceptos de Robot-as-a-Service y la economía del robot.",
  "Our publications in scientific journals of this period are available in the": "Nuestras publicaciones en revistas científicas de este período están disponibles en la sección",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Hemos recopilado todos los proyectos de I+D a lo largo de los años en un",
  "a handy book": "práctico libro",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Todo comenzó con una idea que se les ocurrió a los fundadores cuando Ethereum acababa de lanzar su red principal. ¿Qué sucede si el robot realiza una tarea para un cliente de criptomonedas y su lógica está controlada por un contrato inteligente?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Para probar la idea, hicimos una demostración en la que se lanzó un dron controlado por una computadora Ethereum para lograr las coordenadas GPS especificadas después de que el usuario completara una transacción de pago.",
  "The demo is available on": "La demostración está disponible en",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "LÍNEA DE TIEMPO DE LA INFRAESTRUCTURA Y DESARROLLO TECNOLÓGICO",
  "Notable events": "Eventos notables",
  "World Economic Forum Annual Meeting 2022": "World Economic Forum Annual Meeting 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "En camino a Sovereign Home Automation",
  "Becoming a Parachain for IoT Applications": "Convertirse en una Parachain para aplicaciones IoT",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (patrocinado por Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (organizado por Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Transición a MultiNetwork - Llegó Polkadott",
  "The Rise of Robonomics Network": "El auge de Robonomics Network",
  "Crypto Valley Conference 2018": "Conferencia Crypto Valley 2018",
  "European Parliament workshop 'The Economy of Robots'": "Taller del Parlamento Europeo 'La economía de los robots'",
  "Consensus 2018": "Conferencia Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Simposio sobre Blockchain para sistemas robóticos en MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics-2018 summer school organizada por el equipo de Robonomics",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Reuniendo Tecnologías Web3 y los Frameworks Robóticos",
  "Playing with Human-Machine Interaction through Ethereum": "Jugando con la interacción hombre-máquina a través de Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Guía de bienvenida de Robonomics Whitepaper 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Hemos desarrollado un protocolo de comunicación de máquina tecnoeconómico que se ejecuta sobre Ethereum e IPFS, y lo complementamos con elementos de una plataforma IoT basada en la nube, que esta basada en la parachain de Polkadot. Hoy ya contamos con una plataforma híbrida para crear aplicaciones IoT futuristas. Proporciona interacción con dispositivos bajo el control de una computadora descentralizada global. Antes de comenzar a crear aplicaciones IoT seguras, sin servidor y futuristas utilizando la plataforma Robonomics, profundicemos un poco en la teoría...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Los dos primeros capítulos del Whitepaper de Robonomics ya están disponibles para los usuarios.",
  "Chapter 1.": "Capítulo 1.",
  "At the intersection of cybernetics and economics": "En la intersección de la cibernética y la economía",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Presentamos un sistema económico en el que los dispositivos robóticos actúan como agentes independientes capaces de realizar actividades económicas clave, antes reservadas para los humanos. En este capítulo, hablaremos sobre la relevancia de la economía robótica, que puede convertirse en una parte importante de la vida de las personas y cambiar el nivel actual de la economía en servicios totalmente automatizados en el futuro.",
  "In this chapter you will learn": "En este capítulo aprenderás",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase y la naturaleza de la empresa",
  "CPS - cyber-physical system": "PS - sistema ciberfísico",
  "Norbert Wiener and the search for patterns in living and machine": "Norbert Wiener y la búsqueda de patrones en la vida y la máquina",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "La Cuarta Revolución Industrial, Dinero para Robots y Bitcoin",
  "Ethereum Smart Contracts": "Contratos inteligentes de Ethereum",
  "Polkadot Parachains": "Parachains de Polkadot",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Preguntas abiertas de la teleología y el trabajo de Mises",
  "Read chapter 1": "Lea el capítulo 1",
  "Chapter 2.": "Capítulo 2.",
  "Robonomics architecture": "Arquitectura de Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "En el segundo capítulo, leerá sobre la interacción hombre-máquina utilizando la tecnología moderna de Internet, desde dispositivos IoT hasta una red de proveedores descentralizada y accesible a nivel mundial. Veremos los fundamentos del Internet de las Cosas para resaltar los problemas y principales retos a los que se enfrentan los creadores de sistemas IoT y la solución a la que ya se dirige Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Resumen del estado del Internet de las cosas (IoT)",
  "Classification of IoT devices": "Clasificación de dispositivos IoT",
  "Embedded IoT systems": "Sistemas IoT integrados",
  "Edge-systems: IoT gateways and controllers": "Edge-systems: puertas de enlace y controladores IoT",
  "Autonomous Systems": "Sistemas Autónomos",
  "Internet of Things providers": "Proveedores de Internet de las cosas",
  "Digital twins are the heart of the Internet of Things": "Los gemelos digitales son el corazón del Internet de las Cosas",
  "IoT data flows in cloud service": "Flujos de datos de IoT en servicio en la nube",
  "Popular examples of IoT solutions": "Ejemplos populares de soluciones IoT",
  "Current problems of building IoT solutions": "Problemas actuales de construcción de soluciones IoT",
  "Main tasks of Robonomics architecture": "Tareas principales de la arquitectura de Robonomics",
  "Basic components of Robonomics architecture": "Componentes básicos de la arquitectura de Robonomics",
  "A simple representation of Robonomics architecture": "Una representación simple de la arquitectura de Robonomics",
  "Read chapter 2": "Lea el capítulo 2",
  "We continue to update the white paper of Robonomics": "Seguimos actualizando el Whitepaper de Robonomics",
  "stay tuned for new parts on our website and in Discord": "estén atentos a las nuevas partes en nuestro sitio web y en Discord",
  "Join our discord": "Únase a nuestro Discord",
  "Robonomics logos and usage": "Logo de Robonomics y usos",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Hemos reunido logos, colores, activos y pautas de Robonomics para mostrar cómo puede usarlo.",
  "Download Robonomics logo": "Descargar el logo de Robonomics",
  "Download RWS logo": "Descargar el logo de RWS",
  "Download wiki logo": "Descargar logo wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Utilice estos logos permitidos para enlazar con Robonomics, RWS o Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Use el logo de Robonomics permitido para informar a otros que está integrado con Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Usar logos permitidos en publicaciones de blog, artículos y diapositivas sobre tecnología Robonomics y proyectos integrados",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "No modifique los logos de Robonomics permitidos, incluido el cambio de color, las dimensiones o la combinación con otras palabras o elementos de diseño",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "No utilice el logo y el nombre de Robonomics de una manera que sugiera que usted es Robonomics, que su oferta o proyecto es de Robonomics, o que Robonomics lo respalda a usted o su oferta o proyecto si no fue aprobado por Robonomics DAO",
  "Robonomics Color pallet": "Paleta de colores de Robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Estos colores los usamos en nuestras interfaces, impresiones y otras imágenes. </br> Úselo para sus diapositivas, pancartas para publicaciones, etc. sobre Robonomics."
}