{
  "What is Robonomics network?": "Robonomi̇cs nedi̇r??",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics, IoT uygulamaları için açık kaynaklı bir platformdur. Kullanıcı uygulamaları, IoT hizmetleri ve karmaşık robotik arasında atomik işlemler şeklinde teknik ve ekonomik bilgi alışverişini uygulayan yeni nesil internet teknolojilerini (web3) destekler.",
  "Get started": "Başla",
  "Explore Robonomics": "Robonomics'i Keşfet",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics, IoT pazarı için herkes tarafından kullanılabilen açık kaynaklı bir teknolojidir. Daha fazla bilgi için bir yönetici özeti okuyun",
  "Get XRT": "XRT'yi alın",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT, Ethereum ağı ve Robonomics parachain üzerindeki IoT cihazlarını kontrol etmeyi mümkün kılan yardımcı dijital varlıktır.",
  "Use a Dapp": "Dapp Kullan",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "IoT cihazlarını yönetmek için merkezi olmayan uygulamanın Beta sürümüne bir göz atın",
  "Start building": "İnşa etmeye başla",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Robonomics WIKI'de öğreticiler ve pratik olarak faydalı eğitimler yoluyla Robonomics öğrenin",
  "Robonomics objectives": "Robonomics hedefleri",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Robonomics, bulut platformlarının başarılarına dayanarak, insan-makine iletişiminin her aşamasında IoT pazarına daha güvenli ve daha gelişmiş İnternet çözümleri sunmayı hedefliyor. Robonomics'in geliştirilmekte olduğu ana görevler vardır",
  "IoT device management with a decentralized cloud": "Merkezi olmayan bir bulut ile IoT cihaz yönetimi",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Blokzinciri ağları, cihaz başlatma ve telemetri alma için en yüksek düzeyde güvenlik sağlamak için tüm parametrelere sahiptir. Bir cihazla etkileşim, aslında blok zinciri ağında depolanan dijital ikizin durumunu değiştirerek ve bu değişikliklerle ilgili bilgileri fiziksel cihaza ileterek tanımlanabilir. İzinsiz bir blok zinciri kullanılması durumunda, sağlayıcıların küresel kullanılabilirliğinden ve dijital ikizin istenmeyen değişikliklere karşı yüksek düzeyde veri korumasından emin olabiliriz.",
  "Techno-economic transactions between humans and machines": "İnsanlar ve makineler arasındaki tekno-ekonomik işlemler",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Otomatik sistemlerin kripto paralar ve akıllı sözleşmeler aracılığıyla doğrudan dijital pazarlara erişimi konusunda kurumsal başarılardan bahsedebiliriz. Örneğin, Ethereum, ekonomik faaliyetin temel araçlarının çoğunu zaten uyguluyor. Son kullanıcı ve IoT cihazlarını birbirine bağlamak için bugün oluşturulan uygulamalar, ödeme ve hizmet koşullarının cihazın başlatma parametrelerinden ayrılamaz olması durumunda çok daha verimli olacaktır.",
  "Serverless IoT applications for users": "Kullanıcılar için Sunucusuz IoT uygulamaları",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Modern uygulamaların kullanıcılarının mahremiyeti sorusu, şirketlerin web3 alanındaki modern gelişmeleri kullanamamasına takılıp kalmamalıdır. Telemetriye erişmek ve cihazı kontrol etmek için kimlik doğrulaması yapmaya veya belirli sunuculara bağlantı gerektirmeye gerek yoktur.",
  "Learn with Robonomics": "Robonomics İle öğren",
  "Introduction course": "Giriş Kursu",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "IoT geliştiricileri ve kullanıcıları için web3 teknolojileri ve Robonomics araçlarıyla modern Nesnelerin İnterneti uygulamalarının oluşturulmasında ortaya çıkan sorunlara ve olası çözümlere dalın.",
  "Boston dynamics spot software developing": "Boston Dynamics Spot Yazılım Geliştirme",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Size Spot SDK eğitim programını tanıtmaktan heyecan duyuyoruz! Amacımız, sizi Spot'un SDK'sına alıştırmak ve laboratuvarımızda bir Boston Dynamics Spot robotu kullanarak becerilerinizi uzaktan test etmenize olanak sağlamaktır.",
  "Sovereign smart home with robonomics and home assistant": "Robonomi ve Ev Asistanı ile Egemen Akıllı Ev",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Bu kursta, ana avantajı kullanıcı verilerinin güvenliği / gizliliği olan kendi egemen akıllı evinizi inşa etmek için gerekli tüm adımları atacaksınız.",
  "Shop": " Mağaza",
  "Science papers": "Bi̇li̇msel çalişmalar",
  "Books": "Ki̇taplar",
  "Logo and assets": "Logo ve varliklar",
  "Blog": "Blog",
  "Ambassador program": "Elçİli̇k programi",
  "Contacts": "İleti̇şİmler",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Zaman çİzelgesi̇",
  "Tokenomics": "Tokenomi̇k",
  "Parachain": "Parachain",
  "User (D)App": "Kullanıcı (D)App'ı",
  "Function request": "Fonksiyon İsteği",
  "Report": "Raporla",
  "Control": "Kontrol",
  "Log": "Log",
  "IoT Device": "IoT Cihaz",
  "Decentralized application": "Merkezi̇ olmayan uygulama",
  "Digital twin": "Dijital İkiz",
  "IoT / Smart device": "Iot / Akilli ci̇haz",
  "Robonomics tokenomics": "Robonomics tokenomiksleri̇",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": ",Polkadot ekosistemindeki Ethereum ağı ve Robonomics parachain üzerindeki IoT cihazlarını kontrol etmeyi mümkün kılacak yardımcı program simgesidir.",
  "The task": "Görev",
  "Be aware of scammers": "Dolandırıcılara dikkat edin",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "XRT alışverişi yapmak için lütfen yalnızca iyi bilinen pazarları kullanın. Size özel mesajlarda verilen hesaplara hangi işlemi yapmak isterseniz (token almak veya satmak) tokenlerinizi göndermeyiniz. Robonomics belirteci hakkında herhangi bir 'gürültülü ifade' aldıysanız (dolandırıcılar genellikle airdrop duyurusu gibi bir şey kullanır), resmi güncellemeler için lütfen bu web sitesini (https://robonomics.network/) veya",
  "for official updates. Be careful, be safe.": "'ımızı kontrol edin. Dikkatli ol, güvende ol.",
  "XRT in Ethereum": "Ethereum'da XRT",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "2015 - 2018'de Robonomics projesini uygulayan proje ekibinin, Robonomics Network tarafından faydalı bir işlevin sağlanması, yani IoT cihazlarının hizmet olarak robot modeline göre piyasaya sürülmesi ile geri ödenmesi arasında bir bağlantı bulması gerekiyordu. Ethereum'daki gaz ücretleri için Robonomics sağlayıcılarına maliyeti. Her bir akıllı cihazın bir hizmeti yerine getirme sorumluluğunun yaşam döngüsü hakkında düşünmemiz gerekiyordu. Robonomics'teki ilk Ar-Ge'nin bir sonucu olarak ekip, oluşturulan her bir hizmet olarak robot akıllı sözleşmesini ödüllendirmek için yeni belirteç madenciliği için bir mekanizma geliştirdi. Bu model, Robonomics'in Ethereum'daki geleceği için geçerli olmaya devam ediyor, ancak yalnızca Ethereum'da önemli iyileştirmelerle.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Ethereum ekosistemindeki XRT ekibinin tarihsel geçmişini ve uzun vadeli planlarını öğrenmek için bunu okuyun.",
  "Etherscan profile": "Etherscan profili",
  "View token smart contract and transactions in Ethereum network here.": "Token akıllı sözleşmesini ve Ethereum ağındaki işlemleri burada görüntüleyin.",
  "Coingecko markets": "Coingecko piyasaları",
  "Here you can find CEX and DEX markets for trading XRT.": "Burada XRT ticareti için CEX ve DEX piyasalarını bulabilirsiniz.",
  "XRT In Polkadot": "Polkadot'ta XRT",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Ethereum'dan Polkadot'a geçerken, tokenomikte bir 'ölçek büyütme' yapmamız gerekiyor. Polkadot ekosistemindeki parachain'ler, akıllı bir sözleşmenin eşdeğeri değil, genel ağın bir bölümünü kiralayan tamamen programlanabilir bir blok zinciridir.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Polkadot ve Kusama parachains'in asıl ödemesi, açık artırmalardan birini kazanmak için yeterli miktarda yerli Relay zincir belirteçlerinin (DOT / KSM) uzun vadeli bağlanmasıdır. Robonomics parachain'deki XRT, yuva yenilemeyi ve paydaşlar için ödülleri destekler. IoT aboneliklerinin aktivasyonunun altında yatan XRT yazma mekanizması, enflasyonu minimuma indirmek ve faizin artması durumunda sıfıra indirmek için tasarlanmıştır.",
  "Learn more": "Ağ mimarımızın",
  "in Twitter thread from our network architect.": "Twitter başlığında daha fazla bilgi edinin.",
  "Usage:": "Kullanım:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT, hem parachain üzerinde işlem gerçekleştirme ücretlerini ödemek hem de cihaz veya kullanıcı IoT işlemlerinin öncelikli olarak işlenmesini garanti eden bir IoT aboneliği satın almak için kullanılabilir.",
  "Rewards:": "Ödüller:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Parachain, parachain harmanlayıcılarını teşvik etmek için yıl boyunca az miktarda XRT yayınlar.",
  "The parameter of the total reward": "Yıl için harmanlayıcılar için toplam ödülün parametresi,",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "token sahiplerinin zincirleme oylamasıyla belirlenir ve bir referandum düzenlenerek değiştirilebilir.",
  "Use XRT": "XRT'yi kullan",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Merkezi olmayan uygulamamızda IoT aboneliği satın alın. Herhangi bir merkezi şirket gözlemi olmadan akıllı cihazlarınızı blockchain üzerinden kontrol edin.",
  "Subscan profile": "Subscan profili",
  "View token statistics on top of Polkadot ecosystem.": "Polkadot ekosisteminin tepesinde belirteç istatistiklerini görüntüleyin",
  "Other questions": "Di̇ğer sorular",
  "What is RWS?": "RWS nedir?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Çekirdek işlevsellik geliştiriliyor] Mühendisler için Core Dev ekibi, farklı Robonomics kullanım modelleri oluşturmaya çalışacak ve bu yolda ilk adım, ömür boyu abonelik belirteci olan RWS belirtecini başlatmak olacak. Her bir RWS belirteci, Robonomics Parachain üzerinden IoT cihazınızdan/cihazınıza saniyede 1 işlem (tps) verecektir. RWS jetonunuzu etkinleştirin ve yürütme öncesi ve öngörülebilir gecikme ile   'bedava gaz' işlemleri yapın. RWS jetonunu devre dışı bırakın ve DEX'te ticaret yapın.",
  "What is AIRA/AIR ID?": "AIRA/AIR ID nedir?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT belirteci, 2017'de Ethereum'daki Robonomics altyapısının özerk bir parçası olarak dağıtıldı. Robonomics'in 2019'da Ethereum üzerinden başarılı bir şekilde piyasaya sürülmesinden sonra, AIRA belirteçleri, XRT öncesi ERC-20 XRT'ye otonom ve bağımsız takas sürecini garanti eden",
  "ambix smart contract": "ambix akıllı sözleşme",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "aracılığıyla projenin oluşturulan altyapısına bağlandı.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Robonomics belirtecinin, Blockchain altyapısında Akıllı Şehirler ve Endüstri 4.0'ın bakımı için merkezi olmayan bir ağın çalışmasını sağlamaktır. Bu hedefe ulaşmak için, belirteç ekonomisinin ağın uygulanmasına yönelik teşvikleri yansıtması gerekir.",
  "Token distribution": "Token dağıtımı",
  "Try our Dapp": "Dapp'ımızı deneyin",
  "In addition": "Ek olarak",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "farklı bağımsız ekipler tarafından sağlanan araçlar kullanarak XRT'yi Polkadot (Kusama) ve Ethereum topluluklarında farklı blok zincirlerinde işletebilirsiniz.",
  "Within the Kusama network, you have the capability use": "Kusama ağı içinde,",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "Robonomics parachain ve diğer parachainler arasında iletişim kurmak için çeşitli merkezi olmayan uygulamalar (dApp'ler) kullanma yeteneğine sahipsiniz:",
  "Within the Ethereum network you can use decentralized application powered by the": "Ethereum ağı içinde,",
  "Attention please": "Ethereum topluluğu tarafından desteklenen merkezi olmayan uygulamaları kullanabilirsiniz.",
  "If you have been utilizing The Multichain service for bridge transactions, please refrain from using it at the moment, as it has been": "Lütfen dikkat",
  "announced": "Köprü işlemleri için Multichain hizmetini kullanıyorsanız, lütfen şu anda kullanmaktan kaçının, çünkü",
  "on the official Twitter of The Multichain.": "resmi Multichain Twitter hesabında duyuruldu.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Merkezi olmayan uygulama (dapp) Blockchain içinde çalışır. Açık kaynak kodludur ve verileri IPFS ve Github üzerinde sunulur. Bu teknolojiler uygulamanın aynı zamanda güvenli ve şeffaf olmasını sağlar. Geliştiricilerimiz hem Robonomics'in uygulamasının geliştirilmesi hem de kendi dapp'ınızı oluştururken kullanabileceğiniz kütüphaneler üzerinde çalışmaktadır.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin, Robonomics Web Services (RWS) tarafından sağlanan araçlardan biridir. Gerçek dünyadaki ekipmanın dijital bir versiyonu gibi davranır ve tüm teknik özelliklerini kopyalar. Merkezi olmayan bir uygulamanın kullanıcının komutlarına daha duyarlı olmasını sağlar.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Robonomics'i, evinizin/ofisinizin çeşitli yönlerini otomatikleştirmek ve kontrol etmek için çok çeşitli Zigbee akıllı cihazlarla kullanabilir veya daha karmaşık endüstriyel görevler için ROS tabanlı robotlarla birlikte kullanabilirsiniz.",
  "Do Androids Dream of Electric Sheep?": "Androidler Elektrikli Koyun Düşler mi?",
  "Sleeping Mew Space": "Uyuyan Mew Uzayı",
  "Are you ready for Mars?": "Mars'a hazır mısın?",
  "Shiva Robot": "Şiva Robotu",
  "Space Travelers": "Uzay Yolcuları",
  "Retro Astronaut": "Retro Astronot",
  "New Newton": "Yeni Newton",
  "Your email": "E-posta adresiniz",
  "Community & Contacts": "Topluluk ve İletişim",
  "Get latest updates": "En son güncellemeleri al",
  "Tell us something if you want": "Bize istersen bir şey söyle",
  "Submit": "Gönder",
  "Something went  wrong :( Try again later": "Bir şeyler yanlış gitti :( Daha sonra tekrar dene",
  "Want emails from robonomics": "Robonomics'ten e-posta almak istiyorum",
  "Adding you to our special list...": "Sizi özel listemize ekliyoruz...",
  "Nice, you are in the list": "Harika, listedesin!",
  "Something went  wrong. Try again later": "Bir şeyler yanlış gitti. Daha sonra tekrar deneyin",
  "Robonomics art shop": "Robonomi̇k sanat mağazasi",
  "Welcome to our brand new online shop on": "robonomics.threadless.com adresindeki yepyeni çevrimiçi mağazamıza hoş geldiniz!",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Mağazamızda robot teknolojisine, teknolojiye ve sanata olan sevgimizi gösteren giysiler, aksesuarlar, ev dekorasyonu ve diğer ürünler bulunmaktadır. Robonomics sanatçıları tarafından yapılan benzersiz tasarımlarımız ve Threadless'tan arkadaşlar tarafından işlenmiş üretim ve nakliye ile t-shirt, uzun kollu, kapşonlu, duş perdesi, yastık, battaniye ve diğer kullanışlı ürünleri bulabilirsiniz. Eğlence!",
  "Shop now on threadless": "Şİmdi̇ threadless üzeri̇nden alişveri̇ş yapin",
  "alternative shop": "alternatif mağaza",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Yıl büyük bir başarı ile başladı - Robonomics 20. parachain slot müzayedesini kazandı ve Kusama ağında ",
  "officially became": "resmi olarak ID 2048 ile bir parachain oldu",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": " Lansman, datalog, DigitalTwin, sorumluluk işlevleri ve IoT abonelikleri ekosistemin tüm kullanıcıları tarafından kullanılabilir hale geldi • Projenin bu aşamasına ilişkin ayrıntıları sağlamak için, çekirdek ekip",
  "Robonomics Whitepaper 2.0.": "Robonomics Teknik İncelemesi 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "in ilk bölümlerini yayınladı. Substrate üzerinde Robonomics 2.0, XCM mesajları desteğiyle yayınlandı ve diğer parachain'lerle kanal oluşturdu.(örneğin, İşlevselliği bizim için son derece yararlı olan Crust Shadow ve Darwinia).",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Aynı zamanda, IoT pazarını protokolümüze dahil etmek için bir stratejinin kilidini açtık. Nesnelerin İnterneti ekipmanıyla yaptığımız deneyler, bizi merkezi bulut hizmeti sağlayıcılarından bağımsız, egemen bir akıllı ev konseptine götürdü. Home Assistant otomasyon sistemi ile",
  "integration": "entegrasyonumuzu",
  "with the Home Assistant automation system, and also designed our own": "geliştirdik ve ayrıca akıllı cihazları bağlamak için kendi",
  "IoT gateway": "IoT ağ geçidimizi",
  "for connecting smart devices.": "tasarladık.",
  "We have launched two big initiatives in order to increase community engagement —": "Topluluk katılımını artırmak için iki büyük girişim başlattık:",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Elçisi Programı",
  "Additionally,": "Ayrıca",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "Robonomics topluluğunun yönetişim mekanizmalarımızı ilk kez deneyebilmesi için sonbaharda düzenlendi. Son zamanlarda Robonomics ekibi, DAO IPCI projesinin akıllı binalar için karbon denkleştirme hizmeti sunmak üzere bir parachain yuvası elde etmesine yardımcı oldu.",
  "In 2021, our": "2021 yılında",
  "main focus": "asıl odak noktamız",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "IoT uygulamalarının Kusama ağındaki parachain'imiz üzerinden kullanılabilmesi için proje hazırlamak oldu. Substrate üzerinde Robonomics 1.0 piyasaya sürüldü ve dijital ikiz işlevselliğini geliştirmenin yanı sıra telemetri verilerini göndermek için parachain'e bağlanan sensörleri test ediyoruz. Yılın ortasında, ağımızın tam döngüsünü test etmeye karar verdik ve Robonomics parachain'in entegre edildiği (Kusama geçiş zincirine taşınmadan önce)",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "adlı kendi geçiş zincirimizi oluşturduk. Birkaç kitle kredisi kampanyası düzenlediğimiz Kusama'da bir parachain slotu edinmeye çokça odaklanıldı.",
  "There have been two big changes for the community. First, we launched the": "Topluluk için iki büyük değişiklik oldu. İlk olarak web3, robotik ve IoT projelerinin Ar-Ge görevleri için fon almasını sağlayan",
  "Robonomics Grant Program": "Robonomics Hibe Programını",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "başlattık. Yıl sonu itibarıyla programa 4 aktif proje katıldı. İkinci olarak ekip",
  "Exodus process": "Exodus sürecini",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "başlatarak Ethereum token sahiplerinin XRT tokenlerini parachain'e taşımalarına izin verdi.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "İşbirlikleri arasında, kendisi için bir",
  "rental remote control system": "kiralık uzaktan kumanda sistemi",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "geliştirilen Boston Dynamics Spot'un MerkleBot'taki olağanüstü görünümünü hatırlayabiliriz. Robonomics mühendislerinden oluşan bir ekip tarafından oluşturulmuş kişisel bir proje olan Multi-Agent Systems firması hakkında da sizleri bilgilendirmek isteriz. Kahve dükkanı sahipleri için yemek pişirme görevlerini yerine getiren Eisenchoch adlı robotik bir waffle fırını geliştirdiler.",
  "There came a time when the existing limitations of Ethereum": "Ethereum'un mevcut sınırlamalarının (özellikle zayıf ölçeklenebilirlik, düşük hız ve çok yüksek işlem maliyeti)",
  "began to stand out clearly": "açıkça öne çıkmaya başladığı",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "bir zaman geldi. ETH2.0'a yükseltmenin durumu düzeltmesi gerekiyordu, ancak bu yükseltme defalarca ertelendi. Ethereum ağından ayrılmak istemesek de mevcut durumda kullanım durumlarımızı uygulamanın zor olduğunu fark ettik ve alternatif bir ağ aramaya başladık. Parçalanmış blockchain ekosistemi Polkadot bu alternatif haline geldi. Ana Robonomics özelliklerini taşımak ve kendi test ağımızı dağıtmak için Substrate çerçevesini deneyerek başladık. Bu aşamanın sonunda, parachain'imizi Rococo test ağına konuşlandırdık ve Kusama ağında bir slot almak için hazırlanmaya başladık.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Nesnelerin İnterneti sistemlerini incelemeye devam ederek, Robonomics'in kullanıcılara değer katabilecek ana işlevini belirledik: Nesnelerin İnterneti için merkezi olmayan bulut işlevi. Bu fikir,",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "temelini oluşturdu. RWS altyapısı, tipik bir merkezi bulutun tüm işlevlerini üstlendi, ve bunu standart küresel kullanılabilirlik, güvenlik ve gizlilik sorunları olmadan yaptı. Ek olarak, abonelik sahiplerinin her işlem için bir ücret ödemek zorunda kalmadan blockchain ağını kullanmalarına olanak tanıyan parachain IoT abonelikleri fikrini bulduk. IoT abonelikleriyle yapılan ilk deney, sahibinin blok başına 1 işlem göndermesine izin veren RWS belirtecinin yayımlanmasıydı. Ek olarak, akıllı cihazların kontrolü için kendi donanım kitimizi (DAOS konsepti) geliştirmek için ilk adımları atmaya başladık.",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Tabii ki, Ethereum'da Robonomics'e verilen destek durmadı. Robonomics iletişim yığını,",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "sürümüne son halini verdi. XRT belirteci birkaç borsada (özellikle Uniswap DEX) işlem görmeye başladı ve likidite teşvik programı başlatıldı.",
  "The team actively developed ways to interact with the community. The first version of our": "Ekip aktif olarak toplulukla etkileşim kurmanın yollarını geliştirdi.",
  "dapp": "Dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "sitemizin ve Robonomics Wiki'nin ilk versiyonu yayınlandı. Daha şeffaf ve uygun proje yönetimi için ",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "yu kullanmaya başladık. Projeye yeni başlayanlar için ",
  "Robonomics Winter School": "Robonomics Kış Okulu'nu",
  "in 2019 for newcomers to the project.": "2019 yılında ağırladık.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Cana yakın projelerle işbirlikleri de devam etti. Robonomics ve DAO IPCI, duyusal verileri toplamak ve analiz etmek için bir hizmet olan",
  "Robonomics became the foundation for the": "'ı tanıttı. Robonomics, robot ekipmanlarının akıllı bir şekilde kiralanması için bir sistem geliştiren",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "projesinin temeli oldu.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Otonom ajanların güvenilir teknik ve ekonomik operasyonlarını sağlayacak bir ortama ihtiyaçları olduğunu anladık. Birkaç yıldır, robot aracıların hizmetlerini sağlamasına yardımcı olan merkezi olmayan bir sağlayıcılar ağı oluşturmak için bir protokol geliştiriyorduk. Ağ bakımı ve Ethereum ile ROS arasındaki iletişim yığını için araçlar geliştirilmiştir. 2018'd",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "'ı yayınladık ve Robonomics Network'ün alfa sürümü Ethereum ana ağında başlatıldı. XRT token oluşturma etkinliği için aktif hazırlıklar devam etti (Nihayetinde ilk kripto kışı nedeniyle 2019 baharında gerçekleşti).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Bu dönemden itibaren Robonomics, Endüstri 4.0 ile ilgili kullanım senaryolarını (akıllı fabrikalar, akıllı şehirler ve akıllı evler) dinamik olarak geliştirmeye başladı ve bu, IoT dünyasına olan yakın ilgimizi çekti. İnovasyon arayışında olan ekip, birkaç büyük ve benzersiz Ar-Ge demosu sundu: bir sivil",
  "sensor network": "sensör ağı",
  "a water drone": "çevresel izleme için bir su uçağı",
  "for environmental monitoring (supported by a sensor systems manufacturer": "(sensör sistemleri üreticisi",
  "Libelium": "Libelium tarafından destekleniyor),",
  "a smart factory model": "bir akıllı fabrika modeli",
  "a self-employed": "bağımsız bir",
  "robot artist Gaka-chu": "robot sanatçısı Gaka-chu",
  "and a": "ve",
  "drone traffic management system": "bir drone trafik yönetim sistemi",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics, web3 teknolojilerini ve IoT cihazlarını kullanarak çevresel varlık yönetimi konusunda DAO IPCI projesi ile işbirliğine başladı.",
  "Important news &amp; announcements": "Важные новости и объявления",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Bu, p2p teknolojilerinin daha önce robotik için mevcut olmayan yeteneklere sahip olduğu bir dizi görev belirlediğimiz aktif bir Ar-Ge dönemiydi. Ethereum bilgisayarı, IPFS dosya depolaması ve Robot İşletim Sistemini (ROS) birleştirerek, herhangi bir cihazın potansiyel olarak",
  "autonomous intelligent robot agent": "otonom bir akıllı robot aracısı",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "haline gelebileceğini fark ettik. Bu da bizim için Hizmet olarak Robot ve robot ekonomisi kavramlarına giden yolu açtı.",
  "Our publications in scientific journals of this period are available in the": "Bu döneme ait bilimsel dergilerdeki yayınlarımıza ",
  "Papers section": "Bildiriler bölümünden ulaşabilirsiniz.",
  "We have collected all R&D projects over the years in the": "Yıllar boyunca tüm Ar-Ge projelerini",
  "a handy book": "kullanışlı bir kitapta topladık.",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Her şey, Ethereum ana ağını yeni başlattığında kurucuların aklına gelen bir fikirle başladı. Robot, kripto para birimi için bir müşteri için bir görev gerçekleştirirse ve mantığı bir akıllı sözleşme tarafından kontrol edilirse ne olur?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Fikri test etmek için, kullanıcı bir ödeme işlemini tamamladıktan sonra belirtilen GPS koordinatlarına ulaşmak için bir Ethereum bilgisayarı tarafından kontrol edilen bir drone'un başlatıldığı bir demo yaptık.",
  "The demo is available on": "Demo",
  "YouTube": "YouTube'da mevcuttur.",
  "Infrastructure && tech development timeline": "Altyapi && teknoloji̇ geli̇şti̇rme zaman çİzelgesi̇",
  "Notable events": "Önemli olaylar",
  "World Economic Forum Annual Meeting 2022": "Dünya Ekonomik Forumu Yıllık Toplantısı 2022",
  "Polkadot Decoded 2022": "Polkadot'un Kodu Çözüldü 2022",
  "On the Way to Sovereign Home Automation": "Egemen Ev Otomasyonuna Giden Yolda",
  "Becoming a Parachain for IoT Applications": "IoT Uygulamaları için Parachain Olmak",
  "Polkadot Decoded 2021": "Polkadot'un Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (robonomics sponsorluğunda)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Kış Okulu 2021 (Robonomys'in ev sahipliğinde)",
  "Transition to Multinetwork — Along Came Polkadot": "Çoklu Ağa Geçiş — Polkadot geldi",
  "The Rise of Robonomics Network": "Robonomik Ağın Yükselişi",
  "Crypto Valley Conference 2018": "Kripto Vadisi Konferansı 2018",
  "European Parliament workshop 'The Economy of Robots'": "Avrupa Parlamentosu çalıştayı 'Robotların Ekonomisi'",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MIT Media Lab'de Robotik Sistemler için Blockchain Sempozyumu",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics-2018 yaz okulu (Robonomics ekibi ev sahipliğinde)",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Web3 Teknolojilerini ve Robotik Çerçeveleri Bir Araya Getirmek",
  "Playing with Human-Machine Interaction through Ethereum": "Ethereum aracılığıyla İnsan-Makine Etkileşimi ile Oynama",
  "Robonomics whitepaper 2022 welcome guide": "Robonomics 2022 Teknik İnceleme klavuzuna hoşgeldiniz",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Ethereum ve IPFS üzerinde çalışan bir tekno-ekonomik makine iletişim protokolü geliştirdik ve bunu Polkadot parachain'ine dayalı bulut tabanlı bir IoT platformunun unsurlarıyla tamamladık. Bugün, fütüristik IoT uygulamaları oluşturmak için zaten bir hibrit platformumuz var. Bu platformumuz, küresel bir merkezi olmayan bilgisayarın kontrolü altındaki cihazlarla etkileşim sağlıyor. Robonomics platformunu kullanarak güvenli, sunucusuz ve fütüristik IoT uygulamaları oluşturmaya başlamadan önce gelin biraz teoriye dalalım...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomics teknik incelemesinin ilk iki bölümü zaten kullanıcılara sunulmuştur.",
  "Chapter 1.": "Bölüm 1.",
  "At the intersection of cybernetics and economics": "Si̇berneti̇k ve ekonomi̇ni̇n kesi̇şİmi̇",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Robotik cihazların, daha önce insanlar için ayrılmış olan, temel ekonomik faaliyetleri gerçekleştirebilen bağımsız unsurlar olarak hareket ettiği bir ekonomik sistem sunduk. Bu bölümde, insanların hayatlarının önemli bir parçası haline gelebilecek ve gelecekte ekonominin mevcut seviyesini tam otomatik hizmetlere dönüştürebilecek robot ekonomisi hakkında konuşacağız.",
  "In this chapter you will learn": "Bu bölümde öğrenecekleriniz",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase ve Şirketlerin Doğası",
  "CPS - cyber-physical system": "CPS- siber fiziksel sistem",
  "Norbert Wiener and the search for patterns in living and machine": "НNorbert Wiener ve aktif makine sistemlerinde örüntü arayışı",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Dördüncü Sanayi Devrimi, Robotlar ve Bitcoin için Par",
  "Ethereum Smart Contracts": "Ethereum Akıllı Kontratları",
  "Polkadot Parachains": "Polkadot Parachainleri",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Teleoloji ve Mises'in çalışmasına ilişkin açık sorular",
  "Read chapter 1": "1. bölümü okuyun",
  "Chapter 2.": "Bölüm 2.",
  "Robonomics architecture": "Robonomi̇cs mi̇mari̇si̇",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "İkinci bölümde, IoT cihazlarından merkezi olmayan ve küresel olarak erişilebilir bir sağlayıcı ağına kadar modern İnternet teknolojisini kullanan insan-makine etkileşimi hakkında bilgi edineceksiniz. IoT sistemlerinin yaratıcılarının karşılaştığı ve Robonomics'in çözümünün hedeflendiği sorunları ve ana zorlukları vurgulamak için Nesnelerin İnterneti'nin temellerine bakacağız.",
  "Overview of the state of the Internet of Things (IoT)": "Nesnelerin İnterneti'nin (IoT) durumuna genel bakış",
  "Classification of IoT devices": "IoT cihazlarının sınıflandırılması",
  "Embedded IoT systems": "Gömülü IoT sistemleri",
  "Edge-systems: IoT gateways and controllers": "Uç sistemler: IoT ağ geçitleri ve denetleyiciler",
  "Autonomous Systems": "Otonom Sistemler",
  "Internet of Things providers": "Nesnelerin İnterneti sağlayıcıları",
  "Digital twins are the heart of the Internet of Things": "Dijital ikizler Nesnelerin İnterneti'nin kalbidir",
  "IoT data flows in cloud service": "Bulut hizmetinde IoT veri akışları",
  "Popular examples of IoT solutions": "IoT çözümlerinin popüler örnekleri",
  "Current problems of building IoT solutions": "IoT çözümler oluşturma konusundaki güncel sorunlar",
  "Main tasks of Robonomics architecture": "Robonomics mimarisinin ana görevleri",
  "Basic components of Robonomics architecture": "Robonomics mimarisinin temel bileşenleri",
  "A simple representation of Robonomics architecture": "Robonomics mimarisinin basit bir temsili",
  "Read chapter 2": "2. bölümü okuyun",
  "We continue to update the white paper of Robonomics": "web sitemizde ve Discord'da yeni bölümler için bizi izlemeye devam edin",
  "stay tuned for new parts on our website and in Discord": "следите за выходом новых частей на сайте и в Discord",
  "Join our discord": "Discordumuza katilin",
  "Robonomics logos and usage": "Robonomics logolari ve kullanimi",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Nasıl kullanabileceğinizi göstermek için Robonomics logolarını, renklerini, varlıklarını ve yönergelerini bir araya getirdik.",
  "Download Robonomics logo": "Robonomics logosunu İndi̇ri̇n",
  "Download RWS logo": "RWS logosunu İndi̇r",
  "Download wiki logo": "Wiki logosunu İndi̇ri̇n",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Robonomics, RWS veya Robonomics Wiki'ye bağlanmak için bu izin verilen logoları kullanın",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Robonomics ile entegre olduğunuzu başkalarına bildirmek için izin verilen Robonomics logosunu kullanıns",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Robonomics teknolojisi ve entegre projelerle ilgili blog gönderilerinde, makalelerde ve slaytlarda izin verilen logoları kullanın",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "İzin verilen Robonomics logolarını, rengini, boyutlarını değiştirmek veya başka kelimelerle veya tasarım öğeleriyle birleştirmek dahil olmak üzere değiştirmeyin",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Robonomics logosunu ve adını, Robonomics olduğunuzu, teklifinizin veya projenizin Robonomics'e ait olduğunu veya Robonomics'in sizi, teklifinizi veya projenizi Robonomics DAO tarafından onaylanmamışsa desteklediğini gösterecek şekilde kullanmayın",
  "Robonomics Color pallet": "Robonomics renk paleti̇",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Arayüzlerimizde, baskılarımızda ve diğer görsellerimizde kullandığımız bu renkler. </br> Slaytlarınız, Robonomik hakkında bilgi veren yazılarınız için afişleriniz vb. için kullanın.",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines’ own economics to perform various operations in the world around them at a speed not available to humans.": "Robonomics yazarlarının daha önce aktarmaya çalıştıkları ana fikir, ekonominin mevcut seviyesinden tam otomatik hizmetlere doğal, mantıklı ve görünüşte kaçınılmaz olan evrimdir. Otomatik hizmetlerin hem insan ekonomisinin dilini konuşma becerisine hem de çevrelerindeki dünyadaki çeşitli işlemleri insanların erişemeyeceği bir hızda gerçekleştirebilmesi için makinelerin kendi ekonomisine sahip olması gerekecektir.",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Şimdi size modern İnternet teknolojisini kullanarak insan-makine etkileşiminin pratik alanlarını göstermek istiyoruz. Bulut hizmetleri aracılığıyla teknik bilgi alışverişinin bilinen IoT cihaz mimarisinden, merkezi olmayan, küresel olarak erişilebilir bir sağlayıcı ağı aracılığıyla teknik-ekonomik etkileşimin organizasyonuna geçeceğiz.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Başlangıç olarak, otomatik sistemlerin ağ bağlantısıyla en açık şekilde ilgili olan alana bir gezi yapmamız gerekiyor. Ardından, IoT sistemlerinin yaratıcılarının karşılaştığı sorunları ve temel zorlukları ve Robonomics'in çözümünü hedeflediği sorunları ve temel zorlukları vurgulamak için Nesnelerin İnterneti'nin temellerine bakacağız.",
  "Overview of the state of the internet of things (IoT)": "Nesnelerin İnternetinin Durumuna Genel Bakış (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Otomatik cihazların ağ erişilebilirliği konusu, 60'lı yıllardan beri tüm gezegende tartışılıyor ve o zamanlar bunu çözmek için oldukça ciddi girişimlerde bulunuldu. Örneğin, Sovyet sibernetikçi Viktor Glushkov, 60'lı ve 70'li yıllarda",
  "OGAS": "OGAS",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "ulusal bilgi sisteminin tasarımının bir parçası olarak tek bir tesisin üretim hacimleri hakkında otomatik bilgi toplamayı önerdi ve kısmen uyguladı. Coca-Cola otomatının 1980'lerde ARPANET'e nasıl bağlandığı yaygın olarak biliniyor, böylece makineler içeceklerin mevcudiyetini ve sıcaklıklarını rapor edebiliyordu.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Ancak yine de, etkinleştirme teknolojilerinin yaygın kullanımı nedeniyle IoT''nin asıl gelişimi bugün gerçekleşiyor. Nesnelerin İnterneti uygulamalarının hızlı evriminin ana itici güçleri, çeşitli aralıkların ve gömülü cihazların kablosuz iletişiminden bulut analitiği ve makine öğrenimine kadar birçok alanın geliştirilmesinin sonuçlarıdır. IoT cihazlarının sayısı son 10 yılda istikrarlı bir şekilde artıyor (2030''a kadar 25 milyar birimlik bir tahminle) ve bu, araştırmacıları ve geliştiricileri sağlık, ev otomasyonu, tarım ticareti,çevresel koruma gibi çeşitli alanlarda yeni IoT uygulamaları oluşturmaya teşvik etti. ",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "IoT sistemleri oluşturma süreci ve bu süreçte ortaya çıkan görevlerle daha çok ilgileniyoruz. Yıllar süren araştırmalar boyunca birçok farklı mimari önerildi ve bunların ortalamasını alarak bir IoT sisteminin üç temel bileşenini ayırt edebiliriz: cihazlar, ağ altyapısı, analitik, bilgi işlem ve kontrol makineleri.",
  "New challenges": "Yeni̇ meydan okumalar",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud’s functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Nesnelerin İnterneti'nin geliştirilmesi ve uygulanması, tipik sorunları çözmenin yeterli olmadığını göstermiştir. Daha önceki hatalara ve tespit edilen eksikliklere dayanan tamamen yeni kavramlar ve ilkeler günümüze kadar ortaya çıkmıştır. Bulut hizmetlerini kullanmanın bu kesinlikle uygun yaklaşımının ölçeklenebilirlik, gizlilik ve güvenlikle ilgili bir takım kritik eksiklikleri olduğu ortaya çıktı. Bu sorunları çözmek için, veri işleme, mantık ve hesaplamayı kullanıldıkları yere yakın bir yere getirmeleri önerildi. Böylece, bulut ve cihazlar arasındaki ara sistemlerin bulutun bazı işlevlerini üstlenmesiyle sis ve uç bilgi işlem kavramları ortaya çıktı. Bu nedenle, uç sistemlerin oluşturulması, Nesnelerin İnterneti'ni oluşturmanın yeni zorluklarından biri haline geldi.",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "IoT'yi inşa etmek için son zamanlardaki bir diğer zorluk, gerçek ekipmanın teknik özelliklerini ve geçmiş verilerini kopyalayan dijital bir versiyonu olan dijital ikiz kavramı olmuştur. Bu kavram, bir sürecin doğru ve eksiksiz bir belirtimine sahip olmanın ve gelişimini tahmin edebilmenin gerekli olduğu alanlarda en iyisidir. Nesnelerin İnterneti, dijital ikizlerin ana entegratörü olarak hareket eder, ancak bu görev, IoT cihazlarının olağan bağlantılarından çok daha karmaşıktır.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Şu anda, insanlar için değil, makineler için tasarlanmış ve kullanışlı bir ağın tamamına tanık oluyoruz. Nesnelerin İnterneti artık yalnızca bir cihazı ağa bağlama mekanizması değil, özellikle cihazlar için oluşturulan ve kullanılabilen daha fazla hizmettir. Nesnelerin İnterneti, yalnızca kullanıcı ile cihazı birbirine bağlamakla kalmaz, aynı zamanda cihazların kişiye hizmet sağlama görevlerini özerk olarak yerine getirmesine yardımcı olur.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Bu tür sistemlerde kullanıcı arayüzü yoktur ve temel işlevsellik sağlamak için genellikle IoT ekosistemlerinin en düşük düzeyinde kullanılır. Enerji verimli ve küçük olmalıdır. Sınırlı bilgi işlem ve iletişim kaynaklarına sahip olur. IoT ağ geçitleri veya denetleyicileri genellikle sinyal alıcıları olarak işlev görür.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Bu sistemler, yerel olarak erişilebilen gömülü sistemler ile küresel İnternet arasında bir bağlantı görevi görür. Genellikle gömülü sistemlerin çoklu iletişim protokollerini destekler ve telemetriyi cihazlardan buluta aktarır ve sinyalleri geriye doğru kontrol eder. Genellikle bu cihazlar, yerel ağdan ayrılmadan cihazlardan gelen bilgilerin birincil işlenmesini gerçekleştirmek için tek bir kart bilgisayarla donatılmış WiFi yönlendiricinin daha karmaşık bir sürümüdür.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "Bu sınıf, yüksek performanslı bir işlemciye ve büyük miktarda belleğe sahip tam bir bilgisayar düzeyinde bir kontrol bileşenine sahip olan karmaşık otomatları (Boston Dynamics'ten Spot gibi) içerir. Bu gibi durumlarda robot, ek ara çözümler (uç sistemler) olmadan internete bağlanır. Nesnelerin İnterneti'ne erişmek için gerekli yazılım, doğrudan bağımsız sistemin bilgisayarına yüklenir. Veriler yerel olarak toplanır ve kısmen işlenir, ardından herhangi bir tam teşekküllü ağ cihazına benzer şekilde İnternet'e yayınlanır.",
  "Internet of things providers ": "Nesnelerin İnterneti Sağlayıcıları",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "IoT sağlayıcılarının ana işi, kullanıcılara internet üzerinden akıllı cihazların yönetilmesinin yanı sıra verilere ve analitiklere uzaktan erişim sağlamaktır. Sağlayıcının kalitesi için ana kriterler, operasyonların güvenliği, bağlantının kararlılığı ve sağlayıcının dünyanın her yerinden erişilebilir olmasıdır.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Bir IoT sağlayıcısıyla çalışmak için standart şema şunları içerir: bulut akıllı cihazla uyumlu yazılımın yüklenmesi, bir cihazın ilk başarılı bağlantısından sonra bulut tarafı yönetim hizmetlerinin ayarlanması, çeşitli analitik hizmetlerin bağlanması.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Dijital ikizlerden bahsetmişken, mimari olarak uygulanmasının gerekli olduğunu belirtmek gerekir; kullanıcıya kontrol cihazlarına,ikizin durumunu değiştirmeyi reddetme olarak doğrudan erişim verilmelidir. Reddedilmenin en belirgin nedenlerinden biri, ilk olarak, lansmandan hemen önce cihazlarda kendi gereksinimlerinin ve koşullarının bulunmasıdır. İkincisi, birden fazla kullanıcı cihazının tek bir veri kaynağına erişmesi gerekiyorsa, her kullanıcıya kişiselleştirilmiş kontrol verilmesi kritik olabilir. Son olarak, cihazın devre dışı kalması durumunda cihazın son fiili durumunu kullanılabilir durumda tutmak son derece yararlıdır.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "Sonuç olarak, kullanıcı ile bilgi alışverişi döngüsü ve sensörler tarafından gerçek veri üretimi arasında bir ayrım elde ederiz. Bu çalışmayı göstermek için aşağıda, bir dijital ikiz kullanarak IoT cihazı ile çalışan kullanıcının sürecine yer verilmiştir.",
  "IoT data flows in cloud services": "Bulut hi̇zmetleri̇nde IoT veri̇ akişlari",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Bulut tetikleyicileri için giriş değerleri. Örneğin, bulut hizmeti, bir araba alarm sensöründen bir grev hakkında bir rapor olması durumunda kullanıcıya çeşitli bildirimler gönderir.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Edge düzeyinde üretilemeyen karmaşık analitik için çıktı verileri. Örneğin, bir kalabalıkta yüz tanıma için video işlemeyi düşünebiliriz.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Durumunun bir dökümünü oluşturmak için cihazın dijital ikizini oluşturmanın temeli. Örneğin, mobil uygulamada veya web sitesinde kullanıcının isteği üzerine.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Tipik bir akıllı ev sistemi, yaşam alanınızı kontrol etmek için çok çeşitli seçenekler sunar. Yardımı ile kapı kilitlerini uzaktan kontrol edebilir, odaya aile ve arkadaş olarak ve bakım veya teslimat personeli için bir kerelik veya düzenli erişim ayarlayabilirsiniz. Çok sayıda sensör ve kayıt cihazı ile sistem, hareket sensörlerini tetiklerken video kaydını dahil edebilir, su sisteminde bir sızıntı tespit edildiğinde su kaynağını otomatik olarak kapatmak için kararlar alabilir, programlı bir robot elektrikli süpürge başlatabilir ve bir temizlik raporu sağlayabilir. kullanıcı uygulamasında, programınıza bağlı olarak oda sıcaklığını en uygun değere değiştirebilir.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Akıllı arabalar. Aracın yerleşik elektroniğine mobil İnternet erişimi sağlayan kullanıcı, çeşitli araç işlevlerinin uzaktan kontrolüne doğrudan akıllı telefonundan erişebilir ve şunları yapabilir: kapıları açmak, klimayı açmak, farları kontrol etmek. Bu tür arabalar araç paylaşımı için kullanılıyorsa, bu hizmetin müşterileri için durumlarıyla, kalan yakıtlarıyla vb. araçların konumlarının etkileşimli bir haritasını oluşturabilirsiniz.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Akıllı ekipman kiralama sistemi. Şirket, işlem sayısı veya robotun süresi için ödeme ile bir sözleşme kapsamında konveyör hattına robotik manipülatörler kurar. Manipülatörler düzenli olarak gerçekleştirilen işlemlerin, hataların ve uyarıların bir kaydını sağlar. Robotun kiralama ücreti, satıcının robotların öngörücü bakımının yanı sıra buna göre hesaplanır.",
  "Global availability": "Küresel kullanilabi̇li̇rli̇k",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Standart istemci-sunucu mimarisi, iletileri IoT cihazlarından yönlendirirken uç noktaların belirtilmesini gerektirir. Bu nedenle, akıllı bir cihazın ömrü boyunca bağlantı eksikliği, cihazı kontrol etme ve etkileşim kurma yeteneğinde bir sınırlama anlamına gelecektir.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Örneğin, Çin ile Amerika Birleşik Devletleri arasındaki ticaret savaşı, halihazırda Amerika Birleşik Devletleri'ndeki binlerce Çinli akıllı cihaz tüketicisi üzerinde asılı duran Demokles'in kılıcıdır ve bunun tersi de geçerlidir. Her an, ABD yetkilileri tarafından Xiaomi sunucularının engellenmesi, üreticinin bulut hizmetlerine bağlanan cihazların kullanıcılarını etkileyebilir.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Bir IoT cihazının hemen yakınında olmak, cihazların kendilerinden kullanıcı kimlik doğrulaması ve telemetri toplamanın sağlandığı sunuculara bağlantı yoksa bir mobil uygulamadan kontrol edemezsiniz. Yani cihaz aslında kullanıcı tarafından değil bulut tarafından kontrol edilir.",
  "Cybersecurity": "Si̇ber güvenli̇k",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Çoğu IoT çözümünün düşük siber güvenliğinin en önemli nedeni, bulut istemci-sunucu mimarisinin sorunlu mirasından kaynaklanmaktadır. Örneğin, şu anda en yaygın akıllı ev mimarisi genellikle bir bulut hizmetine bağlı bir IoT hub'ıdır. Bu nedenle, tipik bir IoT sistemi, birden fazla harici ağ saldırısına, DoS saldırılarına (sistemi başarısızlığa sürükleyen), kötü niyetli değişikliklere, kullanıcı oturumu ele geçirmeye vb. veya sunucuların başarısız olmasına neden olan doğal afetler. Ayrıca kesinlikle önemli olan bir diğer nokta da ilke olarak buluta ve onu koruyan insanlara güvenme ihtiyacıdır.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Bulut hizmeti sunucuları, tüm tipik siber güvenlik sorunlarına tabidir: aynı sisteme ait cihazlar yüzlerce veya binlerce cihaz olabilir ve aynı zamanda doğaları gereği IoT cihazları daha az bilgi işlem gücüne sahiptir, bu da güvenlik duvarlarını dağıtmayı ve anti-virüs kullanmayı çok daha zor hale getirir. Ne yazık ki en tehlikeli faktör, IoT cihazlarının CPS''leri çalıştırmasıdır, bu nedenle siber güvenliğe yönelik tehditler fiziksel düzeyde de bulunmaktadır.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Tüm bunlar, IoT çözümlerinin ölçeğiyle daha da kötüleşiyor. Bunun sebebi IoT sistemlerinin sayısıdır. Bulut hizmeti kesinlikle düşük seviyeli cihazlardan daha güvenlidir, ancak bu tür yüz binlerce sistem üzerinde merkezi kontrolün konsolidasyonu, her türlü güvenlik ihlalini ve sızıntıyı büyük bir felaket haline getirir.",
  "Data privacy": "Veri̇ gi̇zli̇li̇ğİ",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Gizlilik noktasının siber güvenlikten ayrılması gerekiyor çünkü bu sorun IoT sistemlerine özgüdür. Fiziksel dünyayla yalnızca bilgisayarlar ve akıllı telefonlardan çok daha fazla entegre olan çok sayıda ve çeşitli cihaz türleri nedeniyle, özel veri türleri yelpazesi çoğalır. Artık sadece GPS konumu, alışveriş kayıtları, finansal işlemler ve fotoğraflar değil, aynı zamanda kalıcı bir video ve konuşma kaydı, ses çıktıları, sağlık koşulları ve hatta bir kişinin alışkanlıklarının bir listesini paylaşıyoruz. Gizlilikle ilgili tehdit türleri arasında bilgi tanımlama, yerelleştirme ve izleme, profil oluşturma, envanter saldırısı, veri bağlama saldırısı yer almaktadır.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "En ürkütücü yanı, kullanıcıların hangi verilerin toplandığı ve nasıl kullanıldığı hakkında neredeyse hiçbir fikirleri olmadığı için mahremiyetlerinden vazgeçtiklerinin çok az farkında olmaları veya hiç olmamasıdır. Gizliliğe yönelik tehdit, yalnızca davetsiz misafirlerden değil, aynı zamanda kuruluşlardan ve devlet kurumlarından da tam da bu nedenle büyür. Bulut IoT hizmetleri tipik olarak cihazlardan maksimum veri aktarımı gerektirir ve veri aktarımını yasaklamanın veya daraltmanın hiçbir yolu yoktur ('Şartları Kabul Et veya Defol Git'). Ayrıca, toplanan verilerin bir varlık olmasına ve gerçek bir değere sahip olmasına rağmen, toplanan kişinin yalnızca bu verileri aktif olarak elden çıkarma hakkından mahrum bırakılmamakta, hatta kendi verilerinin toplanması ve kullanılması için herhangi bir tazminat bile verilmemektedir.",
  "Main tasks of robonomics architecture": "Robonomics mi̇mari̇si̇ni̇n başlica görevleri̇",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Bulut platformlarının başarılarını ve zorluklarını temel alan Robonomics, insan-makine iletişiminin her aşamasında IoT pazarına daha güvenli ve daha gelişmiş İnternet çözümleri sunmayı hedefliyor. Robonomics''in hedeflediği ana görevler aşağıdadır:",
  "Managing an IoT device using a decentralized cloud": "Merkezi̇ olmayan bulut kullanarak bi̇r iot ci̇hazini yönetme",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Blok zinciri ağları, bir cihazı çalıştırmak ve telemetrisini almak için en yüksek derecede güvenlik sağlamak için tüm yeteneklere sahiptir. Cihazla etkileşim, aslında blok zinciri ağında depolanan dijital ikizin durumunu değiştirerek ve bu değişiklikler hakkında bilgi göndererek tanımlanabilir. İzinsiz bir blok zinciri durumunda, IoT sağlayıcılarının küresel kullanılabilirliğinin garantilerinin yanı sıra dijital ikiz verilerinin istenmeyen değişikliklerden yüksek düzeyde korunması hakkında konuşabiliriz.",
  "Performing technical and economic transaction between people and machines": "İnsanlar ve maki̇neler arasinda tekni̇k ve ekonomi̇k İşlem yapilmasi",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Kripto para birimleri ve akıllı sözleşmeler mekanizması sayesinde, otomatik sistemlere doğrudan dijital pazarlara erişim sağlayabiliyoruz. Örneğin, Ethereum, otonom cihazların çalışmasında kullanılabilecek temel ekonomik faaliyet araçlarının çoğunu zaten uygular. Son kullanıcı ile IoT cihazı arasındaki etkileşim için oluşturulan uygulamalar, hizmet şartları ve ödeme koşulları cihazın başlatma parametrelerinden ayrılmazsa çok daha etkili olacaktır.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Web3 teknolojisindeki modern gelişmeler, kullanıcı gizliliği sorununu çözebilir. Web3 ile, telemetriye erişmek ve cihazı kontrol etmek için kimlik doğrulamaya veya belirli sunuculara bağlantı gerektirmeye gerek yoktur.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Robonomics, IoT cihazlarının dijital ikizleri için merkezi olmayan bir buluttur. Robonomics, kullanıcılar için özel uygulamalar sağlamanın yanı sıra iletişim için tekno-ekonomik formatı destekler.",
  "A human interface to access the system": "A human interface to access the system",
  "A communication protocol": "Bir iletişim protokolü",
  "A machine interface": "Bir makine arayüzü",
  "Human interface": "İnsan arayüzü",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Kullanıcıları İnternet üzerinden akıllı cihazları kontrol etmeye bağlamanın ana yolu olarak merkezi olmayan uygulamaların (dapps) kullanılmasını öneriyoruz. Böylece, yerel şehir ağı koşullarında ve ortak bir küresel ağ üzerinden eş zamanlı olarak çalışabilecek sisteme (veri açısından) en güvenli kullanıcı arayüzünü sağlayabileceğiz.",
  "Communication protocol": "İleti̇şİm protokolü",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Robonomics ağı, proje ekibi tarafından geliştirilen ve IoT cihazlarını çalıştırmak için gereken bilgilerin iletimini, işlenmesini ve depolanmasını sağlayan merkezi olmayan bir sağlayıcılar ağı uygulayan bir özellik olan Robonomics ağı tarafından oynanır. Aslında, bir işlevin uygulanmasıdır. -IPFS, Ethereum ve Polkadot ağları için özel düğüm.",
  "Machine interface": "Maki̇ne arayüzü",
  "We have chosen the most well-known robotics framework called Robot Operating System Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Uyumlu herhangi bir siber-fiziksel sistemi entegre etmek için standart arayüz olarak Robot İşletim Sistemi Robot İşletim Sistemi (ROS) olarak adlandırılan en iyi bilinen robotik çerçevesini seçtik. Robonomics, ROS için çeşitli kullanımları destekler. Ethereum ağı için Robonomics uygulaması, ROS paketi robonomics_comm biçimindedir. ROS 2 mimarisi için, bir ara yazılım katmanı olarak Robonomics desteği uyguluyoruz (ayrıntılar için bkz. «ROBonomics as ROS 2 Middleware»). ROS kullanımı gereksiz olduğunda (örneğin, IoT cihazlarıyla çalışırken), bir Python robonomics-arayüz modülü geliştirilmiştir. Robonomics işlevlerine yerel olarak erişmeye yardımcı olur ve hem yerel hem de özel ve uzak ve genel düğümlerle çalışır.",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Robonomics platformunu kullanan bir cihaz başlatma döngüsünün genel bir şeması:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "Kullanıcının merkezi olmayan uygulaması, Robonomics ağı aracılığıyla bir cihaz kontrol işlevi için bir istek gönderir.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "Robonomics ağı, libp2p kullanarak istek çevirisi sağlar ve Ethereum blok zinciri veya Robonomics parachain'deki olayları yakalar.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Cihazın kontrolü, IoT cihazını çalıştırmak için gerekli bilgileri depolaması garanti edilen merkezi olmayan bir ağ tarafından sağlanır.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "IoT cihazı, dijital ikizin mevcut durumu hakkında Ethereum ve Polkadot ağlarından bağımsız olarak bilgi alır. Bu, cihazın ancak teknik ve ekonomik başlatma parametreleri ayarlandıktan sonra güvenli bir şekilde çalıştırılabilmesini sağlar.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "İşlemin bir sonucu olarak, IoT cihazı, sağlanan hizmetin kanıtı olarak veya hata ayıklama hataları için kullanılabilecek tamamlanmış işlemlerin bir günlüğünü yayınlar.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Günlük, kullanıcı için bir rapora dönüştürülür ve dapp'inde kullanılabilir hale gelir.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Robonomics Parachain'de IoT için Dapps && Web Hizmetleri Oluşturma",
  "Sergei Lonshakov, software architect": "Sergei Lonshakov, yazılım mimarı",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Otomatik makinenin köle işgücünün tam ekonomik eşdeğeri olduğunu hatırlayalım. Köle işgücüyle rekabet eden herhangi bir emek, köle işgücünün ekonomik sonuçlarını kabul etmek zorundadır.",
  "Norbert Wiener": "Norbert Wiener",
  "cybernetics": "sibernetik",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Robotlar bugün yetişkin çocuklar gibidir - onlar parayı yönetebilir, yasal ilişkilere girebilir, bağımsız olabilirler.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "İnsanlığın geleceği, robotlara yeteneklerini kullanmayı nasıl öğrettiğimize bağlıdır.",
  "Robonomics tools": "Robonomics araçları",
  "Operate with digital twins of IoT devices": "IoT cihazlarının dijital ikizleriyle çalışın",
  "The first tools of the robot economy: money for robots, contracts for robots": "Robot ekonomisinin ilk araçları: robotlar için para, robotlar için sözleşmeler",
  "Software for connecting devices to a decentralized cloud": "Cihazları merkezi olmayan bir buluta bağlamak için yazılım",
  "API library for custom IoT applications": "Özel IoT uygulamaları için API kitaplığı",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics, hem robotik hem de kullanıcı arayüzü tarafında IoT uygulamaları geliştirmek için eksiksiz bir araç seti içerir. Kullanıcı ve cihaz arasındaki iletişim, Web3 dünyasının en başarılı teknolojileri olan IPFS, Ethereum ve Polkadot kullanılarak gerçekleşir. Böylece geliştiriciler, Akıllı Şehirler ve Endüstri 4.0 için modern ve güvenli uygulamalar oluşturabilirler.",
  "Robonomics Connectivity": "Robonomics bağlantısı",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Geliştiricilerin kolay çalışabilmesi için Robonomics, aşağıdakileri bağlamak için bir dizi yazılım içerir: HTTP/MQTT protokolünü kullanan IoT cihazları, Robot İşletim Sistemini (ROS) kullanan karmaşık robotik sistemler.",
  "Connect a sensor": "Sensör bağla",
  "to the Robonomics network": "Robonomics ağına",
  "Try": "Dene",
  "a simple prototyping tool": "basit bir prototipleme aracı",
  "Start building your own cyber physical system with": "ile kendi siber fiziksel sisteminizi oluşturmaya başlayın.",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics Kullanıma Hazır Yüzlerce Robotu Destekliyor",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Platform kullanıcıları, ROS uyumlu robotları birkaç dakika içinde dijital ekonomiye bağlayabilir. Desteklenen robotların tam listesi için lütfen bağlantıyı takip edin",
  "Decentralized Cloud infrastructure for IoT": "IoT için Merkezi Olmayan Bulut altyapısı",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS), Robonomics Parachain ve IPFS'nin yanı sıra Robotik ve IoT için temel altyapı hizmetidir",
  "Robonomics web services (RWS)": "Robonomics web servi̇si̇ (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "Robot ekonomi̇si̇",
  "Core RWS features available for IoT today": "IoT için bugün kullanılabilen temel RWS özellikleri",
  "RWS PubSub Message Broker": "RWS PubSub Mesaj Aracısı",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "IPFS protokolüne dayalı bir p2p ağı üzerinden sınırsız mesajlaşma kullanın",
  "RWS Data Blockchainization Service": "RWS Veri Blok Zincirleme Hizmeti",
  "RWS Robot Actions": "RWS Robot Hareketleri",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Aç / kapa; merkezi olmayan bir bilgisayarın kontrolü altında IoT cihazlarınızı başlatın veya durdurun",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "IoT Uygulamanızın Kalbi - Blockchain'de Dijital İkiz",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "Teknik mimaride, IoT dijital ikizleri, nesnelerin ve ilgili olayların (örneğin, bir ürünün yapısını otomatik olarak yakalamak için IoT cihazlarının kullanılması) görünürlüğünü ve izlenmesini sağlar ve blokzincir üzerinde bunların durumuna ilişkin gerçeğin paylaşılan tek versiyonunu sağlar. Buna yaşam döngüleri ve ilgili iş olayları boyunca gerçekleşen her şey dahildir.",
  "from Gartner research": "Gartner araştırmasından",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Robonomics Parachain, bir dijital ikiz modeli oluşturma ve durumunu her 6 saniyede bir güncelleme fırsatı sunar.",
  "App Store for Robotics - Robonomics Marketplace": "Robotik için App Store - Robonomics Marketplace",
  "Companies that design and manufacture IoT-connected products and equipment should adopt a flexible digital twin delivery model to lower barriers to adoption, such as offering digital twins via marketplaces, rather than only offering digital twins via their own, proprietary, delivery model": "IoT bağlantılı ürün ve ekipman tasarlayan ve üreten şirketler, benimseme engellerini azaltmak için esnek bir dijital ikiz dağıtım modelini benimsemelidir",
  "The developed digital twin model can be directly linked with additional services that your company provides for the IoT industry": "Geliştirilen dijital ikiz model, şirketinizin IoT endüstrisi için sağladığı ek hizmetlerle doğrudan bağlantılı olabilir",
  "To make a delivery process convenient and simple for hundreds of customers, we have added a section of the services for robots marketplace. Take a look at the first examples of the implemented bundles of digital twin model + company automated service": "Bir teslimat sürecini yüzlerce müşteri için uygun ve basit hale getirmek için robot pazarına yönelik hizmetlerin bir bölümünü ekledik. Dijital ikiz model + şirket otomatik hizmetinin uygulanan paketlerinin ilk örneklerine bir göz atın",
  "You've got an idea for your service for robots or users? Then proceed to the step-by-step instructions for building your IoT application on the Robonomics platform.": "Robotlar veya kullanıcılar için hizmetiniz için bir fikriniz mi var? O zaman şimdi, IoT uygulamanızı Robonomics platformunda oluşturmak için adım adım talimatları izleyin.",
  "Secure": "Güvenli",
  "Serverless": "Sunucusuz",
  "Futuristic": "Fütüristik",
  "IoT applications": "IoT uygulamaları",
  "Robonomics network vision": "Robonomics ağı vizyonu",
  "At the frontier of cybernetics and economics": "Si̇berneti̇k ve ekonomi̇ni̇n sinirinda",
  "Build your IoT services on Robonomics platform": "Iot hi̇zmetleri̇ni̇zi̇ robonomics platformunda oluşturun",
  "taking full advantage of decentralized architecture": "merkezi olmayan mimariden tam olarak yararlanmak",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Robonomics, kullanıcıların kimlik doğrulama için kullanıcı veri aktarımı gerektirmeyenmerkezi olmayan uygulamaları (dapp) kullanarak akıllı cihazlara bağlanmasına olanaktanır. İletişim, merkezi olmayan bir sağlayıcı ağı aracılığıyla tek bir arızanoktası olmaksızın gerçekleşir ve cihaz, yürütme için çalıştırmak veya verileriuzaktan iletmek için blok zinciri ağından bağımsız olarak bilgi alır. BöyleceRobonomics, kullanıcı uygulamasından akıllı cihazın kullanıma sunulmasına kadariletişimin tüm aşamalarında yüksek düzeyde cihaz siber güvenliği ve kullanıcıveri gizliliği sağlar.",
  "From smart contracts to cross chain IoT platform": "Akilli sözleşmelerden çapraz zi̇nci̇r iot platformuna",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Robonomics projesi 6 yıldan daha fazla bir geçmişe sahiptir. Ethereum ağınınilk günlerinden itibaren 2015 yılında bağımsız bir merkezi olmayan sağlayıcı ağıkullanarak insan-makine iletişimini gösteren ilk deney için hazırlanmaya başladık.2021'in başlarında proje ekibi Ethereum ve IPFS üzerinde çalışan bir tekno-ekonomikmakine iletişim protokolü oluşturduk ve bunu Polkadot para zincirine dayalı buluttabanlı bir IoT platformunun unsurlarıyla tamamladık.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "Sonuç olarak, bugün, küresel bir merkezi olmayan bilgisayarın kontrolü altındakicihazlarla etkileşimi mümkün kılan fütüristik IoT uygulamaları oluşturmak içinhalihazırda hibrit bir platforma sahibiz.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Robonomics'in yaratıcıları, yaklaşımın bilimsel geçerliliğini anlamaya özengösteren ve yazılım çözümünün tüm mimarisinin temelini oluşturması gereken ilkelerisunmada netlik elde eden deneyciler, mühendisler ve bilim adamlarıdır.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "2017-2020 yılları arasındaki makalelerimizde, bilim camiasına, daha önce insanlariçin ayrılmış, temel ekonomik faaliyetleri gerçekleştirebilen bağımsız ajanlarolarak robotik cihazların hareket ettiği bir ekonomik sistem olan robot ekonomisifikri etrafında birleşmiş birçok kavram ve çözümü sunduk. Bilimsel makaleleribu",
  "this link": "linkten okuyabilirsiniz",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "Robot ekonomisinin ortaya çıkışını haklı çıkarmak ve bu kavramın neden yenisanayi devriminin büyük ölçekli robotik sistemlerinin işleyişine kaçınılmaz veaçık bir cevap olduğuna inandığımızı genel terimlerle açıklamak istiyoruz.",
  "Move towards the factory of the future": "Geleceğİn fabri̇kasina doğru",
  "Inspired by Ronald Coase": "Ronald Coase'den ilham alınmıştır",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Ekonomide Nobel ödüllü Ronald Coase, 1937 tarihli “Firmanın Doğası” adlı çalışmasında,“hiyerarşiye karşı serbest piyasa” ikilemini en iyi şekilde göstermiş ve kuruluşların,özellikle de firmaların varlığının nedenlerine ilişkin bir açıklama yapmıştır.Coase, bunun etkisini şu şekilde tartışmaktadır. Bir sözleşmenin akdedilmesineilişkin kararlar almak ve uygulanmasını izlemek için işlem maliyetlerinin (bilgitoplama ve işleme maliyeti) tüm hiyerarşik piyasa dışı yapısı ile firma, tüketiciyisağlamanın en verimli yolu olarak oluşturulmuştur. En düşük işlem maliyetine sahiphedef ürünle, piyasada bireyler arasındaki çoklu alışverişler yoluyla aynı ürünüyaratmaya yönelik işlemsel çabanın çok daha yüksek olduğu anda bu gerçekleşir.Bu süreci en iyi şekilde görselleştirmek için, bir araba satın almanın açıklayıcıörneğine bakın. Parçalarına göre bir araba almaya çalışın ve garajınızdaki tümbileşenleri bir araya getirmek için ne kadar para ve zaman harcayacağınızı hesaplayın.Parça satın alma maliyetleri, Tesla'nın hazır Model X'ine kıyasla çok yüksek.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Yine de bu, her şeyin üretimi için dünyanın tek bir firmasının ortaya çıkmasınayol açmaz. Buradaki ana nokta, aynı işlem maliyetlerinin firmaların büyüklüğünede kısıtlamalar getirmesidir. Coase şöyle yazıyor:'",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "“...bir firma, firma içinde fazladan bir işlem düzenlemenin maliyeti, aynı işlemiaçık piyasada bir takas yoluyla gerçekleştirmenin maliyetine eşit oluncaya kadargenişleme eğiliminde olacaktır...“",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Başka bir deyişle, firma içindeki hiyerarşi ne kadar karmaşıksa, iç maliyetlero kadar büyük olur ve bir noktada, piyasaya geri dönme maliyetlerine kıyasla aşırıoldukları ortaya çıkar. Bu nedenle, itici güçlerden biri olarak büyümelerini sağlamakiçin girişimciler bu maliyetleri düşürmenin yollarını arıyorlar.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "İş sürecindeki (üretim, lojistik, tüketim) tüm katılımcıların daha yakın bir",
  "clearly correlates": "düzeyde birleşme yeteneği yoluyla işlem maliyetlerini",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "azaltma fikri, otomasyon çözümleri üreticilerinin karşılaştığı sorunlar ve zorluklarlaaçıkça ilişkilidir. Son 50 yılda, büyük şirketlerin çoğu iş süreçlerinin standart/düzenliişlemleri neredeyse tamamen otomatikleştirildi. Tedarik zincirinin tam otomatikparçaları arasında güvenli iletişim kurma görevi esasen üreticilere bırakılmıştırve bu görev, otomasyon yoluyla işlem maliyetlerinin daha da azaltılmasını engelleyenbir faktördür. Kısmen otomatikleştirilmiş firmalara kıyasla daha rekabetçi ürünveya",
  "firms spurs the search for solutions to": "hizmet pazarlama arzusu, bu zorluklara çözüm",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "arayışlarını teşvik eder. Görünüşe göre her şey robofirmlerin(robot firmalarının)- tüm iş süreci döngüsünün tamamen otomatik olduğu ve yararlanıcılar ve tüketicilerdışında insan katılımı gerektirmeyen organizasyonların - ortaya çıkmasına doğrugidiyor.",
  "Get rid of transaction costs": "İşlem mali̇yetleri̇nden kurtulun",
  "Our future in smart cities": "Akilli şehi̇rlerde geleceğİmi̇z",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Bugün otomasyon üreticilerinin karşı karşıya olduğu görevin belirli bir adı vardır: - siber-fiziksel sistemlerin (CPS olarak kısaltılır inşası. Tanım",
  "definition,": "olarak,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "bir CPS, çoklu hesaplama, ağ oluşturma ve fiziksel süreçlerin güçlü bir birleşimi ve karşılıklı entegrasyonudur.",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "CPS oluşturma görevleri, yeni (dördüncü) sanayi devriminde tanımlanan herhangibir fikrin merkezinde yer alır. Bu nedenle CPS, Akıllı Şehirlerdeki gelecektekiyaşamımızın temel taşıdır ve her yerde kendini gösterir. Geleceğin siber-fizikselsistemlerine örnekler: Uber otopilot, drone selfie''leri, metro istasyonlarındaki3D yazıcı ağı.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "CPS, birbirine bağlı birçok öğeden oluşan karmaşık bir yapıdır: telefondakiuygulamadan, dronun şehir üzerinde uçuşunu kontrol etmeye kadar uzanır ve ardındanortaya çıkan fotoğrafları Instagram''da yayınlamaya devam eder, ancak yalnızcabulut AI tarafından işlendikten sonra.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "CPS tasarım sürecindeki en önemli şey, hizmet kullanıcısı tedarik zincirindekiyeterli ve aşırı sayıda otomatik öğe arasındaki ince çizgiyi bulmaktır. Başkabir deyişle, CPS'nin boyut sınırı nerede? Bu soruyu cevaplamak için ünlü matematikçiNorbert Wiener'e kulak vermeliyiz.",
  "Self-regulating systems": "Kendi̇ni̇ denetleyen si̇stemler",
  "Inspired by Norbert Wiener": "Norbert Wiener'den ilham alınmıştır",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works 'Cybernetics: Or Control and Communication in the Animal and the Machine'. He used the term 'cybernetics' as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday": "1948''de MIT''de matematik profesörü Norbert Wiener en ufuk açıcı çalışmalardanbirini yayınladı 'Sibernetik: Hayvan ve Makinede Kontrol ve İletişim'. 'Sibernetik' terimini kendi kendini düzenleyen mekanizmalar olarak kullandı. ilk kez ve bunedenle, bu yayın, tanınan bir Sibernetik doğum günü olarak kabul edilir.",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Norbert Wiener, disiplinler arası bilim yaklaşımının uygulanabilirliğinden bahsediyordu.Örneğin, otomatik kontrol sistemleri ile insan toplumunun ölçeklenmesi ve karmaşıklığınınartması zorlukları arasındaki paralellikleri çizdi.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Başka bir deyişle, sibernetik yaklaşım psikoterapiye, biyolojiye ve otomatiknavigasyona eşit olarak uygulanabilir. Sistemin işlevine, bireysel eylemlerinnasıl kontrol edildiğine ve bireysel düğümlerin birbirleriyle nasıl etkileşimegirdiğine dayanır.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Ronald Coase ve Norbert Wiener'in yayınlarını dikkate alarak, Endüstri 4.0'ıngelişimini takip ederek, robotize hizmetleri tasarlarken CPS'yi ekonomik bir ajanolarak kullanmayı düşünebiliriz. CPS'nin boyutunu düzenlemek ve bireylerin değişenihtiyaçlarına uyum sağlamak için piyasa mekanizmasını kullanabiliriz.",
  "And what’s so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this": "Ve bilimsel olarak ilginç olan şey, piyasanın firmanın büyüklüğüne getirdiğikısıtlamalar fikrini temel alarak, CPS'deki artışın sınırının her zaman piyasatarafından belirleneceğini ve bunun için başka hiçbir şeye gerek olmadığını söyleyebiliriz.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Robofirms, siber-fiziksel sistemler için ideal bir temsildir. Hem insanlarahem de diğer robotlara para karşılığında hizmet verebilen oldukça özerk bir birimdir.Sonuç olarak, robot ekonomisi bize doğrudan pazara hizmet ve mal sağlayan genelbir CPS seti gibi görünüyor.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Robotlar İçİn para",
  "Industry 1.0": "Endüstri 1.0",
  "Mechanization:": "mekanizasyon:",
  "replacement of muscle power with steam energy.": "kas gücünün buhar enerjisi ile değiştirilmesi.",
  "1784 y.": "1784",
  "Industry 2.0": "Endüstri 2.0",
  "Electrification:": "elektrifikasyon:",
  "introduction of assembly-line production.": "montaj hattı üretimine giriş.",
  "1870 y.": "1870",
  "Industry 3.0": "Endüstri 3.0",
  "Automation:": "Otomasyon:",
  "introduction of automated systems with CNC.": "CNC ile otomatik sistemlerin tanıtımı.",
  "1969 y.": "1969",
  "Industry 4.0": "Endüstri 4.0",
  "Smart production:": "Akıllı üretim:",
  "development of cyber physical systems.": "siber fiziksel sistemlerin geliştirilmesi.",
  "Now": "Şimdi",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "Robofirms dünyasında, robotların daha önce sadece insanların ihtiyaç duyduğu sosyal kurumlara erişimini sağlamak hayatın olağan akışına uygun görünüyor.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Sosyal kurumlar bizler insanız diye ortaya çıkmaz ve fizyolojik olarak bir insanbankalar, sözleşmeler ve toplumun diğer araçları olmadan yaşayamaz. Ancak sadecebir noktada bir kişi, toplumda daha karmaşık ilişkiler yoluna girdiği ve çevremizdekilerinsüreçlerini hızlandırmak için önemli bir adım attığı için.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Para ve sözleşmeler robotların kullanımına sunulmalı, çünkü bu Skynet'in neolduğunu unutmuş robot hayranlarının hasta bir fantezisi değil. Ancak yeni sanayidevrimi, hem teknik bilgi hem de ekonomik bilgi alışverişini etkileyecek ve aynızamanda insanların erişemeyeceği bir hızda ilerleyecek olan karmaşık otomatikzincirler inşa etme görevini üstlendiği için.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to “charge” your ride with uber and make it faster.": "Deneylerimizin örneklerinden biri şu şekilde: sıkışıklığı azaltmak için otonomaraçlar için yol alanı ve geçiş hakkı ödemelerinin pazarlığı. Trafikte bir kişininrobotlar olmadan kesinlikle yapamayacağı bir şey düşünelim. Araba sizin için zorlukçekmeden yapacak: şerit değiştirmek istiyorsunuz, araba ve komşunuzun arabasıböyle bir işlemin maliyetine saniyede yüzlerce mesaj hızında teklif verirse, birdenge fiyatı ortaya çıkaracak ve bu yüzden zaten bir sonraki daha hızlı hareketeden şeride geçeceksiniz.Bu, şimdi kullanılabilir hale geleceği anlamına geliyoryolculuğunuzu uber ile 'şarj etmek' ve daha hızlı hale getirmek için.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Robotlar, yalnızca makinelerin karar verebileceği hızda, bir kişi olmadan işlemlerigerçekleştirebilmek için doğrudan ellerinde olacak paraya ihtiyaç duyarlar. Vetüm bunlar sadece bir kişinin Akıllı Şehir'de hayattan zevk alması içindir!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "Ve burada sorunsuz bir şekilde ilk elektronik paraya geliyoruz - Bitcoin. Bitcoin'inbanka değil, cüzdanınızdaki nakit prensibiyle hesabınızda saklanabilmesi, onurobotun bağımsız, daha doğrusu otonom olarak yönetebildiği ilk para yapıyor. Aynızamanda bugün Bitcoin'in sadece elektronik para değil, gerçek anlamda küreselbir finans kurumu olduğunu şimdiden söyleyebiliriz.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "Sonuç olarak: Bizim tarafımızdan icat edilmemiş, ancak açıkça vizyonumuza girenbir olay, Bitcoin''i robotlar için ilk para haline getiriyor veya daha da derineinersek, robotik firmaların oluşumuna yardımcı olacak tam da bu sosyal kurum.",
  "Smart contracts": "Akilli sözleşmeler",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": "Bitcoin, robotların kullanabileceği ilk para oldu. Bu arada, tam teşekküllüteknik ve ekonomik değişim için bir araç olarak mevcut haliyle Bitcoin hakkındakonuşamayız.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Artık, insanlığın insan ekonomisinin tam otomatik bir parçasını - robot ekonomisini- yaratma olasılığını açan robotlar arasında mesaj alışverişi yapmak için akıllısözleşmelere, DeFi pazarlarına ve merkezi olmayan bir altyapıya sahibiz.",
  "One of the great opportunity to build the economy of robots is": " Robotların ekonomisini inşa etmek için en büyük fırsatlardan biri",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "teknolojisidir. Ethereum işlevselliği ile robotlar sadece para alışverişi yapmakla kalmaz, aynı zamanda insanlarla ve kendi aralarında sözleşmeler yapabilirler.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Ancak makineden makineye (m2m) sözleşmeye dayalı iletişimin anlamı nedir? Buharika bir soru! CPS'ye geri dönelim. Sensörler, makine ekipmanı veya diğer unsurlararasındaki doğrudan iletişimden bahsettiğimizde, yine de düzenlenmiş bir sistemiçindeki işbirliğinden bahsediyoruz. Ancak akıllı şehir hizmetlerinin canlı (hattabazı durumlarda akıllı ev) olmasını istiyorsak, çeşitli üçüncü taraf unsurlarlailetişim kurmamız gerekir.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Drone teslimat hizmetini düşünelim. Örneğin bir drone, DHL'in mülküyse, Amazon'undepolarına nasıl erişebilir veya şehrin tüm hava sahasına nasıl erişebilir? Tekelmi olacak? Bu, birçok 4. sanayi devrimi girişimi için büyük bir zorluktur!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Çoğu şirket, kendi kurumsal yapılarının dışında otomatik sistemler arasındateknik bilgi alışverişini güvenli bir şekilde nasıl kuracaklarını bilmediklerinden,çevreleri üzerinde neredeyse tam haklara ihtiyaçları olduğunu söylüyor. Aynı zamandabir kişinin çalıştığı süreçlere bakarsanız, farklı kurumların işbirliğinin uzunsüredir var olduğunu ve başarılı bir şekilde var olduğunu görüyoruz. Amazon websitesinde satın alınan malların kapıdan kapıya teslimatını kolayca sipariş edebilirsinizve kurye şehir yollarında araba kullanabilir, depoda sipariş alabilir ve sizegetirebilir.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Fark ne? İlk durumda, makineler arasında sözleşmeye dayalı bir ilişki kurmanınbir yolu yoktur ve ikinci durumda, insanların dünyasında sözleşmeye dayalı ilişkilerzaten mevcuttur.",
  "Parachains": "Müzayedeler",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Bugün Robonomics'in karşılaştığı ana zorluk, Ethereum kullanarak bir IoT cihazıbaşlatmanın yüksek fiyatıdır. Ethereum'da, her işlem için ABD doları cinsinden10 ila 100 dolar arasında bir komisyon ödemeniz gerekir. Çoğu için oldukça pahalıdır.Gerçek ekonomiden vakalar, araba paylaşım gezisi, akıllı bir daire kiralama, droneteslimatı veya sipariş vermek için en sevdiğiniz anime kahramanının 3D baskısıolsun.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Dürüst olmak gerekirse, 2018 - 2019 Ethereum ağında işlem ücretleriyle bilekarlı senaryolar olduğunu belirtmek isteriz. Örneğin, otomatik karbon ayak iziofset işlemleri veya siparişin web sitesinden doğrudan üretime aktarılması. Ancakyine de web3 teknolojilerinin IoT alanında toplu olarak uygulanması için bulutunbağlı cihazdan aldığı ücretin düşürülmesi gerekiyor.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Bir IoT cihazıyla etkileşim maliyetini azaltmak için bir fırsat arayan Robonomicsgeliştiricileri, Ethereum'a alternatif geliştirmeler üzerinde çalıştı. Seçimimiz,güvenliğin projemizden bağımsız doğrulayıcılar tarafından sağlandığı ortak birağ içinde kendi blok zincirimizi çalıştırmamıza izin verecek olan",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": " mimarisine karar verdi.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Heterojen Blockchain Ağı",
  "Homogeneous Shard Network": "Homojen Parça Ağı",
  "On-chain protocol control": "Zincir-içi protokol kontrolü",
  "Protection against the tyranny of the crowd": "Kalabalığın zorbalığına karşı koruma",
  "Auction of bandwidth in the common network": "Ortak ağda bant genişliği açık artırması",
  "Payment for gas by users": "Kullanıcılar tarafından gaz için ödeme",
  "Have you read this?": "Bunu okudunuz mu?",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection": "Harika kitaplar harika fikirlere yol açar. İnsan-makine iletişimi hakkında dahafazla ilham almak istiyorsanız, bilim kurgu kitapları okumayı deneyin. Halihazırdaokuduğunuz kitapları işaretleyin ve daha fazla düşünmeniz için size başka nelersunabileceğimizi görün.",
  "Philip K. Dick": "Philip K. Dick",
  "Autofac": "Autofac",
  "I, Robot": "I, Robot",
  "Isaac Asimov": "Isaac Asimov",
  "The Bicentennial Man": "The Bicentennial Man",
  "Neuromancer": "Neuromancer",
  "William Gibson": "William Gibson",
  "Marionettes, Inc.": "Marionetlər, Inc.",
  "Ray Bradbury": "Ray Bradbury",
  "Open questions of teleology": "Teleolojinin açık soruları",
  "and a treatise by L. von Mises": "ve L. von Mises'in bir incelemesi",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "Sonuç olarak, küresel bir bakış açısıyla açık kalan sorulara değinmek istiyoruz. Robotların amacı nedir?",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots": "Aslında, insanların ekonomisi genellikle sözleşme çerçevesinde görevleri yerinegetirme vicdanı, tarafların bir sonuca ulaşma arzusu, bireyin toplumdaki fırsatçıve fedakar davranışları ile ilişkilendirilir. Tüm bu ilkelerin robot ekonomisineuygulanması zordur. Robot ekonomisinin nedenleri nelerdir? Robotları daha iyianlamak ve uygulamak için toplumda araştırmamız ve tartışmamız gereken açık birsoru.",
  "For the start we suggest to look at Mises's work 'Human Action: A Treatise on Economics' (praxeological approach) and at early article by Norbert Wiener 'Behavior, Purpose and Teleology' (teleological vision).": "Başlangıç ​​olarak, Mises''in 'İnsan Eylemi: Ekonomi Üzerine Bir İnceleme' (praxeological yaklaşım) adlı çalışmasına ve Norbert Wiener''in 'Behavior, Purpose and Teleology' (teleolojik vizyon) adlı ilk makalesine bakmayı öneriyoruz.",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Praxeology, amaçlara doğrudan bağımlı olmadan insan davranışı hakkında ilginçfikirlerle bize ilham verir. Bu bize, nihai hedeflere dalmadan, bir kara kutugibi koşullu olarak robot ekonomisinin süreçleri üzerinde çalışma fırsatı verir.Aynı zamanda, teleoloji, nedenleri açıklamak için bir zorluk teşkil eder.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Mises ve Wiener'in çalışmalarının kesiştiği bir yerde, robot ekonomisinin dahada geliştirilmesi için bir noktanın bulunabileceğini umuyoruz, sadece insanlarve makineler arasında prakseolojik nitelikte bir etkileşim protokolü olarak değil,teleolojik türler arası iletişim kurma unsurları olarak düşünüyoruz.",
  "or": "veya"
}