{
  "What is Robonomics network?": "Robonomi̇cs nedi̇r??",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics, IoT uygulamaları için açık kaynaklı bir platformdur. Kullanıcı uygulamaları, IoT hizmetleri ve karmaşık robotik arasında atomik işlemler şeklinde teknik ve ekonomik bilgi alışverişini uygulayan yeni nesil internet teknolojilerini (web3) destekler.",
  "Get started": "Başla",
  "Explore Robonomics": "Robonomics'i Keşfet",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Robonomics, IoT pazarı için herkes tarafından kullanılabilen açık kaynaklı bir teknolojidir. Daha fazla bilgi için bir yönetici özeti okuyun",
  "Get XRT": "XRT'yi alın",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT, Ethereum ağı ve Robonomics parachain üzerindeki IoT cihazlarını kontrol etmeyi mümkün kılan yardımcı dijital varlıktır.",
  "Use a Dapp": "Dapp Kullan",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "IoT cihazlarını yönetmek için merkezi olmayan uygulamanın Beta sürümüne bir göz atın",
  "Start building": "İnşa etmeye başla",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Robonomics WIKI'de öğreticiler ve pratik olarak faydalı eğitimler yoluyla Robonomics öğrenin",
  "Robonomics objectives": "Robonomics hedefleri",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Robonomics, bulut platformlarının başarılarına dayanarak, insan-makine iletişiminin her aşamasında IoT pazarına daha güvenli ve daha gelişmiş İnternet çözümleri sunmayı hedefliyor. Robonomics'in geliştirilmekte olduğu ana görevler vardır",
  "IoT device management with a decentralized cloud": "Merkezi olmayan bir bulut ile IoT cihaz yönetimi",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Blokzinciri ağları, cihaz başlatma ve telemetri alma için en yüksek düzeyde güvenlik sağlamak için tüm parametrelere sahiptir. Bir cihazla etkileşim, aslında blok zinciri ağında depolanan dijital ikizin durumunu değiştirerek ve bu değişikliklerle ilgili bilgileri fiziksel cihaza ileterek tanımlanabilir. İzinsiz bir blok zinciri kullanılması durumunda, sağlayıcıların küresel kullanılabilirliğinden ve dijital ikizin istenmeyen değişikliklere karşı yüksek düzeyde veri korumasından emin olabiliriz.",
  "Techno-economic transactions between humans and machines": "İnsanlar ve makineler arasındaki tekno-ekonomik işlemler",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Otomatik sistemlerin kripto paralar ve akıllı sözleşmeler aracılığıyla doğrudan dijital pazarlara erişimi konusunda kurumsal başarılardan bahsedebiliriz. Örneğin, Ethereum, ekonomik faaliyetin temel araçlarının çoğunu zaten uyguluyor. Son kullanıcı ve IoT cihazlarını birbirine bağlamak için bugün oluşturulan uygulamalar, ödeme ve hizmet koşullarının cihazın başlatma parametrelerinden ayrılamaz olması durumunda çok daha verimli olacaktır.",
  "Serverless IoT applications for users": "Kullanıcılar için Sunucusuz IoT uygulamaları",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Modern uygulamaların kullanıcılarının mahremiyeti sorusu, şirketlerin web3 alanındaki modern gelişmeleri kullanamamasına takılıp kalmamalıdır. Telemetriye erişmek ve cihazı kontrol etmek için kimlik doğrulaması yapmaya veya belirli sunuculara bağlantı gerektirmeye gerek yoktur.",
  "Learn with Robonomics": "Robonomics İle öğren",
  "Introduction course": "Giriş Kursu",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "IoT geliştiricileri ve kullanıcıları için web3 teknolojileri ve Robonomics araçlarıyla modern Nesnelerin İnterneti uygulamalarının oluşturulmasında ortaya çıkan sorunlara ve olası çözümlere dalın.",
  "Boston dynamics spot software developing": "Boston Dynamics Spot Yazılım Geliştirme",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Size Spot SDK eğitim programını tanıtmaktan heyecan duyuyoruz! Amacımız, sizi Spot'un SDK'sına alıştırmak ve laboratuvarımızda bir Boston Dynamics Spot robotu kullanarak becerilerinizi uzaktan test etmenize olanak sağlamaktır.",
  "Sovereign smart home with robonomics and home assistant": "Robonomi ve Ev Asistanı ile Egemen Akıllı Ev",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "Bu kursta, ana avantajı kullanıcı verilerinin güvenliği / gizliliği olan kendi egemen akıllı evinizi inşa etmek için gerekli tüm adımları atacaksınız.",
  "Shop": " Mağaza",
  "Science papers": "Bi̇li̇msel çalişmalar",
  "Books": "Ki̇taplar",
  "Logo and assets": "Logo ve varliklar",
  "Blog": "Blog",
  "Ambassador program": "Elçİli̇k programi",
  "Contacts": "İleti̇şİmler",
  "White Paper 2022": "White paper 2022",
  "Timeline": "Zaman çİzelgesi̇",
  "Tokenomics": "Tokenomi̇k",
  "Parachain": "Parachain",
  "User (D)App": "Kullanıcı (D)App'ı",
  "Function request": "Fonksiyon İsteği",
  "Report": "Raporla",
  "Control": "Kontrol",
  "Log": "Log",
  "IoT Device": "IoT Cihaz",
  "Decentralized application": "Merkezi̇ olmayan uygulama",
  "Digital twin": "Dijital İkiz",
  "IoT / Smart device": "Iot / Akilli ci̇haz",
  "Robonomics tokenomics": "Robonomics tokenomiksleri̇",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": ",Polkadot ekosistemindeki Ethereum ağı ve Robonomics parachain üzerindeki IoT cihazlarını kontrol etmeyi mümkün kılacak yardımcı program simgesidir.",
  "The task": "Görev",
  "Be aware of scammers": "Dolandırıcılara dikkat edin",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "XRT alışverişi yapmak için lütfen yalnızca iyi bilinen pazarları kullanın. Size özel mesajlarda verilen hesaplara hangi işlemi yapmak isterseniz (token almak veya satmak) tokenlerinizi göndermeyiniz. Robonomics belirteci hakkında herhangi bir 'gürültülü ifade' aldıysanız (dolandırıcılar genellikle airdrop duyurusu gibi bir şey kullanır), resmi güncellemeler için lütfen bu web sitesini (https://robonomics.network/) veya",
  "for official updates. Be careful, be safe.": "'ımızı kontrol edin. Dikkatli ol, güvende ol.",
  "XRT in Ethereum": "Ethereum'da XRT",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "2015 - 2018'de Robonomics projesini uygulayan proje ekibinin, Robonomics Network tarafından faydalı bir işlevin sağlanması, yani IoT cihazlarının hizmet olarak robot modeline göre piyasaya sürülmesi ile geri ödenmesi arasında bir bağlantı bulması gerekiyordu. Ethereum'daki gaz ücretleri için Robonomics sağlayıcılarına maliyeti. Her bir akıllı cihazın bir hizmeti yerine getirme sorumluluğunun yaşam döngüsü hakkında düşünmemiz gerekiyordu. Robonomics'teki ilk Ar-Ge'nin bir sonucu olarak ekip, oluşturulan her bir hizmet olarak robot akıllı sözleşmesini ödüllendirmek için yeni belirteç madenciliği için bir mekanizma geliştirdi. Bu model, Robonomics'in Ethereum'daki geleceği için geçerli olmaya devam ediyor, ancak yalnızca Ethereum'da önemli iyileştirmelerle.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Ethereum ekosistemindeki XRT ekibinin tarihsel geçmişini ve uzun vadeli planlarını öğrenmek için bunu okuyun.",
  "Etherscan profile": "Etherscan profili",
  "View token smart contract and transactions in Ethereum network here.": "Token akıllı sözleşmesini ve Ethereum ağındaki işlemleri burada görüntüleyin.",
  "Coingecko markets": "Coingecko piyasaları",
  "Here you can find CEX and DEX markets for trading XRT.": "Burada XRT ticareti için CEX ve DEX piyasalarını bulabilirsiniz.",
  "XRT In Polkadot": "Polkadot'ta XRT",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Ethereum'dan Polkadot'a geçerken, tokenomikte bir 'ölçek büyütme' yapmamız gerekiyor. Polkadot ekosistemindeki parachain'ler, akıllı bir sözleşmenin eşdeğeri değil, genel ağın bir bölümünü kiralayan tamamen programlanabilir bir blok zinciridir.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Polkadot ve Kusama parachains'in asıl ödemesi, açık artırmalardan birini kazanmak için yeterli miktarda yerli Relay zincir belirteçlerinin (DOT / KSM) uzun vadeli bağlanmasıdır. Robonomics parachain'deki XRT, yuva yenilemeyi ve paydaşlar için ödülleri destekler. IoT aboneliklerinin aktivasyonunun altında yatan XRT yazma mekanizması, enflasyonu minimuma indirmek ve faizin artması durumunda sıfıra indirmek için tasarlanmıştır.",
  "Learn more": "Ağ mimarımızın",
  "in Twitter thread from our network architect.": "Twitter başlığında daha fazla bilgi edinin.",
  "Usage:": "Kullanım:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT, hem parachain üzerinde işlem gerçekleştirme ücretlerini ödemek hem de cihaz veya kullanıcı IoT işlemlerinin öncelikli olarak işlenmesini garanti eden bir IoT aboneliği satın almak için kullanılabilir.",
  "Rewards:": "Ödüller:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Parachain, parachain harmanlayıcılarını teşvik etmek için yıl boyunca az miktarda XRT yayınlar.",
  "The parameter of the total reward": "Yıl için harmanlayıcılar için toplam ödülün parametresi,",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "token sahiplerinin zincirleme oylamasıyla belirlenir ve bir referandum düzenlenerek değiştirilebilir.",
  "Use XRT": "XRT'yi kullan",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Merkezi olmayan uygulamamızda IoT aboneliği satın alın. Herhangi bir merkezi şirket gözlemi olmadan akıllı cihazlarınızı blockchain üzerinden kontrol edin.",
  "Subscan profile": "Subscan profili",
  "View token statistics on top of Polkadot ecosystem.": "Polkadot ekosisteminin tepesinde belirteç istatistiklerini görüntüleyin",
  "Other questions": "Di̇ğer sorular",
  "What is RWS?": "RWS nedir?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Çekirdek işlevsellik geliştiriliyor] Mühendisler için Core Dev ekibi, farklı Robonomics kullanım modelleri oluşturmaya çalışacak ve bu yolda ilk adım, ömür boyu abonelik belirteci olan RWS belirtecini başlatmak olacak. Her bir RWS belirteci, Robonomics Parachain üzerinden IoT cihazınızdan/cihazınıza saniyede 1 işlem (tps) verecektir. RWS jetonunuzu etkinleştirin ve yürütme öncesi ve öngörülebilir gecikme ile   'bedava gaz' işlemleri yapın. RWS jetonunu devre dışı bırakın ve DEX'te ticaret yapın.",
  "What is AIRA/AIR ID?": "AIRA/AIR ID nedir?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Pre-XRT belirteci, 2017'de Ethereum'daki Robonomics altyapısının özerk bir parçası olarak dağıtıldı. Robonomics'in 2019'da Ethereum üzerinden başarılı bir şekilde piyasaya sürülmesinden sonra, AIRA belirteçleri, XRT öncesi ERC-20 XRT'ye otonom ve bağımsız takas sürecini garanti eden",
  "ambix smart contract": "ambix akıllı sözleşme",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "aracılığıyla projenin oluşturulan altyapısına bağlandı.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "Robonomics belirtecinin, Blockchain altyapısında Akıllı Şehirler ve Endüstri 4.0'ın bakımı için merkezi olmayan bir ağın çalışmasını sağlamaktır. Bu hedefe ulaşmak için, belirteç ekonomisinin ağın uygulanmasına yönelik teşvikleri yansıtması gerekir.",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Merkezi olmayan uygulama (dapp) Blockchain içinde çalışır. Açık kaynak kodludur ve verileri IPFS ve Github üzerinde sunulur. Bu teknolojiler uygulamanın aynı zamanda güvenli ve şeffaf olmasını sağlar. Geliştiricilerimiz hem Robonomics'in uygulamasının geliştirilmesi hem de kendi dapp'ınızı oluştururken kullanabileceğiniz kütüphaneler üzerinde çalışmaktadır.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Digital Twin, Robonomics Web Services (RWS) tarafından sağlanan araçlardan biridir. Gerçek dünyadaki ekipmanın dijital bir versiyonu gibi davranır ve tüm teknik özelliklerini kopyalar. Merkezi olmayan bir uygulamanın kullanıcının komutlarına daha duyarlı olmasını sağlar.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Robonomics'i, evinizin/ofisinizin çeşitli yönlerini otomatikleştirmek ve kontrol etmek için çok çeşitli Zigbee akıllı cihazlarla kullanabilir veya daha karmaşık endüstriyel görevler için ROS tabanlı robotlarla birlikte kullanabilirsiniz.",
  "Do Androids Dream of Electric Sheep?": "Androidler Elektrikli Koyun Düşler mi?",
  "Sleeping Mew Space": "Uyuyan Mew Uzayı",
  "Are you ready for Mars?": "Mars'a hazır mısın?",
  "Shiva Robot": "Şiva Robotu",
  "Space Travelers": "Uzay Yolcuları",
  "Retro Astronaut": "Retro Astronot",
  "New Newton": "Yeni Newton",
  "Your email": "E-posta adresiniz",
  "Want emails from robonomics": "Robonomics'ten e-posta almak istiyorum",
  "Adding you to our special list...": "Sizi özel listemize ekliyoruz...",
  "Nice, you are in the list": "Harika, listedesin!",
  "Something went  wrong. Try again later": "Bir şeyler yanlış gitti. Daha sonra tekrar deneyin",
  "Robonomics art shop": "Robonomi̇k sanat mağazasi",
  "Welcome to our brand new online shop on": "robonomics.threadless.com adresindeki yepyeni çevrimiçi mağazamıza hoş geldiniz!",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "Mağazamızda robot teknolojisine, teknolojiye ve sanata olan sevgimizi gösteren giysiler, aksesuarlar, ev dekorasyonu ve diğer ürünler bulunmaktadır. Robonomics sanatçıları tarafından yapılan benzersiz tasarımlarımız ve Threadless'tan arkadaşlar tarafından işlenmiş üretim ve nakliye ile t-shirt, uzun kollu, kapşonlu, duş perdesi, yastık, battaniye ve diğer kullanışlı ürünleri bulabilirsiniz. Eğlence!",
  "Shop now on threadless": "Şİmdi̇ threadless üzeri̇nden alişveri̇ş yapin",
  "alternative shop": "alternatif mağaza",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Yıl büyük bir başarı ile başladı - Robonomics 20. parachain slot müzayedesini kazandı ve Kusama ağında ",
  "officially became": "resmi olarak ID 2048 ile bir parachain oldu",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": " Lansman, datalog, DigitalTwin, sorumluluk işlevleri ve IoT abonelikleri ekosistemin tüm kullanıcıları tarafından kullanılabilir hale geldi • Projenin bu aşamasına ilişkin ayrıntıları sağlamak için, çekirdek ekip",
  "Robonomics Whitepaper 2.0.": "Robonomics Teknik İncelemesi 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "in ilk bölümlerini yayınladı. Substrate üzerinde Robonomics 2.0, XCM mesajları desteğiyle yayınlandı ve diğer parachain'lerle kanal oluşturdu.(örneğin, İşlevselliği bizim için son derece yararlı olan Crust Shadow ve Darwinia).",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "Aynı zamanda, IoT pazarını protokolümüze dahil etmek için bir stratejinin kilidini açtık. Nesnelerin İnterneti ekipmanıyla yaptığımız deneyler, bizi merkezi bulut hizmeti sağlayıcılarından bağımsız, egemen bir akıllı ev konseptine götürdü. Home Assistant otomasyon sistemi ile",
  "integration": "entegrasyonumuzu",
  "with the Home Assistant automation system, and also designed our own": "geliştirdik ve ayrıca akıllı cihazları bağlamak için kendi",
  "IoT gateway": "IoT ağ geçidimizi",
  "for connecting smart devices.": "tasarladık.",
  "We have launched two big initiatives in order to increase community engagement —": "Topluluk katılımını artırmak için iki büyük girişim başlattık:",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Elçisi Programı",
  "Additionally,": "Ayrıca",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "Robonomics topluluğunun yönetişim mekanizmalarımızı ilk kez deneyebilmesi için sonbaharda düzenlendi. Son zamanlarda Robonomics ekibi, DAO IPCI projesinin akıllı binalar için karbon denkleştirme hizmeti sunmak üzere bir parachain yuvası elde etmesine yardımcı oldu.",
  "In 2021, our": "2021 yılında",
  "main focus": "asıl odak noktamız",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "IoT uygulamalarının Kusama ağındaki parachain'imiz üzerinden kullanılabilmesi için proje hazırlamak oldu. Substrate üzerinde Robonomics 1.0 piyasaya sürüldü ve dijital ikiz işlevselliğini geliştirmenin yanı sıra telemetri verilerini göndermek için parachain'e bağlanan sensörleri test ediyoruz. Yılın ortasında, ağımızın tam döngüsünü test etmeye karar verdik ve Robonomics parachain'in entegre edildiği (Kusama geçiş zincirine taşınmadan önce)",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "adlı kendi geçiş zincirimizi oluşturduk. Birkaç kitle kredisi kampanyası düzenlediğimiz Kusama'da bir parachain slotu edinmeye çokça odaklanıldı.",
  "There have been two big changes for the community. First, we launched the": "Topluluk için iki büyük değişiklik oldu. İlk olarak web3, robotik ve IoT projelerinin Ar-Ge görevleri için fon almasını sağlayan",
  "Robonomics Grant Program": "Robonomics Hibe Programını",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "başlattık. Yıl sonu itibarıyla programa 4 aktif proje katıldı. İkinci olarak ekip",
  "Exodus process": "Exodus sürecini",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "başlatarak Ethereum token sahiplerinin XRT tokenlerini parachain'e taşımalarına izin verdi.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "İşbirlikleri arasında, kendisi için bir",
  "rental remote control system": "kiralık uzaktan kumanda sistemi",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "geliştirilen Boston Dynamics Spot'un MerkleBot'taki olağanüstü görünümünü hatırlayabiliriz. Robonomics mühendislerinden oluşan bir ekip tarafından oluşturulmuş kişisel bir proje olan Multi-Agent Systems firması hakkında da sizleri bilgilendirmek isteriz. Kahve dükkanı sahipleri için yemek pişirme görevlerini yerine getiren Eisenchoch adlı robotik bir waffle fırını geliştirdiler.",
  "There came a time when the existing limitations of Ethereum": "Ethereum'un mevcut sınırlamalarının (özellikle zayıf ölçeklenebilirlik, düşük hız ve çok yüksek işlem maliyeti)",
  "began to stand out clearly": "açıkça öne çıkmaya başladığı",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "bir zaman geldi. ETH2.0'a yükseltmenin durumu düzeltmesi gerekiyordu, ancak bu yükseltme defalarca ertelendi. Ethereum ağından ayrılmak istemesek de mevcut durumda kullanım durumlarımızı uygulamanın zor olduğunu fark ettik ve alternatif bir ağ aramaya başladık. Parçalanmış blockchain ekosistemi Polkadot bu alternatif haline geldi. Ana Robonomics özelliklerini taşımak ve kendi test ağımızı dağıtmak için Substrate çerçevesini deneyerek başladık. Bu aşamanın sonunda, parachain'imizi Rococo test ağına konuşlandırdık ve Kusama ağında bir slot almak için hazırlanmaya başladık.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Nesnelerin İnterneti sistemlerini incelemeye devam ederek, Robonomics'in kullanıcılara değer katabilecek ana işlevini belirledik: Nesnelerin İnterneti için merkezi olmayan bulut işlevi. Bu fikir,",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "temelini oluşturdu. RWS altyapısı, tipik bir merkezi bulutun tüm işlevlerini üstlendi, ve bunu standart küresel kullanılabilirlik, güvenlik ve gizlilik sorunları olmadan yaptı. Ek olarak, abonelik sahiplerinin her işlem için bir ücret ödemek zorunda kalmadan blockchain ağını kullanmalarına olanak tanıyan parachain IoT abonelikleri fikrini bulduk. IoT abonelikleriyle yapılan ilk deney, sahibinin blok başına 1 işlem göndermesine izin veren RWS belirtecinin yayımlanmasıydı. Ek olarak, akıllı cihazların kontrolü için kendi donanım kitimizi (DAOS konsepti) geliştirmek için ilk adımları atmaya başladık.",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Tabii ki, Ethereum'da Robonomics'e verilen destek durmadı. Robonomics iletişim yığını,",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "sürümüne son halini verdi. XRT belirteci birkaç borsada (özellikle Uniswap DEX) işlem görmeye başladı ve likidite teşvik programı başlatıldı.",
  "The team actively developed ways to interact with the community. The first version of our": "Ekip aktif olarak toplulukla etkileşim kurmanın yollarını geliştirdi.",
  "dapp": "Dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "sitemizin ve Robonomics Wiki'nin ilk versiyonu yayınlandı. Daha şeffaf ve uygun proje yönetimi için ",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "yu kullanmaya başladık. Projeye yeni başlayanlar için ",
  "Robonomics Winter School": "Robonomics Kış Okulu'nu",
  "in 2019 for newcomers to the project.": "2019 yılında ağırladık.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Cana yakın projelerle işbirlikleri de devam etti. Robonomics ve DAO IPCI, duyusal verileri toplamak ve analiz etmek için bir hizmet olan",
  "Robonomics became the foundation for the": "'ı tanıttı. Robonomics, robot ekipmanlarının akıllı bir şekilde kiralanması için bir sistem geliştiren",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "projesinin temeli oldu.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Otonom ajanların güvenilir teknik ve ekonomik operasyonlarını sağlayacak bir ortama ihtiyaçları olduğunu anladık. Birkaç yıldır, robot aracıların hizmetlerini sağlamasına yardımcı olan merkezi olmayan bir sağlayıcılar ağı oluşturmak için bir protokol geliştiriyorduk. Ağ bakımı ve Ethereum ile ROS arasındaki iletişim yığını için araçlar geliştirilmiştir. 2018'd",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "'ı yayınladık ve Robonomics Network'ün alfa sürümü Ethereum ana ağında başlatıldı. XRT token oluşturma etkinliği için aktif hazırlıklar devam etti (Nihayetinde ilk kripto kışı nedeniyle 2019 baharında gerçekleşti).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "Bu dönemden itibaren Robonomics, Endüstri 4.0 ile ilgili kullanım senaryolarını (akıllı fabrikalar, akıllı şehirler ve akıllı evler) dinamik olarak geliştirmeye başladı ve bu, IoT dünyasına olan yakın ilgimizi çekti. İnovasyon arayışında olan ekip, birkaç büyük ve benzersiz Ar-Ge demosu sundu: bir sivil",
  "sensor network": "sensör ağı",
  "a water drone": "çevresel izleme için bir su uçağı",
  "for environmental monitoring (supported by a sensor systems manufacturer": "(sensör sistemleri üreticisi",
  "Libelium": "Libelium tarafından destekleniyor),",
  "a smart factory model": "bir akıllı fabrika modeli",
  "a self-employed": "bağımsız bir",
  "robot artist Gaka-chu": "robot sanatçısı Gaka-chu",
  "and a": "ve",
  "drone traffic management system": "bir drone trafik yönetim sistemi",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics, web3 teknolojilerini ve IoT cihazlarını kullanarak çevresel varlık yönetimi konusunda DAO IPCI projesi ile işbirliğine başladı.",
  "Important news &amp; announcements": "Важные новости и объявления",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Bu, p2p teknolojilerinin daha önce robotik için mevcut olmayan yeteneklere sahip olduğu bir dizi görev belirlediğimiz aktif bir Ar-Ge dönemiydi. Ethereum bilgisayarı, IPFS dosya depolaması ve Robot İşletim Sistemini (ROS) birleştirerek, herhangi bir cihazın potansiyel olarak",
  "autonomous intelligent robot agent": "otonom bir akıllı robot aracısı",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "haline gelebileceğini fark ettik. Bu da bizim için Hizmet olarak Robot ve robot ekonomisi kavramlarına giden yolu açtı.",
  "Our publications in scientific journals of this period are available in the": "Bu döneme ait bilimsel dergilerdeki yayınlarımıza ",
  "Papers section": "Bildiriler bölümünden ulaşabilirsiniz.",
  "We have collected all R&D projects over the years in the": "Yıllar boyunca tüm Ar-Ge projelerini",
  "a handy book": "kullanışlı bir kitapta topladık.",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Her şey, Ethereum ana ağını yeni başlattığında kurucuların aklına gelen bir fikirle başladı. Robot, kripto para birimi için bir müşteri için bir görev gerçekleştirirse ve mantığı bir akıllı sözleşme tarafından kontrol edilirse ne olur?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Fikri test etmek için, kullanıcı bir ödeme işlemini tamamladıktan sonra belirtilen GPS koordinatlarına ulaşmak için bir Ethereum bilgisayarı tarafından kontrol edilen bir drone'un başlatıldığı bir demo yaptık.",
  "The demo is available on": "Demo",
  "YouTube": "YouTube'da mevcuttur.",
  "Infrastructure && tech development timeline": "Altyapi && teknoloji̇ geli̇şti̇rme zaman çİzelgesi̇",
  "Notable events": "Önemli olaylar",
  "World Economic Forum Annual Meeting 2022": "Dünya Ekonomik Forumu Yıllık Toplantısı 2022",
  "Polkadot Decoded 2022": "Polkadot'un Kodu Çözüldü 2022",
  "On the Way to Sovereign Home Automation": "Egemen Ev Otomasyonuna Giden Yolda",
  "Becoming a Parachain for IoT Applications": "IoT Uygulamaları için Parachain Olmak",
  "Polkadot Decoded 2021": "Polkadot'un Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (robonomics sponsorluğunda)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Kış Okulu 2021 (Robonomys'in ev sahipliğinde)",
  "Transition to Multinetwork — Along Came Polkadot": "Çoklu Ağa Geçiş — Polkadot geldi",
  "The Rise of Robonomics Network": "Robonomik Ağın Yükselişi",
  "Crypto Valley Conference 2018": "Kripto Vadisi Konferansı 2018",
  "European Parliament workshop 'The Economy of Robots'": "Avrupa Parlamentosu çalıştayı 'Robotların Ekonomisi'",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "MIT Media Lab'de Robotik Sistemler için Blockchain Sempozyumu",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics-2018 yaz okulu (Robonomics ekibi ev sahipliğinde)",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Web3 Teknolojilerini ve Robotik Çerçeveleri Bir Araya Getirmek",
  "Playing with Human-Machine Interaction through Ethereum": "Ethereum aracılığıyla İnsan-Makine Etkileşimi ile Oynama",
  "Robonomics whitepaper 2022 welcome guide": "Robonomics 2022 Teknik İnceleme klavuzuna hoşgeldiniz",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Ethereum ve IPFS üzerinde çalışan bir tekno-ekonomik makine iletişim protokolü geliştirdik ve bunu Polkadot parachain'ine dayalı bulut tabanlı bir IoT platformunun unsurlarıyla tamamladık. Bugün, fütüristik IoT uygulamaları oluşturmak için zaten bir hibrit platformumuz var. Bu platformumuz, küresel bir merkezi olmayan bilgisayarın kontrolü altındaki cihazlarla etkileşim sağlıyor. Robonomics platformunu kullanarak güvenli, sunucusuz ve fütüristik IoT uygulamaları oluşturmaya başlamadan önce gelin biraz teoriye dalalım...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Robonomics teknik incelemesinin ilk iki bölümü zaten kullanıcılara sunulmuştur.",
  "Chapter 1.": "Bölüm 1.",
  "At the intersection of cybernetics and economics": "Si̇berneti̇k ve ekonomi̇ni̇n kesi̇şİmi̇",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Robotik cihazların, daha önce insanlar için ayrılmış olan, temel ekonomik faaliyetleri gerçekleştirebilen bağımsız unsurlar olarak hareket ettiği bir ekonomik sistem sunduk. Bu bölümde, insanların hayatlarının önemli bir parçası haline gelebilecek ve gelecekte ekonominin mevcut seviyesini tam otomatik hizmetlere dönüştürebilecek robot ekonomisi hakkında konuşacağız.",
  "In this chapter you will learn": "Bu bölümde öğrenecekleriniz",
  "Ronald Coase and The Nature of the Firm": "Ronald Coase ve Şirketlerin Doğası",
  "CPS - cyber-physical system": "CPS- siber fiziksel sistem",
  "Norbert Wiener and the search for patterns in living and machine": "НNorbert Wiener ve aktif makine sistemlerinde örüntü arayışı",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Dördüncü Sanayi Devrimi, Robotlar ve Bitcoin için Par",
  "Ethereum Smart Contracts": "Ethereum Akıllı Kontratları",
  "Polkadot Parachains": "Polkadot Parachainleri",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Teleoloji ve Mises'in çalışmasına ilişkin açık sorular",
  "Read chapter 1": "1. bölümü okuyun",
  "Chapter 2.": "Bölüm 2.",
  "Robonomics architecture": "Robonomi̇cs mi̇mari̇si̇",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "İkinci bölümde, IoT cihazlarından merkezi olmayan ve küresel olarak erişilebilir bir sağlayıcı ağına kadar modern İnternet teknolojisini kullanan insan-makine etkileşimi hakkında bilgi edineceksiniz. IoT sistemlerinin yaratıcılarının karşılaştığı ve Robonomics'in çözümünün hedeflendiği sorunları ve ana zorlukları vurgulamak için Nesnelerin İnterneti'nin temellerine bakacağız.",
  "Overview of the state of the Internet of Things (IoT)": "Nesnelerin İnterneti'nin (IoT) durumuna genel bakış",
  "Classification of IoT devices": "IoT cihazlarının sınıflandırılması",
  "Embedded IoT systems": "Gömülü IoT sistemleri",
  "Edge-systems: IoT gateways and controllers": "Uç sistemler: IoT ağ geçitleri ve denetleyiciler",
  "Autonomous Systems": "Otonom Sistemler",
  "Internet of Things providers": "Nesnelerin İnterneti sağlayıcıları",
  "Digital twins are the heart of the Internet of Things": "Dijital ikizler Nesnelerin İnterneti'nin kalbidir",
  "IoT data flows in cloud service": "Bulut hizmetinde IoT veri akışları",
  "Popular examples of IoT solutions": "IoT çözümlerinin popüler örnekleri",
  "Current problems of building IoT solutions": "IoT çözümler oluşturma konusundaki güncel sorunlar",
  "Main tasks of Robonomics architecture": "Robonomics mimarisinin ana görevleri",
  "Basic components of Robonomics architecture": "Robonomics mimarisinin temel bileşenleri",
  "A simple representation of Robonomics architecture": "Robonomics mimarisinin basit bir temsili",
  "Read chapter 2": "2. bölümü okuyun",
  "We continue to update the white paper of Robonomics": "web sitemizde ve Discord'da yeni bölümler için bizi izlemeye devam edin",
  "stay tuned for new parts on our website and in Discord": "следите за выходом новых частей на сайте и в Discord",
  "Join our discord": "Discordumuza katilin",
  "Robonomics logos and usage": "Robonomics logolari ve kullanimi",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Nasıl kullanabileceğinizi göstermek için Robonomics logolarını, renklerini, varlıklarını ve yönergelerini bir araya getirdik.",
  "Download Robonomics logo": "Robonomics logosunu İndi̇ri̇n",
  "Download RWS logo": "RWS logosunu İndi̇r",
  "Download wiki logo": "Wiki logosunu İndi̇ri̇n",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Robonomics, RWS veya Robonomics Wiki'ye bağlanmak için bu izin verilen logoları kullanın",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Robonomics ile entegre olduğunuzu başkalarına bildirmek için izin verilen Robonomics logosunu kullanıns",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Robonomics teknolojisi ve entegre projelerle ilgili blog gönderilerinde, makalelerde ve slaytlarda izin verilen logoları kullanın",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "İzin verilen Robonomics logolarını, rengini, boyutlarını değiştirmek veya başka kelimelerle veya tasarım öğeleriyle birleştirmek dahil olmak üzere değiştirmeyin",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Robonomics logosunu ve adını, Robonomics olduğunuzu, teklifinizin veya projenizin Robonomics'e ait olduğunu veya Robonomics'in sizi, teklifinizi veya projenizi Robonomics DAO tarafından onaylanmamışsa desteklediğini gösterecek şekilde kullanmayın",
  "Robonomics Color pallet": "Robonomics renk paleti̇",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Arayüzlerimizde, baskılarımızda ve diğer görsellerimizde kullandığımız bu renkler. </br> Slaytlarınız, Robonomik hakkında bilgi veren yazılarınız için afişleriniz vb. için kullanın."
}