{
  "What is Robonomics network?": "Що таке robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics— це платформа з відкритим вихiдним кодом для програм Інтернету речей. Ми підтримуємо нове покоління інтернет-технологій (web3), які реалізують обмін технічною та економічною інформацією у формі атомарних транзакцій між додатками користувача, сервісами Інтернету речей і складною робототехнікою.",
  "Get started": "Вступ",
  "Explore Robonomics": "Відкрийте для себе Робономіку",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Робономіка — це доступна для кожного технологія з відкритим вихідним кодом для ринку Інтернету речей. Щоб дізнатися більше, прочитайте основні тези",
  "Get XRT": "Токен XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT — протокольний токен, який дозволяє керувати IoT-пристроями  поверх мережі Ethereum та парачейна Робономіки",
  "Use a Dapp": "Скористайтеся Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Подивіться бета-версію децентралізованої програми для керування пристроями IoT",
  "Start building": "Спробуйте на практиці",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Вивчіть Робономіку за допомогою навчальних посібників та практично корисних експериментів",
  "Robonomics objectives": "Задачі Робономіки",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Спираючись на досягнення хмарних платформ, Робономіка прагне запропонувати ринку IoT більш безпечні та вдосконалені інтернет рішення на кожному етапі спілкування між людиною та машиною. Нижче наведено основні целі, для яких розробляється Робономіка",
  "IoT device management with a decentralized cloud": "Керування IoT-пристроєм за допомогою децентралізованої хмари",
  "Blockchain networks have all the parameters to ensure the highest level of security for device launch and receiving telemetry. Interaction with a device can actually be described by changing the state of the digital twin stored in the blockchain network and delivering information about these changes to the physical device. In the case of using a permissionless blockchain, we can be sure of the global availability of providers, as well as a high level of data protection of the digital twin from unwanted changes.": "Блокчейн мережі мають усі параметри для забезпечення найвищого ступеня безпеки запуску пристрою та отримання телеметрії. Взаємодія з пристроєм фактично можна описати зміною стану цифрового двійника, що зберігається в блокчейн мережі, та доставкою інформації про зміни фізичного пристрою. У випадку використання permissionless blockchain ми можемо бути впевнені в глобальній доступності провайдерів, а також високому рівні захисту даних цифрового двійника від небажаних змін.",
  "Techno-economic transactions between humans and machines": "Техніко-економічні транзакції між людьми та машинами",
  "We can talk about institutional achievements in terms of access of automated systems directly to digital markets through cryptocurrencies and smart contracts. For example, Ethereum already implements most of the basic tools of economic activity. The applications created today to connect the end user and IoT devices will be much more efficient if the payment and terms of service are inseparable from the launch parameters of the device.": "Ми можемо говорити про інституційні досягнення у плані доступу автоматичних систем безпосередньо до цифрових ринків за допомогою криптовалют та розумних контрактів. Наприклад, Ethereum вже реалізує більшість базових інструментів економічної діяльності. Програми, що створюються сьогодні для зв'язку кінцевого користувача та IoT-пристрою, будуть набагато ефективнішими, якщо оплата та умови надання послуги будуть нерозривні з параметрами запуску пристрою.",
  "Serverless IoT applications for users": "Безсерверні IoT програми користувачів",
  "The question of the privacy of users of modern applications should not be stuck in the inability of companies to use modern advances in the field of web3. There is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Питання приватності користувачів сучасних програм не повинно стикатися з невмінням компаній використовувати сучасні досягнення в галузі web3. Немає необхідності виконувати автентифікацію або вимагати підключення до конкретних серверів для доступу до телеметрії та керування пристроєм.",
  "Learn with Robonomics": "Вчиться з Robonomics",
  "Introduction course": "Вступний курс",
  "Dive into the problems that arise around building modern Internet of Things applications and possible solutions with web3 technologies and Robonomics tools for IoT developers and users.": "Пориньте у проблеми, що виникають при створенні сучасних програм Інтернету речей, і можливі рішення за допомогою технологій web3 та інструментів Robonomics для розробників та користувачів Інтернету речей.",
  "Boston dynamics spot software developing": "Розробка програмного забезпечення для Spot від Boston Dynamics",
  "We are excited to introduce you the Spot SDK educational program! Our goal is to get you familiar with Spot’s SDK and allow you to test your skills remotely using a Boston Dynamics Spot robot in our lab.": "Ми раді представити вам освітню програму Spot SDK! Наша мета — познайомити вас із SDK Spot і дати можливість віддалено перевірити свої навички за допомогою робота Spot від Boston Dynamics у нашій лабораторії.",
  "Sovereign smart home with robonomics and home assistant": "Суверенний Розумний Дім З Robonomics Та Home Assistant",
  "In this course, you will go through all the steps required in order to build your own sovereign smart home, the main advantage of which is the safety / privacy of user data.": "У цьому курсі ви пройдете всі кроки, необхідні для того, щоб побудувати свій власний суверенний розумний будинок, головною перевагою якого є безпека/конфіденційність даних користувача.",
  "Shop": "Магазин",
  "Science papers": "Наукові статті",
  "Books": "Книги",
  "Logo and assets": "Лого та асети",
  "Blog": "Блог",
  "Ambassador program": "Амбасадорська програма",
  "Contacts": "Контакти",
  "White Paper 2022": "Біла книга 2022",
  "Timeline": "Таймлайн",
  "Tokenomics": "Токеноміка",
  "Parachain": "Парачейн",
  "User (D)App": "(D)App користувача",
  "Function request": "Запит",
  "Report": "Звіт",
  "Control": "Дія",
  "Log": "Лог",
  "IoT Device": "IoT-пристрій",
  "Decentralized application": "Децентралізований додаток",
  "Digital twin": "Цифровий двійник",
  "IoT / Smart device": "IoT / Розумний пристрій",
  "Robonomics tokenomics": "Токеноміка rRbonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "— це службовий токен, який дозволить керувати IoT-пристроями поверх мережі Ethereum та парачейну Robonomics в екосистемі Polkadot.",
  "The task": "Завдання",
  "Be aware of scammers": "Стережіться шахраїв",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "будь ласка, використовуйте тільки відомі ринки для обміну XRT. Не надсилайте свої токени на акаунти, надіслані вам в особистих повідомленнях, яку б транзакцію ви не хотіли зробити (купити або продати токен). Якщо ви отримали будь-які «гучні заяви» про токені Robonomics (шахраї часто використовують щось на зразок оголошення про airdrop), будь ласка, перевірте цей сайт (https://robonomics.network/) або наш",
  "for official updates. Be careful, be safe.": "для отримання офіційних оновлень. Будьте обережні, будьте у безпеці.",
  "XRT in Ethereum": "XRT у Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реалізуючи проект Robonomics у 2015-2018, команді проекту необхідно було знайти зв'язок між забезпеченням мережею Robonomics корисної функції, а саме запуском IoT-пристроїв за моделлю «робот як послуга», та відшкодуванням витрат провайдерів Robonomics на комісію за газ у Ethereum. Нам потрібно було подумати про життєвий цикл зобов'язання кожного окремого смарт-пристрою за виконання послуги. В результаті ранніх досліджень та розробок у Robonomics команда розробила механізм майнінгу нових токенів для винагороди кожного створеного смарт-контракту формату «робот як послуга». Ця модель залишається життєздатною для майбутнього Robonomics на Ethereum, але лише зі значними покращеннями у Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочитайте це, щоб дізнатися про історію та довгострокові плани команди на XRT в екосистемі Ethereum.",
  "Etherscan profile": "Etherscan профіль",
  "View token smart contract and transactions in Ethereum network here.": "Переглянути смарт-контракт токена та транзакції у мережі Ethereum можна тут.",
  "Coingecko markets": "Біржі Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Тут ви можете знайти біржі CEX та DEX для торгівлі XRT.",
  "XRT In Polkadot": "XRT у Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходячи від Ethereum до Polkadot, нам потрібно «масштабуватися» у токеноміці. Парачейни в екосистемі Polkadot не є еквівалентами смарт-контрактів, а є повністю програмованим блокчейном, що орендує сегмент всієї мережі.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактичний платіж з боку парачейнів Polkadot і Kusama — це довгострокове зв'язування нативних токенів Relay chain (DOT/KSM) у кількості, достатньої для перемоги в одному з аукціонів. XRT у парачейні Robonomics підтримує оновлення слотів та винагороди для стейкхолдерів. Механізм спалювання XRT, що лежить в основі активації IoT-підписок, покликаний знизити інфляцію до мінімуму, а у разі підвищеного інтересу до нуля.",
  "Learn more": "Дізнайтесь більше",
  "in Twitter thread from our network architect.": "у гілці Twitter від нашого архітектора мережі.",
  "Usage:": "Використання:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можна використовувати як для оплати комісій за виконання транзакцій у парачейні, так і для покупки IoT-підписки, яка гарантує пріоритетну обробку IoT-транзакцій пристроїв або користувачів.",
  "Rewards:": "Нагороди:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Протягом року парачейн випускає невелику кількість XRT, щоб стимулювати колаторів парачейну.",
  "The parameter of the total reward": "Параметр загальної винагороди",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для колаторів протягом року визначається ончейн-голосуванням власників токенів і може бути змінений шляхом проведення референдуму.",
  "Use XRT": "Використовуйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купуйте IoT-підписку у нашому децентралізованому додатку. Керуйте своїми розумними пристроями через блокчейн без спостереження будь-якої централізованої корпорації.",
  "Subscan profile": "Subscan профіль",
  "View token statistics on top of Polkadot ecosystem.": "Переглядайте статистику токенів в екосистемі Polkadot.",
  "Other questions": "Інші питання",
  "What is RWS?": "Що таке RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Розробляється основна функціональність] Для інженерів команда Core Dev спробує створити різні моделі використання Robonomics, і першим кроком на цьому шляху буде запуск токена довічної підписки — токена RWS. Кожен токен RWS дає вам 1 транзакцію в секунду (tps) з/на ваш IoT-пристрій через парачейн Robonomics. Активуйте свій токен RWS і робіть транзакції з «безкоштовним газом» із попереднім виконанням та передбачуваною затримкою. Деактивуйте токен RWS та обміняйте його на DEX.",
  "What is AIRA/AIR ID?": "Що таке AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Токен Pre-XRT був поширений у 2017 році як автономна частина майбутньої інфраструктури Robonomics на Ethereum. Після успішного запуску Robonomics над Ethereum у 2019 році токени AIRA були підключені до створеної інфраструктури проекту через",
  "ambix smart contract": "смарт-контракт ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "який гарантував автономний і незалежний процес обміну pre-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "токена Robonomics — забезпечити роботу децентралізованої мережі для обслуговування Розумних міст та Індустрії 4.0 в інфраструктурі блокчейну. Для досягнення цієї мети економіка токена повинна відбивати стимули для реалізації мережі",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Децентралізований додаток (dapp) працює в рамках Blockchain. Він має відкритий вихідний код, а його дані розміщуються на IPFS та Github. Ці технології дозволяють додатку бути одночасно безпечним і прозорим. Наші розробники працюють як над розробкою додатку Robonomics, так і над бібліотеками, які ви можете використовувати при створенні власного dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Цифровий двійник — це один із інструментів, що надаються Robonomics Web Services (RWS). Він діє як цифрова версія реального обладнання та копіює всі його технічні характеристики. Це дозволяє зробити децентралізовану програму більш чуйною на команди користувача.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Ви можете використовувати Robonomics з широким спектром розумних пристроїв Zigbee для автоматизації та управління різними аспектами вашого будинку/офісу або використовувати її з робототехнікою на основі ROS для більш складних промислових завдань.",
  "Do Androids Dream of Electric Sheep?": "Чи мріють андроїди про електричних овець?",
  "Sleeping Mew Space": "Сплячий Мяу-Космос",
  "Are you ready for Mars?": "А ви готові до Марса?",
  "Shiva Robot": "Робот Шива",
  "Space Travelers": "Космічні Мандрівники",
  "Retro Astronaut": "Ретро Астронавт",
  "New Newton": "Новий Ньютон",
  "Your email": "Ваш адрес электронной почты",
  "Want emails from robonomics": "Бажаєте листи від robonomics",
  "Adding you to our special list...": "додаючи вас до нашого спеціального списк...",
  "Nice, you are in the list": "Чудово, ви у списку",
  "Something went  wrong. Try again later": "Щось пішло не так. Спробуйте ще раз пізніше",
  "Robonomics art shop": "Арт-магазин Robonomics",
  "Welcome to our brand new online shop on": "Ласкаво просимо до нашого нового інтернет-магазину на",
  "Our shop features clothing, accessories, home decor and other items that display our love for robotics, technology and art. You can find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful products with our unique designs made by Robonomics artists and processed production&shipping by fellows from Threadless. Enjoy!": "У нашому магазині представлений одяг, аксесуари, предмети інтер'єру та інші товари, які демонструють нашу любов до робототехніки, технологій та мистецтва. Ви можете знайти футболки, лонгсліви, толстовки, фіранки для ванної, подушки, ковдри та інші корисні товари з унікальним дизайном, створеним художниками Robonomics, а виробництво та доставка здійснюються співробітниками Threadless. Насолоджуйтесь!",
  "Shop now on threadless": "Купуйте зараз на threadless",
  "alternative shop": "альтернативна крамниця",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Рік почався з великого досягнення — Robonomics виграла 20-й аукціон слотів парачейна і",
  "officially became": "офіційно стала",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "стала парачейном з ID 2048 у мережі Kusama. Функції launch, datalog, DigitalTwin, liability та IoT-підписки стали доступні всім користувачам екосистеми. Щоб надати детальну інформацію про цей етап проекту, команда розробників опублікувала перші розділи",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 на Substrate була випущена з підтримкою XCM-повідомлень, і ми почали відкривати HRMP-канали з іншими парачейнами (такими як Crust Shadow та Darwinia), функціонал яких нам дуже корисний.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "У той же час, ми розблокували стратегію впровадження нашого протоколу на ринок IoT. Наші експерименти з IoT-обладнанням привели нас до концепції розумного будинку, незалежного від централізованих постачальників хмарних послуг. Ми розробили свою",
  "integration": "інтеграцію",
  "with the Home Assistant automation system, and also designed our own": "із системою автоматизації Home Assistant, а також розробили власний",
  "IoT gateway": "IoT-шлюз",
  "for connecting smart devices.": "для підключення розумних пристроїв.",
  "We have launched two big initiatives in order to increase community engagement —": "Ми запустили дві великі ініціативи для підвищення залучення спільноти —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Крім того, восени було проведено",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "щоб співтовариство Robonomics могло вперше випробувати наші механізми управління. Нещодавно команда Robonomics допомогла проекту DAO IPCI отримати слот для парачейна, щоб презентувати сервіс компенсації викидів вуглецю для розумних будівель.",
  "In 2021, our": "У 2021 році наша",
  "main focus": "основна увага",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "перейшла на підготовку проекту до використання IoT-додатків за допомогою нашого парачейна в мережі Kusama. Було випущено Robonomics 1.0 на Substrate, протестовано підключення датчиків до парачейну з метою відправлення їх телеметрії, а також розроблено функції цифрового двійника. У середині року ми вирішили протестувати повний цикл нашої мережі та створили власний релей-чейн під назвою",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "о якого був інтегрований парачейн Robonomics (до міграції до Kusama). Великий фокус був сконцентрований на отриманні слота парачейна в Kusama, для чого ми організували кілька краудлоан-кампаній.",
  "There have been two big changes for the community. First, we launched the": "Для громади відбулися дві великі зміни. По-перше, ми запустили",
  "Robonomics Grant Program": "програму грантів Robonomics",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "яка дозволяє проектам web3, робототехніки та IoT отримувати фінансування для виконання завдань R&D розробок. До кінця року в програмі взяли участь чотири активні проекти. По-друге, команда розпочала",
  "Exodus process": "процесс Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "що дозволяє власникам токенів Ethereum перемістити свої токени XRT у парачейн.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Серед колаборацій можна згадати помітну появу Boston Dynamics Spot у MerkleBot, для якого була розроблена",
  "rental remote control system": "система оренди віддаленого управління роботом",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Також варто згадати появу компанії Multi-Agent Systems, яка є особистим проектом команди інженерів Robonomics. Вони розробили робота-кухаря під назвою Eisenkoch, який може випікати вафлі для відвідувачів кав'ярень.",
  "There came a time when the existing limitations of Ethereum": "У цей період стали",
  "began to stand out clearly": "чітко виділятися існуючі",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "обмеження мережі Ethereum (зокрема, погана масштабованість, низька швидкість та дуже висока вартість транзакцій). Оновлення до ETH2.0 мало виправити ситуацію, але це оновлення неодноразово відкладалося. Ми не хотіли залишати мережу Ethereum, але зрозуміли, що в поточній ситуації складно реалізувати наші сценарії застосування і почали шукати альтернативну мережу. Цією альтернативою стала сегментована блокчейн-екосистема Polkadot. Ми почали експериментувати з фреймворком Substrate, щоб перенести основні функції Robonomics і розгорнути власну тестову мережу. До кінця цього етапу ми розгорнули наш парачейн у тестовій мережі Rococo і розпочали підготовку до отримання слоту у мережі Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Продовжуючи вивчати IoT-системи, ми визначили основний функціонал Robonomics, який може принести цінність користувачам — функцію децентралізованої хмари для IoT. Ця ідея стала основою",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Інфраструктура RWS взяла на себе всі функції типової централізованої хмари, але без стандартних проблем глобальної доступності, безпеки та конфіденційності. Крім того, ми запропонували ідею IoT-підписок для парачейну, яка дозволяє власникам підписки використовувати блокчейн-мережу без необхідності сплачувати комісію за кожну транзакцію. Першим експериментом з IoT-підписками стала емісія токена RWS, який дозволяє його власнику відправляти 1 транзакцію на блок парачейну. Крім того, ми почали робити перші кроки щодо розробки власного апаратного набору для керування розумними пристроями (концепція DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Зрозуміло, що підтримка Robonomics на Ethereum не припинилася. Комунікаційний стек Robonomics було доопрацьовано до версії",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Токен XRT почав торгуватися на кількох біржах (зокрема, Uniswap DEX), а також було запущено програму підтримки ліквідності.",
  "The team actively developed ways to interact with the community. The first version of our": "Команда активно розробляла способи взаємодії із співтовариством. Була запущена перша версія нашого",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "и Robonomics Wiki. Для більш прозорого та зручного керування проектами ми почали використовувати",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "У 2019 році ми провели",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "ля початківців у проекті.",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data — ": "Співпраця із дружніми проектами також була продовжена. Robonomics та проект DAO IPCI представили сервіс для збору та аналізу сенсорних даних — ",
  "Robonomics became the foundation for the": "Robonomics стала основою для проекту",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "який розробляє систему розумного лізингу роботизованого обладнання.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Ми розуміли, що автономним агентам потрібне середовище, що забезпечує їх надійну технічну та економічну діяльність. Декілька років ми розробляли протокол для створення децентралізованої мережі провайдерів, які допомагають роботам-агентам надавати свої послуги. Були розроблені інструменти для обслуговування мережі та комунікаційний стек між Ethereum та ROS. У 2018 році ми опублікували",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "після чого була запущена альфа-версія мережі Robonomics в Ethereum. Ми продовжили активну підготовку до генерації токенів XRT (яка затрималася до весни 2019 року через першу криптозиму).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "З цього періоду Robonomics почала динамічно розробляти сценарії застосування, пов'язані з Індустрією 4.0 – розумні фабрики, розумні міста та розумні будинки – і це привернуло нашу пильну увагу до світу Інтернету речей. У пошуках інновацій команда представила кілька великих та унікальних R&D демонстрацій: цивільна",
  "sensor network": "мережа датчиків",
  "a water drone": "водний дрон",
  "for environmental monitoring (supported by a sensor systems manufacturer": "для моніторингу навколишнього середовища (за підтримки виробника сенсорних систем",
  "a smart factory model": "модель розумної фабрики",
  "a self-employed": "заробляє незалежно від людини - ",
  "robot artist Gaka-chu": "робот-художник Gaka-chu",
  "and a": "та",
  "drone traffic management system": "система управління трафіком дронів",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics розпочала співпрацю з проектом DAO IPCI з управління екологічними активами з використанням технологій web3 та IoT-пристроїв.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Це був період активної R&D діяльності, в ході якої ми визначили коло завдань, в яких p2p-технології мають можливості, недоступні раніше для робототехніки. Об'єднавши комп'ютер Ethereum, файлове сховище IPFS і Robot Operating System (ROS), ми зрозуміли, що будь-який пристрій може стати",
  "autonomous intelligent robot agent": "автономним розумним роботом-агентом",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "У свою чергу, це відкрило нам шлях до концепцій Robot-as-a-Service та економіки роботів.",
  "Our publications in scientific journals of this period are available in the": "Наші публікації у наукових журналах цього періоду доступні у розділі",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Всі R&D проекти за ці роки доступні у",
  "a handy book": "зручній книзі",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Все почалося з ідеї, яка спала на думку засновникам проекту, коли Ethereum тільки запустив свою основну мережу. Що якщо робот виконуватиме роботу для клієнта за криптовалюту, а його логіка керується смарт-контрактом?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Щоб перевірити ідею, ми зробили демонстрацію, де дрон, керований комп'ютером Ethereum, запускався для досягнення заданих GPS-координат після того, як користувач здійснив платіжну транзакцію.",
  "The demo is available on": "Демо доступне на",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Таймлайн разработки інфраструктури та технології",
  "Notable events": "Визначні події",
  "World Economic Forum Annual Meeting 2022": "World Economic Forum Annual Meeting 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "On the Way to Sovereign Home Automation": "На шляху до автоматизації суверенного будинку",
  "Becoming a Parachain for IoT Applications": "Становлення парачейном для IoT-додатків",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (за допомогою Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Robonomics Winter School 2021 (організована Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Трансформація в мультимережу - І прийшов Polkadot",
  "The Rise of Robonomics Network": "Розквіт мережі Robonomics",
  "Crypto Valley Conference 2018": "Crypto Valley Conference 2018",
  "European Parliament workshop 'The Economy of Robots'": "Семінар на тему 'Економіка Роботів' у Європарламенті",
  "Consensus 2018": "Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Symposium on Blockchain for Robotic Systems у MIT Media Lab",
  "Robonomics-2018 summer school hosted by Robonomics team.": "Robonomics Summer School 2018, організована командою Robonomics",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Об'єднання web3-технологій та фреймворків робототехніки",
  "Playing with Human-Machine Interaction through Ethereum": "Розважаючись із людино-машинною взаємодією через Ethereum",
  "Robonomics whitepaper 2022 welcome guide": "Гайд по білому папері Robonomics 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Ми розробили техніко-економічний машинний протокол зв’язку, який працює на основі Ethereum і IPFS, і доповнюємо його елементами хмарної платформи IoT на основі парачейну Polkadot. Сьогодні ми вже маємо гібридну платформу для створення футуристичних додатків IoT. Він забезпечує взаємодію з пристроями під управлінням глобального децентралізованого комп'ютера. Перш ніж ми почнемо створювати безпечні, безсерверні та футуристичні додатки IoT за допомогою платформи Robonomics, давайте трохи зануримося в теорію...",
  "The first two chapters of the Robonomics white paper are already available to users.": "Перші два розділи білого паперу Robonomics вже доступні для користувачів.",
  "Chapter 1.": "Розділ 1.",
  "At the intersection of cybernetics and economics": "На стику кібернетики та економіки",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Ми представили економічну систему, в якій роботизовані пристрої діють як незалежні агенти, здатні виконувати ключові економічні види діяльності, раніше зарезервовані для людей. У цьому розділі ми поговоримо про актуальність роботизованої економіки, яка може стати важливою частиною життя людей і змінити поточний рівень економіки на повністю автоматизовані послуги в майбутньому.",
  "In this chapter you will learn": "У цьому розділі ви дізнаєтеся",
  "Ronald Coase and The Nature of the Firm": "Рональд Коуз і природа фірми",
  "CPS - cyber-physical system": "КФС — кіберфізична система",
  "Norbert Wiener and the search for patterns in living and machine": "Норберт Вінер та пошук закономірностей у живому та машинному",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Четверта промислова революція, гроші для роботів і біткойн",
  "Ethereum Smart Contracts": "Розумні контракти Ethereum",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Відкриті питання телеології та творчість Мізеса",
  "Read chapter 1": "Прочитайте розділ 1",
  "Chapter 2.": "Розділ 2. ",
  "Robonomics architecture": "Архітектура Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "У другому розділі ви прочитаєте про взаємодію «людина-машина» за допомогою сучасних інтернет-технологій — від пристроїв IoT до децентралізованої та глобально доступної мережі провайдерів. Ми розглянемо основи Інтернету речей, щоб висвітлити проблеми та основні виклики, з якими стикаються творці систем IoT і на вирішення яких спрямована Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Огляд стану Інтернету речей (IoT)",
  "Classification of IoT devices": "Класифікація пристроїв IoT",
  "Embedded IoT systems": "Вбудовані системи IoT",
  "Edge-systems: IoT gateways and controllers": "Edge-системи: шлюзи та контролери IoT",
  "Autonomous Systems": "Автономні системи",
  "Internet of Things providers": "Провайдери Інтернету речей",
  "Digital twins are the heart of the Internet of Things": "Цифрові двійники — серце Інтернету речей",
  "IoT data flows in cloud service": "Потоки даних IoT у хмарному сервісі",
  "Popular examples of IoT solutions": "Популярні приклади рішень IoT",
  "Current problems of building IoT solutions": "Актуальні проблеми побудови IoT рішень",
  "Main tasks of Robonomics architecture": "Основні завдання архітектури Robonomics",
  "Basic components of Robonomics architecture": "Основні компоненти архітектури Робономіки",
  "A simple representation of Robonomics architecture": "Просте представлення архітектури Robonomics",
  "Read chapter 2": "Прочитайте розділ 2 ",
  "We continue to update the white paper of Robonomics": "Ми продовжуємо оновлювати білий папір Robonomics",
  "stay tuned for new parts on our website and in Discord": "слідкуйте за новими частинами на нашому веб-сайті та в Discord",
  "Join our discord": "Приєднуйтеся до нашого discord",
  "Robonomics logos and usage": "Логотипи Robonomics та їх використання",
  "We have put together Robonomics logos and guidelines to show how you may use it": "Ми зібрали логотипи, кольори та асети Robonomics, а також посібники щодо їх використання.",
  "Download Robonomics logo": "Завантажте логотип Robonomics",
  "Download RWS logo": "Завантажте логотип RWS",
  "Download wiki logo": "Завантажте логотип wiki",
  "Use these permitted logos to link to Robonomics, RWS or Robonomics Wiki": "Скористайтеся цими дозволеними логотипами для посилання на Robonomics, RWS або Robonomics Wiki",
  "Use permitted Robonomics logo to inform others you are integrated with Robonomics": "Використовуйте дозволений логотип Robonomics, щоб повідомити про те, що ви інтегровані з Robonomics",
  "Use permitted logos in blog posts, articles and slides about Robonomics technology and integrated projects": "Використовуйте дозволені логотипи для постів у блозі, статтях та презентаціях про технологію Robonomics та вбудовані проекти.",
  "Do not modify the permitted Robonomics logos, including changing the color, dimensions, or combining it with other words or design elements": "Не модифікуйте дозволені логотипи Robonomics, у тому числі не змінюйте колір, розміри та не поєднуйте їх з іншими словами або елементами дизайну",
  "Do not use Robonomics logo and name in a way that suggests you are Robonomics, your offering or project is by Robonomics, or that Robonomics is endorsing you or your offering or project if it was not approved by Robonomics DAO": "Не використовуйте логотип і назву Robonomics таким чином, що передбачає, що ви представляєте Robonomics, що ваша пропозиція або проект належать Robonomics або що Robonomics підтримує вас або вашу пропозицію/проект, якщо вони не були схвалені Robonomics DAO",
  "Robonomics Color pallet": "Кольорова палітра robonomics",
  "These colors we use in our interfaces, prints, and other visuals. </br> Use it for your slides, banners for posts etc telling about Robonomics": "Ці кольори ми використовуємо у наших інтерфейсах, принтах та інших візуальних елементах.</br>Використовуйте цю палітру для своїх презентацій, банерів для постів тощо, які розповідають про Robonomics."
}