{
  "What is Robonomics network?": "Що таке robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics— це платформа з відкритим вихiдним кодом для програм Інтернету речей. Ми підтримуємо нове покоління інтернет-технологій (web3), які реалізують обмін технічною та економічною інформацією у формі атомарних транзакцій між додатками користувача, сервісами Інтернету речей і складною робототехнікою.",
  "Get started": "Вступ",
  "Explore Robonomics": "Відкрийте для себе Робономіку",
  "Robonomics is an open-source technology for IoT market available for everyone. Read an executive summary to know more": "Робономіка — це доступна для кожного технологія з відкритим вихідним кодом для ринку Інтернету речей. Щоб дізнатися більше, прочитайте основні тези",
  "Get XRT": "Токен XRT",
  "XRT is the utility token that make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain": "XRT — протокольний токен, який дозволяє керувати IoT-пристроями  поверх мережі Ethereum та парачейна Робономіки",
  "Use a Dapp": "Скористайтеся Dapp",
  "Take a look at the Beta version of decentralized application for managing IoT devices": "Подивіться бета-версію децентралізованої програми для керування пристроями IoT",
  "Start building": "Спробуйте на практиці",
  "Learn Robonomics through tutorials and practically useful experimenting in Robonomics WIKI": "Вивчіть Робономіку за допомогою навчальних посібників та практично корисних експериментів",
  "Robonomics objectives": "Задачі Робономіки",
  "Based on the achievements of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. There are the main tasks for which Robonomics is being developed": "Спираючись на досягнення хмарних платформ, Робономіка прагне запропонувати ринку IoT більш безпечні та вдосконалені інтернет рішення на кожному етапі спілкування між людиною та машиною. Нижче наведено основні целі, для яких розробляється Робономіка",
  "IoT device management with a decentralized cloud": "Керування IoT-пристроєм за допомогою децентралізованої хмари",
  "Techno-economic transactions between humans and machines": "Техніко-економічні транзакції між людьми та машинами",
  "Serverless IoT applications for users": "Безсерверні IoT програми користувачів",
  "Learn with Robonomics": "Вчиться з Robonomics",
  "Science papers": "Наукові статті",
  "Books": "Книги",
  "Logo and assets": "Лого та асети",
  "Blog": "Блог",
  "Contacts": "Контакти",
  "White Paper 2022": "Біла книга 2022",
  "Timeline": "Таймлайн",
  "Tokenomics": "Токеноміка",
  "Parachain": "Парачейн",
  "User (D)App": "(D)App користувача",
  "Function request": "Запит",
  "Report": "Звіт",
  "Control": "Дія",
  "Log": "Лог",
  "IoT Device": "IoT-пристрій",
  "Decentralized application": "Децентралізований додаток",
  "Digital twin": "Цифровий двійник",
  "IoT / Smart device": "IoT / Розумний пристрій",
  "Robonomics tokenomics": "Токеноміка Rbonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "— це службовий токен, який дозволить керувати IoT-пристроями поверх мережі Ethereum та парачейну Robonomics в екосистемі Polkadot.",
  "The task": "Завдання",
  "Be aware of scammers": "Стережіться шахраїв",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "будь ласка, використовуйте тільки відомі ринки для обміну XRT. Не надсилайте свої токени на акаунти, надіслані вам в особистих повідомленнях, яку б транзакцію ви не хотіли зробити (купити або продати токен). Якщо ви отримали будь-які «гучні заяви» про токені Robonomics (шахраї часто використовують щось на зразок оголошення про airdrop), будь ласка, перевірте цей сайт (https://robonomics.network/) або наш",
  "for official updates. Be careful, be safe.": "для отримання офіційних оновлень. Будьте обережні, будьте у безпеці.",
  "XRT in Ethereum": "XRT у Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реалізуючи проект Robonomics у 2015-2018, команді проекту необхідно було знайти зв'язок між забезпеченням мережею Robonomics корисної функції, а саме запуском IoT-пристроїв за моделлю «робот як послуга», та відшкодуванням витрат провайдерів Robonomics на комісію за газ у Ethereum. Нам потрібно було подумати про життєвий цикл зобов'язання кожного окремого смарт-пристрою за виконання послуги. В результаті ранніх досліджень та розробок у Robonomics команда розробила механізм майнінгу нових токенів для винагороди кожного створеного смарт-контракту формату «робот як послуга». Ця модель залишається життєздатною для майбутнього Robonomics на Ethereum, але лише зі значними покращеннями у Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочитайте це, щоб дізнатися про історію та довгострокові плани команди на XRT в екосистемі Ethereum.",
  "Etherscan profile": "Etherscan профіль",
  "View token smart contract and transactions in Ethereum network here.": "Переглянути смарт-контракт токена та транзакції у мережі Ethereum можна тут.",
  "Coingecko markets": "Біржі Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Тут ви можете знайти біржі CEX та DEX для торгівлі XRT.",
  "XRT In Polkadot": "XRT у Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходячи від Ethereum до Polkadot, нам потрібно «масштабуватися» у токеноміці. Парачейни в екосистемі Polkadot не є еквівалентами смарт-контрактів, а є повністю програмованим блокчейном, що орендує сегмент всієї мережі.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактичний платіж з боку парачейнів Polkadot і Kusama — це довгострокове зв'язування нативних токенів Relay chain (DOT/KSM) у кількості, достатньої для перемоги в одному з аукціонів. XRT у парачейні Robonomics підтримує оновлення слотів та винагороди для стейкхолдерів. Механізм спалювання XRT, що лежить в основі активації IoT-підписок, покликаний знизити інфляцію до мінімуму, а у разі підвищеного інтересу до нуля.",
  "Learn more": "Дізнайтесь більше",
  "in Twitter thread from our network architect.": "у гілці Twitter від нашого архітектора мережі.",
  "Usage:": "Використання:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можна використовувати як для оплати комісій за виконання транзакцій у парачейні, так і для покупки IoT-підписки, яка гарантує пріоритетну обробку IoT-транзакцій пристроїв або користувачів.",
  "Rewards:": "Нагороди:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Протягом року парачейн випускає невелику кількість XRT, щоб стимулювати колаторів парачейну.",
  "The parameter of the total reward": "Параметр загальної винагороди",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для колаторів протягом року визначається ончейн-голосуванням власників токенів і може бути змінений шляхом проведення референдуму.",
  "Use XRT": "Використовуйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купуйте IoT-підписку у нашому децентралізованому додатку. Керуйте своїми розумними пристроями через блокчейн без спостереження будь-якої централізованої корпорації.",
  "Subscan profile": "Subscan профіль",
  "View token statistics on top of Polkadot ecosystem.": "Переглядайте статистику токенів в екосистемі Polkadot.",
  "Other questions": "Інші питання",
  "What is RWS?": "Що таке RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Розробляється основна функціональність] Для інженерів команда Core Dev спробує створити різні моделі використання Robonomics, і першим кроком на цьому шляху буде запуск токена довічної підписки — токена RWS. Кожен токен RWS дає вам 1 транзакцію в секунду (tps) з/на ваш IoT-пристрій через парачейн Robonomics. Активуйте свій токен RWS і робіть транзакції з «безкоштовним газом» із попереднім виконанням та передбачуваною затримкою. Деактивуйте токен RWS та обміняйте його на DEX.",
  "What is AIRA/AIR ID?": "Що таке AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Токен Pre-XRT був поширений у 2017 році як автономна частина майбутньої інфраструктури Robonomics на Ethereum. Після успішного запуску Robonomics над Ethereum у 2019 році токени AIRA були підключені до створеної інфраструктури проекту через",
  "ambix smart contract": "смарт-контракт ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "який гарантував автономний і незалежний процес обміну pre-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "токена Robonomics — забезпечити роботу децентралізованої мережі для обслуговування Розумних міст та Індустрії 4.0 в інфраструктурі блокчейну. Для досягнення цієї мети економіка токена повинна відбивати стимули для реалізації мережі",
  "Token distribution": "Розподіл токенів",
  "Try our Dapp": "Спробуйте наш Dapp",
  "In addition": "Крім того",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "ви можете працювати з XRT в межах блокчейнів за допомогою інструментів, наданих різними незалежними командами у спільнотах Polkadot (Kusama) та Ethereum.",
  "Within the Kusama network, you have the capability use": "В мережі Kusama ви маєте можливість використовувати",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "комунікацію між парачейном Robonomics та іншими парачейнами за допомогою різних децентралізованих додатків (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "В мережі Ethereum ви можете використовувати децентралізований додаток, який працює на основі",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Децентралізований додаток (dapp) працює в рамках Blockchain. Він має відкритий вихідний код, а його дані розміщуються на IPFS та Github. Ці технології дозволяють додатку бути одночасно безпечним і прозорим. Наші розробники працюють як над розробкою додатку Robonomics, так і над бібліотеками, які ви можете використовувати при створенні власного dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Цифровий двійник — це один із інструментів, що надаються Robonomics Web Services (RWS). Він діє як цифрова версія реального обладнання та копіює всі його технічні характеристики. Це дозволяє зробити децентралізовану програму більш чуйною на команди користувача.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Ви можете використовувати Robonomics з широким спектром розумних пристроїв Zigbee для автоматизації та управління різними аспектами вашого будинку/офісу або використовувати її з робототехнікою на основі ROS для більш складних промислових завдань.",
  "Do Androids Dream of Electric Sheep?": "Чи мріють андроїди про електричних овець?",
  "Your email": "Ваш адрес электронной почты",
  "Community & Contacts": "Спільнота та контакти",
  "Get latest updates": "Отримуйте останні оновлення",
  "Tell us something if you want": "Скажіть щось, якщо хочете",
  "Submit": "Надіслати",
  "Something went  wrong :( Try again later": "Щось пішло не так :( Спробуйте пізніше",
  "Want emails from robonomics": "Бажаєте листи від robonomics",
  "Adding you to our special list...": "додаючи вас до нашого спеціального списк...",
  "Nice, you are in the list": "Чудово, ви у списку",
  "Something went  wrong. Try again later": "Щось пішло не так. Спробуйте ще раз пізніше",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Рік почався з великого досягнення — Robonomics виграла 20-й аукціон слотів парачейна і",
  "officially became": "офіційно стала",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "стала парачейном з ID 2048 у мережі Kusama. Функції launch, datalog, DigitalTwin, liability та IoT-підписки стали доступні всім користувачам екосистеми. Щоб надати детальну інформацію про цей етап проекту, команда розробників опублікувала перші розділи",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 на Substrate була випущена з підтримкою XCM-повідомлень, і ми почали відкривати HRMP-канали з іншими парачейнами (такими як Crust Shadow та Darwinia), функціонал яких нам дуже корисний.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "У той же час, ми розблокували стратегію впровадження нашого протоколу на ринок IoT. Наші експерименти з IoT-обладнанням привели нас до концепції розумного будинку, незалежного від централізованих постачальників хмарних послуг. Ми розробили свою",
  "integration": "інтеграцію",
  "with the Home Assistant automation system, and also designed our own": "із системою автоматизації Home Assistant, а також розробили власний",
  "IoT gateway": "IoT-шлюз",
  "for connecting smart devices.": "для підключення розумних пристроїв.",
  "We have launched two big initiatives in order to increase community engagement —": "Ми запустили дві великі ініціативи для підвищення залучення спільноти —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Крім того, восени було проведено",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "щоб співтовариство Robonomics могло вперше випробувати наші механізми управління. Нещодавно команда Robonomics допомогла проекту DAO IPCI отримати слот для парачейна, щоб презентувати сервіс компенсації викидів вуглецю для розумних будівель.",
  "In 2021, our": "У 2021 році наша",
  "main focus": "основна увага",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "перейшла на підготовку проекту до використання IoT-додатків за допомогою нашого парачейна в мережі Kusama. Було випущено Robonomics 1.0 на Substrate, протестовано підключення датчиків до парачейну з метою відправлення їх телеметрії, а також розроблено функції цифрового двійника. У середині року ми вирішили протестувати повний цикл нашої мережі та створили власний релей-чейн під назвою",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "о якого був інтегрований парачейн Robonomics (до міграції до Kusama). Великий фокус був сконцентрований на отриманні слота парачейна в Kusama, для чого ми організували кілька краудлоан-кампаній.",
  "There have been two big changes for the community. First, we launched the": "Для громади відбулися дві великі зміни. По-перше, ми запустили",
  "Robonomics Grant Program": "програму грантів Robonomics",
  "which allows web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "яка дозволяє проектам web3, робототехніки та IoT отримувати фінансування для виконання завдань R&D розробок. До кінця року в програмі взяли участь чотири активні проекти. По-друге, команда розпочала",
  "Exodus process": "процесс Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "що дозволяє власникам токенів Ethereum перемістити свої токени XRT у парачейн.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Серед колаборацій можна згадати помітну появу Boston Dynamics Spot у MerkleBot, для якого була розроблена",
  "rental remote control system": "система оренди віддаленого управління роботом",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Також варто згадати появу компанії Multi-Agent Systems, яка є особистим проектом команди інженерів Robonomics. Вони розробили робота-кухаря під назвою Eisenkoch, який може випікати вафлі для відвідувачів кав'ярень.",
  "There came a time when the existing limitations of Ethereum": "У цей період стали",
  "began to stand out clearly": "чітко виділятися існуючі",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "обмеження мережі Ethereum (зокрема, погана масштабованість, низька швидкість та дуже висока вартість транзакцій). Оновлення до ETH2.0 мало виправити ситуацію, але це оновлення неодноразово відкладалося. Ми не хотіли залишати мережу Ethereum, але зрозуміли, що в поточній ситуації складно реалізувати наші сценарії застосування і почали шукати альтернативну мережу. Цією альтернативою стала сегментована блокчейн-екосистема Polkadot. Ми почали експериментувати з фреймворком Substrate, щоб перенести основні функції Robonomics і розгорнути власну тестову мережу. До кінця цього етапу ми розгорнули наш парачейн у тестовій мережі Rococo і розпочали підготовку до отримання слоту у мережі Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Продовжуючи вивчати IoT-системи, ми визначили основний функціонал Robonomics, який може принести цінність користувачам — функцію децентралізованої хмари для IoT. Ця ідея стала основою",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Інфраструктура RWS взяла на себе всі функції типової централізованої хмари, але без стандартних проблем глобальної доступності, безпеки та конфіденційності. Крім того, ми запропонували ідею IoT-підписок для парачейну, яка дозволяє власникам підписки використовувати блокчейн-мережу без необхідності сплачувати комісію за кожну транзакцію. Першим експериментом з IoT-підписками стала емісія токена RWS, який дозволяє його власнику відправляти 1 транзакцію на блок парачейну. Крім того, ми почали робити перші кроки щодо розробки власного апаратного набору для керування розумними пристроями (концепція DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Зрозуміло, що підтримка Robonomics на Ethereum не припинилася. Комунікаційний стек Robonomics було доопрацьовано до версії",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Токен XRT почав торгуватися на кількох біржах (зокрема, Uniswap DEX), а також було запущено програму підтримки ліквідності.",
  "The team actively developed ways to interact with the community. The first version of our": "Команда активно розробляла способи взаємодії із співтовариством. Була запущена перша версія нашого",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "и Robonomics Wiki. Для більш прозорого та зручного керування проектами ми почали використовувати",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "У 2019 році ми провели",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "ля початківців у проекті.",
  "Robonomics became the foundation for the": "Robonomics стала основою для проекту",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "який розробляє систему розумного лізингу роботизованого обладнання.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Ми розуміли, що автономним агентам потрібне середовище, що забезпечує їх надійну технічну та економічну діяльність. Декілька років ми розробляли протокол для створення децентралізованої мережі провайдерів, які допомагають роботам-агентам надавати свої послуги. Були розроблені інструменти для обслуговування мережі та комунікаційний стек між Ethereum та ROS. У 2018 році ми опублікували",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "після чого була запущена альфа-версія мережі Robonomics в Ethereum. Ми продовжили активну підготовку до генерації токенів XRT (яка затрималася до весни 2019 року через першу криптозиму).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "З цього періоду Robonomics почала динамічно розробляти сценарії застосування, пов'язані з Індустрією 4.0 – розумні фабрики, розумні міста та розумні будинки – і це привернуло нашу пильну увагу до світу Інтернету речей. У пошуках інновацій команда представила кілька великих та унікальних R&D демонстрацій: цивільна",
  "sensor network": "мережа датчиків",
  "a water drone": "водний дрон",
  "for environmental monitoring (supported by a sensor systems manufacturer": "для моніторингу навколишнього середовища (за підтримки виробника сенсорних систем",
  "a smart factory model": "модель розумної фабрики",
  "a self-employed": "заробляє незалежно від людини - ",
  "robot artist Gaka-chu": "робот-художник Gaka-chu",
  "and a": "та",
  "drone traffic management system": "система управління трафіком дронів",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using web3 technologies and IoT devices.": "Robonomics розпочала співпрацю з проектом DAO IPCI з управління екологічними активами з використанням технологій web3 та IoT-пристроїв.",
  "This was a period of active R&D during which we identified a range of tasks, in which p2p technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Це був період активної R&D діяльності, в ході якої ми визначили коло завдань, в яких p2p-технології мають можливості, недоступні раніше для робототехніки. Об'єднавши комп'ютер Ethereum, файлове сховище IPFS і Robot Operating System (ROS), ми зрозуміли, що будь-який пристрій може стати",
  "autonomous intelligent robot agent": "автономним розумним роботом-агентом",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "У свою чергу, це відкрило нам шлях до концепцій Robot-as-a-Service та економіки роботів.",
  "Our publications in scientific journals of this period are available in the": "Наші публікації у наукових журналах цього періоду доступні у розділі",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Всі R&D проекти за ці роки доступні у",
  "a handy book": "зручній книзі",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Все почалося з ідеї, яка спала на думку засновникам проекту, коли Ethereum тільки запустив свою основну мережу. Що якщо робот виконуватиме роботу для клієнта за криптовалюту, а його логіка керується смарт-контрактом?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Щоб перевірити ідею, ми зробили демонстрацію, де дрон, керований комп'ютером Ethereum, запускався для досягнення заданих GPS-координат після того, як користувач здійснив платіжну транзакцію.",
  "The demo is available on": "Демо доступне на",
  "YouTube": "YouTube",
  "Infrastructure && tech development timeline": "Таймлайн разработки інфраструктури та технології",
  "Notable events": "Визначні події",
  "Robonomics whitepaper 2022 welcome guide": "Гайд по білому папері Robonomics 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Ми розробили техніко-економічний машинний протокол зв’язку, який працює на основі Ethereum і IPFS, і доповнюємо його елементами хмарної платформи IoT на основі парачейну Polkadot. Сьогодні ми вже маємо гібридну платформу для створення футуристичних додатків IoT. Він забезпечує взаємодію з пристроями під управлінням глобального децентралізованого комп'ютера. Перш ніж ми почнемо створювати безпечні, безсерверні та футуристичні додатки IoT за допомогою платформи Robonomics, давайте трохи зануримося в теорію...",
  "Chapter 1.": "Розділ 1.",
  "At the intersection of cybernetics and economics": "На стику кібернетики та економіки",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Ми представили економічну систему, в якій роботизовані пристрої діють як незалежні агенти, здатні виконувати ключові економічні види діяльності, раніше зарезервовані для людей. У цьому розділі ми поговоримо про актуальність роботизованої економіки, яка може стати важливою частиною життя людей і змінити поточний рівень економіки на повністю автоматизовані послуги в майбутньому.",
  "In this chapter you will learn": "У цьому розділі ви дізнаєтеся",
  "Ronald Coase and The Nature of the Firm": "Рональд Коуз і природа фірми",
  "CPS - cyber-physical system": "КФС — кіберфізична система",
  "Norbert Wiener and the search for patterns in living and machine": "Норберт Вінер та пошук закономірностей у живому та машинному",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Четверта промислова революція, гроші для роботів і біткойн",
  "Ethereum Smart Contracts": "Розумні контракти Ethereum",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Відкриті питання телеології та творчість Мізеса",
  "Read chapter 1": "Прочитайте розділ 1",
  "Chapter 2.": "Розділ 2. ",
  "Robonomics architecture": "Архітектура Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "У другому розділі ви прочитаєте про взаємодію «людина-машина» за допомогою сучасних інтернет-технологій — від пристроїв IoT до децентралізованої та глобально доступної мережі провайдерів. Ми розглянемо основи Інтернету речей, щоб висвітлити проблеми та основні виклики, з якими стикаються творці систем IoT і на вирішення яких спрямована Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Огляд стану Інтернету речей (IoT)",
  "Classification of IoT devices": "Класифікація пристроїв IoT",
  "Embedded IoT systems": "Вбудовані системи IoT",
  "Edge-systems: IoT gateways and controllers": "Edge-системи: шлюзи та контролери IoT",
  "Autonomous Systems": "Автономні системи",
  "Internet of Things providers": "Провайдери Інтернету речей",
  "Digital twins are the heart of the Internet of Things": "Цифрові двійники — серце Інтернету речей",
  "IoT data flows in cloud service": "Потоки даних IoT у хмарному сервісі",
  "Popular examples of IoT solutions": "Популярні приклади рішень IoT",
  "Current problems of building IoT solutions": "Актуальні проблеми побудови IoT рішень",
  "Main tasks of Robonomics architecture": "Основні завдання архітектури Robonomics",
  "Basic components of Robonomics architecture": "Основні компоненти архітектури Робономіки",
  "A simple representation of Robonomics architecture": "Просте представлення архітектури Robonomics",
  "Read chapter 2": "Прочитайте розділ 2 ",
  "We continue to update the white paper of Robonomics": "Ми продовжуємо оновлювати білий папір Robonomics",
  "stay tuned for new parts on our website and in Discord": "слідкуйте за новими частинами на нашому веб-сайті та в Discord",
  "Join our discord": "Приєднуйтеся до нашого discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Далі ми хотіли б показати вам практичні сфери взаємодії людини і машин за допомогою сучасних Інтернет-технологій. Ми рухатимемося від звичної для IoT-пристроїв архітектури обміну технічною інформацією за допомогою хмарних сервісів до організації техніко-економічної взаємодії за допомогою децентралізованої, глобально доступної мережі провайдерів.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Для початку потрібно зробити екскурс в область, яка найбільш чітко пов'язана з мережевим підключенням автоматизованих систем. Після цього ми розглянемо основи Інтернету речей, щоб висвітлити проблеми та основні виклики, з якими стикаються творці IoT-систем і на вирішення яких спрямована Робономіка.",
  "Overview of the state of the internet of things (IoT)": "Огляд стану інтернету речей (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Питання мережевої доступності автоматів обговорюється на всій планеті з 60-х років, і вже тоді робилися досить серйозні спроби вирішити його. Наприклад, радянський кібернетик Віктор Глушков запропонував і частково реалізував автоматизований збір інформації про обсяги виробництва окремого підприємства в рамках проектування національної інформаційної системи",
  "OGAS": "ЗДАС",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "в 60-70-х роках. Широко відомо, як торговельний автомат Coca-Cola був підключений до ARPANET у 1980-х роках, щоб автомат міг повідомляти про наявність напоїв та їх температуру.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Але все ж таки фактичний розвиток IoT відбувається саме сьогодні, через широке поширення опорних (enabling) технологій. Основними драйверами швидкої еволюції додатків Інтернету речей є результат розвитку багатьох напрямків – від бездротового зв’язку різних діапазонів і вбудованих пристроїв до хмарної аналітики та машинного навчання. Кількість IoT-пристроїв стабільно зростала протягом останніх 10 років (з прогнозом 25 мільярдів пристроїв до 2030 року), і це спонукало дослідників і розробників до створення нових IoT-додатків у різних сферах, таких як охорона здоров’я, домашня автоматизація, агробізнес, охорона навколишнього середовища.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Нас більше цікавить процес побудови IoT-систем і завдання, які в цьому процесі виникають. За роки досліджень було запропоновано багато різних архітектур, і, усереднюючи їх, ми можемо виділити три основні компоненти IoT-системи: безпосередньо пристрої, мережева інфраструктура, аналітичні, обчислювальні та керуючі машини.",
  "New challenges": "Нові виклики",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Іншим недавнім викликом для створення IoT стала концепція цифрового двійника — цифрової версії реального обладнання, яке копіює його специфікації та історичні дані. Ця концепція найкраще підходить у сферах, де необхідно мати точну та повну специфікацію процесу та мати можливість передбачити його розвиток. Інтернет речей діє як головний інтегратор цифрових двійників, але це завдання набагато глибше, ніж звичайне підключення IoT-пристроїв.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Зараз ми спостерігаємо цілий сегмент мережі, призначений і зручний не для людей, а для машин. Інтернет речей — це вже не просто механізми підключення пристрою до мережі, а більше послуг, створених і доступних спеціально для пристроїв. Інтернет речей не тільки з’єднує користувача та пристрій, але й допомагає пристроям справлятися із завданнями надання послуг для людини, але автономно.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Такі системи не мають користувальницьких інтерфейсів і зазвичай використовуються на найнижчому рівні екосистем Інтернету речей для забезпечення базової функціональності. Вони мають бути енергоефективним і маленькими. Мають обмежені обчислювальні та комунікаційні ресурси. Сигнали можуть передаватися через Wi-Fi, Bluetooth або радіочастотами, а приймачем сигналів зазвичай виступають IoT-шлюзи або контролери.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Ці системи виступають зв'язуючим дзвінком між локально доступними системами, що вбудовуються, і глобальною мережею Інтернет. Зазвичай вони підтримують кілька протоколів зв’язку вбудованих систем і передають телеметрію з пристроїв у хмару та керують сигналами назад. Часто ці пристрої є більш складною версією WiFi роутера, оснащеного одноплатним комп'ютером для виконання первинної обробки інформації з пристроїв, не виходячи з локальної мережі.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "До цього класу належать складні автомати (такі як Spot від Boston Dynamics), що мають керуючий компонент на рівні повноцінного комп'ютера з високопродуктивним процесором та великим об'ємом пам'яті. У разі робот підключається до мережі Інтернет без додаткових проміжних рішень (edge-систем). Необхідне програмне забезпечення для доступу до Інтернету речей встановлюється безпосередньо на комп'ютер автономної системи. Дані збираються і частково обробляються локально, потім транслюються в Інтернет аналогічно будь-якому повноцінному мережному пристрою.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Основна робота IoT-провайдерів — надавати користувачам віддалений доступ до даних і аналітики, а також керувати розумними пристроями через Інтернет. Основними критеріями якості провайдера є безпека роботи, стабільність зв'язку та доступність провайдера з будь-якої точки світу.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Стандартна схема роботи з провайдером Інтернету речей включає встановлення програмного забезпечення на розумний пристрій, сумісного з хмарою; налаштування керуючих сервісів на стороні хмари після першого успішного підключення пристрою; підключення різноманітних аналітичних сервісів.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Говорячи про цифрові двійники, слід зазначити, що архітектурно їх реалізація є обов'язковою; як відмова надати користувачеві прямий доступ до пристроїв керування та змінити їх стан. З найбільш очевидних причин відмови – це, по-перше, наявність власних вимог і умов у пристроїв безпосередньо перед запуском. По-друге, якщо кілька пристроїв користувачів повинні отримати доступ до одного джерела даних, надання персоналізованого контролю кожному користувачеві може бути критичним. Нарешті, надзвичайно корисно зберігати останній фактичний стан пристрою на випадок, якщо він вийде з ладу.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "В результаті ми маємо розділення циклу обміну інформацією з користувачем і власне генерування датчиками реальних даних. Щоб проілюструвати цей принцип, нижче наведено процес роботи користувача з пристроєм IoT за допомогою цифрового двійника.",
  "IoT data flows in cloud services": "Потоки IoT-даних у хмарних сервісах",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Вхідні значення для хмарних тригерів. Наприклад, у разі отримання повідомлення від датчика сигналізації автомобіля про удар хмарний сервіс надсилає різні повідомлення користувачеві.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Вихідні дані для складної аналітики, які не можуть бути створені на крайньому рівні. Наприклад, при обробці відео для розпізнавання обличчя в натовпі.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Основа для формування цифрового двійника пристрою з метою створення зліпку його стану. Наприклад, за бажанням користувача в мобільному додатку або на сайті.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Типова система розумного дому надає широкий спектр можливостей для керування вашим житловим простором. З його допомогою можна дистанційно керувати дверними замками, організовуючи одноразовий або регулярний доступ в приміщення як рідних і близьких, так і обслуговуючого або доставного персоналу. Завдяки численним датчикам і реєструючим пристроям система здатна включати відеозапис при спрацьовуванні датчиків руху, самостійно приймати рішення про відключення подачі води при виявленні витоку в водопровідній системі, запускати плановий робот-пилосос, надаючи звіт про прибирання. У програмі користувача змініть кімнатну температуру на оптимальне значення залежно від вашого розкладу.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Розумні автомобілі. Забезпечуючи бортову електроніку автомобіля доступом до мобільного Інтернету, користувач отримує доступ до дистанційного керування різними функціями автомобіля прямо зі свого смартфона: відкриття дверей, увімкнення кондиціонера, керування фарами. Якщо такі автомобілі використовуються для каршерінгу, то для клієнтів цього сервісу можна створити інтерактивну карту розташування автомобілів із зазначенням їх статусу, залишку пального.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Розумна система лізингу обладнання. Компанія встановлює роботизовані маніпулятори на конвеєрі за договором з оплатою за кількість операцій або за час роботи робота. Маніпулятори регулярно надають журнал виконаних операцій, помилок і попереджень. На основі цього розраховується плата за оренду робота, а також прогнозне обслуговування роботів постачальником.",
  "Global availability": "Глобальна доступність",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Стандартна клієнт-серверна архітектура вимагає вказівки кінцевих точок під час маршрутизації повідомлень від IoT-пристроїв. Тим самим у процесі життя розумного пристрою відсутність з'єднання означатиме обмеження можливостей управління та взаємодії з пристроєм.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Наприклад, торговельна війна між Китаєм та США вже сьогодні висить дамокловим мечем над тисячами споживачів китайської розумної техніки у США та навпаки. У будь-який момент блокування серверів Xiaomi владою США може зашкодити користувачам пристроїв, що підключаються до хмарних сервісів виробника.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Перебуваючи в безпосередній близькості від IoT-пристрою, ви не можете керувати ним з мобільного додатку, якщо немає підключення до серверів, через які забезпечується автентифікація користувачів і збір телеметрії з самих пристроїв. Тобто пристроєм фактично керує хмара, а не користувач.",
  "Cybersecurity": "Кібербезпека",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Найбільш важлива причина низької кібербезпеки більшості IoT-рішень виростає із проблемної спадщини хмарної клієнт-серверної архітектури. Наприклад, зараз найпоширеніша архітектура розумного будинку - це, як правило, IoT-хаб, підключений до хмарного сервісу. Таким чином, типова IoT-система є центральним контролюючим елементом, підключеним до безлічі зовнішніх систем. Безумовно, хмарний сервіс більш захищений, ніж низькорівневі пристрої, проте через укрупнення централізованого контролю за сотнями тисяч таких систем будь-які проломи в безпеці та витоки стають масштабною катастрофою.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Сервери хмарного сервісу піддаються всім типовим проблемам кібербезпеки: мережеві атаки, DoS-атаки (доведення системи до відмови), шкідливі модифікації, захоплення сесій, тощо. Але до сильних погроз також додаються й ненавмисні проблеми, такі як помилки при проектуванні, неправильне використання або стихійні лиха, що призводять до поломок серверів. І ще один, безумовно, важливий пункт — необхідність у принципі довіряти хмарі та співробітникам, які її обслуговують.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Все це посилюється масштабом IoT-рішень. Кількість IoT-пристроїв, що належать одній системі, може перевищувати сотні і тисячі, і при цьому за своєю природою IoT-пристрої мають менші обчислювальні можливості, що значно ускладнює розгортання фаєрволів і антивірусів для них. Але найбільш згубним фактором є те, що IoT-пристрої є діючими КФС, тому загрози кібербезпеки виявляються вже і фізично.",
  "Data privacy": "Конфіденційність даних",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Пункт із приватністю потрібно відокремити від кібербезпеки, оскільки ця проблема є специфічною для IoT-систем. Завдяки великій кількості різноманітних типів пристроїв, які набагато більше інтегровані у фізичний світ, ніж просто комп’ютери та смартфони, діапазон типів особистих даних збільшується в рази. Це вже не лише місцезнаходження за допомогою GPS, записи про покупки, фінансові операції та фотографії, а й постійний запис відео та розмов, відбитки голосу, стан здоров’я та навіть список звичок людини. Серед типів загроз, пов’язаних з конфіденційністю, є: ідентифікація інформації, локалізація та відстеження, профілювання, inventory attack (збір даних для подальшого профілювання), лінковка даних.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "Найжахливіше те, що користувачі майже не усвідомлюють, що вони відмовляються від своєї конфіденційності, тому що вони майже не уявляють, які дані збираються та як вони використовуються. Загроза конфіденційності зростає не лише з боку зловмисників, а й з боку організацій та державних установ саме через це. Хмарні IoT-сервіси зазвичай вимагають максимальної передачі даних з пристроїв, і немає способів заборонити або звузити передачу даних («Прийміть умови або злиться»). Крім того, незважаючи на те, що зібрані дані є активом і мають реальну цінність, особі, від якої вони збираються, не тільки відмовляють у праві активно розпоряджатися цими даними, але навіть відмовляють у будь-якій компенсації за збір і використання власних даних.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Спираючись на досягнення та проблеми хмарних платформ, Робономіка ставить своїм завданням запропонувати IoT-ринку більш безпечні та досконаліші інтернет-рішення на кожному етапі комунікації людини та машини. Нижче наводяться основні завдання, на які спрямована Робономіка:",
  "Managing an IoT device using a decentralized cloud": "Управління iot-пристроєм за допомогою децентралізованої хмари",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Блокчейн мережі мають усі можливості для забезпечення найвищого ступеня безпеки запуску пристрою та отримання його телеметрії. Взаємодія з пристроєм фактично можна описати зміною стану цифрового двійника, що зберігається в блокчейн мережі, та надсиланням інформації про ці зміни. У разі використання permissionless blockchain ми можемо говорити про гарантії глобальної доступності провайдерів для IoT, а також високий рівень захисту даних цифрового двійника від небажаних змін.",
  "Performing technical and economic transaction between people and machines": "Виконання техніко-економічних операцій між людьми і машинами",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Завдяки механізму криптовалют і смарт-контрактів ми можемо забезпечити доступ автоматизованих систем безпосередньо до цифрових ринків. Наприклад, Ethereum вже реалізує більшість основних інструментів економічної діяльності, які можна використовувати в роботі автономних пристроїв. Додатки, створені для взаємодії між кінцевим користувачем і пристроєм IoT, будуть набагато ефективнішими, якщо умови надання послуг і їх оплата будуть невіддільні від параметрів запуску пристрою.",
  "Modern advances in web3-technology can solve the issue of user privacy. With web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Сучасні досягнення web3-технологій можуть вирішити питання конфіденційності користувачів. Завдяки web3 немає необхідності здійснювати автентифікацію або вимагати підключення до конкретних серверів для доступу до телеметрії та керування пристроєм.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Робономіка — це децентралізована хмара для цифрових двійників IoT-пристроїв. Робономіка підтримує техніко-економічний формат спілкування, а також надає приватні програми для користувачів.",
  "A human interface to access the system": "Інтерфейс людини для доступу до системи",
  "A communication protocol": "Протокол зв'язку",
  "A machine interface": "Машинний інтерфейс",
  "Human interface": "Інтерфейс людини",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Ми пропонуємо використовувати децентралізовані програми (dapp, скор. від decentralized applications) як основний спосіб підключення користувачів до управління розумними пристроями через мережу Інтернет. Таким чином, ми зможемо надати найбільш безпечний (з точки зору даних) інтерфейс користувача в систему, який зможе одночасно працювати як в умовах локальної міської мережі, так і через загальну глобальну мережу.",
  "Communication protocol": "Протокол зв'язку",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Його роль виконує мережа Робономіка — специфікація, розроблена командою проекту, реалізує децентралізовану мережу провайдерів, які забезпечують передачу, обробку та зберігання інформації, необхідної для запуску IoT-пристроїв. Фактично є реалізацією специфічного за своїми функціями вузла для мереж IPFS, Ethereum, Polkadot.",
  "Machine interface": "Машинний інтерфейс",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Нижче представлена загальна схема повного циклу запуску пристрою за допомогою платформи Робономіки:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "Децентралізована програма користувача надсилає запит на виконання функції з керування пристроєм через мережу Робономіки.",
  "The Robonomics network provides request translation using libp2p and captures events in Ethereum blockchain or Robonomics parachain.": "Мережа Робономіка забезпечує транслювання запиту за допомогою libp2p та фіксує події у Ethereum blockchain або Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Управління пристроєм забезпечується децентралізованою мережею, яка гарантовано зберігає необхідну інформацію для роботи пристрою IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "IoT-пристрій самостійно отримує інформацію із мереж Ethereum та Polkadot про поточний стан цифрового двійника. Це гарантує безпечний запуск пристрою лише після встановлення техніко-економічних параметрів запуску.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "В результаті роботи IoT-пристрій публікує лог виконаних операцій, який може використовуватися як доказ наданої послуги або для налагодження помилок.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Лог трансформується у звіт для користувача і стає доступним у його dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Створення Dapps та Web-cервісів для IoT на парачейні Робономіки",
  "Sergei Lonshakov, software architect": "Сергій Лоншаков, архітектор ПЗ",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Згадаймо, що робот — це точний економічний еквівалент рабської праці. Будь-яка праця, яка конкурує з рабською, повинна прийняти економічні наслідки рабської праці.",
  "Norbert Wiener": "Норберт Вінер",
  "cybernetics": "кібернетика",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Сьогодні роботи схожі на дітей, що подорослішали — вони вже можуть керувати грошима, вступати у правовідносини, бути незалежними.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Майбутнє людства залежить від того, як ми навчимо роботів керувати своїми можливостями.",
  "Robonomics tools": "Інструменти Robonomics",
  "Operate with digital twins of IoT devices": "Робота з цифровими двійниками IoT-пристроїв",
  "The first tools of the robot economy: money for robots, contracts for robots": "Перші інструменти в економіці роботів: гроші для роботів, контракти для роботів",
  "Software for connecting devices to a decentralized cloud": "Програмне забезпечення для підключення пристроїв до децентралізованої хмари",
  "API library for custom IoT applications": "API бібліотека для користувальних IoT-програм",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics містить повний набір інструментів для розробки програм Інтернету речей, як для робототехніки, так і для інтерфейсу користувача. Зв'язок між користувачем та пристроєм відбувається з використанням найуспішніших технологій зі світу Web3 — IPFS, Ethereum та Polkadot. Таким чином, розробники можуть створювати сучасні та безпечні програми для розумних міст та Індустрії 4.0.",
  "Robonomics Connectivity": "Сумісність Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Для зручності розробників Robonomics містить набір програмного забезпечення для підключення: пристроїв Інтернету речей, що використовують протокол HTTP/MQTT, складних роботизованих систем, що використовують операційну систему роботів (ROS).",
  "Connect a sensor": "Підключіть датчик",
  "to the Robonomics network": "до мережі Robonomics",
  "Try": "Спробуйте",
  "a simple prototyping tool": "- простий інструмент створення прототипів",
  "Start building your own cyber physical system with": "Почніть будувати власну кіберфізичну систему з",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics підтримує сотні роботів із коробки",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Користувачі платформи можуть підключити роботів, сумісних із ROS, до цифрової економіки за лічені хвилини. Щоб побачити повний список роботів, що підтримуються, перейдіть за посиланням",
  "Decentralized Cloud infrastructure for IoT": "Децентралізована хмарна інфраструктура для IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) — це базовий інфраструктурний сервіс для робототехніки та Інтернету речей на основі парачейна Robonomics та IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "Економіка роботів",
  "Core RWS features available for IoT today": "Основні функції RWS, доступні сьогодні для IoT",
  "RWS PubSub Message Broker": "Брокер повідомлень RWS PubSub",
  "Use unlimited messaging over a p2p network based on IPFS protocol": "Використовуйте необмежений обмін повідомленнями по мережі p2p на основі протоколу IPFS",
  "RWS Data Blockchainization Service": "Сервіс RWS для блокчейнізації даних",
  "RWS Robot Actions": "Дії роботів з RWS",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Запускайте та зупиняйте свої IoT-пристрої під керуванням децентралізованого комп'ютера",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Серце вашого IoT-додатку — цифровий двійник на Блокчейні",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "У технічній архітектурі цифрові двійники IoT забезпечують видимість та моніторинг речей та пов'язаних з ними подій (наприклад, за допомогою пристроїв IoT для автоматичного визначення походження продукту), а блокчейн дозволяє поділитися єдиною версією істини про стан цих речей протягом їх життєвих циклів та пов'язаних з ними бізнес-подій",
  "from Gartner research": "з дослідження Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Парачейн Robonomics дає можливість створити модель цифрового двійника та оновлювати її стан кожні 6 секунд.",
  "Secure": "Захищені",
  "Serverless": "безсерверні",
  "Futuristic": "футуристичні",
  "IoT applications": "програми IoT",
  "Robonomics network vision": "Концепція мережі Робономіка",
  "At the frontier of cybernetics and economics": "На стику кібернетики та економіки",
  "Build your IoT services on Robonomics platform": "Будуйте свої iot-сервіси на платформі робономіка",
  "taking full advantage of decentralized architecture": "отримуючи всі переваги децентралізованої архітектури",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Робономіка дозволяє підключати користувачів до розумних пристроїв за допомогою децентралізованих додатків (dapp), які не вимагають передачі даних для аутентифікації. Комунікація відбувається через децентралізовану мережу провайдерів без жодної точки відмови, а пристрій самостійно отримує інформацію з блокчейн-мережі для запуску виконання або передачі даних віддалено. Таким чином, Робономіка забезпечує високий рівень кібербезпеки пристроїв та приватності даних користувачів на всіх етапах комунікації від користувальницької програми до запуску розумного пристрою.",
  "From smart contracts to cross chain IoT platform": "Від смарт-контрактів до міжмережевої iot-платформи",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Проекту Робономіка вже понад 6 років. Готуватися до проведення першого експерименту, що демонструє комунікацію людей та машин з використанням незалежної децентралізованої мережі провайдерів, ми розпочали у 2015 році — з перших днів існування мережі Ethereum. До початку 2021 року команді проекту вдалося створити протокол техніко-економічної комунікації машин, що працює поверх Ethereum та IPFS, та доповнити його елементами хмарної IoT-платформи на базі парачейну Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "У результаті, вже сьогодні ми маємо гібридну платформу для створення футуристичних IoT-додатків, що забезпечують взаємодію з пристроями, що знаходяться під контролем світового децентралізованого комп'ютера.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Творці Робономіки — експериментатори, інженери та вчені, яким важливо розібратися в науковій обґрунтованості підходу та досягти ясності у поданні принципів, які мають бути покладені в основу всієї архітектури програмного рішення.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "У своїх статтях у період з 2017 по 2020 рік ми представили науковому співтовариству безліч концепцій і рішень, об'єднаних навколо ідеї економіки роботів — економічної системи, в якій робототехнічні пристрої виступають як незалежні агенти, здатні до виконання ключових економічних активностей, які були притаманні лише людині. З науковими статтями ви можете ознайомитись за",
  "this link": "цим посиланням",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "У цьому розділі ми хотіли б обґрунтувати появу економіки роботів і пояснити загалом, чому ми вважаємо, що саме це поняття є неминучою та явною відповіддю на питання функціонування великомасштабних роботизованих систем нової промислової революції.",
  "Move towards the factory of the future": "Шлях до заводу майбутнього",
  "Inspired by Ronald Coase": "Натхненний Рональдом Коузом",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Нобелівський лауреат з економіки Рональд Коуз у своїй роботі 1937 року The Nature of the Firm найкраще продемонстрував дихотомію 'ієрархія vs вільний ринок' і дав пояснення причин існування організацій, зокрема фірм. Коуз розмірковує про вплив транзакційних витрат (витрат на збирання та обробку інформації) на прийняття рішень про укладення контракту та на контроль його виконання. Фірма зі всією своєю ієрархічною позаринковою структурою утворюється як найбільш ефективний спосіб надати споживачеві цільовий продукт з найменшими транзакційними витратами в той момент, коли транзакційні зусилля щодо створення того ж продукту шляхом множини обмінних операцій на ринку між індивідами стають значно вище. Щоб найкраще уявити собі цей процес, подивіться на показовий приклад із покупкою автомобіля. Спробуйте купити автомобіль по запчастинах і порахуйте скільки коштів і часу ви витратите, щоб просто зібрати всі комплектуючі у своєму гаражі. Ризики та витрати на переговори при купівлі деталей дуже високі в порівнянні з готовим до вживання Model X від фірми Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Проте, це не призводить до виникнення єдиної у світі фірми з виробництва всього. Справа в тому, що ті ж транзакційні витрати накладають обмеження і на розмір фірм. Коуз пише:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "«...фірма прагнутиме до розширення до того часу, поки витрати на організацію додаткової угоди всередині фірми не зрівняються з витратами здійснення тієї ж операції у вигляді обміну на відкритому ринку...»",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Іншими словами, чим складніша ієрархія всередині фірми, тим більші внутрішні витрати, і в якийсь момент вони виявляються надмірними порівняно з витратами повернення на ринок. Тому, щоб забезпечити своє зростання як один із драйверів, підприємці шукають шляхи зменшити ці витрати.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Ідея зниження транзакційних витрат за рахунок можливості об’єднання всіх учасників бізнес-процесу (виробництво, логістика, споживання) на більш тісному рівні",
  "clearly correlates": "чітко корелює",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "з проблемами та викликами, з якими стикаються виробники рішень автоматизації. За останні 50 років стандартні/регулярні операції більшості бізнес-процесів великих компаній були майже повністю автоматизовані. Виробникам, по суті, залишається завдання побудови безпечного зв’язку між повністю автоматизованими частинами ланцюга постачання, і це завдання є чинником, який стримує подальше зниження транзакційних витрат за рахунок автоматизаціі. Бажання продавати на ринку більш конкурентоспроможні продукти чи послуги порівняно з частково автоматизованими ",
  "firms spurs the search for solutions to": "фірмами спонукає до пошуку рішень ",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "цих проблем. Схоже, все йде до появи робофірм — організацій, у яких весь цикл бізнес-процесів повністю автоматизований і не вимагає участі людини, окрім як бенефіціарів і споживачів.",
  "Get rid of transaction costs": "Позбудьтесь транзакційних витрат",
  "Our future in smart cities": "Наше майбутнє в розумних містах",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Завдання, яке сьогодні стоїть перед виробниками засобів автоматизації, має конкретну назву — побудова кіберфізичних систем (скор. КФС). За",
  "definition,": "визначенням,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "КФС — це міцне об’єднання та взаємна інтеграція багатьох обчислювальних, мережевих і фізичних процесів. ",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Завдання побудови КФС є центральними для будь-якої ідеї, описаної в нової (четвертої) промисловой революції. Тому КФС є наріжним каменем нашого майбутнього життя в розумних містах, проявляючи себе всюди. Прикладами кіберфізичних систем майбутнього є: автопілот Uber, селфі з дронів, мережа 3D-принтерів на станціях метро.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "КФС — це складна структура з багатьох пов’язаних елементів: від додатка на телефоні він поширюється на керування безпілотником у польоті над містом, а потім переходить до публікації отриманих фотографій в Instagram, але лише після обробки хмарним AI.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Найважливішим у процесі проектування КФС є знаходження тонкої межі між достатньою та надмірною кількістю автоматизованих елементів у ланцюжку поставок користувачів послуг. Іншими словами, де обмеження розміру КФС? Щоб відповісти на це питання, варто звернутися до відомого математика Норберта Вінера.",
  "Self-regulating systems": "Системи саморегулювання",
  "Inspired by Norbert Wiener": "Натхненний Норбертом Вінером",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Норберт Вінер говорить про життєздатність міждисциплінарного наукового підходу. Наприклад, він провів паралелі між автоматизованими системами управління та проблемами масштабування та підвищення складності людського суспільства.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Таким чином, іншими словами, кібернетичний підхід можна однаково застосовувати до психотерапії, біології та автоматизованої навігації. Він ґрунтується на функції системи, на тому, як контролюються окремі дії та як окремі вузли взаємодіють один з одним.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Зважаючи на публікації Рональда Коуза та Норберта Вінера, які продовжують тему розвитку Індустрії 4.0, ми можемо розглянути можливість використання КФС як економічного агента при розробці роботизованих послуг. Щоб регулювати розмір КФС і адаптуватися до потреб людей, що змінюються, ми можемо використовувати ринковий механізм.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Робофірми є ідеальними ілюстраціями кібер-фізичних систем. Вони є досить автономними одиницями, здатними надавати послуги як людям, так і іншим роботам за гроші. В результаті економіка роботів постає перед нами як загальний набір КФС, що надають послуги та товари безпосередньо на ринок.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Гроші для роботів",
  "Industry 1.0": "Індустрія 1.0",
  "Mechanization:": "Механізація:",
  "replacement of muscle power with steam energy.": "заміна сили м'язів енергією пари.",
  "1784 y.": "1784 р.",
  "Industry 2.0": "Індустрія 2.0",
  "Electrification:": "Електрифікація:",
  "introduction of assembly-line production.": "введення конвеєрного виробництва.",
  "1870 y.": "1870 р.",
  "Industry 3.0": "Індустрія 3.0",
  "Automation:": "Автоматизація:",
  "introduction of automated systems with CNC.": "впровадження автоматизованих систем із ЧПУ.",
  "1969 y.": "1969 р.",
  "Industry 4.0": "Індустрія 4.0",
  "Smart production:": "Розумне виробництво:",
  "development of cyber physical systems.": "розробка кібер фізичних систем.",
  "Now": "Зараз",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "У світі робофірм виявляється природним надати роботам доступ до соціальних інститутів, які раніше були потрібні лише людям.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Соціальні інститути виникають не тому, що люди не можуть жити без банків, контрактів та інших інструментів суспільства. Вони виникають лише тому, що людина в якийсь момент часу ступила на шлях більш складних відносин у суспільстві і зробила важливий крок до прискорення навколишніх процесів.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Гроші та контракти мають стати доступними для роботів не тому, що це хвора фантазія фанатів роботів, які забули, що таке Skynet. Але лише тому, що нова індустріальна революція ставить перед собою завдання побудови складних автоматизованих ланцюгів, процеси в яких впливатимуть на обмін як технічною інформацією, так і економічною, а також відбуватимуться з недоступною для людини швидкістю.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Роботам потрібні гроші, які будуть безпосередньо доступні для них, щоб мати можливість виконувати операції без участі людини зі швидкістю, з якою лише машини можуть приймати рішення. І все це виключно для того, щоб людина насолоджувалася життям у Розумному місті!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "І ось ми плавно підійшли до першої електронної готівки — Bitcoin. Той факт, що Bitcoin можна зберігати на вашому рахунку за принципом не банку, а готівки у вашому гаманці, робить його першими грошима, якими робот може розпоряджатися самостійно, точніше автономно. При цьому вже сьогодні можна сказати, що біткойн — це не просто електронні гроші, а справді глобальний фінансовий інститут.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "У підсумку: подія, вигадана не нами, але явно вписується в наше бачення, робить Bitcoin першими грошима для роботів, або, якщо дивитися ще глибше, то саме тим соціальним інститутом, який сприятиме формуванню роботизованих фірм.",
  "Smart contracts": "Смарт-контракти",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": " Bitcoin став першими грошима, доступними для роботів. При цьому ми не можемо говорити про Bitcoin у його нинішньому вигляді як інструмент повноцінного технічного та економічного обміну.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Нині ми вже маємо смарт-контракти, ринки DeFi та децентралізовану інфраструктуру обміну повідомленнями між роботами, які відкривають перед людством можливість створення повністю автоматизованої частини людської економіки — економіки роботів.",
  "One of the great opportunity to build the economy of robots is": "Одна з чудових можливостей побудувати економіку роботів — це технології",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Завдяки функціональності Ethereum роботи можуть не лише обмінювати гроші, але й укладати контракти з людьми та між собою.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Але який сенс зв’язку між машинами (m2m) на основі контракту? Це чудове запитання! Повернемося до КФС. Коли ми говоримо про прямий зв’язок між датчиками, машинним обладнанням або будь-якими іншими елементами, ми все ще говоримо про співпрацю в рамках однієї регульованої системи. Але якщо ми хочемо, щоб сервіси розумних міст були живі (або навіть розумний дім у деяких випадках), нам потрібно встановити зв’язок із різними сторонніми елементами.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Уявімо службу доставки дронами. Якщо дрон, наприклад, є власністю DHL, як він може отримати доступ до складів Amazon або отримати доступ до всього повітряного простору міста? Чи це буде монополією? Це серйозний виклик багатьом ініціативам четвертої промислової революції!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Більшість корпорацій кажуть, що їм потрібні майже повні права на навколишню територію, тому що вони не знають, як безпечно налаштувати обмін технічною інформацією між автоматизованими системами за межами їхньої власної внутрішньої корпоративної структури. Водночас, якщо подивитися на процеси, де працює людина, то бачимо, що співпраця різних корпорацій давно й успішно існує. Ви легко можете замовити доставку куплених товарів «від дверей до дверей» на сайті Amazon, а кур'єр зможе проїхати автомобілем дорогами міста, отримати замовлення на складі і привезти його до вас.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Яка різниця? У першому випадку немає можливості побудувати договірні відносини між машинами, а у другому випадку в світі людей договірні відносини вже існують.",
  "Parachains": "Парачейни",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Основна складність, з якою сьогодні стикається Робономіка, — це висока ціна за запуск IoT-пристрою з використанням Ethereum. У Ethereum ви повинні сплачувати комісію за кожну транзакцію у доларах США в діапазоні від 10 до 100 доларів. Це досить дорого для більшості випадків з реальної економіки, чи це поїздка на каршерингу, оренда шикарної квартири, доставка дронами або 3D-друк улюбленого аніме-героя на замовлення.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Справедливості заради відзначимо, що в мережі Ethereum 2018-2019 років є вигідні сценарії навіть з комісіями за транзакції. Наприклад, автоматизовані транзакції компенсації вуглецевого сліду або передача замовлення з веб-сайту безпосередньо на виробництво. Але все ж для масового застосування технологій web3 в області IoT потрібне зниження ціни, яку хмара стягує з підключеного пристрою.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Шукаючи можливість знизити вартість взаємодії з пристроєм IoT, розробники Робономіки вивчали альтернативні розробки Ethereum. Наш вибір зупинився на архітектурі",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": ", яка дозволить нам запускати власний блокчейн у загальной мережі, в якій безпека забезпечується валідаторами, незалежними від нашого проекту.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Гетерогенна мережа блокчейнів",
  "Homogeneous Shard Network": "Гомогенна мережа шард",
  "On-chain protocol control": "On-chain управління протоколом",
  "Protection against the tyranny of the crowd": "Захист від тиранії юрби",
  "Auction of bandwidth in the common network": "Аукціони пропускної спроможності в загальной мережі",
  "Payment for gas by users": "Оплата газу користувачами",
  "Have you read this?": "Ви це читали?",
  "Philip K. Dick": "Філіп К. Дік",
  "Autofac": "Autofac",
  "I, Robot": "Я, робот",
  "Isaac Asimov": "Айзек Азiмов",
  "The Bicentennial Man": "The Bicentennial Man",
  "Neuromancer": "Нейромант",
  "William Gibson": "Вільям Ґібсон",
  "Marionettes, Inc.": "Корпорація «Маріонетки»",
  "Ray Bradbury": "Рей Бредбері",
  "Open questions of teleology": "Відкриті питання телеології",
  "and a treatise by L. von Mises": "і трактат Л. фон Мізеса",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "На закінчення хочеться згадати питання, які залишаються відкритими з глобальної точки зору. Яка мета роботів?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Праксеологія надихає нас цікавими уявленнями про людську поведінку без прямої залежності від цілей. Це дає нам можливість працювати над процесами економіки роботів умовно, як з чорною скринькою, не заглиблюючись у кінцеві цілі. У той же час телеологія ставить перед собою завдання пояснити причини.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Ми сподіваємося, що десь на стику праць Мізеса та Вінера може бути знайдена точка для подальшого розвитку економіки роботів, не просто як протоколу взаємодії між людьми та машинами праксеологічного характеру, але з урахуванням телеологічного елементи побудови міжвидової комунікації.",
  "or": "або",
  "Wallpapers": "Шпалери",
  "Cases": "Кейси",
  "Wiki": "Вікі",
  "Academy": "Академія",
  "Github": "Github",
  "Dapp": "Dapp",
  "Robonomics is 100% open-source.": "Robonomics є 100% відкритим джерелом.",
  "Anyone can contribute to": "Будь-хто може внести свій внесок у",
  "the code base": "кодову базу",
  "build services with Robonomics": "створювати сервіси з використанням Robonomics",
  "Translation was executed by AI so there may be some inaccuracies": "Перелад виконано штучним інтелектом, тому можуть бути деякі неточності",
  "Inform us": "Повідомте нас",
  "please": "будь ласка",
  "if you find any": "якщо ви знайдете будь-які",
  "Additional icons for the wallpaper:": "Додаткові значки для шпалер:",
  "Important news &amp; announcements": "Важливі новини та оголошення",
  "All posts": "Всі повідомлення",
  "I agree to receive emails": "Я погоджуюся отримувати електронні листи",
  "Send": "Надіслати",
  "Thanks, your application has been sent!": "Дякуємо, ваша заявка надіслана!",
  "R&D cases": "R&D кейси",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Співпраця з розробником нерухомості на Кіпрі для відстеження щоденного розподілу, споживання та компенсації будь-якого надлишку вуглецевого сліду.",
  "This page is out of your space": "Ця сторінка не знаходиться у вашому просторі",
  "Check url once more or create an": "Перевірте URL ще раз або створіть",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "повідомлення, що ви отримали помилку 404 (не забудьте зазначити поточний URL)",
  "Embedded iot systems": "Автономні системи",
  "Autonomous systems": "Цифрові двійники - це серце Інтернету речей",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Помістіть дані в IPFS та зберігайте хеші в публічному блокчейні",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Тут ми зібрали колекцію NFT, які були випущені протягом нашого великого криптового шляху, як самостійно, так і з великими командами. Ці унікальні токени надають перевірену вланість на блокчейні і стануть чудовими прикрасами для вашого облікового запису блокчейну. Ви можете зробити ставку на деякі з них на аукціоні або навіть випустити свій власний унікальний екземпляр.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Під час нашої початкової кампанії зі збору коштів Kusama ми прийняли рішення винагородити наших крипто-піонерів не тільки токенами, але й подарувати їм кольоровий NFT. Ця картка має велике значення для нас, і якщо хтось її володіє, ми знаємо, що вони є фантастичними прихильниками цінностей Robonomics: свободи та децентралізації.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Ми раді представити нашу спеціальну серію цифрових активів - Robonomics Crypto Girls, створених командою Robonomics Art&Science. Кожен NFT в цій колекції є унікальним графічним представленням технології, що використовується в Robonomics або побудованої на його основі. Наші талановиті художники вручну намалювали кожну дівчину в стилі Robonomics. Ви можете вибрати ту, яка вам найбільше подобається, або зібрати всю серію! Придбавши ці NFT, ви не тільки додаєте стильний елемент до своєї колекції, але й підтримуєте нас у подальшому інноваційному розвитку та впровадженні децентралізованого зв'язку для роботів. Слідкуйте за новими додатками до колекції!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. СЕЗОННІ КОЛЕКЦІЇ NFT",
  "On demand minting": "Можливість миття на вимогу",
  "SEASONAL SPOT NFT COLLECTIONS": "СЕЗОННІ КОЛЕКЦІЇ NFT",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Ці сезонні колекції NFT представляють унікальний цифровий актив, який зафіксовує унікальну взаємодію між користувачем та Spot в межах паралельного простору Robonomics. Користувачі можуть малювати будь-що у браузер, і робот відтворюватиме їх рухи, щоб створити ручне зображення. Після завершення взаємодії NFT випускається на ринку Singular для облікового запису Polkadot користувача. Тепер будь-хто може взаємодіяти з реальним роботом, розташованим у лабораторії в Каліфорнії, щоб створювати персоналізовані та унікальні цифрові активи, які можна володіти, купувати та продавати, як будь-який інший цифровий актив.",
  "Create your NFT": "Створіть свій NFT",
  "4. automated telescope collection": "4. автоматизована колекція телескопів",
  "automated telescope collection": "автоматизована колекція телескопів",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Розташований у пустелі Атакама, Чилі, фізичний телескоп можна отримати за допомогою децентралізованого додатку для отримання зображень астрономічних об'єктів у реальному часі у глибокому космосі. Кожен користувач з підключенням до Інтернету може отримати доступ до нього за допомогою токенів $STRGZN, які можна придбати в додатку за допомогою кредитної картки. Виберіть астрономічний об'єкт, надішліть команду телескопу зробити знімок і зачекайте на випущений NFT на платформі Singular. Зверніть увагу, що додаток доступний лише з 23:00 до 6:00 за Грінвічем через робочі години телескопа.",
  "Try yourself": "Спробуйте самі",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "У співпраці з Polkapets",
  "and": "та",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Як пишний член екосистеми Polkadot, Robonomics взяв участь у світі Polka Pets. Разом з командою Polka Pets ми випустили 1200 NFT з унікальною концепцією дизайну, яка демонструє нашу основну ідею зв'язку. Щоб втілити цю ідею, ми створили персональність: андроїд, який спеціалізується на допомозі людям у взаємодії з будь-яким роботом.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "У 2021 році Robonomics почав підтримувати додавання палет RMRK до свого рантайму, що призвело до нативної інтеграції з найбільш передовою логікою NFT в світі. Щоб відзначити цей визначний момент, ми запустили спеціальний предмет, сумісний з Kanaria - дитячий NFT, який можна використовувати на пташці Kanaria і який може надавати переваги в метавсесвіті RMRK.",
  "RMRK Partnerships": "Партнерства RMRK",
  "This page has moved to a": "Ця сторінка була переміщена на",
  "Automatic redirecting": "Автоматичне перенаправлення",
  "Libelium": "Libelium",
  "Robonomics token": "Токен Робономіки",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "У 1948 році професор математики в МІТ Норберт Вінер опублікував одну з найвпливовіших праць \"Кібернетика: або Керування та комунікація в тварині та машині\". Він вперше використав термін \"кібернетика\" як саморегулюючі механізми, тому ця публікація вважається визнаним кібернетичним днем народження.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Великі книги призводять до великих ідей. Якщо ви шукаєте більше натхнення щодо комунікації людини з машинами, спробуйте прочитати науково-фантастичні книги. Позначте книги, які ви вже прочитали, і подивіться, що ще ми можемо запропонувати вам для подальшого роздуму.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Насправді, економіка людей часто пов'язана з добросовісністю виконання завдань в рамках контракту, бажанням сторін досягти результату, мжливим і альтруїстичним поведінкою особи в суспільстві. Усі ці принципи важко застосовувати до роботизованої економіки. Які мотиви роботизованої економіки? Це відкрите питання, яке нам потрібно досліджувати і обговорювати в суспільстві для кращого розуміння та застосування роботів.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "На початок ми пропонуємо ознайомитися з працею Мізеса \"Людська діяльність: Трактат з економіки\" (праксеологічний підхід) та з ранніми статтями Норберта Вінера \"Поведінка, мета і телеологія\" (телеологічне бачення).",
  "Robonomics wallpapers": "Фони Робономіки",
  "Regular wallpapers": "Звичайні фони",
  "Wallpapers for phones": "Фони для телефонів",
  "Hidden wallpapers": "Приховані фони",
  "This page may need translation": "Ця сторінка може потребувати перекладу",
  "Establishing democracy with smart contracts": "Створення демократії за допомогою розумних контрактів",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Уявімо невеликий офіс з командою з 10-15 осіб. Поки кожен зосереджений на своїх основних професійних завданнях, ніхто не здається звертати увагу на підтримку офісного простору. Найпоширенішим рішенням для уникнення хаосу є наймати сторонніх осіб для підтримки. Інший підхід - взяти ініціативу і накладати штрафи на тих, хто створює безлад або вичерпує запаси без їх поповнення. Однак, чи етично жити під тиранією в нашому майбутньому крипто-анархістичному світі, де від кожного очікується відповідальність і свобода? Давайте прагнемо створити більш демократичне суспільство, використовуючи розумні контракти та нове покоління Інтернет-технологій (часто називають Web3). Нам потрібні інструменти, які допоможуть нам приймати рішення разом, а потім забезпечать їх правильну реалізацію без прямої участі людей.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Хто випив усю каву?!' або трагедія загального користування",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Існує поняття, широко обговорюване в економіці, екології та інших науках, відоме як 'трагедія загального користування'. Це стосується сценарію, в якому особи, які мають доступ до спільного ресурсу, надають перевагу своїм власним інтересам, в результаті чого ресурс вичерпується. Кава дуже нагадує такий ресурс, оскільки вона псується через неконтрольоване споживання в офісі. Однак, зазвичай жоден з членів команди не має бажання витрачати свій час і гроші на отримання додаткового пакету кавових зерен. Тому вони продовжують пити каву, не поповнюючи запаси.",
  "How to formulate the task in numbers.": "Як сформулювати задачу у числах.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Припускаючи щомісячний бюджет на каву в розмірі 100 доларів, що приблизно еквівалентно 150 чашок для нашої команди з 10 осіб, це залишає кожну особу з 1 чашкою кожні 2 дні. Тепер давайте заглибимося в технічні деталі. Питання таке: як ми можемо оживити автономну кавоварку в офісі?",
  "Step 1: automated coffee bean ordering": "Крок 1: автоматичне замовлення кавових зерен",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Ми уклали угоду з бариста Нікітою, який знаходиться поруч з офісом. Він буде постачати нам кавові зерна після отримання сповіщення від бота. Бот надсилає повідомлення, коли кава закінчується, зазначаючи кількість кави (у кілограмах), необхідну для замовлення, та відповідну суму платежу, визначену командою. З цими деталями Нікіта може вибрати каву за своїм смаком.",
  "Step 2: automatic access to smart office.": "Крок 2: автоматичний достп до розумного офісу.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Одночасно з замовленням кавоварка генерує QR-код. Потім Нікіта представляє цей QR-код камері для входу в офіс.",
  "Step 3: distribution of coffee tokens to the team.": "Крок 3: розподіл кавових токенів команді.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Після того, як локальна камера сканує QR-код, система управління розумним будинком ініціює платіж Нікіті та розподіляє нові кавові токени серед членів команди.",
  "Step 4: drink coffee!": "Крок 4: пити каву!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Для отримання свіжої чашки кави член команди повинен надіслати кавовий токен на адресу кавоварки.",
  "Coffee beans delivery process:": "Процес доставки кавових зерен:",
  "Unlock new possibilities with this concept": "Розблокуйте нові можливості з цим концептом",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Крім того, така автоматизована кавоварка вводить різні економічні та соціальні аспекти. Давайте розглянемо їх:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Розробники можуть внести додаткові кавові токени, коли споживання впадає нижче лімту. Це створює прозору систему для різноманітного використання кави в межах ліміту.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "Кавоварка може мати спільний рахунок, що дозволяє членам офісу вносити кошти зі своїх особистих рахунків для отримання кращого досвіду від кави в майбутньому.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Команда спільно вирішує кількість кави, яку машина буде замовляти кожного разу за допомогою голосування DAO. Це надає свободу вирішувати проблему з обмеженими ресурсами.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Програмовані процеси зменшують вплив людських факторів і також пропонують більшу гнучкість у налаштуванні параметрів для конкретних команд.",
  "How we smarten up our coffee machine in real life": "Як ми розуміємо нашу кавоварку в реальному житті",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Щоб мати можливість контролювати кавоварку, ми інтегрували одноплатний комп'ютер, зокрема Raspberry Pi 4, разом з доступною на рину кавоваркою, яка підтримує підключення GPIO. Нашим вибором була",
  "selected for its affordability and the convenience of its easily removable front panel.": "обрана через її доступність та зручність знімної передньої панелі.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Далі ми вирішили деталі щодо токенів, які користувачі можуть надсилати, та базового алгоритму. Ось результат:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Щоб насолодитися чашкою смачної кави, користувачам потрібно надіслати певну суму коштів (у нашому випадку, 1 токен ACT від Statemine, id=3077) на адресу кавоварки з паралелейних ланцюжків (Statemine). Після цього починається процес наливання кави, а потім журнал дій публікується на",
  "via the Datalog function": "за допомогою функції Datalog",
  "When the concept extends beyond the office": "Коли концепція виходить за межі офісу.",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Ця концепція пропонує численні можливості для розширення ідеї. Вона була успішно реалізована в Polkadot Web3 Hub під час Світового економічного форуму 2022 року в Давосі. Учасники могли замовляти каву і вказувати бажаний тип кави (наприклад, еспресо, американо, капучино), відправляючи певну кількість токенів. Давайте поділимося фотографіями та відео з цього заходу:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Наш блокчейн-кавоварка готує каву в Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "DIY або як побудувати свою власну розумну блокчейн-кавоварку",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Ви можете знайти детальний посібник та технічні характеристики в репозиторії GitHub з відкритим кодом. Пам'ятайте, що ви можете використовувати будь-яку кавоварку, яку ви бажаєте, і майже будь-який токен за своїм вибором, щоб оживити цей проект у своєму просторі.",
  "In a nutshell": "В кінцевому підсумку",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Сьогодні стає все більш очевидним, що споживання енергії є основним чинником викидів вуглецю, тому все більш важливо знаходити способи зменшення нашого впливу на навколишє середовище. Офіси та комерційні будівлі відіграють значну роль у споживанні енергії. Інженери компанії Robonomics встановили систему в офісі BBF, кіпрського розробника нерухомості, для відстеження та збору показників електроенергії. Ця система також надає практичний спосіб компенсувати викиди вуглецю.",
  "1. Monitoring surplus energy generation": "1. Моніторинг надлишкового виробництва енергії",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "У будівлі офісу компанії BBF встановлено кілька сонячних панелей, які інтегровано в систему Solarweb, що дозволяє легко збирати аналітику. Система надає дані про загальне споживання електроенергії будівлею та електроенергію, вироблену сонячними панелями. Однак, відсутня важлива функція - можливість компенсувати викиди вуглецю, що виникають внаслідок споживання електроенергії понад те, що вирбляють сонячні панелі.",
  "2. Converting excess energy power to CO2 offset": "2. Перетворення надлишкової енергії на компенсацію CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Маючи дані про загальне споживання електроенергії та виробництво електроенергії сонячними панелями, можна легко розрахувати викиди вуглецю. Припускається, що електроенергія від сонячних панелей має викид вуглецю 0, що означає, що компенсація необхідна лише за споживану електроенергію, яка перевищує вироблену сонячними панелями.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "На замітку, викиди CO2 відрізняються в різних країнах. В Кіпрі середнє забруднення становить 587 г/кВт-год, за даними Ханны Рітчі, Макса Розера та Пабло Росадо (2022) - \"Енергетика\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Для компенсації викидів вуглецю використовуються вуглецеві кредити, кожен з яких представляє 1 тонну CO2. Ці кредити відіграють важливу роль у компенсаії впливу на навколишнє середовище, спричиненого споживанням електроенергії понад внесок сонячних панелей.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Таким чином, маючи дані про споживання енергії, виробництво сонячних панелей та кіпрський коефіцієнт, стає легким визначити кількість токенів, необхідних для компенсації викидів вуглецю.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Для досягнення цього ми використали Raspberry Pi, налаштували Home Assistant для збору аналітичних даних та розробили інтеграцію для компенсації викидів. Панель керування енергією Home Assistant показує наступні деталі:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Крім того, наша інтеграція покращує систему, пропонуючи зручну панель керування для перегляду статистики та запуску компенсації:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Нижче наведено ілюстративний приклад того, як відбувається компенсація викидів вуглецю через нашу інтеграцію. Після успішного завершення",
  "transaction": "транзакції",
  "unfolds as follows:": "відбувається наступне:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Зменшення споживання енергії в офісі так само важливо, як компенсація викидів вуглецю. Ми можемо досягти цього, роблячи невеликі зміни, такі як використання енергоефективного освітлення та приладів та дотримання належного утримання офісного обладнання.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Споживання енергії є великою частиною нашого викиду вуглецю, і бізнеси повинні внести свій внесок у збереження навколишнього середовища. Мати систему, яка відстежує споживання енергії та допомагає компенсувати викиди вуглецю, може значно зменшити вплив офісної будівлі на навколишнє середовище. За допомогою правильного підходу бізнеси можуть сприяти зеленому майбутньому.",
  "The way forward": "Шлях вперед",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Стратегія перетворення кавової машини в автономний роботизований пристрій",
  "Robot and electrics sheep artboard": "Малюнок «Робот і електрична вівця»",
  "Robot and apple artboard": "Малюнок «Робот і яблуко»",
  "Robot and cosmonaut artboard": "Малюнок «Робот і космонавт»",
  "Robot and cat artboard": "Малюнок «Робот і кіт»",
  "Space travelers artboard": "Малюнок «Космічні мандрівники»",
  "Coloured astronaut artboard": "Малюнок «Кольоровий астронавт»",
  "Black and white astronaut artboard": "Малюнок «Чорно-білий астронавт»",
  "icons for macos": "Іконки для macOS",
  "icons for windows": "Іконки для Windows",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Олександр Капітонов, Сергій Лоншаков, Віталій Булатов, Бабак Кіа Монтазам, Джеймс Вайт",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Іван Берман, Енріка Зерейк, Олександр Капітонов, Фабіо Бонсіньоріо, Алішер Хасанов, Азіза Оріпова, Сергій Лоншаков, Віталій Булатов",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Вадим Манаєнко, Олександр Капітонов, Іван Берман",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Олександр Капітонов; Іван Берман; Вадим Манаєнко; В'ячеслав Ржевський; Віталій Булатов; Артемій Зенкін",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ілья Афанасьєв, Олександр Колотов, Руслан Резін, Константин Данилов, Мануель Маззара, Субхам Чакраборті, Алексей Кашевнік, Андрей Чечулін, Олександр Капітонов, Володимир Йоцов, Андон Топалов, Нікола Шакев, Севіл Ахмед",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Олексадр Капітонов, Сергій Лоншаков, Іван Берман, Едуардо Кастельо Феррер, Фабіо П. Бонсіньоріо, Віталій Булатов, Олександр Свістов",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Олександр Капітонов, Іван Берман, Сергій Лоншаков, Олександр Крупенкін, Віталій Булатов",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Константин Данилов; Руслан Резін; Ілья Афанасьєв; Олександр Колотов",
  "Alastair Marke": "Аластер Марке",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Сергій Лоншаков, Олександр Крупенкін, Олександр Капітонв, Євген Радченко, Алішер Хасанов, Олександр Старостін",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Олександр Капітонов, Іван Берман, Сергій Лоншаков, Олександр Крупенкін",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Олександр Капітонов, Іван Берман, Віталій Булатов, Сергій Лоншаков, Олександр Крупенкін",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Антон Галенович, Сергій Лоншаков, Олексей Шадрін",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Олександр Капітонов, Сергій Лоншаков, Олександр Крупенкін, Іван Берман",
  "The latest Robonomics news here.": "Останні новини Robonomics тут.",
  "Follow us": "Слідкуйте за нами",
  "Video tutorials, screencasts, interviews, events.": "Відеоуроки, скрінкасти, інтерв'ю, події.",
  "Watch videos": "Дивіться відео",
  "Chat with us and our community. Feel free to ask any questions and discuss your suggestions.": "Чатуйте з нами та нашою спільнотою. Задавайте будь-які питання та обговорюйте свої пропозиції.",
  "Join chat": "Приєднуйтесь до чату",
  "Medium Blog": "Блог Medium",
  "Our vision of the past, nowdays and future about Robonomics, Ethereum, Polkadot networks, green markets, robotics, and everything, that connected with Robonomics.": "Наше бачення минулого, сьогодення та майбутнього про Robonomics, Ethereum, Polkadot мережі, зелені ринки, робототехніку та все, що пов'язано з Robonomics.",
  "Read": "Читати",
  "Telegram chat": "Чат Telegram",
  "Local communities & news. You are welcome!": "Місцеві спільноти та новини. Ви вітаєтеся!",
  "On the Way to Sovereign Home Automation": "У шляху до суверенної домашньої автоматизації",
  "World Economic Forum Annual Meeting 2022": "Щорічна зустріч Світового економічного форуму 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Стати парачейном для IoT-додатків",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (підтримується Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Зимова школа Robonomics 2021 (організована Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Перехід до багатомережевості - Ось і прийшов Polkadot",
  "The Rise of Robonomics Network": "Підйом мережі Robonomics",
  "Crypto Valley Conference 2018": "Конференція Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Семінар Європейського парламенту «Економіка роботів»",
  "Consensus 2018 conference": "Конференція Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Симпозіум з блокчейну для робототехнічних систем в Медіа-лабораторії MIT",
  "Robonomics-2018 summer school hosted by Robonomics.": "Літня школа Robonomics-2018, організована Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Інтеграція Fronius Solar.web з Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Одна з наших цілей у розробці цього випадку - перетворити Robonomics в проміжний програмний засіб ROS 2. Це дозволить нам використовувати Robonomics на Substrate для створення додатка, який може працювати з ROS 2 прямо з браузера!",
  "Eisenkoch, the robot chef": "Ейзенкоч, робот-кухар",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Реальний випадок для робота, оснащеного двома вафельними прасками, який готує 6 вафель одночасно за 5-7 хвилин.",
  "Blockchain-powered smart coffee machine": "Смарт-кавоварка на основі блокчейну",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Кавоварка Robonomics - це смарт-кавоварка, інтегрована в мережу Robonomics. Цей проект має на меті показати потенціал Robonomics у сфері Інтернету речей на реальному прикладі.",
  "Water environmental inspector": "Інспектор водного середовища",
  "Air monitoring network": "Мережа моніторингу повітря",
  "Production quality control platform “Feecc”": "Платформа контролю якості виробництва «Feecc»",
  "Backup and archiving service for robotics companies": "Сервіс резервного копіювання та архівування для робототехнічних компаній",
  "Public lab with Boston Dynamics Spot": "Публічна лабораторія з роботом Boston Dynamics Spot",
  "Autonomous telescope service": "Автономний сервіс телескопа",
  "Smart home secure remote control and backup service": "Безпечне дистанційне керування та резервне копіювання розумного будинку",
  "Blockchain as quality control system for chemistry": "Блокчейн як система контролю якості для хімії",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Справжнє зменшення викидів CO2 за допомогою блокчейн-підтверджених сертифікатів",
  "Robot-artist Gaka-Chu": "Робот-художник Гака-Чу",
  "Demo “Get the weather of Fuji mountain”": "Демонстрація «Отримання погоди гори Фудзі»",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Основна ідея, яку автори Robonomics намагалися передати раніше, - це природна, логічна і, здається, необхідна еволюція від поточного рівня економіки до повністю автоматизованих послуг. Автоматизовані послуги повинні мати здатність говорити мовою людської економіки і також власної економіки машин для виконання різних операцій у світі навколо них зі швидкістю, недоступною для людей.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Розробка та застосування Інтернету речей показали, що вирішення типових проблем недостатньо. З'явилися зовсім нові концепції і принципи, засновані на раніше допущених помилках і виявлених недоліках. Цей зручний підхід до використання хмарних сервісів виявився з низкою критичних недоліків, пов'язаних з масштабованістю, конфіденційністю та безпекою. В намаганні вирішити ці проблеми було запропоновано наблизити обробку даних, логіку та обчислення до безпосереднього місця їх використання. Таким чином, з'явилися концепції туманного та реберного обчислення, з проміжними системами між хмарою та пристроями, які беруть на себе деякі функції хмари. Тому створення реберних систем стало одним з нових викликів побудови Інтернету речей.",
  "the Robonomics Parachain portal": "портал Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Управління вуглецевим слідом, підтвердженим блокчейном",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Також продовжувалися співпраці з рідкісними проектами. Robonomics та DAO IPCI представили сервіс для збору та аналізу сенсорних даних -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "І що так науково цікаво, виходячи з ідеї обмежень, накладених ринком на розмір фірми, можна сказати, що межа зростання CPS завжди буде визначатися ринком і для цього не потрібно нічого іншого.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Один з прикладів наших експериментів: переговори про дорожній простір та платежі за право проїзду для автономних транспортних засобів з метою зменшення заторів. Те, що людина абсолютно не зробила б у дорожньому русі, автомобіль зробить для вас без проблем: ви хочете перестроїтися, ваш автомобіль та автомобіль вашого сусіда обмінюються пропозиціями щодо вартості такої операції зі швидкістю сотень повідомлень на секунду, вони виявлять рівновагову ціну, і ви вже знаходитесь в наступному швидкому рухомому ряду. Це означає, що тепер ви зможете \"зарядити\" свою поїздку з uber та зробити її швидшою.",
  "Important news and announcements": "Важливі новини та оголошення",
  "Robonomics White Paper": "Robonomics Білий Папір",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Тут ви можете знайти та завантажити (звичайно, абсолютно безкоштовно) перший Білий Папір Robonomics, який був представлений у травні 2018 року. Хоча з того часу багато що змінилося, основи Robonomics все ще описані в цьому документі.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Самозайнятий автономний робот-художник",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Кооперативна безградієнтна локалізація та відстеження рухомих меж навколишнього середовища командами неголономних роботів",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Робот-як-сервіс: від технологій хмари до технологій пірінгу",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Довірчий моніторинг навколишнього середовища за допомогою мереж датчиків на розповзаючихся автономних морських суднах та технології розподіленого реєстру",
  "Digital Passport for Unmanned Vehicles": "Цифровий паспорт для безпілотних транспортних засобів",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics як блокчейн-платформа для управління рухом безпілотних транспортних засобів",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Шлях до блокчейн-базових багентних роботизованих систем: аналіз, класифікація та застосування",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Роботизовані сервіси для нових парадигм розумних міст на основі децентралізованих технологій",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Протокол для організації децентралізованої мережі автономних агентів на фабриках з використанням ринкових механізмів",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Шлях до блокчейн-базового Robonomics: перевірка поведінки автономних агентів",
  "Transforming Climate Finance and Green Investment with Blockchains": "Трансформація фінансування клімату та зелених інвестицій за допомогою блокчейнів",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: платформа для інтеграції кіберфізичних систем в людську економіку",
  "Blockchain based protocol for economical communication in industry 4.0": "Протокол на основі блокчейну для економічного спілкування в промисловості 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics на основі блокчейну як принцип створення розумних фабрик",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Екосистема блокчейну для вуглецевих ринків, екологічних активів, прав та зобов'язань: концепт-дизайн та реалізація",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Протокол на основі блокчейну для автономної бізнес-діяльності багентних систем, що складаються з БПЛА",
  "English": "Англійська",
  "Russian": "Російська",
  "Chinese": "Китайська",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics - це відкрита платформа, яка сприяє як простим IoT-сервісам, так і складній робототехніці, забезпечуючи ефективну комунікацію між агентами, будь то людиною або роботом. Для інтеграції роботів у цю систему ми використовуємо ROS. У цій статті ми маємо на меті надати огляд нашого процесу інтеграції Robonomics у ROS 2.",
  "Why ROS 2 in Robonomics?": "Чому ROS 2 в Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, Операційна система роботів, є однією з найстаріших відкритих фреймворків для робототехніки. Це колекція програмних бібліотек і інструментів для робототехніки. Вона має все, від основ до розширених функцій і постачається зручними інструментами для програмістів. Вона широко використовується університетами по всьому світу для навчання та досліджень у галузі робототехніки, тому вона добре встановлена, працює з багатьма типами роботів і має велику спільноту розробників.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "З моменту запуску ROS у 2007 році в галузі робототехніки та в спільноті ROS відбулися значні зміни. Як відповідь на ці зміни, був представлений ROS 2 з метою адаптації до цих змін. Він ґрунтується на перевагах ROS 1, вирішуючи його обмеження. Ми використовували ROS у Robonomics з самого початку, і тепер настав час для нас мігрувати до ROS 2.",
  "You might find this interesting": "Ви можете знайти це цікавим",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Існує безліч відкритих роботів та складних робототехнічних платформ, які підтримують ROS. Це означає, що ви можете створити вражаючу мультироботну систему для досягнення ваших конкретних цілей. Для ",
  "the most current list of supported robots": " найактуальнішого списку підтримуваних роботів ",
  "please visit the ROS website.": "відвідайте веб-сайт ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Давайте подивимося, як ROS використовується в рамках фреймворку Robonomics, уявивши весь систему з Robonomics, діючим як різні шари:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "На рівні 'Машинний інтерфейс' нам потрібні інструменти дл безшовного з'єднання роботів з програмним забезпеченням. ROS 2 надає надійний набір інструментів розробника, які ідеально підходять для цієї задачі.",
  "Robonomics packages for ROS and ROS 2": "Пакети Robonomics для ROS і ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "Побудова багатороботних систем часто включає в себе виклик підключення пристроїв від різних виробників або навіть пристроїв в межах одного виробника, кожен з яких використовує різні протоколи. Незалежно від того, чи це розумний домашній комплект або автоматизоване виробництво, ефективна комунікація між вашими машинами є вирішальною. ROS (і, звичайно, ROS 2) пропонує різні режими для вирішення цієї проблеми. Що, якщо ви могли б налаштувати завдання, а ROS керував комунікацією між вузлами?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Команда Robonomics створила різні пакети для ROS, щоб зробити роботів розумнішими а виконувати конкретні завдання за потребою. Щоб побачити завдання, які ми виконали з ROS, перегляньте нашу сторінку з випадками дослідження та розробки. Майже кожна взаємодія з роботом базується на ROS. Ви можете знайти наші відкриті пакети Robonomics для ROS на GitHub, а ось деякі з них:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Стек комунікації Robonomics містить набір пакетів ROS для економічної комунікації.",
  "Robonomics' contribution in the ROS 2 community": "Внесок Robonomics у спільноту ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics поєднує робототехніку з технологіями Web3, і ми прагнемо розвиватися в цих галузях. Після введення ROS 2 ми визначили три основні виклики, які пов'язані з підтримкою спільноти ROS 2 та покращенням можливостей Robonomics:",
  "Creating ROS 2 tools for Rust:": "Створення інструментів ROS 2 для Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Ці інструменти дозволяють розробникам писати додатки ROS 2 з використанням Rust. Щоб дізнатися більше про те, чому ми обрали Rust і значення цього проекту для нас, ви можете знайти",
  "additional details": "додаткові деталі",
  "Developing Robonomics Middleware for ROS 2:": "Розробка проміжного програмного забезпечення Robonomics для ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Це відіграє важливу роль у забезпеченні безшовної інтеграції Robonomics у різноманітні багатороботні системи з використанням ROS 2. Воно може сприяти інтеграції роботів у технології блокчейн Web 3, а також зменшувати помилки під час процесу інтеграції, що дозволяє зекономити час і кошти.",
  "Creating a robotics lab with ROS 2:": "Створення лабораторії робототехніки з ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Оскільки ROS 2 набуває популярності в робототехнічній спільноті, ми бажаємо бачити більше роботів та обладнання, що працюють з ROS 2. Нашою метою є підключення їх до екосистеми Web3 за допомогою Robonomics.",
  "Research papers": "Наукові статті",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Без наукових досліджень розвиток складних систем, які можуть бути інтегровані в наше повсякденне життя, може втратити свою мету або навіть створити ризики. Ми повинні ретельно обдумувати наш напрямок, цілі та потенційні наслідки. Сфери, в яких працює Robonomics, зокрема робототехніка, економічні відносини та технології Web3, варто вивчати окремо, досліджуючи, як їх можна інтегрувати один з одним та оцінюючи їх потенційний вплив на наше життя.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Цей випадок наразі знаходиться в русі; не пропустіть новини - підпишіться на оновлення у полі нижче",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "Кавоварка 'Robonomics Coffee' - це розумна кавоварка, інтегрована в мережу Robonomics. Цей проект має на меті продемонструвати потенціал Robonomics у сфері Інтернету речей на прикладі реального світу.",
  "Digital twins are the heart of the internet of things": "Цифрові двійники є серцем Інтернету речей",
  "\"Main tasks of robonomics architecture": "\"Основні завдання архітектури робономіки",
  "No posts yet": "Ще немає записів",
  "If you want to help us with translation": "Якщо ви хочете допомогти нам з перекладом",
  "contact us at": "зв'яжіться з нами за адресою",
  "send": "надіслати",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics - це 100% відкрита, безпечна, ефективна за вартістю та майбутнєорієнтована платформа Інтернету речей для з'єднання робототехніки під контролем Polkadot та Ethereum. Будь-хто може створювати сервіси з Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Нижче наведений список наших перевірених застосувань сучасних технологій робототехніки.",
  "By interest:": "За інтересами:",
  "Sort by progress:": "Сортувати за прогресом:",
  "Any progress": "Будь-який прогрес",
  "Complete": "Завершено",
  "Proceeding": "В процесі",
  "Sort by time:": "Сортувати за часом:",
  "Recent": "Останні",
  "Earliest": "Найраніше",
  "Show more": "Показати більше",
  "logos and assets": "логотипи та активи",
  "Download the Robonomics logos here. We've got two options for your": "Завантажте логотипи Robonomics тут. У нас є два варіанти для вашої",
  "basic needs": "основних потреб",
  "and one designed for": "і один розроблений для",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "токену. Крім того, відкрийте оптимальну",
  "color palette": "палітру кольорів",
  "for the distinguished Robonomics brand": "для видатного бренду Robonomics",
  "Robonomics logos": "логотипи Robonomics",
  "Download all": "Завантажте всі",
  "XRT logos": "логотипи XRT",
  "Recommended color palette": "Рекомендована палітра кольорів",
  "RWS logos": "Логотипи RWS",
  "Buy in Telegram bot": "Купити в Telegram-боті",
  "Smart Devices": "Розумні пристрої",
  "Control your home": "Контролюйте свій дім",
  "Be smart": "Будьте розумними",
  "Be independent": "Будьте незалежними",
  "Support it on hackster.io": "Підтримайте його на hackster.io",
  "Product 1: Universal IR Remote Control": "Продукт 1: Універсальний ІЧ-пульт дистанційного керування",
  "Build smart climate control with any ANY A-N-Y air conditioner, setup open/close operations for any ANY A-N-Y gates in your home. We’ve built universal IR remote control with an open-source Tasmota firmware onboard. We installed USB-C port for your better experience - upgrade the firmware for the remote control just with a simple wired connection!": "Створіть розумний клімат-контроль з будь-яким кондиціонером, налаштуйте відкриття/закриття будь-яких воріт у вашому домі. Ми створили універсальний ІЧ-пульт дистанційного керування з вбудованою відкритою прошивкою Tasmota. Ми встановили порт USB-C для вашого кращого досвіду - оновлюйте прошивку пульта дистанційного керування просто за допомогою простого проводового підключення!",
  "Supports wide range of devices": "Підтримує широкий спектр пристроїв",
  "Home Assistant Friendly": "Сумісний з Home Assistant",
  "Product 2: Smart Energy Power Consumption Monitoring": "Продукт 2: Розумний вимірювач споживання електроенергії",
  "Efficient energy monitoring consumption": "Ефективний моніторинг споживання енергії",
  "Doesn’t need any cloud service": "Не потребує жодних хмарових сервісів",
  "You are currently opted out. Click here to opt in.": "Ви в даний момент відмовилися. Натисніть тут, щоб погодитися.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Відмова виконана; ваші відвідування цього веб-сайту не будуть записуватися інструментом веб-аналітики. Зверніть увагу, що якщо ви очистите файли cookie, видалите файли cookie відмови або зміните комп'ютери або веб-браузери, вам доведеться знову виконати процедуру відмови.",
  "Please click below to opt in:": "Натисніть нижче, щоб погодитися:",
  "You are currently opted in. Click here to opt out.": "Ви в даний момент погодилися. Натисніть тут, щоб відмовитися.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Ви можете відмовитися від призначення унікального номера ідентифікації файлу cookie веб-аналітики для вашого комп'ютера, щоб уникнути агрегації та аналізу даних, зібраних на цьому веб-сайті.",
  "To make that choice, please click below to receive an opt-out cookie": "Щоб зробити цей вибір, натисніть нижче, щоб отримати файл cookie відмови",
  "Privacy Policy": "Політика конфіденційності",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Ця політика описує інформацію, яку ми збираємо від вас, як ми використовуємо цю інформацію та нашу правову підставу для цього. Вона також охоплює питання про те, чи як ця інформація може бути розповсюджена та ваші права та вибори щодо наданої вами інформації.",
  "Where are those annoying cookie consent pop-ups": "Де знаходяться ті надокучливі спливаючі вікна з погодженням на використання файлів cookie",
  "We don't need cookie consent is needed because": "Нам не потрібне погодження на використання файлів cookie, оскільки",
  "Tracking cookies are not used": "Використання відстежувальних файлів cookie не здійснюється",
  "The data is not used for any other purpose than analytics": "Дані не використовуються для інших цілей, крім аналітики",
  "Visitors aren't tracked across websites": "Відвідувачі не відстежуються між веб-сайтами",
  "A user cannot be tracked across days within the same website": "Користувач не може бути відстежений протягом декількох днів на тому ж веб-сайті",
  "What We Collect and Receive": "Що ми збираємо та отримуємо",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include": "Для того, щоб надати вам найкращий досвід на наших веб-сайтах, нам потрібно зібрати та обробити певну інформацію. Залежно від вашого використання послуг, це може включати",
  "Contact us via email": "Зв'яжіться з нами електронною поштою",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "наприклад, коли ви надсилаєте наші форми, надсилаєте нам запитання чи коментарі або повідомляєте про проблему, ми збираємо ваше ім’я, адресу електронної пошти, повідомлення тощо. Ми використовуємо ці дані виключно для відповідей на запити, які ми отримуємо.",
  "Usage data": "Дані про використання",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "коли ви відвідуєте наш веб-сайт, ми зберігатимемо: URL-адресу, з якої ви відвідали нас, веб-сторінки нашого веб-сайту, які ви відвідуєте, дату та тривалість вашого відвідування, вашу анонімізовану IP-адресу, характеристики пристрою (тип пристрою, операційна система, роздільна здатність екрана, мова, країна, у якій ви перебуваєте, і тип веб-браузера), який ви використовували під час свого візиту, а також",
  "other": "інший",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "неперсональні дані. Ми обробляємо ці дані про використання лише на нашому сервері, не передаючи їх третім особам",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "платформа веб-аналітики, яка надає нам 100% володіння даними. Ця аналітика допомагає нам покращити взаємодію з нашим веб-сайтом, а також розпізнавати та припиняти будь-які зловживання.",
  "Non-personalized cookies": "Неперсоналізовані файли cookie",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "ми використовуємо файли cookie без відстеження (невеликі файли даних, які сайти передають на комп’ютери або пристрої) для цілей ведення записів і для покращення функціональності нашого веб-сайту. Ви можете вимкнути або обмежити передачу цих файлів cookie, змінивши налаштування веб-браузера або відмовившись на цій сторінці у формі нижче. Уже збережені файли cookie можуть бути видалені в будь-який час.",
  "Opt-out of website tracking": "Відмова від відстеження веб-сайту",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Ви можете відмовитися від відстеження нашим примірником Matomo Analytics нижче:",
  "Your Rights": "Ваші права",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Ви маєте право на отримання інформації про персональні дані, які обробляє Matomo, право на виправлення/виправлення, видалення та обмеження обробки. Ви також маєте право вимагати від нас структурований, загальний і машиночитаний формат Персональних даних, які ви нам надали",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Ми можемо ідентифікувати вас лише за вашою адресою електронної пошти, і ми можемо виконати ваш запит і надати інформацію, лише якщо ми маємо персональні дані про вас через те, що ви безпосередньо зв’язалися з нами та/або ви використовуєте наш сайт і/або службу. Ми не можемо надавати, виправляти чи видаляти будь-які дані, які ми зберігаємо від імені наших користувачів або клієнтів.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Щоб скористатися будь-яким із прав, зазначених у цій Політиці конфіденційності, та/або у разі виникнення запитань чи коментарів щодо використання Персональних даних ви можете зв’язатися з нами.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Крім того, ви маєте право подати скаргу до органу захисту даних у вашій юрисдикції.",
  "Retention of data": "Збереження даних",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Network legal rights.": "Ми зберігатимемо вашу інформацію до тих пір, поки це необхідно для надання вам послуг або іншим чином, як зазначено в цій Політиці. Ми також зберігатимемо та використовуватимемо цю інформацію за потреби для цілей, викладених у цій Політиці, і в обсязі, необхідному для дотримання наших юридичних зобов’язань, вирішення суперечок, забезпечення виконання наших угод і захисту законних прав Robonomics Network.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations": "Ми також збираємо та зберігаємо зведену, анонімізовану або псевдонімізовану інформацію, яку ми можемо зберігати необмежений час для захисту безпеки та безпеки нашого Сайту, покращення наших Послуг або дотримання юридичних зобов’язань",
  "Devices": "Пристрої",
  "type-c for OSS firmware upgrading": "тип-с для оновлення прошивки OSS",
  "WI-FI": "WI-FI",
  "MQTT": "MQTT",
  "Why should you install any corporate app for switching on/off your smart light?  Our wi-fi smart switches doesn’t require any cloud connection. We tried out many other switches from various manufactureres all over the world and know some important details to make comfortable device. As other smart devices from Robonomics it is fully compatible with Home Assistant, uses open-source upgradable firmware Tasmota.": "Чому вам потрібно встановлювати корпоративний додаток для включення / вимикання вашого розумного світла? Наші wi-fi розумні вимикачі не потребують жодного хмарного підключення. Ми випробували багато інших вимикачів від різних виробників з усього світу і знаємо деякі важливі деталі, щоб зробити комфортний пристрій. Як і інші розумні пристрої від Robonomics, він повністю сумісний з Home Assistant, використовує відкриту прошивку Tasmota, яку можна оновити.",
  "large touchable  buttons": "великі сенсорні кнопки",
  "Product 5: Air Quality Sensor": "Продукт 5: Датчик якості повітря",
  "Join with this air quality sensor to the decentralized opensource sensors map which operates with the sole intent of serving the free will of individuals. This sensor is ready to install, you will need wi-fi and a power socket, it can be installed both indoor and outdoor. Includes PM2.5/PM10 sensor and temperature/humidity sensor, can be expanded with several types of additional sensors (VOC, CO2, atmospheric pressure).": "Приєднуйтесь до цього датчика якості повітря до децентралізованої карти відкритих датчиків, яка працює з єдиним наміром служити вільній волі особистості. Цей датчик готовий до установки, вам знадобиться wi-fi і розетка, його можна встановити як у приміщенні, так і на вулиці. Включає датчик PM2.5 / PM10 і датчик температури / вологості, може бути розширений декількома типами додаткових датчиків (VOC, CO2, атмосферний тиск).",
  "Measures PM2.5/PM10": "Вимірює PM2.5 / PM10",
  "Can be added as a part of global sensor map or your own fork": "Може бути доданий як частина глобальної карти датчиків або вашої власної гілки",
  "Compatible with luftdaten": "Сумісний з luftdaten",
  "View specification": "Переглянути специфікацію",
  "Robonomics Middleware Framework for ROS 2": "Робономічс Middleware Framework для ROS 2",
  "Twitter": "Twitter",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Buy devices": "Придбати пристрої",
  "Have you ever wondered what consumes the most electricity in your home? Our smart energy power meter is designed to help you identify the major sources of electricity usage and prevent unwanted energy leaks. This energy meter works both, with an individual asset or an entire building, doesn’t need any cloud, MQTT protocol onboard, can be used with Home Assistant and it’s useful energy management dashboard.": "Чи коли-небудь ви задумувалися, що споживає найбільше електроеергії у вашому будинку? Наш розумний енергометр призначений для допомоги вам виявити основні джерела споживання електроенергії та запобігти небажаному витоку енергії. Цей енергометр працює як з окремим активом, так і з усією будівлею, не потребує жодних хмар, має протокол MQTT на борту, може використовуватися з Home Assistant та має корисну панель керування енергією.",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Об'єднання технологій Web3 та роботичних фреймворків",
  "Playing with Human-Machine Interaction through Ethereum": "Гра з взаємодією людини та машини через Ethereum",
  "We are an autonomous team with extensive expertise in robotics, blockchain, and IoT. Having a deep understanding of the challenges faced by advanced smart home users, we've chosen to venture into manufacturing our own devices. Take control of your home, save energy, and liberate yourself from corporate clouds and device limitations with us!": "Ми є автономною командою з великим досвідом у робототехніці, блокчейні та Інтернету речей. Маючи глибоке розуміння проблем, з якими стикаються користувачі розумного дому, ми вирішили ризикувати та виробляти власні пристрої. Беріть контроль над своїм домом, економте енергію та звільняйте себе від корпоративних хмар та обмежень пристроїв разом з нами!",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Ця інформація про дослідження застаріла. Для актуальних уроків та майстер-класів відвідайте нашу",
  "academy": "академію",
  "Free worldwide shipping starts from February 2024": "Безкоштовна доставка по всьому світу починається з лютого 2024 року",
  "Free worldwide shipping starts from January 2024": "Безкоштовна доставка по всьому світу починається з січня 2024 року",
  "It's gonna get worse": "Це стане ще гірше",
  "DIY": "Саморобка",
  "your own safe": "власний сейф",
  "smart space": "розумний простір",
  "manifest": "маніфест",
  "Have you ever wondered why, in the process of evolution on Earth, the human species prevailed instead of, for example, fungi? Even now, it's challenging to provide a definitive answer to this question. The success of Homo sapiens is often attributed to successful cooperation, but then why not bees or ants? Our survival is also owed to a crucial characteristic—the autonomy of an individual within the population. In other words, the ability not to unquestionably submit to the queen bee. Ultimately, the group where each member has the right to be independent prevails.": "Чи коли-небудь задумувалися ви, чому, у процесі еволюції на Землі, людський вид переважив, а не, наприклад, гриби? Навіть зараз важко дати остаточну відповідь на це питання. Успіх Homo sapiens часто пов'язують з успішною співпрацею, але чому не бджоли або мурахи? Наше виживання також залежить від важливої характеристики - автономії окремої особи в межах популяції. Іншими словами, здатності не безперечно підкорятися матці-бджолі. У кінцевому рахунку, група, де кожен член має право на незалежність, переважає.",
  "Unfortunately, those who proclaim themselves arbiters of human destinies rarely contemplate the true laws of nature. Politicians and major corporations engage in strategic games, where the populace is treated as mere units. This dynamic existed before the advent of computer games and has persisted since: 'buying units,' 'building units,' 'removing units'—throughout history, various ruling structures around the world have resorted to such dehumanizing terms when dealing with other people. However, almost invariably, to commit crimes against humanity, these rulers require enforcers, who, in turn, have their subordinates. Therefore, over the last 200 years, such stark dystopias in the vein of the book '1984' typically endure for no more than one or two generations.": "На жаль, ті, хто проголошують себе суддями людських долень, рідко розглядають справжні закони природи. Політики та великі корпорації займаються стратегічними іграми, де населення розглядається як прості одиниці. Ця динаміка існувала до появи комп'ютерних ігор і триває й досі: 'купівля одиниць', 'створення одиниць', 'видалення одиниць' - протягом історії різні правлячі структури по всьому світу вдаються до таких дезлюднюючих термінів, коли мають справу з іншими людьми. Однак, майже завжди, для вчинення злочинів проти людства, цим правителям потрібні виконавці, які, у свою чергу, мають своїх підлеглих. Тому, протягом останніх 200 років, такі яскраві дистопії в дусі книги '1984' зазвичай існують не більше, ніж одне-дві покоління.",
  "This is exactly where we are all heading now. And this could be just the beginning of a widespread nightmare that will quietly embed itself in the lives of many modern people in a twisted way.": "Ось куди ми всі зараз рухаємося. І це може бути лише початком широко поширеного кошмару, який тихо вкоріниться в житті багатьох сучасних людей по кривавому шляху.",
  "We, the Robonomics team, aim to redirect the development of IoT towards a more open and secure path. We've": "Ми, команда Robonomics, маємо на меті перенаправити розвиток Інтернету речей на більш відкритий і безпечний шлях. Ми вже",
  "introduced": "запровадили",
  "an independent web3 cloud for IoT, allowing your home to stay connected autonomously, and communication with the manufacturer's server is only optional. Currently, we have started producing our own": "незалежний хмарний веб3 для Інтернету речей, що дозволяє вашому будинку залишатися підключеним автономно, а спілкування з сервером виробника є лише необов'язковим. Наразі ми почали виробляти свої власні",
  "IoT devices": "пристрої Інтернету речей",
  "based on open hardware and open software. Our goal is to create a fully open hardware-software system that won't let any digital intruders into your apartment. So, with our innovations, you can enjoy your time in the bedroom as you wish!": "на основі відкритого апаратного та програмного забезпечення. Нашою метою є створення повністю відкритої апаратно-програмної системи, яка не дозволить жодним цифровим зловисникам потрапити до вашої квартири. Таким чином, завдяки нашим інноваціям, ви можете насолоджуватися часом у спальні так, як вам заманеться!",
  "Home assistant themes": "Теми для домашнього помічника",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Налаштуйте свій домашній помічник за допомогою наших безкоштовних тем. Дотримуйтесь інструкцій для встановлення на",
  "Home Assistant themes": "Теми для домашнього помічника",
  "Why human?": "Чому людина?",
  "In the name of free will...": "В ім'я свободи волі ...",
  "Can IoT be dangerous?": "Чи може Інтернет речей бути небезпечним?",
  "What can unsettle the balance between freedom and subordination is the Internet of Things (IoT). Completely confining people, for example, is no easy task these days. A recent case with the quarantine vividly illustrated this: in Shanghai, exits from homes were sealed, and it was such a disturbing action by the authorities that these measures remained in place for no more than 3 months.": "Те, що може підривати рівновагу між свободою та підпорядкуванням, це Інтернет речей (IoT). Повністю обмежувати людей, наприклад, не є легким завданням в наші дні. Останній випадок з карантином яскраво це проілюстрував: в Шанхаї виходи з будинків були запечатані, і це була настільки тривожна дія влади, що ці заходи залишилися на місці не більше 3 місяців.",
  "But what if goals could be achieved without turning to such obvious methods? What if you could ask a major telecommunications company to disable the lock-opening function in all the apartments in the city? What if you could start blocking essential functions in their customers' cars because they haven't paid a subscription or the surveillance policy (gathering necessary metrics) doesn't align with their region's policy on collecting information about citizens": "Але що, якби ці цілі можна було досягти, не звертаючись до таких очевидних методів? Що, якби ви могли попросити велику телекомунікаційну компанію вимкнути функцію відкриття замка в усіх квартирах у місті? Що, якби ви могли почати блокувати важливі функції в автомобілях їхніх клієнтів, тому що вони не сплачували підписку або політика спостереження (збір необхідних метрик) не відповідає політиці їхнього регіону щодо збору інформації про громадян",
  "What’s the plan?": "Який план?",
  "Do you want": "Чи хочете",
  "to dive even deeper?": "ще глибше зануритися?",
  "Our": "Наш",
  "White Paper": "Білий Папір",
  "Science": "Наука",
  "Read books": "Читайте книги",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Ми вважаємо, що читання книг дійсно може відкрити ваш розум. Чи то прості, але розумні ідеї, чи складніші, книги - це найкращий спосіб для вашого мозку всмоктувати все це. Ви можете завантажити наші книги безкоштовно та переглянути наш список рекомендованих книг, щоб зануритися в захопливий світ робототехніки!",
  "Download books about Robonomics": "Завантажте книги про Робономіку",
  "Open your mind [list of recommendations]": "Відкрийте свій розум [список рекомендацій]",
  "Robonomics R&D": "Робономіка R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Робот-економіка",
  "Go to cart": "Перейти до кошика",
  "Add to cart": "Додати до кошика",
  "Free worldwide shipping": "Безкоштовна доставка по всьому світу",
  "Notify me": "Повідомити мене",
  "You are on the list!": "Ви у списку!",
  "Shop Smart devices": "Магазин Смарт-пристроїв",
  "Robonomics merch": "Мерч Robonomics",
  "Decentralized cloud": "Децентралізований хмарний сервіс",
  "Books & inspiration": "Книги та натхнення",
  "Academia": "Академія",
  "Smart devices online shop": "Інтернет-магазин Смарт-пристроїв",
  "Universal IR Remote Control": "Універсальний ІЧ-пульт дистанційного керування",
  "Free worldwide shipping starts": "Безкоштовна доставка по всьому світу починається",
  "Smart Energy Power Consumption Monitoring": "Моніторинг споживання енергії Смарт-пристроїв",
  "1 gang wi-fi Smart Switch": "1-канальний Wi-Fi Смарт-вимикач",
  "2 gang wi-fi Smart Switch": "2-канальний Wi-Fi Смарт-вимикач",
  "Air Quality Sensor": "Датчик якості повітря",
  "Easily forkable map": "Легко розгалужуваний мапа",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Заберіть свій товар з унікальним мерчем Robonomics, намальованим нашими чудовими дівчатами. Ми створили магазини на найбільших онлайн-ринках для художників, перевірте це і знайдіть футболки, довгі рукави, куртки з капюшоном, душові занавіски, подушки, ковдри та інші корисні речі.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Ми обрали найбільш відому рамку робототехніки під назвою Robot Operating System (ROS) як стандартний інтерфейс для інтеграції будь-якої сумісної кібер-фізичної системи. Robonomics підтримує кілька використань для ROS. Реалізація Robonomics для мережі Ethereum відбувається у вигляді пакету ROS robonomics_comm. Для архітектури ROS 2 ми реалізуємо підтримку Robonomics як проміжного рівня (див. «Robonomics як проміжний рівень ROS 2» для деталей). Коли використання ROS є зайвим (наприклад, при роботі з пристроями Інтернету речей), був розроблений модуль інтерфейсу Python robonomics, який допомагає отримати доступ до функцій Robonomics нативно і працює як з локальними, так і з приватними та віддаленими та публічними вузлами.",
  "View more on Hackster": "Переглянути більше на Hackster",
  "Something went wrong. Try again later": "Щось пішло не так. Спробуйте ще раз пізніше",
  "Product 3 : 1 gang wi-fi Smart Switch": "Продукт 3: 1-канальний wi-fi розумний вимикач",
  "Product 4: 2 gang wi-fi Smart Switch": "Продукт 4: 2-канальний wi-fi розумний вимикач",
  "is a part of the World Computer": "є частиною Всесвітнього комп'ютера",
  "Watch the video": "Дивіться відео",
  "“What is Robonomics”": "“Що таке Робономіка”",
  "What is Robonomics": "Що таке Робономіка",
  "Web3 cloud": "Хмара Web3",
  "for Robotics and IoT Devices": "для робототехніки та пристроїв Інтернету речей",
  "Robonomics is already functioning Web3 Cloud, which allows managing IoT devices, performing techno-economic transactions between people and machines, and building serverless IoT apps. Create use cases from the world of IoT/Robotics with a focus on global accessibility, cybersecurity, and data privacy.": "Робономіка вже працює як Хмара Web3, яка дозволяє керувати пристроями Інтернету речей, виконувати техноекономічні транзакції між людьми та машинами, і будувати безсерверні додатки для Інтернету речей. Створюйте використання зі світу Інтернету речей/робототехніки з фокусом на глобальну доступність, кібербезпеку та конфіденційність даних.",
  "IoT Privacy study '2024": "Дослідження конфіденційності Інтернету речей '2024",
  "Based on a dozen recent scientific publications and reports, this study looks on actual state of privacy question in smart home industry, nowadays risks and pitfalls. You will get some answers on how to protect yourself as well.": "На основі десятка останніх наукових публікацій та звітів, це дослідження розглядає фактичний стан питання конфіденційності в галузі розумного будинку, сучасні ризики та пастки. Ви отримаєте відповіді на питання, як захистити себе.",
  "How the World Computer can save us": "Як Світовий Комп'ютер може нас врятувати",
  "What is a world computer? How it works, can it replace corporate cloud infrastructure, who owns data? Please, don't skip these 4 lectures written on our Academy and widen your mind.": "Що таке світовий комп'ютер? Як він працює, чи може він замінити корпоративну хмарну інфраструктуру, хто володіє даними? Будь ласка, не пропустіть ці 4 лекції, написані нашою Академією, і розширте свій розум.",
  "Build safe smart home": "Будуємо безпечний розумний будинок",
  "Practical guide on how to build vendor- and corporate- independent smart home with Robonomics and Home Assistant. All steps and requirements in one place.": "Практичний посібник з побудови незалежного від постачальників та корпораційного розумного будинку з використанням Робономіки та Home Assistant. Усі кроки та вимоги в одному місці."
}