{
  "What is Robonomics network?": "Що таке robonomics ?",
  "Robonomics is an open-source platform for IoT applications which enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics— це платформа з відкритим вихiдним кодом для програм Інтернету речей. Ми підтримуємо нове покоління інтернет-технологій (Web3), які реалізують обмін технічною та економічною інформацією у формі атомарних транзакцій між додатками користувача, сервісами Інтернету речей і складною робототехнікою.",
  "Serverless IoT applications for users": "Безсерверні IoT програми користувачів",
  "Timeline": "Таймлайн",
  "User (D)App": "(D)App користувача",
  "Function request": "Запит",
  "Report": "Звіт",
  "Control": "Дія",
  "Log": "Лог",
  "IoT Device": "IoT-пристрій",
  "Decentralized application": "Децентралізований додаток",
  "Digital twin": "Цифровий двійник",
  "IoT / Smart device": "IoT / Розумний пристрій",
  "Robonomics tokenomics": "Токеноміка Rbonomics",
  "is the utility token that will make it possible to control IoT devices on top of the Ethereum network and the Robonomics parachain in Polkadot ecosystem.": "— це службовий токен, який дозволить керувати IoT-пристроями поверх мережі Ethereum та парачейну Robonomics в екосистемі Polkadot.",
  "The task": "Завдання",
  "Be aware of scammers": "Стережіться шахраїв",
  "please use only well known markets to exchange XRT. Do not send your tokens to accounts that are given to you in private messages whatever transaction you would like to carry out (buy or sell token). If you received any ‘loud statements’ about Robonomics token (scammers often use something like airdrop announcement), please check this website(https://robonomics.network/) or our": "будь ласка, використовуйте тільки відомі ринки для обміну XRT. Не надсилайте свої токени на акаунти, надіслані вам в особистих повідомленнях, яку б транзакцію ви не хотіли зробити (купити або продати токен). Якщо ви отримали будь-які «гучні заяви» про токені Robonomics (шахраї часто використовують щось на зразок оголошення про airdrop), будь ласка, перевірте цей сайт (https://robonomics.network/) або наш",
  "for official updates. Be careful, be safe.": "для отримання офіційних оновлень. Будьте обережні, будьте у безпеці.",
  "XRT in Ethereum": "XRT у Ethereum",
  "Implementing Robonomics project in 2015 - 2018, the project team needed to find a connection between the provision of a useful function by Robonomics Network, namely the launch of IoT devices according to the robot-as-a-service model, and the reimbursement of the costs to Robonomics providers for gas fees in Ethereum. We needed to think about the lifecycle of each individual smart device’s liability to perform a service. As a result of the early R&D in Robonomics, the team came up with a mechanism for mining new tokens to reward each created robot-as-a-service smart contract. This model remains viable for future of Robonomics on Ethereum, but only with a significant improvements in Ethereum.": "Реалізуючи проект Robonomics у 2015-2018, команді проекту необхідно було знайти зв'язок між забезпеченням мережею Robonomics корисної функції, а саме запуском IoT-пристроїв за моделлю «робот як послуга», та відшкодуванням витрат провайдерів Robonomics на комісію за газ у Ethereum. Нам потрібно було подумати про життєвий цикл зобов'язання кожного окремого смарт-пристрою за виконання послуги. В результаті ранніх досліджень та розробок у Robonomics команда розробила механізм майнінгу нових токенів для винагороди кожного створеного смарт-контракту формату «робот як послуга». Ця модель залишається життєздатною для майбутнього Robonomics на Ethereum, але лише зі значними покращеннями у Ethereum.",
  "Read this to know historical background and long-term plans of team for XRT in Ethereum ecosystem.": "Прочитайте це, щоб дізнатися про історію та довгострокові плани команди на XRT в екосистемі Ethereum.",
  "Etherscan profile": "Etherscan профіль",
  "View token smart contract and transactions in Ethereum network here.": "Переглянути смарт-контракт токена та транзакції у мережі Ethereum можна тут.",
  "Coingecko markets": "Біржі Coingecko",
  "Here you can find CEX and DEX markets for trading XRT.": "Тут ви можете знайти біржі CEX та DEX для торгівлі XRT.",
  "XRT In Polkadot": "XRT у Polkadot",
  "Moving from Ethereum to Polkadot, we need to do a “scaling up” in tokenomics. Parachains in the Polkadot ecosystem are not the equivalent of a smart contract, but are a fully programmable blockchain that leases a segment of the overall network.": "Переходячи від Ethereum до Polkadot, нам потрібно «масштабуватися» у токеноміці. Парачейни в екосистемі Polkadot не є еквівалентами смарт-контрактів, а є повністю програмованим блокчейном, що орендує сегмент всієї мережі.",
  "The actual payment on the part of Polkadot and Kusama parachains is long-term bonding of native Relay chain tokens (DOT / KSM) in sufficient quantity to win one of the auctions. The XRT in the Robonomics parachain supports slot renewal and rewards for stakeholders. The XRT burning mechanism underlying the activation of IoT subscriptions is designed to reduce inflation to a minimum, and in case of increased interest to zero.": "Фактичний платіж з боку парачейнів Polkadot і Kusama — це довгострокове зв'язування нативних токенів Relay chain (DOT/KSM) у кількості, достатньої для перемоги в одному з аукціонів. XRT у парачейні Robonomics підтримує оновлення слотів та винагороди для стейкхолдерів. Механізм спалювання XRT, що лежить в основі активації IoT-підписок, покликаний знизити інфляцію до мінімуму, а у разі підвищеного інтересу до нуля.",
  "Learn more": "Дізнайтесь більше",
  "in Twitter thread from our network architect.": "у гілці Twitter від нашого архітектора мережі.",
  "Usage:": "Використання:",
  "XRT can be used both to pay fees for performing transactions on the parachain or to purchase an IoT subscription that guarantees priority processing of device or user IoT transactions.": "XRT можна використовувати як для оплати комісій за виконання транзакцій у парачейні, так і для покупки IoT-підписки, яка гарантує пріоритетну обробку IoT-транзакцій пристроїв або користувачів.",
  "Rewards:": "Нагороди:",
  "Throughout the year, the parachain issues a small amount of XRT to incentivize parachain collators.": "Протягом року парачейн випускає невелику кількість XRT, щоб стимулювати колаторів парачейну.",
  "The parameter of the total reward": "Параметр загальної винагороди",
  "for collators for the year is determined by on-chain voting of token holders, and can be changed by holding a referendum.": "для колаторів протягом року визначається ончейн-голосуванням власників токенів і може бути змінений шляхом проведення референдуму.",
  "Use XRT": "Використовуйте XRT",
  "Buy IoT subscription in our decentralized application. Control your smart devices over blockchain without any centralized corporation observing.": "Купуйте IoT-підписку у нашому децентралізованому додатку. Керуйте своїми розумними пристроями через блокчейн без спостереження будь-якої централізованої корпорації.",
  "Subscan profile": "Subscan профіль",
  "View token statistics on top of Polkadot ecosystem.": "Переглядайте статистику токенів в екосистемі Polkadot.",
  "Other questions": "Інші питання",
  "What is RWS?": "Що таке RWS?",
  "[Under development of core functionality] For engineers, Core Dev team will try to make different Robonomics usage models and the first step in this way is launching lifetime subscription token - RWS token. Each RWS token will give you 1 transaction per second (tps) from/to your IoT device over Robonomics Parachain. Activate your RWS token and make \"free gas\" transactions with prior to execute and predictable latency. Deactivate RWS token and trade it on DEX.": "[Розробляється основна функціональність] Для інженерів команда Core Dev спробує створити різні моделі використання Robonomics, і першим кроком на цьому шляху буде запуск токена довічної підписки — токена RWS. Кожен токен RWS дає вам 1 транзакцію в секунду (tps) з/на ваш IoT-пристрій через парачейн Robonomics. Активуйте свій токен RWS і робіть транзакції з «безкоштовним газом» із попереднім виконанням та передбачуваною затримкою. Деактивуйте токен RWS та обміняйте його на DEX.",
  "What is AIRA/AIR ID?": "Що таке AIRA/AIR ID?",
  "Pre-XRT token distributed in 2017 as a autonomous part of futher Robonomics infrastructure on Ethereum. After successful launch of Robonomics over Ethereum in 2019 AIRA tokens was connected to created infrastructure of the project through": "Токен Pre-XRT був поширений у 2017 році як автономна частина майбутньої інфраструктури Robonomics на Ethereum. Після успішного запуску Robonomics над Ethereum у 2019 році токени AIRA були підключені до створеної інфраструктури проекту через",
  "ambix smart contract": "смарт-контракт ambix,",
  "which guaranteed autonomous and independent process of swapping pre-XRT to ERC-20 XRT.": "який гарантував автономний і незалежний процес обміну pre-XRT на ERC-20 XRT.",
  "of the Robonomics token is to ensure the operation of a decentralized network for the maintenance of Smart Cities and Industry 4.0 in blockchain infrastructure. In order to achieve this goal, the token economy needs to reflect the incentives for the implementation of the network.": "токена Robonomics — забезпечити роботу децентралізованої мережі для обслуговування Розумних міст та Індустрії 4.0 в інфраструктурі блокчейну. Для досягнення цієї мети економіка токена повинна відбивати стимули для реалізації мережі",
  "Token distribution": "Розподіл токенів",
  "Try our Dapp": "Спробуйте наш Dapp",
  "In addition": "Крім того",
  "you can operate XRT within blockchains using tools provided by different independent teams in Polkadot (Kusama) and Ethereum communities.": "ви можете працювати з XRT в межах блокчейнів за допомогою інструментів, наданих різними незалежними командами у спільнотах Polkadot (Kusama) та Ethereum.",
  "Within the Kusama network, you have the capability use": "В мережі Kusama ви маєте можливість використовувати",
  "communication between the Robonomics parachain and other parachains using various decentralized applications (dApps):": "комунікацію між парачейном Robonomics та іншими парачейнами за допомогою різних децентралізованих додатків (dApps):",
  "Within the Ethereum network you can use decentralized application powered by the": "В мережі Ethereum ви можете використовувати децентралізований додаток, який працює на основі",
  "Decentralized application (dapp) works within Blockchain. It is open source and its data served on IPFS and Github. These techonolgies allow application be secure and transparent at the same time. Our developers are working both on the development of Robonomics’ application and on the libraries that you can use when building your own dapp.": "Децентралізований додаток (dapp) працює в рамках Blockchain. Він має відкритий вихідний код, а його дані розміщуються на IPFS та Github. Ці технології дозволяють додатку бути одночасно безпечним і прозорим. Наші розробники працюють як над розробкою додатку Robonomics, так і над бібліотеками, які ви можете використовувати при створенні власного dapp.",
  "Digital Twin is one of the instruments provided by Robonomics Web Services (RWS). It acts as a digital version of the real-world equipment and copies all of its technical characteristics. It allows to make a decentralized app more responsive to the user’s commands.": "Цифровий двійник — це один із інструментів, що надаються Robonomics Web Services (RWS). Він діє як цифрова версія реального обладнання та копіює всі його технічні характеристики. Це дозволяє зробити децентралізовану програму більш чуйною на команди користувача.",
  "You can use Robonomics with a wide range of Zigbee smart devices to automate and control various aspects of your home/office or use it with ROS-based robotics for more complex industrial tasks.": "Ви можете використовувати Robonomics з широким спектром розумних пристроїв Zigbee для автоматизації та управління різними аспектами вашого будинку/офісу або використовувати її з робототехнікою на основі ROS для більш складних промислових завдань.",
  "Do Androids Dream of Electric Sheep?": "Чи мріють андроїди про електричних овець?",
  "Your email": "Ваш адрес электронной почты",
  "The year began with a major achievement — Robonomics won the 20th parachain slot auction and": "Рік почався з великого досягнення — Robonomics виграла 20-й аукціон слотів парачейна і",
  "officially became": "офіційно стала",
  "a parachain with ID 2048 on the Kusama network. The launch, datalog, DigitalTwin, liability functions and IoT subscriptions have become available to all users of the ecosystem. To provide details for this phase of the project, the core team has published the first chapters of the": "стала парачейном з ID 2048 у мережі Kusama. Функції launch, datalog, DigitalTwin, liability та IoT-підписки стали доступні всім користувачам екосистеми. Щоб надати детальну інформацію про цей етап проекту, команда розробників опублікувала перші розділи",
  "Robonomics Whitepaper 2.0.": "Robonomics Whitepaper 2.0.",
  "Robonomics 2.0 on Substrate has been released with support for XCM messages, and we began to open HRMP channels with other parachains (like Crust Shadow and Darwinia), whose functionality is extremely useful for us.": "Robonomics 2.0 на Substrate була випущена з підтримкою XCM-повідомлень, і ми почали відкривати HRMP-канали з іншими парачейнами (такими як Crust Shadow та Darwinia), функціонал яких нам дуже корисний.",
  "At the same time, we have unlocked a strategy for introducing the IoT market to our protocol. Our experiments with IoT equipment led us to the concept of a sovereign smart home, one which is independent of centralized cloud service providers. We have developed our": "У той же час, ми розблокували стратегію впровадження нашого протоколу на ринок IoT. Наші експерименти з IoT-обладнанням привели нас до концепції розумного будинку, незалежного від централізованих постачальників хмарних послуг. Ми розробили свою",
  "integration": "інтеграцію",
  "with the Home Assistant automation system, and also designed our own": "із системою автоматизації Home Assistant, а також розробили власний",
  "IoT gateway": "IoT-шлюз",
  "for connecting smart devices.": "для підключення розумних пристроїв.",
  "We have launched two big initiatives in order to increase community engagement —": "Ми запустили дві великі ініціативи для підвищення залучення спільноти —",
  "Robonomics Academy": "Robonomics Academy",
  "Robonomics Ambassador Program": "Robonomics Ambassador Program",
  "Additionally,": "Крім того, восени було проведено",
  "Robonomics Town Hall": "Robonomics Town Hall",
  "was held in autumn so that the Robonomics community could try out our governance mechanisms for the first time. Recently, the Robonomics team helped the DAO IPCI project obtain a parachain slot to present carbon offsetting service for smart buildings.": "щоб співтовариство Robonomics могло вперше випробувати наші механізми управління. Нещодавно команда Robonomics допомогла проекту DAO IPCI отримати слот для парачейна, щоб презентувати сервіс компенсації викидів вуглецю для розумних будівель.",
  "In 2021, our": "У 2021 році наша",
  "main focus": "основна увага",
  "shifted to preparing the project so that IoT applications could be used via our parachain on the Kusama network. Robonomics 1.0 on Substrate has been released, and we have been testing connecting sensors to the parachain to send their telemetry data, as well as developing the digital twin functionality. In the middle of the year, we decided to test the full cycle of our network and created our own relay chain called": "перейшла на підготовку проекту до використання IoT-додатків за допомогою нашого парачейна в мережі Kusama. Було випущено Robonomics 1.0 на Substrate, протестовано підключення датчиків до парачейну з метою відправлення їх телеметрії, а також розроблено функції цифрового двійника. У середині року ми вирішили протестувати повний цикл нашої мережі та створили власний релей-чейн під назвою",
  "Robonomics Frontier": "Robonomics Frontier",
  "to which the Robonomics parachain was integrated (prior to being migrated to the Kusama relay chain). There has been a lot of focus on getting a parachain slot in Kusama, for which we organized several crowdloan campaigns.": "о якого був інтегрований парачейн Robonomics (до міграції до Kusama). Великий фокус був сконцентрований на отриманні слота парачейна в Kusama, для чого ми організували кілька краудлоан-кампаній.",
  "There have been two big changes for the community. First, we launched the": "Для громади відбулися дві великі зміни. По-перше, ми запустили",
  "Robonomics Grant Program": "програму грантів Robonomics",
  "which allows Web3 robotics and IoT projects to receive funding for R&D tasks. By the end of the year, four active projects participated in the program. Secondly, the team started the": "яка дозволяє проектам Web3, робототехніки та IoT отримувати фінансування для виконання завдань R&D розробок. До кінця року в програмі взяли участь чотири активні проекти. По-друге, команда розпочала",
  "Exodus process": "процесс Exodus",
  "allowing Ethereum token holders to move their XRT tokens to the parachain.": "що дозволяє власникам токенів Ethereum перемістити свої токени XRT у парачейн.",
  "Among the collaborations, we can recall the remarkable appearance of Boston Dynamics Spot at MerkleBot, for which a": "Серед колаборацій можна згадати помітну появу Boston Dynamics Spot у MerkleBot, для якого була розроблена",
  "rental remote control system": "система оренди віддаленого управління роботом",
  "was developed. We would also like to inform you about the Multi-Agent Systems company which is a personal project that has been formed by a team of Robonomics engineers. They have developed a robotic waffle baker called Eisenkoch which conducts cooking tasks for coffee shop owners.": "Також варто згадати появу компанії Multi-Agent Systems, яка є особистим проектом команди інженерів Robonomics. Вони розробили робота-кухаря під назвою Eisenkoch, який може випікати вафлі для відвідувачів кав'ярень.",
  "There came a time when the existing limitations of Ethereum": "У цей період стали",
  "began to stand out clearly": "чітко виділятися існуючі",
  "(in particular, poor scalability, low speed and very high cost of transactions). The upgrade to ETH2.0 was supposed to fix the situation, but this upgrade was repeatedly delayed. Whilst we did not want to leave the Ethereum network, we realized that in the current situation it was difficult to implement our use cases, and we began to look for an alternative network. The sharded blockchain ecosystem Polkadot became this alternative. We started by experimenting with the Substrate framework to migrate the main Robonomics features and to deploy our own testnet. By the end of this stage, we had deployed our parachain on the Rococo testnet and started preparing to get a slot on the Kusama network.": "обмеження мережі Ethereum (зокрема, погана масштабованість, низька швидкість та дуже висока вартість транзакцій). Оновлення до ETH2.0 мало виправити ситуацію, але це оновлення неодноразово відкладалося. Ми не хотіли залишати мережу Ethereum, але зрозуміли, що в поточній ситуації складно реалізувати наші сценарії застосування і почали шукати альтернативну мережу. Цією альтернативою стала сегментована блокчейн-екосистема Polkadot. Ми почали експериментувати з фреймворком Substrate, щоб перенести основні функції Robonomics і розгорнути власну тестову мережу. До кінця цього етапу ми розгорнули наш парачейн у тестовій мережі Rococo і розпочали підготовку до отримання слоту у мережі Kusama.",
  "Continuing to study IoT systems, we have identified the main functionality of Robonomics, which can add value to users — the function of decentralized cloud for IoT. This idea formed the basis of": "Продовжуючи вивчати IoT-системи, ми визначили основний функціонал Robonomics, який може принести цінність користувачам — функцію децентралізованої хмари для IoT. Ця ідея стала основою",
  "Robonomics Web Services": "Robonomics Web Services (RWS)",
  "The RWS infrastructure took on all the functions of a typical centralized cloud, but without the standard problems of global availability, security and privacy. Additionally, we came up with the idea of parachain IoT subscriptions that allows subscription holders to use the blockchain network without having to pay a fee for each transaction. The first experiment with IoT subscriptions was the emission of the RWS token, which allows its owner to send 1 transaction per block. In addition, we began to take the first steps to develop our own hardware kit for control of smart devices (the DAOS concept).": "Інфраструктура RWS взяла на себе всі функції типової централізованої хмари, але без стандартних проблем глобальної доступності, безпеки та конфіденційності. Крім того, ми запропонували ідею IoT-підписок для парачейну, яка дозволяє власникам підписки використовувати блокчейн-мережу без необхідності сплачувати комісію за кожну транзакцію. Першим експериментом з IoT-підписками стала емісія токена RWS, який дозволяє його власнику відправляти 1 транзакцію на блок парачейну. Крім того, ми почали робити перші кроки щодо розробки власного апаратного набору для керування розумними пристроями (концепція DAOS).",
  "Of course, support for Robonomics on Ethereum has not stopped. The Robonomics communication stack has been finalized to version": "Зрозуміло, що підтримка Robonomics на Ethereum не припинилася. Комунікаційний стек Robonomics було доопрацьовано до версії",
  "LTS 1.0.": " LTS 1.0.",
  "The XRT token has started trading on several exchanges (in particular, the Uniswap DEX), and the liquidity incentivization program was launched.": "Токен XRT почав торгуватися на кількох біржах (зокрема, Uniswap DEX), а також було запущено програму підтримки ліквідності.",
  "The team actively developed ways to interact with the community. The first version of our": "Команда активно розробляла способи взаємодії із співтовариством. Була запущена перша версія нашого",
  "dapp": "dapp",
  "site and Robonomics Wiki have been launched. For more transparent and convenient project management, we started using": "и Robonomics Wiki. Для більш прозорого та зручного керування проектами ми почали використовувати",
  "Aragon DAO": "Aragon DAO",
  "We hosted": "У 2019 році ми провели",
  "Robonomics Winter School": "Robonomics Winter School",
  "in 2019 for newcomers to the project.": "ля початківців у проекті.",
  "Robonomics became the foundation for the": "Robonomics стала основою для проекту",
  "RoSeMAN": "RoSeMAN",
  "MerkleBot": "MerkleBot",
  "project, which is developing a system for smart leasing of robotic equipment.": "який розробляє систему розумного лізингу роботизованого обладнання.",
  "We understood that autonomous agents needed an environment that would ensure their reliable technical and economic operations. For several years we had been developing a protocol for creating a decentralized network of providers that help robotic agents provide their services. Tools for network maintenance and for the communication stack between Ethereum and ROS have been developed. In 2018 we published the": "Ми розуміли, що автономним агентам потрібне середовище, що забезпечує їх надійну технічну та економічну діяльність. Декілька років ми розробляли протокол для створення децентралізованої мережі провайдерів, які допомагають роботам-агентам надавати свої послуги. Були розроблені інструменти для обслуговування мережі та комунікаційний стек між Ethereum та ROS. У 2018 році ми опублікували",
  "Robonomics Whitepaper": "Robonomics Whitepaper",
  "and the alpha version of Robonomics Network was launched on the Ethereum mainnet. Active preparations continued for the XRT token generation event (which eventually happened in the spring of 2019 due to the first crypto winter).": "після чого була запущена альфа-версія мережі Robonomics в Ethereum. Ми продовжили активну підготовку до генерації токенів XRT (яка затрималася до весни 2019 року через першу криптозиму).",
  "From this period, Robonomics began to dynamically develop use cases related to Industry 4.0 — smart factories, smart cities and smart homes — and this brought our close attention to the IoT world. In search of innovation, the team has presented several large and unique R&D demos: a civil": "З цього періоду Robonomics почала динамічно розробляти сценарії застосування, пов'язані з Індустрією 4.0 – розумні фабрики, розумні міста та розумні будинки – і це привернуло нашу пильну увагу до світу Інтернету речей. У пошуках інновацій команда представила кілька великих та унікальних R&D демонстрацій: цивільна",
  "sensor network": "мережа датчиків",
  "a water drone": "водний дрон",
  "for environmental monitoring (supported by a sensor systems manufacturer": "для моніторингу навколишнього середовища (за підтримки виробника сенсорних систем",
  "a smart factory model": "модель розумної фабрики",
  "a self-employed": "заробляє незалежно від людини - ",
  "robot artist Gaka-chu": "робот-художник Gaka-chu",
  "and a": "та",
  "drone traffic management system": "система управління трафіком дронів",
  "Robonomics started cooperation with the DAO IPCI project on the environmental assets management using Web3 technologies and IoT devices.": "Robonomics розпочала співпрацю з проектом DAO IPCI з управління екологічними активами з використанням технологій Web3 та IoT-пристроїв.",
  "This was a period of active R&D during which we identified a range of tasks, in which P2P technologies have capabilities that were not previously available for robotics. Combining Ethereum computer, IPFS file storage and Robot Operating System, we realized that any device could potentially become an": "Це був період активної R&D діяльності, в ході якої ми визначили коло завдань, в яких P2P-технології мають можливості, недоступні раніше для робототехніки. Об'єднавши комп'ютер Ethereum, файлове сховище IPFS і Robot Operating System (ROS), ми зрозуміли, що будь-який пристрій може стати",
  "autonomous intelligent robot agent": "автономним розумним роботом-агентом",
  "In turn, this opened the way for us to the concepts of Robot-as-a-Service and the robot economy.": "У свою чергу, це відкрило нам шлях до концепцій Robot-as-a-Service та економіки роботів.",
  "Our publications in scientific journals of this period are available in the": "Наші публікації у наукових журналах цього періоду доступні у розділі",
  "Papers section": "Papers",
  "We have collected all R&D projects over the years in the": "Всі R&D проекти за ці роки доступні у",
  "a handy book": "зручній книзі",
  "It all started with an idea that dawned on the founders when Ethereum had only just launched its mainnet. What if the robot performs a task for a client for cryptocurrency, and its logic is controlled by a smart contract?": "Все почалося з ідеї, яка спала на думку засновникам проекту, коли Ethereum тільки запустив свою основну мережу. Що якщо робот виконуватиме роботу для клієнта за криптовалюту, а його логіка керується смарт-контрактом?",
  "To test the idea, we made a demo in which a drone controlled by an Ethereum computer was launched to achieve the specified GPS coordinates after the user completed a payment transaction.": "Щоб перевірити ідею, ми зробили демонстрацію, де дрон, керований комп'ютером Ethereum, запускався для досягнення заданих GPS-координат після того, як користувач здійснив платіжну транзакцію.",
  "The demo is available on": "Демо доступне на",
  "YouTube": "YouTube",
  "Notable events": "Визначні події",
  "Robonomics whitepaper 2022 welcome guide": "Гайд по білому папері Robonomics 2022",
  "We have developed a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain. Today, we already have a hybrid platform for creating futuristic IoT applications. It provides interaction with devices under the control of a global decentralized computer. Before we start creating secure, serverless and futuristic IoT applications using the Robonomics platform, let’s dive a little into theory...": "Ми розробили техніко-економічний машинний протокол зв’язку, який працює на основі Ethereum і IPFS, і доповнюємо його елементами хмарної платформи IoT на основі парачейну Polkadot. Сьогодні ми вже маємо гібридну платформу для створення футуристичних додатків IoT. Він забезпечує взаємодію з пристроями під управлінням глобального децентралізованого комп'ютера. Перш ніж ми почнемо створювати безпечні, безсерверні та футуристичні додатки IoT за допомогою платформи Robonomics, давайте трохи зануримося в теорію...",
  "Chapter 1.": "Розділ 1.",
  "At the intersection of cybernetics and economics": "На стику кібернетики та економіки",
  "We presented an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. In this chapter, we will talk about the relevance of the robot economy, which can become an important part of people's lives and change the current level of the economy into fully automated services in the future.": "Ми представили економічну систему, в якій роботизовані пристрої діють як незалежні агенти, здатні виконувати ключові економічні види діяльності, раніше зарезервовані для людей. У цьому розділі ми поговоримо про актуальність роботизованої економіки, яка може стати важливою частиною життя людей і змінити поточний рівень економіки на повністю автоматизовані послуги в майбутньому.",
  "In this chapter you will learn": "У цьому розділі ви дізнаєтеся",
  "Ronald Coase and The Nature of the Firm": "Рональд Коуз і природа фірми",
  "CPS - cyber-physical system": "КФС — кіберфізична система",
  "Norbert Wiener and the search for patterns in living and machine": "Норберт Вінер та пошук закономірностей у живому та машинному",
  "The Fourth Industrial Revolution, Money for Robots and Bitcoin": "Четверта промислова революція, гроші для роботів і біткойн",
  "Ethereum Smart Contracts": "Розумні контракти Ethereum",
  "Polkadot Parachains": "Polkadot Parachains",
  "Polkadot VS Ethereum 2.0": "Polkadot VS Ethereum 2.0",
  "Open questions of teleology and Mises' work": "Відкриті питання телеології та творчість Мізеса",
  "Read chapter 1": "Прочитайте розділ 1",
  "Chapter 2.": "Розділ 2. ",
  "Robonomics architecture": "Архітектура Robonomics",
  "In the second chapter, you will read about human-machine interaction using modern Internet technology - from IoT devices to a decentralized and globally accessible network of providers. We will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "У другому розділі ви прочитаєте про взаємодію «людина-машина» за допомогою сучасних інтернет-технологій — від пристроїв IoT до децентралізованої та глобально доступної мережі провайдерів. Ми розглянемо основи Інтернету речей, щоб висвітлити проблеми та основні виклики, з якими стикаються творці систем IoT і на вирішення яких спрямована Robonomics.",
  "Overview of the state of the Internet of Things (IoT)": "Огляд стану Інтернету речей (IoT)",
  "Classification of IoT devices": "Класифікація пристроїв IoT",
  "Embedded IoT systems": "Вбудовані системи IoT",
  "Edge-systems: IoT gateways and controllers": "Edge-системи: шлюзи та контролери IoT",
  "Autonomous Systems": "Автономні системи",
  "Internet of Things providers": "Провайдери Інтернету речей",
  "Digital twins are the heart of the Internet of Things": "Цифрові двійники — серце Інтернету речей",
  "IoT data flows in cloud service": "Потоки даних IoT у хмарному сервісі",
  "Popular examples of IoT solutions": "Популярні приклади рішень IoT",
  "Current problems of building IoT solutions": "Актуальні проблеми побудови IoT рішень",
  "Main tasks of Robonomics architecture": "Основні завдання архітектури Robonomics",
  "Basic components of Robonomics architecture": "Основні компоненти архітектури Робономіки",
  "A simple representation of Robonomics architecture": "Просте представлення архітектури Robonomics",
  "Read chapter 2": "Прочитайте розділ 2 ",
  "We continue to update the white paper of Robonomics": "Ми продовжуємо оновлювати білий папір Robonomics",
  "stay tuned for new parts on our website and in Discord": "слідкуйте за новими частинами на нашому веб-сайті та в Discord",
  "Join our discord": "Приєднуйтеся до нашого discord",
  "Next we would like to show you the practical areas of human-machine interaction using modern Internet technology. We will move from the familiar IoT device architecture of technical information exchange through cloud services to the organization of technical-economic interaction through a decentralized, globally accessible network of providers.": "Далі ми хотіли б показати вам практичні сфери взаємодії людини і машин за допомогою сучасних Інтернет-технологій. Ми рухатимемося від звичної для IoT-пристроїв архітектури обміну технічною інформацією за допомогою хмарних сервісів до організації техніко-економічної взаємодії за допомогою децентралізованої, глобально доступної мережі провайдерів.",
  "To begin with, we need to make an excursion into the area that is most clearly related to the network connection of automated systems. After that, we will look at the basics of the Internet of Things in order to highlight the problems and main challenges faced by the creators of IoT systems and to the solution of which Robonomics is aimed.": "Для початку потрібно зробити екскурс в область, яка найбільш чітко пов'язана з мережевим підключенням автоматизованих систем. Після цього ми розглянемо основи Інтернету речей, щоб висвітлити проблеми та основні виклики, з якими стикаються творці IoT-систем і на вирішення яких спрямована Робономіка.",
  "Overview of the state of the internet of things (IoT)": "Огляд стану інтернету речей (IoT)",
  "The issue of network accessibility of automatic devices has been discussed all over the planet since the 60s, and already at that time quite serious attempts were made to solve it. For example, the Soviet cyberneticist Viktor Glushkov proposed and partially implemented the automated collection of information on the production volumes of an individual plant as part of the design of the": "Питання мережевої доступності автоматів обговорюється на всій планеті з 60-х років, і вже тоді робилися досить серйозні спроби вирішити його. Наприклад, радянський кібернетик Віктор Глушков запропонував і частково реалізував автоматизований збір інформації про обсяги виробництва окремого підприємства в рамках проектування національної інформаційної системи",
  "OGAS": "ЗДАС",
  "national information system in the 60s and 70s. It is widely known how the Coca-Cola vending machine was connected to the ARPANET in the 1980s so that the machines could report the availability of drinks and their temperature.": "в 60-70-х роках. Широко відомо, як торговельний автомат Coca-Cola був підключений до ARPANET у 1980-х роках, щоб автомат міг повідомляти про наявність напоїв та їх температуру.",
  "But still, the actual development of IoT is happening today, due to the widespread use of enabling technologies. The main drivers of the rapid evolution of Internet of Things applications are the results of the development of many areas – from wireless communications of various ranges and embedded devices, to cloud analytics and machine learning. The number of IoT devices has been growing steadily over the past 10 years (with a forecast of 25 billion units by 2030), and this has spurred researchers and developers to create new IoT applications in various areas such as healthcare, home automation, agribusiness, environmental protection.": "Але все ж таки фактичний розвиток IoT відбувається саме сьогодні, через широке поширення опорних (enabling) технологій. Основними драйверами швидкої еволюції додатків Інтернету речей є результат розвитку багатьох напрямків – від бездротового зв’язку різних діапазонів і вбудованих пристроїв до хмарної аналітики та машинного навчання. Кількість IoT-пристроїв стабільно зростала протягом останніх 10 років (з прогнозом 25 мільярдів пристроїв до 2030 року), і це спонукало дослідників і розробників до створення нових IoT-додатків у різних сферах, таких як охорона здоров’я, домашня автоматизація, агробізнес, охорона навколишнього середовища.",
  "We are more interested in the process of building IoT-systems and the tasks that arise in this process. Over the years of research, many different architectures have been proposed, and by averaging them, we can distinguish three basic components of an IoT system: devices, network infrastructure, analytical, computing and control machines.": "Нас більше цікавить процес побудови IoT-систем і завдання, які в цьому процесі виникають. За роки досліджень було запропоновано багато різних архітектур, і, усереднюючи їх, ми можемо виділити три основні компоненти IoT-системи: безпосередньо пристрої, мережева інфраструктура, аналітичні, обчислювальні та керуючі машини.",
  "New challenges": "Нові виклики",
  "Another recent challenge for building IoT has been the concept of the digital twin — a digital version of real equipment that copies its specifications and historical data. This concept is at its best in areas where it is necessary to have an accurate and complete specification of a process and be able to predict its development. The Internet of Things acts as the main integrator of digital twins, but this task is much more profound than the usual connectivity of IoT devices.": "Іншим недавнім викликом для створення IoT стала концепція цифрового двійника — цифрової версії реального обладнання, яке копіює його специфікації та історичні дані. Ця концепція найкраще підходить у сферах, де необхідно мати точну та повну специфікацію процесу та мати можливість передбачити його розвиток. Інтернет речей діє як головний інтегратор цифрових двійників, але це завдання набагато глибше, ніж звичайне підключення IoT-пристроїв.",
  "Right now we are witnessing a whole segment of the network, designed and convenient not for people, but for machines. The Internet of Things is no longer just the mechanics of connecting a device to the network, but more services, created and available specifically to devices. The Internet of Things not only connects the user and the device, but also helps the devices to handle the tasks of providing a service for the person, but autonomously.": "Зараз ми спостерігаємо цілий сегмент мережі, призначений і зручний не для людей, а для машин. Інтернет речей — це вже не просто механізми підключення пристрою до мережі, а більше послуг, створених і доступних спеціально для пристроїв. Інтернет речей не тільки з’єднує користувача та пристрій, але й допомагає пристроям справлятися із завданнями надання послуг для людини, але автономно.",
  "Such systems have no user interfaces and are typically used at the lowest level of the IoT ecosystems to provide basic functionality. Have to be energy efficient and small. Have limited computing and communication resources. IoT gateways or controllers usually act as signal receivers.": "Такі системи не мають користувальницьких інтерфейсів і зазвичай використовуються на найнижчому рівні екосистем Інтернету речей для забезпечення базової функціональності. Вони мають бути енергоефективним і маленькими. Мають обмежені обчислювальні та комунікаційні ресурси. Сигнали можуть передаватися через Wi-Fi, Bluetooth або радіочастотами, а приймачем сигналів зазвичай виступають IoT-шлюзи або контролери.",
  "These systems act as a link between locally accessible embedded systems and the global Internet. They typically support multiple communication protocols of embedded systems and transfer telemetry from devices to the cloud and control signals backwards. Often these devices are a more sophisticated version of the WiFi router, equipped with a single board computer to perform primary processing of information from devices without leaving the local network.": "Ці системи виступають зв'язуючим дзвінком між локально доступними системами, що вбудовуються, і глобальною мережею Інтернет. Зазвичай вони підтримують кілька протоколів зв’язку вбудованих систем і передають телеметрію з пристроїв у хмару та керують сигналами назад. Часто ці пристрої є більш складною версією WiFi роутера, оснащеного одноплатним комп'ютером для виконання первинної обробки інформації з пристроїв, не виходячи з локальної мережі.",
  "This class includes complex automata (such as Spot from Boston Dynamics), which have a control component on the level of a full computer with a high-performance processor and a large amount of memory. In such cases, the robot is connected to the Internet without additional intermediate solutions (edge-systems). The necessary software for accessing the Internet of Things is installed directly on the computer of the stand-alone system. Data is collected and partially processed locally, then broadcast to the Internet similar to any full-fledged network device.": "До цього класу належать складні автомати (такі як Spot від Boston Dynamics), що мають керуючий компонент на рівні повноцінного комп'ютера з високопродуктивним процесором та великим об'ємом пам'яті. У разі робот підключається до мережі Інтернет без додаткових проміжних рішень (edge-систем). Необхідне програмне забезпечення для доступу до Інтернету речей встановлюється безпосередньо на комп'ютер автономної системи. Дані збираються і частково обробляються локально, потім транслюються в Інтернет аналогічно будь-якому повноцінному мережному пристрою.",
  "The main job of IoT providers is providing users with remote access to data and analytics, as well as management of smart devices over the Internet. The main criteria for the quality of the provider is security of operations, stability of connection and availability of the provider from anywhere in the world.": "Основна робота IoT-провайдерів — надавати користувачам віддалений доступ до даних і аналітики, а також керувати розумними пристроями через Інтернет. Основними критеріями якості провайдера є безпека роботи, стабільність зв'язку та доступність провайдера з будь-якої точки світу.",
  "The standard scheme for working with an IoT provider includes: installing software compatible with the cloud smart device, setting up cloud-side management services after the first successful connection of a device, connection of various kinds of analytical services.": "Стандартна схема роботи з провайдером Інтернету речей включає встановлення програмного забезпечення на розумний пристрій, сумісного з хмарою; налаштування керуючих сервісів на стороні хмари після першого успішного підключення пристрою; підключення різноманітних аналітичних сервісів.",
  "Speaking of digital twins, it should be noted that architecturally their implementation is required; as a refusal to give the user direct access to control devices and change their states. Out of the most obvious reasons for rejection are, first, the presence of their own requirements and conditions in the devices just before the launch. Second, if multiple user devices must access a single data source, giving personalized control to each user can be critical. Lastly, it is extremely useful to keep the last actual state of the device available in case it goes out of operation.": "Говорячи про цифрові двійники, слід зазначити, що архітектурно їх реалізація є обов'язковою; як відмова надати користувачеві прямий доступ до пристроїв керування та змінити їх стан. З найбільш очевидних причин відмови – це, по-перше, наявність власних вимог і умов у пристроїв безпосередньо перед запуском. По-друге, якщо кілька пристроїв користувачів повинні отримати доступ до одного джерела даних, надання персоналізованого контролю кожному користувачеві може бути критичним. Нарешті, надзвичайно корисно зберігати останній фактичний стан пристрою на випадок, якщо він вийде з ладу.",
  "As a result, we have a separation of the loop of information exchange with the user and the actual generation of actual data by the sensors. To illustrate this principle, below is the process of the user working with an IoT device using a digital twin.": "В результаті ми маємо розділення циклу обміну інформацією з користувачем і власне генерування датчиками реальних даних. Щоб проілюструвати цей принцип, нижче наведено процес роботи користувача з пристроєм IoT за допомогою цифрового двійника.",
  "IoT data flows in cloud services": "Потоки IoT-даних у хмарних сервісах",
  "Input values for cloud triggers. For example, the cloud service sends various notifications to the user in the event of a report from a car alarm sensor about a strike.": "Вхідні значення для хмарних тригерів. Наприклад, у разі отримання повідомлення від датчика сигналізації автомобіля про удар хмарний сервіс надсилає різні повідомлення користувачеві.",
  "Output data for complex analytics that cannot be produced at the edge level. For example, when processing video for face recognition in a crowd.": "Вихідні дані для складної аналітики, які не можуть бути створені на крайньому рівні. Наприклад, при обробці відео для розпізнавання обличчя в натовпі.",
  "The basis for forming a digital twin of the device in order to create a cast of its state. For example, at the user’s request in the mobile app or on the website.": "Основа для формування цифрового двійника пристрою з метою створення зліпку його стану. Наприклад, за бажанням користувача в мобільному додатку або на сайті.",
  "A typical smart home system provides a wide range of options for controlling your living space. With its help you can remotely control the door locks, setting up one-time or regular access to the room as family and friends, and for maintenance or delivery personnel. With numerous sensors and recording devices, the system is able to include video recording when triggering motion sensors, autonomously make decisions to shut off the water supply when a leak is detected in the water system, start a scheduled robot vacuum cleaner, providing a cleaning report to the user app, change the room temperature to the optimal value depending on your schedule.": "Типова система розумного дому надає широкий спектр можливостей для керування вашим житловим простором. З його допомогою можна дистанційно керувати дверними замками, організовуючи одноразовий або регулярний доступ в приміщення як рідних і близьких, так і обслуговуючого або доставного персоналу. Завдяки численним датчикам і реєструючим пристроям система здатна включати відеозапис при спрацьовуванні датчиків руху, самостійно приймати рішення про відключення подачі води при виявленні витоку в водопровідній системі, запускати плановий робот-пилосос, надаючи звіт про прибирання. У програмі користувача змініть кімнатну температуру на оптимальне значення залежно від вашого розкладу.",
  "Smart cars. Providing the car’s onboard electronics with access to mobile Internet, the user gets access to remote control of various car functions directly from his smartphone: opening doors, turning on the air conditioner, controlling the headlights. If such cars are used for carsharing, then you can create an interactive map of the location of cars with their status, the remaining fuel, etc. for the clients of this service.": "Розумні автомобілі. Забезпечуючи бортову електроніку автомобіля доступом до мобільного Інтернету, користувач отримує доступ до дистанційного керування різними функціями автомобіля прямо зі свого смартфона: відкриття дверей, увімкнення кондиціонера, керування фарами. Якщо такі автомобілі використовуються для каршерінгу, то для клієнтів цього сервісу можна створити інтерактивну карту розташування автомобілів із зазначенням їх статусу, залишку пального.",
  "Smart equipment leasing system. The company installs robotic manipulators on the conveyor line under a contract with payment for the number of operations or for the time of the robot. Manipulators regularly provide a log of operations performed, errors and warnings. The robot’s leasing fee is calculated on the basis of this, as well as the vendor’s predictive maintenance of the robots.": "Розумна система лізингу обладнання. Компанія встановлює роботизовані маніпулятори на конвеєрі за договором з оплатою за кількість операцій або за час роботи робота. Маніпулятори регулярно надають журнал виконаних операцій, помилок і попереджень. На основі цього розраховується плата за оренду робота, а також прогнозне обслуговування роботів постачальником.",
  "Global availability": "Глобальна доступність",
  "The standard client-server architecture requires specifying endpoints when routing messages from IoT devices. Thus, during the life of a smart device, the lack of connection will mean a limitation in the ability to control and interact with the device.": "Стандартна клієнт-серверна архітектура вимагає вказівки кінцевих точок під час маршрутизації повідомлень від IoT-пристроїв. Тим самим у процесі життя розумного пристрою відсутність з'єднання означатиме обмеження можливостей управління та взаємодії з пристроєм.",
  "For example, the trade war between China and the United States is already a sword of Damocles hanging over thousands of consumers of Chinese smart appliances in the United States and vice versa. At any moment, the blocking of Xiaomi servers by the U.S. authorities could affect users of devices that connect to the manufacturer’s cloud services.": "Наприклад, торговельна війна між Китаєм та США вже сьогодні висить дамокловим мечем над тисячами споживачів китайської розумної техніки у США та навпаки. У будь-який момент блокування серверів Xiaomi владою США може зашкодити користувачам пристроїв, що підключаються до хмарних сервісів виробника.",
  "Being in the immediate vicinity of an IoT device, you can’t control it from a mobile app if there is no connection to the servers, through which the user authentication and telemetry collection from the devices themselves are provided. That is, the device is actually controlled by the cloud, not the user.": "Перебуваючи в безпосередній близькості від IoT-пристрою, ви не можете керувати ним з мобільного додатку, якщо немає підключення до серверів, через які забезпечується автентифікація користувачів і збір телеметрії з самих пристроїв. Тобто пристроєм фактично керує хмара, а не користувач.",
  "Cybersecurity": "Кібербезпека",
  "The most important reason for the low cybersecurity of most IoT solutions stems from the problematic legacy of cloud client-server architecture. For example, the most common smart home architecture right now is usually an IoT hub, connected to a cloud service. Thus, a typical IoT system is a central control element connected to multiple external systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Найбільш важлива причина низької кібербезпеки більшості IoT-рішень виростає із проблемної спадщини хмарної клієнт-серверної архітектури. Наприклад, зараз найпоширеніша архітектура розумного будинку - це, як правило, IoT-хаб, підключений до хмарного сервісу. Таким чином, типова IoT-система є центральним контролюючим елементом, підключеним до безлічі зовнішніх систем. Безумовно, хмарний сервіс більш захищений, ніж низькорівневі пристрої, проте через укрупнення централізованого контролю за сотнями тисяч таких систем будь-які проломи в безпеці та витоки стають масштабною катастрофою.",
  "The cloud service servers are subject to all the typical cybersecurity problems: network attacks, DoS attacks (driving the system to failure), malicious modifications, user session hijacking, etc. But strong threats also include unintentional problems such as design errors, misuse or natural disasters that cause servers to fail. Also another definitely important point is the need in principle to trust the cloud and the people who maintain it.": "Сервери хмарного сервісу піддаються всім типовим проблемам кібербезпеки: мережеві атаки, DoS-атаки (доведення системи до відмови), шкідливі модифікації, захоплення сесій, тощо. Але до сильних погроз також додаються й ненавмисні проблеми, такі як помилки при проектуванні, неправильне використання або стихійні лиха, що призводять до поломок серверів. І ще один, безумовно, важливий пункт — необхідність у принципі довіряти хмарі та співробітникам, які її обслуговують.",
  "All of this is exacerbated by the scale of IoT solutions. The number of IoT systems. Certainly, the cloud service is more secure than low-level devices, but the consolidation of centralized control over hundreds of thousands of such systems makes any security breaches and leaks a massive disaster.": "Все це посилюється масштабом IoT-рішень. Кількість IoT-пристроїв, що належать одній системі, може перевищувати сотні і тисячі, і при цьому за своєю природою IoT-пристрої мають менші обчислювальні можливості, що значно ускладнює розгортання фаєрволів і антивірусів для них. Але найбільш згубним фактором є те, що IoT-пристрої є діючими КФС, тому загрози кібербезпеки виявляються вже і фізично.",
  "Data privacy": "Конфіденційність даних",
  "The privacy point needs to be separated from cybersecurity, because this problem is specific to IoT systems. Due to the large number and varied device types that are much more integrated into the physical world than just computers and smartphones, the range of types of private data is multiplied. It’s no longer just GPS location, shopping records, financial transactions and photos, but also a permanent record of video and conversations, voice prints, health conditions and even a list of a person’s habits. Among the types of threats related to privacy are: identification of information, localization and tracking, profiling, inventory attack, data linking attack.": "Пункт із приватністю потрібно відокремити від кібербезпеки, оскільки ця проблема є специфічною для IoT-систем. Завдяки великій кількості різноманітних типів пристроїв, які набагато більше інтегровані у фізичний світ, ніж просто комп’ютери та смартфони, діапазон типів особистих даних збільшується в рази. Це вже не лише місцезнаходження за допомогою GPS, записи про покупки, фінансові операції та фотографії, а й постійний запис відео та розмов, відбитки голосу, стан здоров’я та навіть список звичок людини. Серед типів загроз, пов’язаних з конфіденційністю, є: ідентифікація інформації, локалізація та відстеження, профілювання, inventory attack (збір даних для подальшого профілювання), лінковка даних.",
  "The creepiest part is that users have little or no awareness that they are giving up their privacy because they have almost no idea what data is being collected and how it is being used. The threat to privacy grows not only from intruders, but also from organizations and government agencies precisely because of this. The cloud IoT services typically require maximum data transfer from devices, and there are no ways to prohibit or narrow data transfer («Accept the Terms or Piss Off»). Moreover, despite the fact that the collected data is an asset and has real value, the person it is collected from is not only denied the right to actively dispose of that data, but even is denied any compensation for their own data’s collection and usage.": "Найжахливіше те, що користувачі майже не усвідомлюють, що вони відмовляються від своєї конфіденційності, тому що вони майже не уявляють, які дані збираються та як вони використовуються. Загроза конфіденційності зростає не лише з боку зловмисників, а й з боку організацій та державних установ саме через це. Хмарні IoT-сервіси зазвичай вимагають максимальної передачі даних з пристроїв, і немає способів заборонити або звузити передачу даних («Прийміть умови або злиться»). Крім того, незважаючи на те, що зібрані дані є активом і мають реальну цінність, особі, від якої вони збираються, не тільки відмовляють у праві активно розпоряджатися цими даними, але навіть відмовляють у будь-якій компенсації за збір і використання власних даних.",
  "Building on the achievements and challenges of cloud platforms, Robonomics aims to offer the IoT market safer and more advanced Internet solutions at every stage of human-machine communication. Below are the main tasks that Robonomics is aimed at:": "Спираючись на досягнення та проблеми хмарних платформ, Робономіка ставить своїм завданням запропонувати IoT-ринку більш безпечні та досконаліші інтернет-рішення на кожному етапі комунікації людини та машини. Нижче наводяться основні завдання, на які спрямована Робономіка:",
  "Managing an IoT device using a decentralized cloud": "Управління iot-пристроєм за допомогою децентралізованої хмари",
  "Blockchain networks have all the capabilities to provide the highest degree of security for running a device and getting its telemetry. The interaction with the device can actually be described by changing the state of the digital twin stored in the blockchain network and sending information about these changes. In the case of a permissionless blockchain, we can talk about the guarantees of global availability of providers for IoT, as well as a high level of protection of digital twin data from unwanted changes.": "Блокчейн мережі мають усі можливості для забезпечення найвищого ступеня безпеки запуску пристрою та отримання його телеметрії. Взаємодія з пристроєм фактично можна описати зміною стану цифрового двійника, що зберігається в блокчейн мережі, та надсиланням інформації про ці зміни. У разі використання permissionless blockchain ми можемо говорити про гарантії глобальної доступності провайдерів для IoT, а також високий рівень захисту даних цифрового двійника від небажаних змін.",
  "Performing technical and economic transaction between people and machines": "Виконання техніко-економічних операцій між людьми і машинами",
  "Thanks to the mechanism of cryptocurrencies and smart contracts, we can provide access to automated systems directly to digital markets. For example, Ethereum already implements most of the basic tools of economic activity that can be used in the operation of autonomous devices. The applications created for the interaction between the end user and the IoT device will be much more effective if the terms of service and payment for it are inseparable from the launch parameters of the device.": "Завдяки механізму криптовалют і смарт-контрактів ми можемо забезпечити доступ автоматизованих систем безпосередньо до цифрових ринків. Наприклад, Ethereum вже реалізує більшість основних інструментів економічної діяльності, які можна використовувати в роботі автономних пристроїв. Додатки, створені для взаємодії між кінцевим користувачем і пристроєм IoT, будуть набагато ефективнішими, якщо умови надання послуг і їх оплата будуть невіддільні від параметрів запуску пристрою.",
  "Modern advances in Web3-technology can solve the issue of user privacy. With Web3 there is no need to authenticate or require connection to specific servers to access telemetry and control the device.": "Сучасні досягнення Web3-технологій можуть вирішити питання конфіденційності користувачів. Завдяки Web3 немає необхідності здійснювати автентифікацію або вимагати підключення до конкретних серверів для доступу до телеметрії та керування пристроєм.",
  "Robonomics is a decentralized cloud for digital twins of IoT devices. Robonomics supports the techno-economic format for communication, as well as providing private applications for users": "Робономіка — це децентралізована хмара для цифрових двійників IoT-пристроїв. Робономіка підтримує техніко-економічний формат спілкування, а також надає приватні програми для користувачів.",
  "A human interface to access the system": "Інтерфейс людини для доступу до системи",
  "A communication protocol": "Протокол зв'язку",
  "A machine interface": "Машинний інтерфейс",
  "Human interface": "Інтерфейс людини",
  "We propose the use of decentralized applications (dapps) as the main way to connect users to control smart devices over the Internet. Thus, we will be able to provide the most secure (in terms of data) user interface to the system, which will be able to simultaneously work in the conditions of the local city network, and through a common global network.": "Ми пропонуємо використовувати децентралізовані програми (dapp, скор. від decentralized applications) як основний спосіб підключення користувачів до управління розумними пристроями через мережу Інтернет. Таким чином, ми зможемо надати найбільш безпечний (з точки зору даних) інтерфейс користувача в систему, який зможе одночасно працювати як в умовах локальної міської мережі, так і через загальну глобальну мережу.",
  "Communication protocol": "Протокол зв'язку",
  "Its role is played by the Robonomics network, a specification developed by the project team that implements a decentralized network of providers that provide the transmission, processing and storage of information needed to run IoT devices. In fact, it is an implementation of a function-specific node for IPFS, Ethereum, and Polkadot networks.": "Його роль виконує мережа Робономіка — специфікація, розроблена командою проекту, реалізує децентралізовану мережу провайдерів, які забезпечують передачу, обробку та зберігання інформації, необхідної для запуску IoT-пристроїв. Фактично є реалізацією специфічного за своїми функціями вузла для мереж IPFS, Ethereum, Polkadot.",
  "Machine interface": "Машинний інтерфейс",
  "Here is a general diagram of the complete device startup cycle using the Robonomics platform:": "Нижче представлена загальна схема повного циклу запуску пристрою за допомогою платформи Робономіки:",
  "The user’s decentralized application sends a request for a device control function through the Robonomics network.": "Децентралізована програма користувача надсилає запит на виконання функції з керування пристроєм через мережу Робономіки.",
  "The Robonomics network provides request translation using libP2P and captures events in Ethereum blockchain or Robonomics parachain.": "Мережа Робономіка забезпечує транслювання запиту за допомогою libP2P та фіксує події у Ethereum blockchain або Robonomics parachain.",
  "The control of the device is provided by a decentralized network, which is guaranteed to store the necessary information to run the IoT device.": "Управління пристроєм забезпечується децентралізованою мережею, яка гарантовано зберігає необхідну інформацію для роботи пристрою IoT.",
  "The IoT device independently receives information from Ethereum and Polkadot networks about the current state of the digital twin. This ensures that the device can be started safely only after the technical and economic start-up parameters have been settled.": "IoT-пристрій самостійно отримує інформацію із мереж Ethereum та Polkadot про поточний стан цифрового двійника. Це гарантує безпечний запуск пристрою лише після встановлення техніко-економічних параметрів запуску.",
  "As a result of the operation, the IoT device publishes a log of completed operations, which can be used as evidence of the service provided or for debugging errors.": "В результаті роботи IoT-пристрій публікує лог виконаних операцій, який може використовуватися як доказ наданої послуги або для налагодження помилок.",
  "The log is transformed into a report for the user and becomes available in his dapp.": "Лог трансформується у звіт для користувача і стає доступним у його dapp.",
  "Building Dapps && Web Services for IoT on Robonomics Parachain": "Створення Dapps та Web-cервісів для IoT на парачейні Робономіки",
  "Sergei Lonshakov, software architect": "Сергій Лоншаков, архітектор ПЗ",
  "Let us remember that the automatic machine is the precise economic equivalent of slave labor. Any labor which competes with slave labor must accept the economic consequences of slave labor.": "Згадаймо, що робот — це точний економічний еквівалент рабської праці. Будь-яка праця, яка конкурує з рабською, повинна прийняти економічні наслідки рабської праці.",
  "Norbert Wiener": "Норберт Вінер",
  "cybernetics": "кібернетика",
  "Robots are like grown-up children today – they already can manage money, and enter into legal relations, be independent.": "Сьогодні роботи схожі на дітей, що подорослішали — вони вже можуть керувати грошима, вступати у правовідносини, бути незалежними.",
  "The future of humanity itself depends on how we teach robots to handle their capabilities.": "Майбутнє людства залежить від того, як ми навчимо роботів керувати своїми можливостями.",
  "Robonomics tools": "Інструменти Robonomics",
  "Operate with digital twins of IoT devices": "Робота з цифровими двійниками IoT-пристроїв",
  "The first tools of the robot economy: money for robots, contracts for robots": "Перші інструменти в економіці роботів: гроші для роботів, контракти для роботів",
  "Software for connecting devices to a decentralized cloud": "Програмне забезпечення для підключення пристроїв до децентралізованої хмари",
  "API library for custom IoT applications": "API бібліотека для користувальних IoT-програм",
  "Robonomics contains a complete set of tools for developing IoT applications, both on the robotics and the user interface sides. Communication between the user and device happens using the most successful technologies from the Web3 world – IPFS, Ethereum, and Polkadot. Thus, developers can create modern and secure applications for Smart Cities and Industry 4.0.": "Robonomics містить повний набір інструментів для розробки програм Інтернету речей, як для робототехніки, так і для інтерфейсу користувача. Зв'язок між користувачем та пристроєм відбувається з використанням найуспішніших технологій зі світу Web3 — IPFS, Ethereum та Polkadot. Таким чином, розробники можуть створювати сучасні та безпечні програми для розумних міст та Індустрії 4.0.",
  "Robonomics Connectivity": "Сумісність Robonomics",
  "For the developers’ convenience, Robonomics contains a set of software for connecting: IoT devices using the HTTP/MQTT protocol, complex robotic systems using the Robot Operating System (ROS).": "Для зручності розробників Robonomics містить набір програмного забезпечення для підключення: пристроїв Інтернету речей, що використовують протокол HTTP/MQTT, складних роботизованих систем, що використовують операційну систему роботів (ROS).",
  "Connect a sensor": "Підключіть датчик",
  "to the Robonomics network": "до мережі Robonomics",
  "Try": "Спробуйте",
  "a simple prototyping tool": "- простий інструмент створення прототипів",
  "Start building your own cyber physical system with": "Почніть будувати власну кіберфізичну систему з",
  "Aira OS": "Aira OS",
  "Robonomics Supports Hundreds of Robots Out of the Box": "Robonomics підтримує сотні роботів із коробки",
  "Platform users can connect ROS-compatible robots to digital economy in a matter of minutes. For a complete list of supported robots, please follow the link": "Користувачі платформи можуть підключити роботів, сумісних із ROS, до цифрової економіки за лічені хвилини. Щоб побачити повний список роботів, що підтримуються, перейдіть за посиланням",
  "Decentralized Cloud infrastructure for IoT": "Децентралізована хмарна інфраструктура для IoT",
  "Robonomics Web Services (RWS) is the basic infrastructural service for Robotics and IoT on top of Robonomics Parachain and IPFS": "Robonomics Web Services (RWS) — це базовий інфраструктурний сервіс для робототехніки та Інтернету речей на основі парачейна Robonomics та IPFS",
  "Robonomics web services (RWS)": "Robonomics web services (RWS)",
  "Robonomics dapp": "Robonomics dapp",
  "economy of robots": "Економіка роботів",
  "Core RWS features available for IoT today": "Основні функції RWS, доступні сьогодні для IoT",
  "RWS PubSub Message Broker": "Брокер повідомлень RWS PubSub",
  "Use unlimited messaging over a P2P network based on IPFS protocol": "Використовуйте необмежений обмін повідомленнями по мережі P2P на основі протоколу IPFS",
  "RWS Data Blockchainization Service": "Сервіс RWS для блокчейнізації даних",
  "RWS Robot Actions": "Дії роботів з RWS",
  "Switch on / off; launch or stop your IoT devices under the control of a decentralized computer": "Запускайте та зупиняйте свої IoT-пристрої під керуванням децентралізованого комп'ютера",
  "Heart of Your IoT Application - Digital Twin on Blockchain": "Серце вашого IoT-додатку — цифровий двійник на Блокчейні",
  "In the technical architecture, IoT digital twins provide the visibility and monitoring of things and related events (e.g., using IoT devices to automatically capture the origin of a product), and blockchain enables the shared single version of the truth as to the state of these things across their life cycles and associated business events": "У технічній архітектурі цифрові двійники IoT забезпечують видимість та моніторинг речей та пов'язаних з ними подій (наприклад, за допомогою пристроїв IoT для автоматичного визначення походження продукту), а блокчейн дозволяє поділитися єдиною версією істини про стан цих речей протягом їх життєвих циклів та пов'язаних з ними бізнес-подій",
  "from Gartner research": "з дослідження Gartner",
  "Robonomics Parachain provides an opportunity to create a model of a digital twin and update its state every 6 seconds.": "Парачейн Robonomics дає можливість створити модель цифрового двійника та оновлювати її стан кожні 6 секунд.",
  "Secure": "Захищені",
  "Serverless": "безсерверні",
  "Futuristic": "футуристичні",
  "IoT applications": "програми IoT",
  "Robonomics network vision": "Концепція мережі Робономіка",
  "At the frontier of cybernetics and economics": "На стику кібернетики та економіки",
  "Build your IoT services on Robonomics platform": "Будуйте свої iot-сервіси на платформі робономіка",
  "taking full advantage of decentralized architecture": "отримуючи всі переваги децентралізованої архітектури",
  "Robonomics allows users to connect to smart devices using decentralized applications (dapp) that do not require the user data transfer for authentication. Communication takes place via a decentralized network of providers without a single point of failure, and the device independently obtains information from the blockchain network to run for execution or transmit data remotely. Thus, Robonomics provides a high level of device cybersecurity and user data privacy at all stages of communication from the user application to the launch of the smart device.": "Робономіка дозволяє підключати користувачів до розумних пристроїв за допомогою децентралізованих додатків (dapp), які не вимагають передачі даних для аутентифікації. Комунікація відбувається через децентралізовану мережу провайдерів без жодної точки відмови, а пристрій самостійно отримує інформацію з блокчейн-мережі для запуску виконання або передачі даних віддалено. Таким чином, Робономіка забезпечує високий рівень кібербезпеки пристроїв та приватності даних користувачів на всіх етапах комунікації від користувальницької програми до запуску розумного пристрою.",
  "From smart contracts to cross chain IoT platform": "Від смарт-контрактів до міжмережевої iot-платформи",
  "The Robonomics project is over 6 years old. We started to prepare for the first experiment demonstrating human-machine communication using an independent decentralized provider network in 2015, from the early days of the Ethereum network. By early 2021, the project team managed to create a techno-economic machine communication protocol running on top of Ethereum and IPFS, and complement it with elements of a cloud-based IoT platform based on the Polkadot parachain.": "Проекту Робономіка вже понад 6 років. Готуватися до проведення першого експерименту, що демонструє комунікацію людей та машин з використанням незалежної децентралізованої мережі провайдерів, ми розпочали у 2015 році — з перших днів існування мережі Ethereum. До початку 2021 року команді проекту вдалося створити протокол техніко-економічної комунікації машин, що працює поверх Ethereum та IPFS, та доповнити його елементами хмарної IoT-платформи на базі парачейну Polkadot.",
  "As a result, today, we already have a hybrid platform for creating futuristic IoT applications that enable interaction with devices under the control of a global decentralized computer.": "У результаті, вже сьогодні ми маємо гібридну платформу для створення футуристичних IoT-додатків, що забезпечують взаємодію з пристроями, що знаходяться під контролем світового децентралізованого комп'ютера.",
  "The creators of Robonomics are experimenters, engineers, and scientists who care to understand the scientific validity of the approach and achieve clarity in presenting the principles that should form the basis of the entire architecture of the software solution.": "Творці Робономіки — експериментатори, інженери та вчені, яким важливо розібратися в науковій обґрунтованості підходу та досягти ясності у поданні принципів, які мають бути покладені в основу всієї архітектури програмного рішення.",
  "In our articles between 2017 and 2020, we presented the scientific community with many concepts and solutions united around the idea of the robot economy, an economic system in which robotic devices act as independent agents capable of performing key economic activities, previously reserved for humans. You can read the scientific articles at": "У своїх статтях у період з 2017 по 2020 рік ми представили науковому співтовариству безліч концепцій і рішень, об'єднаних навколо ідеї економіки роботів — економічної системи, в якій робототехнічні пристрої виступають як незалежні агенти, здатні до виконання ключових економічних активностей, які були притаманні лише людині. З науковими статтями ви можете ознайомитись за",
  "this link": "цим посиланням",
  "We would like to justify the emergence of the robot economy and explain in general terms why we believe that this concept is the inevitable and obvious answer to the functioning of the large-scale robotic systems of the new industrial revolution.": "У цьому розділі ми хотіли б обґрунтувати появу економіки роботів і пояснити загалом, чому ми вважаємо, що саме це поняття є неминучою та явною відповіддю на питання функціонування великомасштабних роботизованих систем нової промислової революції.",
  "Move towards the factory of the future": "Шлях до заводу майбутнього",
  "Inspired by Ronald Coase": "Натхненний Рональдом Коузом",
  "The Nobel laureate in economics Ronald Coase in his 1937 work “The Nature of the Firm” best demonstrated the dichotomy «hierarchy vs free market» and gave an explanation of the reasons for the existence of organizations, in particular firms. Coase discusses the impact of transaction costs (the cost of collecting and processing information) to make decisions about the conclusion of a contract and to monitor its implementation. The firm, with all its hierarchical extra-market structure, is formed as the most efficient way to provide the consumer with the target product with the lowest transaction costs at the moment, when the transactional effort to create the same product through multiple exchanges on the market between individuals becomes much higher. To best visualize this process, look at the illustrative example of buying a car. Try to buy a car by the parts and calculate how much money and time you will spend just to assemble all the components in your garage. The risks and negotiation costs of buying parts are too high compared to Tesla’s off-the-shelf Model X.": "Нобелівський лауреат з економіки Рональд Коуз у своїй роботі 1937 року The Nature of the Firm найкраще продемонстрував дихотомію 'ієрархія vs вільний ринок' і дав пояснення причин існування організацій, зокрема фірм. Коуз розмірковує про вплив транзакційних витрат (витрат на збирання та обробку інформації) на прийняття рішень про укладення контракту та на контроль його виконання. Фірма зі всією своєю ієрархічною позаринковою структурою утворюється як найбільш ефективний спосіб надати споживачеві цільовий продукт з найменшими транзакційними витратами в той момент, коли транзакційні зусилля щодо створення того ж продукту шляхом множини обмінних операцій на ринку між індивідами стають значно вище. Щоб найкраще уявити собі цей процес, подивіться на показовий приклад із покупкою автомобіля. Спробуйте купити автомобіль по запчастинах і порахуйте скільки коштів і часу ви витратите, щоб просто зібрати всі комплектуючі у своєму гаражі. Ризики та витрати на переговори при купівлі деталей дуже високі в порівнянні з готовим до вживання Model X від фірми Tesla.",
  "Nevertheless, this does not lead to the emergence of the world’s only firm for the production of everything. The point is that the same transaction costs also impose restrictions on the size of firms. Coase writes:": "Проте, це не призводить до виникнення єдиної у світі фірми з виробництва всього. Справа в тому, що ті ж транзакційні витрати накладають обмеження і на розмір фірм. Коуз пише:",
  "“...a firm will tend to expand until the costs of organising an extra transaction within the firm become equal to the costs of carrying out the same transaction by means of an exchange on the open market...”": "«...фірма прагнутиме до розширення до того часу, поки витрати на організацію додаткової угоди всередині фірми не зрівняються з витратами здійснення тієї ж операції у вигляді обміну на відкритому ринку...»",
  "In other words, the more complex the hierarchy within the firm, the greater the internal costs, and at some point, they turn out to be excessive compared to the costs of returning to the market. Therefore, to ensure their growth as one of the drivers, entrepreneurs are looking for ways to reduce these costs.": "Іншими словами, чим складніша ієрархія всередині фірми, тим більші внутрішні витрати, і в якийсь момент вони виявляються надмірними порівняно з витратами повернення на ринок. Тому, щоб забезпечити своє зростання як один із драйверів, підприємці шукають шляхи зменшити ці витрати.",
  "The idea of reducing transaction costs through the ability of all participants in the business process (production, logistics, consumption) to unite at a closer level": "Ідея зниження транзакційних витрат за рахунок можливості об’єднання всіх учасників бізнес-процесу (виробництво, логістика, споживання) на більш тісному рівні",
  "clearly correlates": "чітко корелює",
  "with the problems and challenges faced by manufacturers of automation solutions. Over the past 50 years, the standard/regular operations of most business processes of large companies have been almost completely automated. The manufacturers are essentially left with the task of building secure communication between fully automated parts of the supply chain, and this task is a factor holding back further reduction of transaction costs through automation. The desire to market more competitive products or services compared to partially automated": "з проблемами та викликами, з якими стикаються виробники рішень автоматизації. За останні 50 років стандартні/регулярні операції більшості бізнес-процесів великих компаній були майже повністю автоматизовані. Виробникам, по суті, залишається завдання побудови безпечного зв’язку між повністю автоматизованими частинами ланцюга постачання, і це завдання є чинником, який стримує подальше зниження транзакційних витрат за рахунок автоматизаціі. Бажання продавати на ринку більш конкурентоспроможні продукти чи послуги порівняно з частково автоматизованими ",
  "firms spurs the search for solutions to": "фірмами спонукає до пошуку рішень ",
  "these challenges. It seems that everything is heading towards the emergence of robofirms — organizations in which the entire business process cycle is fully automated and does not require human participation, except as beneficiaries and consumers.": "цих проблем. Схоже, все йде до появи робофірм — організацій, у яких весь цикл бізнес-процесів повністю автоматизований і не вимагає участі людини, окрім як бенефіціарів і споживачів.",
  "Get rid of transaction costs": "Позбудьтесь транзакційних витрат",
  "Our future in smart cities": "Наше майбутнє в розумних містах",
  "The task that automation manufacturers are facing today has a specific name — the construction of cyber-physical systems (abbreviated as CPS). By": "Завдання, яке сьогодні стоїть перед виробниками засобів автоматизації, має конкретну назву — побудова кіберфізичних систем (скор. КФС). За",
  "definition,": "визначенням,",
  "a CPS is a strong unification and mutual integration of multiple computational, networking, and physical processes.": "КФС — це міцне об’єднання та взаємна інтеграція багатьох обчислювальних, мережевих і фізичних процесів. ",
  "The tasks of building CPS are central to any idea described in the new (fourth) industrial revolution. Therefore, CPS is the cornerstone of our future life in Smart Cities, manifesting itself everywhere. Examples of cyber-physical systems of the future are: Uber autopilot, drone selfies, network of 3D printers in metro stations.": "Завдання побудови КФС є центральними для будь-якої ідеї, описаної в нової (четвертої) промисловой революції. Тому КФС є наріжним каменем нашого майбутнього життя в розумних містах, проявляючи себе всюди. Прикладами кіберфізичних систем майбутнього є: автопілот Uber, селфі з дронів, мережа 3D-принтерів на станціях метро.",
  "CPS is a complex structure of many connected elements: from the app on the phone, it extends to controlling the drone in flight over the city, and then proceeds to publishing the resulting photos to Instagram, but only after processing by cloud AI.": "КФС — це складна структура з багатьох пов’язаних елементів: від додатка на телефоні він поширюється на керування безпілотником у польоті над містом, а потім переходить до публікації отриманих фотографій в Instagram, але лише після обробки хмарним AI.",
  "The most important thing in the CPS design process is to find the fine line between sufficient and excessive number of automated elements in the service user supply chain. In other words, where is the size limit of the CPS? To answer this question, we should turn to the famous mathematician Norbert Wiener.": "Найважливішим у процесі проектування КФС є знаходження тонкої межі між достатньою та надмірною кількістю автоматизованих елементів у ланцюжку поставок користувачів послуг. Іншими словами, де обмеження розміру КФС? Щоб відповісти на це питання, варто звернутися до відомого математика Норберта Вінера.",
  "Self-regulating systems": "Системи саморегулювання",
  "Inspired by Norbert Wiener": "Натхненний Норбертом Вінером",
  "Norbert Wiener speaks about viability of interdisciplinary science approach. For example he drew the parallels between automated control systems and challenges of scaling and complexity increasing of human society.": "Норберт Вінер говорить про життєздатність міждисциплінарного наукового підходу. Наприклад, він провів паралелі між автоматизованими системами управління та проблемами масштабування та підвищення складності людського суспільства.",
  "So, in other words, the cybernetic approach can be applied equally to psychotherapy, biology and automated navigation. It is based on the function of the system, how the individual actions are controlled and how the individual nodes interact with each other.": "Таким чином, іншими словами, кібернетичний підхід можна однаково застосовувати до психотерапії, біології та автоматизованої навігації. Він ґрунтується на функції системи, на тому, як контролюються окремі дії та як окремі вузли взаємодіють один з одним.",
  "Taking into account Ronald Coase's and Norbert Wiener's publications, following up the development of Industry 4.0, we can consider using CPS as an economic agent, while designing robotized services. To regulate the size of the CPS and adapt to the changing needs of the individuals we can use market mechanism.": "Зважаючи на публікації Рональда Коуза та Норберта Вінера, які продовжують тему розвитку Індустрії 4.0, ми можемо розглянути можливість використання КФС як економічного агента при розробці роботизованих послуг. Щоб регулювати розмір КФС і адаптуватися до потреб людей, що змінюються, ми можемо використовувати ринковий механізм.",
  "Robofirms are an ideal representation for cyber-physical systems. They are a fairly autonomous unit capable of providing services to both humans and other robots for money. As a result, the robot economy appears to us to be a general set of CPSs that provide services and goods directly to the market.": "Робофірми є ідеальними ілюстраціями кібер-фізичних систем. Вони є досить автономними одиницями, здатними надавати послуги як людям, так і іншим роботам за гроші. В результаті економіка роботів постає перед нами як загальний набір КФС, що надають послуги та товари безпосередньо на ринок.",
  "Bitcoin": "Bitcoin",
  "Money for robots": "Гроші для роботів",
  "Industry 1.0": "Індустрія 1.0",
  "Mechanization:": "Механізація:",
  "replacement of muscle power with steam energy.": "заміна сили м'язів енергією пари.",
  "1784 y.": "1784 р.",
  "Industry 2.0": "Індустрія 2.0",
  "Electrification:": "Електрифікація:",
  "introduction of assembly-line production.": "введення конвеєрного виробництва.",
  "1870 y.": "1870 р.",
  "Industry 3.0": "Індустрія 3.0",
  "Automation:": "Автоматизація:",
  "introduction of automated systems with CNC.": "впровадження автоматизованих систем із ЧПУ.",
  "1969 y.": "1969 р.",
  "Industry 4.0": "Індустрія 4.0",
  "Smart production:": "Розумне виробництво:",
  "development of cyber physical systems.": "розробка кібер фізичних систем.",
  "Now": "Зараз",
  "In the world of robofirms it turns out to be natural to provide robots with access to social institutions that previously were only needed by humans.": "У світі робофірм виявляється природним надати роботам доступ до соціальних інститутів, які раніше були потрібні лише людям.",
  "Social institutions do not arise because people cannot live without banks, contracts and other instruments of society. They arise only because a person at some point in time stepped onto the path of more complex relations in society and took an important step towards accelerating the surrounding processes.": "Соціальні інститути виникають не тому, що люди не можуть жити без банків, контрактів та інших інструментів суспільства. Вони виникають лише тому, що людина в якийсь момент часу ступила на шлях більш складних відносин у суспільстві і зробила важливий крок до прискорення навколишніх процесів.",
  "Money and contracts should become available to robots, not because this is a sick fantasy of robot fans who have forgotten what Skynet is. But only because the new industrial revolution sets itself the task of building complex automated chains, the processes in which will affect the exchange of both technical information and economic information, and will also proceed at a speed inaccessible to humans.": "Гроші та контракти мають стати доступними для роботів не тому, що це хвора фантазія фанатів роботів, які забули, що таке Skynet. Але лише тому, що нова індустріальна революція ставить перед собою завдання побудови складних автоматизованих ланцюгів, процеси в яких впливатимуть на обмін як технічною інформацією, так і економічною, а також відбуватимуться з недоступною для людини швидкістю.",
  "Robots need money that will be directly available to them in order to be able to perform operations without a person at the speed with which only machines can make decisions. And all this is solely for a person to enjoy life in the Smart City!": "Роботам потрібні гроші, які будуть безпосередньо доступні для них, щоб мати можливість виконувати операції без участі людини зі швидкістю, з якою лише машини можуть приймати рішення. І все це виключно для того, щоб людина насолоджувалася життям у Розумному місті!",
  "And here we smoothly come to the first electronic cash - Bitcoin. The fact that Bitcoin can be stored in your account on the principle of not a bank, but cash in your wallet makes it the first money that the robot can manage independently, more precisely autonomously. At the same time, today we can already say that Bitcoin is not just electronic cash, but a truly global financial institution.": "І ось ми плавно підійшли до першої електронної готівки — Bitcoin. Той факт, що Bitcoin можна зберігати на вашому рахунку за принципом не банку, а готівки у вашому гаманці, робить його першими грошима, якими робот може розпоряджатися самостійно, точніше автономно. При цьому вже сьогодні можна сказати, що біткойн — це не просто електронні гроші, а справді глобальний фінансовий інститут.",
  "As a result: an event not invented by us, but clearly falling into our vision, makes Bitcoin the first money for robots, or, if we look even deeper, it is precisely that social institution that will help the formation of robotic firms.": "У підсумку: подія, вигадана не нами, але явно вписується в наше бачення, робить Bitcoin першими грошима для роботів, або, якщо дивитися ще глибше, то саме тим соціальним інститутом, який сприятиме формуванню роботизованих фірм.",
  "Smart contracts": "Смарт-контракти",
  "Ethereum": "Ethereum",
  "Bitcoin became the first money available to robots. Meanwhile we can't talk about Bitcoin in its current form as a tool for full-fledged technical and economic exchange.": " Bitcoin став першими грошима, доступними для роботів. При цьому ми не можемо говорити про Bitcoin у його нинішньому вигляді як інструмент повноцінного технічного та економічного обміну.",
  "Now we already have smart contracts, DeFi markets and a decentralized infrastructure for exchanging messages between robots that open up the possibility for humanity to create a fully automated part of the human economy - the robot economy.": "Нині ми вже маємо смарт-контракти, ринки DeFi та децентралізовану інфраструктуру обміну повідомленнями між роботами, які відкривають перед людством можливість створення повністю автоматизованої частини людської економіки — економіки роботів.",
  "One of the great opportunity to build the economy of robots is": "Одна з чудових можливостей побудувати економіку роботів — це технології",
  "technology. With Ethereum functionality robots are able not only exchange money, but to enter into contracts with humans and among themselves.": "Завдяки функціональності Ethereum роботи можуть не лише обмінювати гроші, але й укладати контракти з людьми та між собою.",
  "But what's the point of machine to machine (m2m) contract based communication? That's a great question! Let's go back to CPS. When we talk about direct communications between sensors, machine equipment or any other elements we still talk about collaboration within one regulated system. But if we want smart cities services to be alive (or even smart home in some cases), we need establish communication with various third-party elements.": "Але який сенс зв’язку між машинами (m2m) на основі контракту? Це чудове запитання! Повернемося до КФС. Коли ми говоримо про прямий зв’язок між датчиками, машинним обладнанням або будь-якими іншими елементами, ми все ще говоримо про співпрацю в рамках однієї регульованої системи. Але якщо ми хочемо, щоб сервіси розумних міст були живі (або навіть розумний дім у деяких випадках), нам потрібно встановити зв’язок із різними сторонніми елементами.",
  "Let's imagine drone delivery service. If a drone, for example, is DHL's property how it can access to Amazon's warehouses or access to over the entire airspace of the city? Is it be a monopoly? This is a major challenge for many 4th industrial revolution initiatives!": "Уявімо службу доставки дронами. Якщо дрон, наприклад, є власністю DHL, як він може отримати доступ до складів Amazon або отримати доступ до всього повітряного простору міста? Чи це буде монополією? Це серйозний виклик багатьом ініціативам четвертої промислової революції!",
  "Most corporations say they need nearly complete rights to its surroundings because they don’t know how to securely set up the exchange of technical information between automated systems outside of their own internal corporate structure. At the same time, if you look at the processes where a person works, then we see that the cooperation of different corporations has been long and successfully existed. You can easily order door-to-door delivery of purchased goods on the Amazon website, and the courier will be able to drive a car along city roads, receive an order at the warehouse and bring it to you.": "Більшість корпорацій кажуть, що їм потрібні майже повні права на навколишню територію, тому що вони не знають, як безпечно налаштувати обмін технічною інформацією між автоматизованими системами за межами їхньої власної внутрішньої корпоративної структури. Водночас, якщо подивитися на процеси, де працює людина, то бачимо, що співпраця різних корпорацій давно й успішно існує. Ви легко можете замовити доставку куплених товарів «від дверей до дверей» на сайті Amazon, а кур'єр зможе проїхати автомобілем дорогами міста, отримати замовлення на складі і привезти його до вас.",
  "What's the difference? In the first case there is no way to build a contractual relationship between machines, and in the second case, in the world of people, contractual relations already exist.": "Яка різниця? У першому випадку немає можливості побудувати договірні відносини між машинами, а у другому випадку в світі людей договірні відносини вже існують.",
  "Parachains": "Парачейни",
  "Polkadot": "Polkadot",
  "The main difficulty that Robonomics faces today is the high price for launching an IoT device using Ethereum. In Ethereum you have to pay a commission on each transaction in terms of US dollars in the range of $10 to $100. It is quite expensive for most cases from the real economy, be it a car-sharing trip, renting a smart apartment, drone delivery or 3D printing of your favorite anime hero to order.": "Основна складність, з якою сьогодні стикається Робономіка, — це висока ціна за запуск IoT-пристрою з використанням Ethereum. У Ethereum ви повинні сплачувати комісію за кожну транзакцію у доларах США в діапазоні від 10 до 100 доларів. Це досить дорого для більшості випадків з реальної економіки, чи це поїздка на каршерингу, оренда шикарної квартири, доставка дронами або 3D-друк улюбленого аніме-героя на замовлення.",
  "Out of fairness, we would like to note that there are profitable scenarios even with transaction fees in the Ethereum network of 2018 - 2019. For example, automated carbon footprint offset transactions or transferring the order from the website directly to the production. But still, for the mass application of the Web3 technologies in the field of IoT, a reduction in the price that the cloud charges from the connected device is required.": "Справедливості заради відзначимо, що в мережі Ethereum 2018-2019 років є вигідні сценарії навіть з комісіями за транзакції. Наприклад, автоматизовані транзакції компенсації вуглецевого сліду або передача замовлення з веб-сайту безпосередньо на виробництво. Але все ж для масового застосування технологій Web3 в області IoT потрібне зниження ціни, яку хмара стягує з підключеного пристрою.",
  "Looking for an opportunity to reduce the cost of interacting with an IoT device, Robonomics developers have studied alternative developments to Ethereum. Our choice settled on the": "Шукаючи можливість знизити вартість взаємодії з пристроєм IoT, розробники Робономіки вивчали альтернативні розробки Ethereum. Наш вибір зупинився на архітектурі",
  "architecture, which would allow us to run our own blockchain, within a common network, in which security is ensured by validators independent of our project.": ", яка дозволить нам запускати власний блокчейн у загальной мережі, в якій безпека забезпечується валідаторами, незалежними від нашого проекту.",
  "Ethereum 2.0": "Ethereum 2.0",
  "Heterogeneous Blockchain Network": "Гетерогенна мережа блокчейнів",
  "Homogeneous Shard Network": "Гомогенна мережа шард",
  "On-chain protocol control": "On-chain управління протоколом",
  "Protection against the tyranny of the crowd": "Захист від тиранії юрби",
  "Auction of bandwidth in the common network": "Аукціони пропускної спроможності в загальной мережі",
  "Payment for gas by users": "Оплата газу користувачами",
  "Have you read this?": "Ви це читали?",
  "Philip K. Dick": "Філіп К. Дік",
  "Autofac": "Autofac",
  "I, Robot": "Я, робот",
  "Isaac Asimov": "Айзек Азiмов",
  "The Bicentennial Man": "The Bicentennial Man",
  "Neuromancer": "Нейромант",
  "William Gibson": "Вільям Ґібсон",
  "Marionettes, Inc.": "Корпорація «Маріонетки»",
  "Ray Bradbury": "Рей Бредбері",
  "Open questions of teleology": "Відкриті питання телеології",
  "and a treatise by L. von Mises": "і трактат Л. фон Мізеса",
  "In conclusion, we would like to mention questions that remain open from a global point of view. What is the goal of robots?": "На закінчення хочеться згадати питання, які залишаються відкритими з глобальної точки зору. Яка мета роботів?",
  "Praxeology inspires us with interesting ideas about human behavior without direct dependence on the purposes. This gives us the opportunity to work on the processes of the economy of robots conditionally as with a black box without delving into the ultimate goals. At the same time, teleology poses a challenge to explain causes.": "Праксеологія надихає нас цікавими уявленнями про людську поведінку без прямої залежності від цілей. Це дає нам можливість працювати над процесами економіки роботів умовно, як з чорною скринькою, не заглиблюючись у кінцеві цілі. У той же час телеологія ставить перед собою завдання пояснити причини.",
  "We hope that somewhere at the junction of the works of Mises and Wiener, a point for further development of the robot economy may be found, not just as a protocol of interaction between people and machines of a praxeological nature, but taking into account the teleological elements of building interspecies communication.": "Ми сподіваємося, що десь на стику праць Мізеса та Вінера може бути знайдена точка для подальшого розвитку економіки роботів, не просто як протоколу взаємодії між людьми та машинами праксеологічного характеру, але з урахуванням телеологічного елементи побудови міжвидової комунікації.",
  "or": "або",
  "Github": "Github",
  "Important news &amp; announcements": "Важливі новини та оголошення",
  "All posts": "Всі повідомлення",
  "R&D cases": "R&D кейси",
  "Collaboration with real estate developer on Cyprus for tracking the daily distribution, consumption and offsetting any excess carbon footprint.": "Співпраця з розробником нерухомості на Кіпрі для відстеження щоденного розподілу, споживання та компенсації будь-якого надлишку вуглецевого сліду.",
  "This page is out of your space": "Ця сторінка не знаходиться у вашому просторі",
  "Check url once more or create an": "Перевірте URL ще раз або створіть",
  "telling us that you’ve got 404 error (do not forget to mention current url)": "повідомлення, що ви отримали помилку 404 (не забудьте зазначити поточний URL)",
  "Embedded iot systems": "Автономні системи",
  "Autonomous systems": "Цифрові двійники - це серце Інтернету речей",
  "Robonomics IO": "Robonomics IO",
  "Put data into IPFS and store hashes in a public Blockchain": "Помістіть дані в IPFS та зберігайте хеші в публічному блокчейні",
  "Robonomics nfts": "Robonomics nfts",
  "Here, we've assembled a collection of NFTs minted during our extensive crypto journey, both independently and with great teams. These unique tokens offer verifiable ownership on the blockchain and make for great swag to adorn your blockchain account. You can bid on some of them at auction or even mint your own unique piece.": "Тут ми зібрали колекцію NFT, які були випущені протягом нашого великого криптового шляху, як самостійно, так і з великими командами. Ці унікальні токени надають перевірену вланість на блокчейні і стануть чудовими прикрасами для вашого облікового запису блокчейну. Ви можете зробити ставку на деякі з них на аукціоні або навіть випустити свій власний унікальний екземпляр.",
  "Robonomics Pioneer": "Robonomics Pioneer",
  "1. Robonomics Pioneer": "1. Robonomics Pioneer",
  "During our initial Kusama crowdloan campaign, we made the decision to reward our crypto pioneers' contributors with more than just tokens - we also gifted them a colorful NFT. This card holds great meaning for us, and if someone owns it, we know that they're a fantastic supporter of Robonomics' values: freedom and decentralization.": "Під час нашої початкової кампанії зі збору коштів Kusama ми прийняли рішення винагородити наших крипто-піонерів не тільки токенами, але й подарувати їм кольоровий NFT. Ця картка має велике значення для нас, і якщо хтось її володіє, ми знаємо, що вони є фантастичними прихильниками цінностей Robonomics: свободи та децентралізації.",
  "Robonomics crypto girls": "Robonomics crypto girls",
  "2. Robonomics crypto girls": "2. Robonomics crypto girls",
  "We're excited to introduce our special series of digital assets - Robonomics Crypto Girls, created by the Robonomics Art&Science team. Each NFT in this collection is a unique graphical representation of the technology used in Robonomics or built on top of Robonomics use cases. Our talented artists have hand-drawn each girl in the signature Robonomics style. You can choose the one that resonates with you or collect the entire series! By purchasing these NFTs, you're not only adding a stylish addition to your collection but also supporting us in continuing to innovate and implement decentralized connectivity for robots. Stay tuned for new additions to the collection!": "Ми раді представити нашу спеціальну серію цифрових активів - Robonomics Crypto Girls, створених командою Robonomics Art&Science. Кожен NFT в цій колекції є унікальним графічним представленням технології, що використовується в Robonomics або побудованої на його основі. Наші талановиті художники вручну намалювали кожну дівчину в стилі Robonomics. Ви можете вибрати ту, яка вам найбільше подобається, або зібрати всю серію! Придбавши ці NFT, ви не тільки додаєте стильний елемент до своєї колекції, але й підтримуєте нас у подальшому інноваційному розвитку та впровадженні децентралізованого зв'язку для роботів. Слідкуйте за новими додатками до колекції!",
  "3. SEASONAL SPOT NFT COLLECTIONS": "3. СЕЗОННІ КОЛЕКЦІЇ NFT",
  "On demand minting": "Можливість миття на вимогу",
  "SEASONAL SPOT NFT COLLECTIONS": "СЕЗОННІ КОЛЕКЦІЇ NFT",
  "These seasonal NFT collections represent a one-of-a-kind digital asset that captures the unique interaction between the user and Spot within the Robonomics parachain. Users can draw anything on the browser, and the robot will replicate their movements to create a hand-drawn image. Once the interaction is complete, the NFT is minted on the Singular marketplace for the user's Polkadot account. Now, anyone can interact with a real-life robot located in a laboratory in California to create personalized and unique digital assets that can be owned, bought, and sold just like any other digital asset.": "Ці сезонні колекції NFT представляють унікальний цифровий актив, який зафіксовує унікальну взаємодію між користувачем та Spot в межах паралельного простору Robonomics. Користувачі можуть малювати будь-що у браузер, і робот відтворюватиме їх рухи, щоб створити ручне зображення. Після завершення взаємодії NFT випускається на ринку Singular для облікового запису Polkadot користувача. Тепер будь-хто може взаємодіяти з реальним роботом, розташованим у лабораторії в Каліфорнії, щоб створювати персоналізовані та унікальні цифрові активи, які можна володіти, купувати та продавати, як будь-який інший цифровий актив.",
  "Create your NFT": "Створіть свій NFT",
  "4. automated telescope collection": "4. автоматизована колекція телескопів",
  "automated telescope collection": "автоматизована колекція телескопів",
  "Located in the Atacama Desert, Chile, a physical telescope can be accessed through a decentralized app for capturing real-time images of astronomical objects in deep space. Every user with an internet connection can access it with $STRGZN tokens, which are available for purchase in the app using a credit card. Select an astronomical object, send a command to the telescope to take a picture, and wait for the minted NFT on the Singular platform. Please note that the app is only available for use from 11 pm to 6 am GMT-3 due to the telescope's operating hours.": "Розташований у пустелі Атакама, Чилі, фізичний телескоп можна отримати за допомогою децентралізованого додатку для отримання зображень астрономічних об'єктів у реальному часі у глибокому космосі. Кожен користувач з підключенням до Інтернету може отримати доступ до нього за допомогою токенів $STRGZN, які можна придбати в додатку за допомогою кредитної картки. Виберіть астрономічний об'єкт, надішліть команду телескопу зробити знімок і зачекайте на випущений NFT на платформі Singular. Зверніть увагу, що додаток доступний лише з 23:00 до 6:00 за Грінвічем через робочі години телескопа.",
  "Try yourself": "Спробуйте самі",
  "5. Robonomics Polka pet": "5. Robonomics Polka pet",
  "In collaboration with Polkapets": "У співпраці з Polkapets",
  "and": "та",
  "Robonomics Polka pet": "Robonomics Polka pet",
  "As a proud member of the Polkadot ecosystem, Robonomics took part in Polka Pets World. Together with the Polka Pets team, we minted 1200 NFTs featuring a unique design concept that showcases our core idea of connectivity. To bring this idea to life, we created a personality: an android that specializes in helping humans connect with any robotic entity.": "Як пишний член екосистеми Polkadot, Robonomics взяв участь у світі Polka Pets. Разом з командою Polka Pets ми випустили 1200 NFT з унікальною концепцією дизайну, яка демонструє нашу основну ідею зв'язку. Щоб втілити цю ідею, ми створили персональність: андроїд, який спеціалізується на допомозі людям у взаємодії з будь-яким роботом.",
  "6. Mecha Arm Jetpack": "6. Mecha Arm Jetpack",
  "Mecha Arm Jetpack": "Mecha Arm Jetpack",
  "In 2021, Robonomics started commitment to support the addition of RMRK's pallets into their runtime, which would result in native integration with the world's most advanced NFT logic. To celebrate this remarkable milestone, we launched a special Kanaria-compatible item - a child NFT that can be equipped onto one's Kanaria bird, and may provide advantages in RMRK's metaverse.": "У 2021 році Robonomics почав підтримувати додавання палет RMRK до свого рантайму, що призвело до нативної інтеграції з найбільш передовою логікою NFT в світі. Щоб відзначити цей визначний момент, ми запустили спеціальний предмет, сумісний з Kanaria - дитячий NFT, який можна використовувати на пташці Kanaria і який може надавати переваги в метавсесвіті RMRK.",
  "RMRK Partnerships": "Партнерства RMRK",
  "This page has moved to a": "Ця сторінка була переміщена на",
  "Automatic redirecting": "Автоматичне перенаправлення",
  "Libelium": "Libelium",
  "In 1948 a professor of mathematics at the MIT Norbert Wiener published one of the most seminal works \"Cybernetics: Or Control and Communication in the Animal and the Machine\". He used the term \"cybernetics\" as self-regulating mechanisms for the first time and, so, this publication is considered a recognized Cybernetic birthday.": "У 1948 році професор математики в МІТ Норберт Вінер опублікував одну з найвпливовіших праць \"Кібернетика: або Керування та комунікація в тварині та машині\". Він вперше використав термін \"кібернетика\" як саморегулюючі механізми, тому ця публікація вважається визнаним кібернетичним днем народження.",
  "Great books lead to great ideas. If you're after more inspiration about human-machine communication, try reading science fiction books. Mark the books you’ve already read and see what else can we offer you for further reflection.": "Великі книги призводять до великих ідей. Якщо ви шукаєте більше натхнення щодо комунікації людини з машинами, спробуйте прочитати науково-фантастичні книги. Позначте книги, які ви вже прочитали, і подивіться, що ще ми можемо запропонувати вам для подальшого роздуму.",
  "In fact, the economy of people is often associated with the conscientiousness of performing tasks within the framework of the contract, the desire of the parties to achieve a result, the opportunistic and altruistic behavior of the individual in society. All of these principles are hard to apply to the robot economy. What are the motives of the robot economy? It's an open question that we need to research and discuss in society for better understanding and applying robots.": "Насправді, економіка людей часто пов'язана з добросовісністю виконання завдань в рамках контракту, бажанням сторін досягти результату, мжливим і альтруїстичним поведінкою особи в суспільстві. Усі ці принципи важко застосовувати до роботизованої економіки. Які мотиви роботизованої економіки? Це відкрите питання, яке нам потрібно досліджувати і обговорювати в суспільстві для кращого розуміння та застосування роботів.",
  "For the start we suggest to look at Mises's work \"Human Action: A Treatise on Economics\" (praxeological approach) and at early article by Norbert Wiener \"Behavior, Purpose and Teleology\" (teleological vision).": "На початок ми пропонуємо ознайомитися з працею Мізеса \"Людська діяльність: Трактат з економіки\" (праксеологічний підхід) та з ранніми статтями Норберта Вінера \"Поведінка, мета і телеологія\" (телеологічне бачення).",
  "Establishing democracy with smart contracts": "Створення демократії за допомогою розумних контрактів",
  "Let's imagine a small office with a team of 10-15 people. While everybody is focused on their own deadlines for their main professional tasks, no one seems to care about the upkeep of the office space. The most common solution to avoid sinking into chaos is to hire third-party individuals for support. Another approach is to take the initiative and impose penalties on those who create a mess or deplete supplies without replenishing them. However, is it ethical to live under tyranny in our future crypto-anarchist world, where everyone is expected to be responsible and enjoy freedom? Let's strive to create a more democratic society using smart contracts and the new generation of Internet technologies (often referred to as Web3). We need tools that can help us make decisions together, and then ensure they work properly without humans having to get directly involved.": "Уявімо невеликий офіс з командою з 10-15 осіб. Поки кожен зосереджений на своїх основних професійних завданнях, ніхто не здається звертати увагу на підтримку офісного простору. Найпоширенішим рішенням для уникнення хаосу є наймати сторонніх осіб для підтримки. Інший підхід - взяти ініціативу і накладати штрафи на тих, хто створює безлад або вичерпує запаси без їх поповнення. Однак, чи етично жити під тиранією в нашому майбутньому крипто-анархістичному світі, де від кожного очікується відповідальність і свобода? Давайте прагнемо створити більш демократичне суспільство, використовуючи розумні контракти та нове покоління Інтернет-технологій (часто називають Web3). Нам потрібні інструменти, які допоможуть нам приймати рішення разом, а потім забезпечать їх правильну реалізацію без прямої участі людей.",
  "'Who drank all the coffee?!' or the tragedy of the commons": "'Хто випив усю каву?!' або трагедія загального користування",
  "There's a concept widely discussed in economics, ecology, and other sciences known as the 'tragedy of the commons.' This pertains to a scenario in which individuals who have access to a shared resource prioritize their own interests, ultimately exhausting the resource. Coffee closely resembles such a resource, as it deteriorates due to uncontrolled consumption in the office. However, at the same time, usually none of the team members are inclined to invest their time and money in obtaining an additional package of coffee beans. So, they keep drinking coffee without getting new supplies.": "Існує поняття, широко обговорюване в економіці, екології та інших науках, відоме як 'трагедія загального користування'. Це стосується сценарію, в якому особи, які мають доступ до спільного ресурсу, надають перевагу своїм власним інтересам, в результаті чого ресурс вичерпується. Кава дуже нагадує такий ресурс, оскільки вона псується через неконтрольоване споживання в офісі. Однак, зазвичай жоден з членів команди не має бажання витрачати свій час і гроші на отримання додаткового пакету кавових зерен. Тому вони продовжують пити каву, не поповнюючи запаси.",
  "How to formulate the task in numbers.": "Як сформулювати задачу у числах.",
  "Assuming a monthly coffee budget of $100, which is approximately equivalent to 150 cups for our team of 10 people, this leaves each person with 1 cup every 2 days. Now, let's delve into the technical details. The question is: how can we bring an autonomous coffee machine to life in the office?": "Припускаючи щомісячний бюджет на каву в розмірі 100 доларів, що приблизно еквівалентно 150 чашок для нашої команди з 10 осіб, це залишає кожну особу з 1 чашкою кожні 2 дні. Тепер давайте заглибимося в технічні деталі. Питання таке: як ми можемо оживити автономну кавоварку в офісі?",
  "Step 1: automated coffee bean ordering": "Крок 1: автоматичне замовлення кавових зерен",
  "We've made an arrangement with the barista, Nikita, who's located near the office. He'll supply us with coffee beans upon receiving an alert from the bot. The bot sends a message when the coffee is running low, specifying the quantity of coffee (in kilograms) needed for the order and the corresponding payment amount determined by the team. With these details, Nikita can select the coffee according to his preference.": "Ми уклали угоду з бариста Нікітою, який знаходиться поруч з офісом. Він буде постачати нам кавові зерна після отримання сповіщення від бота. Бот надсилає повідомлення, коли кава закінчується, зазначаючи кількість кави (у кілограмах), необхідну для замовлення, та відповідну суму платежу, визначену командою. З цими деталями Нікіта може вибрати каву за своїм смаком.",
  "Step 2: automatic access to smart office.": "Крок 2: автоматичний достп до розумного офісу.",
  "Simultaneously with the order, the coffee machine generates a QR code. Nikita then presents this QR code to the camera for office entry.": "Одночасно з замовленням кавоварка генерує QR-код. Потім Нікіта представляє цей QR-код камері для входу в офіс.",
  "Step 3: distribution of coffee tokens to the team.": "Крок 3: розподіл кавових токенів команді.",
  "Once the local camera scans the QR code, the smart home management system initiates a payment to Nikita and distributes new coffee tokens among the team members.": "Після того, як локальна камера сканує QR-код, система управління розумним будинком ініціює платіж Нікіті та розподіляє нові кавові токени серед членів команди.",
  "Step 4: drink coffee!": "Крок 4: пити каву!",
  "In order to receive a fresh cup of coffee, a team member needs to send a coffee token to the address of the coffee machine.": "Для отримання свіжої чашки кави член команди повинен надіслати кавовий токен на адресу кавоварки.",
  "Coffee beans delivery process:": "Процес доставки кавових зерен:",
  "Unlock new possibilities with this concept": "Розблокуйте нові можливості з цим концептом",
  "Furthermore, such an automated coffee machine introduces various economic and social dimensions. Let’s take a look at them:": "Крім того, така автоматизована кавоварка вводить різні економічні та соціальні аспекти. Давайте розглянемо їх:",
  "Developers can deposit extra coffee tokens when consumption falls below the limit. This creates a transparent system for varied coffee usage within the limit.": "Розробники можуть внести додаткові кавові токени, коли споживання впадає нижче лімту. Це створює прозору систему для різноманітного використання кави в межах ліміту.",
  "The coffee machine could maintain a shared account, enabling office members to contribute funds from their personal accounts for a higher quality coffee experience next time.": "Кавоварка може мати спільний рахунок, що дозволяє членам офісу вносити кошти зі своїх особистих рахунків для отримання кращого досвіду від кави в майбутньому.",
  "The team collectively decides the coffee quantity the machine will order each time through a DAO vote. This provides freedom to tackle the challenge with limited resources.": "Команда спільно вирішує кількість кави, яку машина буде замовляти кожного разу за допомогою голосування DAO. Це надає свободу вирішувати проблему з обмеженими ресурсами.",
  "Programmable processes reduce the influence of human factors and also offer greater flexibility in tailoring settings for specific teams.": "Програмовані процеси зменшують вплив людських факторів і також пропонують більшу гнучкість у налаштуванні параметрів для конкретних команд.",
  "How we smarten up our coffee machine in real life": "Як ми розуміємо нашу кавоварку в реальному житті",
  "To achieve hands-on control of the coffee machine, we integrated a single-board computer, specifically the Raspberry Pi 4, along with a commonly available mass-market coffee machine that supported GPIO connection. Our preference was the": "Щоб мати можливість контролювати кавоварку, ми інтегрували одноплатний комп'ютер, зокрема Raspberry Pi 4, разом з доступною на рину кавоваркою, яка підтримує підключення GPIO. Нашим вибором була",
  "selected for its affordability and the convenience of its easily removable front panel.": "обрана через її доступність та зручність знімної передньої панелі.",
  "Next, we worked out the operational details, specifically concerning which tokens users could send and the underlying algorithm. Here's the result:": "Далі ми вирішили деталі щодо токенів, які користувачі можуть надсилати, та базового алгоритму. Ось результат:",
  "To enjoy a cup of delicious coffee, users need to send a certain amount of funds (in our case, 1 Statemine's token ACT, id=3077) to the coffee machine's address from a parachain (Statemine). Afterward, the coffee pouring process begins, and an action log is subsequently published on": "Щоб насолодитися чашкою смачної кави, користувачам потрібно надіслати певну суму коштів (у нашому випадку, 1 токен ACT від Statemine, id=3077) на адресу кавоварки з паралелейних ланцюжків (Statemine). Після цього починається процес наливання кави, а потім журнал дій публікується на",
  "via the Datalog function": "за допомогою функції Datalog",
  "When the concept extends beyond the office": "Коли концепція виходить за межі офісу.",
  "This concept offers numerous avenues for expanding the idea. It was successfully implemented at the Polkadot Web3 Hub during the 2022 World Economic Forum in Davos. Participants were able to place coffee orders and specify their desired coffee type (e.g., espresso, americano, cappuccino) by sending a certain amount of tokens.Let us share photos and videos from this event:": "Ця концепція пропонує численні можливості для розширення ідеї. Вона була успішно реалізована в Polkadot Web3 Hub під час Світового економічного форуму 2022 року в Давосі. Учасники могли замовляти каву і вказувати бажаний тип кави (наприклад, еспресо, американо, капучино), відправляючи певну кількість токенів. Давайте поділимося фотографіями та відео з цього заходу:",
  "Our blockchain coffee maker making coffee at the Polkadot Web3 Hub": "Наш блокчейн-кавоварка готує каву в Polkadot Web3 Hub",
  "DIY or how to build your own smart blockchain coffee machine": "DIY або як побудувати свою власну розумну блокчейн-кавоварку",
  "You can find a detailed tutorial and technical specifications in the open-source GitHub repository. Keep in mind that you can use any coffee machine you prefer and almost any token of your choice to bring this project to life in your own space.": "Ви можете знайти детальний посібник та технічні характеристики в репозиторії GitHub з відкритим кодом. Пам'ятайте, що ви можете використовувати будь-яку кавоварку, яку ви бажаєте, і майже будь-який токен за своїм вибором, щоб оживити цей проект у своєму просторі.",
  "In a nutshell": "В кінцевому підсумку",
  "Nowadays, it becomes more and more clear that energy consumption is a major contributor to carbon footprints, making it increasingly important to find ways to reduce our environmental impact. Offices and commercial buildings play a significant role in this energy consumption. The engineers at Robonomics have installed a system in the office of BBF, a Cyprus-based real estate developer, to track and collect electricity measurements. This system also provides a practical way to offset the carbon footprint.": "Сьогодні стає все більш очевидним, що споживання енергії є основним чинником викидів вуглецю, тому все більш важливо знаходити способи зменшення нашого впливу на навколишє середовище. Офіси та комерційні будівлі відіграють значну роль у споживанні енергії. Інженери компанії Robonomics встановили систему в офісі BBF, кіпрського розробника нерухомості, для відстеження та збору показників електроенергії. Ця система також надає практичний спосіб компенсувати викиди вуглецю.",
  "1. Monitoring surplus energy generation": "1. Моніторинг надлишкового виробництва енергії",
  "At the BBF company's office building, several solar panels have been installed and integrated into the Solarweb system, enabling easy collection of analytics. The system provides data on the building's overall electricity consumption and the electricity generated by the solar panels. However, a crucial missing feature is the capability to offset the carbon footprint resulting from the electricity consumed beyond what is generated by the solar panels.": "У будівлі офісу компанії BBF встановлено кілька сонячних панелей, які інтегровано в систему Solarweb, що дозволяє легко збирати аналітику. Система надає дані про загальне споживання електроенергії будівлею та електроенергію, вироблену сонячними панелями. Однак, відсутня важлива функція - можливість компенсувати викиди вуглецю, що виникають внаслідок споживання електроенергії понад те, що вирбляють сонячні панелі.",
  "2. Converting excess energy power to CO2 offset": "2. Перетворення надлишкової енергії на компенсацію CO2",
  "Having data on the total electricity consumption and the solar panels' electricity production allows for a straightforward calculation of the carbon footprint. It is assumed that electricity from solar panels has a carbon footprint of 0, which means compensation is necessary only for the excess electricity consumed beyond what the solar panels generated.": "Маючи дані про загальне споживання електроенергії та виробництво електроенергії сонячними панелями, можна легко розрахувати викиди вуглецю. Припускається, що електроенергія від сонячних панелей має викид вуглецю 0, що означає, що компенсація необхідна лише за споживану електроенергію, яка перевищує вироблену сонячними панелями.",
  "Notably, CO2 emissions differ across countries. In Cyprus, the average pollution stands at 587 g/kWh, according to Hannah Ritchie, Max Roser, and Pablo Rosado (2022) - \"Energy\".": "На замітку, викиди CO2 відрізняються в різних країнах. В Кіпрі середнє забруднення становить 587 г/кВт-год, за даними Ханны Рітчі, Макса Розера та Пабло Росадо (2022) - \"Енергетика\".",
  "To offset the carbon footprint, carbon credits are utilized, with each credit representing 1 ton of CO2. These credits play a vital role in compensating for the environmental impact caused by electricity consumption beyond the solar panels' contribution.": "Для компенсації викидів вуглецю використовуються вуглецеві кредити, кожен з яких представляє 1 тонну CO2. Ці кредити відіграють важливу роль у компенсаії впливу на навколишнє середовище, спричиненого споживанням електроенергії понад внесок сонячних панелей.",
  "Thus, armed with data on energy consumption, solar panel production, and the Cyprus coefficient, it becomes effortless to determine the number of tokens required for carbon footprint offset.": "Таким чином, маючи дані про споживання енергії, виробництво сонячних панелей та кіпрський коефіцієнт, стає легким визначити кількість токенів, необхідних для компенсації викидів вуглецю.",
  "To achieve this, we incorporated a Raspberry Pi, configured Home Assistant to collect analytical data, and developed an integration for compensating the footprint. The Home Assistant energy dashboard showcases the following details:": "Для досягнення цього ми використали Raspberry Pi, налаштували Home Assistant для збору аналітичних даних та розробили інтеграцію для компенсації викидів. Панель керування енергією Home Assistant показує наступні деталі:",
  "Furthermore, our integration enhances the system by offering a convenient control panel to view statistics and trigger compensation:": "Крім того, наша інтеграція покращує систему, пропонуючи зручну панель керування для перегляду статистики та запуску компенсації:",
  "Below is an illustrative example of how carbon footprint offsetting occurs through our integration. Upon successful completion, the": "Нижче наведено ілюстративний приклад того, як відбувається компенсація викидів вуглецю через нашу інтеграцію. Після успішного завершення",
  "transaction": "транзакції",
  "unfolds as follows:": "відбувається наступне:",
  "Reducing energy usage in the office is just as important as compensating for carbon emissions. We can achieve this by making small changes like using energy-efficient lighting and appliances and keeping office equipment well-maintained.": "Зменшення споживання енергії в офісі так само важливо, як компенсація викидів вуглецю. Ми можемо досягти цього, роблячи невеликі зміни, такі як використання енергоефективного освітлення та приладів та дотримання належного утримання офісного обладнання.",
  "Energy consumption is a big part of our carbon footprint, and businesses must do their part to be more environmentally friendly. Having a system that tracks energy usage and helps offset carbon emissions can greatly reduce the impact of an office building on the environment. By adopting the right approach, businesses can contribute to a greener future.": "Споживання енергії є великою частиною нашого викиду вуглецю, і бізнеси повинні внести свій внесок у збереження навколишнього середовища. Мати систему, яка відстежує споживання енергії та допомагає компенсувати викиди вуглецю, може значно зменшити вплив офісної будівлі на навколишнє середовище. За допомогою правильного підходу бізнеси можуть сприяти зеленому майбутньому.",
  "The way forward": "Шлях вперед",
  "Strategy for transforming the coffee machine into an autonomous robotic device": "Стратегія перетворення кавової машини в автономний роботизований пристрій",
  "Aleksandr Kapitonov, Sergey Lonshakov, Vitaly Bulatov, Babak Kia Montazam, James White": "Олександр Капітонов, Сергій Лоншаков, Віталій Булатов, Бабак Кіа Монтазам, Джеймс Вайт",
  "Ivan Berman, Enrica Zereik, Aleksandr Kapitonov, Fabio Bonsignorio, Alisher Khasanov, Aziza Oripova, Sergey Lonshakov, Vitaly Bulatov": "Іван Берман, Енріка Зерейк, Олександр Капітонов, Фабіо Бонсіньоріо, Алішер Хасанов, Азіза Оріпова, Сергій Лоншаков, Віталій Булатов",
  "Vadim Manaenko, Aleksandr Kapitonov, Ivan Berman": "Вадим Манаєнко, Олександр Капітонов, Іван Берман",
  "Aleksandr Kapitonov; Ivan Berman; Vadim Manaenko; Vyacheslav Rzhevskiy; Vitaly Bulatov; Artemii Zenkin": "Олександр Капітонов; Іван Берман; Вадим Манаєнко; В'ячеслав Ржевський; Віталій Булатов; Артемій Зенкін",
  "Ilya Afanasyev, Alexander Kolotov, Ruslan Rezin, Konstantin Danilov, Manuel Mazzara, Subham Chakraborty, Alexey Kashevnik, Andrey Chechulin, Aleksandr Kapitonov, Vladimir Jotsov, Andon Topalov, Nikola Shakev, Sevil Ahmed": "Ілья Афанасьєв, Олександр Колотов, Руслан Резін, Константин Данилов, Мануель Маззара, Субхам Чакраборті, Алексей Кашевнік, Андрей Чечулін, Олександр Капітонов, Володимир Йоцов, Андон Топалов, Нікола Шакев, Севіл Ахмед",
  "Aleksandr Kapitonov, Sergey Lonshakov, Ivan Berman, Eduardo Castelló Ferrer, Fabio P Bonsignorio, Vitaly Bulatov, Aleksandr Svistov": "Олексадр Капітонов, Сергій Лоншаков, Іван Берман, Едуардо Кастельо Феррер, Фабіо П. Бонсіньоріо, Віталій Булатов, Олександр Свістов",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin, Vitaly Bulatov": "Олександр Капітонов, Іван Берман, Сергій Лоншаков, Олександр Крупенкін, Віталій Булатов",
  "Konstantin Danilov; Ruslan Rezin; Ilya Afanasyev; Alexander Kolotov": "Константин Данилов; Руслан Резін; Ілья Афанасьєв; Олександр Колотов",
  "Alastair Marke": "Аластер Марке",
  "Sergey Lonshakov, Aleksandr Krupenkin, Aleksandr Kapitonov, Evgeny Radchenko, Alisher Khassanov, Aleksandr Starostin": "Сергій Лоншаков, Олександр Крупенкін, Олександр Капітонв, Євген Радченко, Алішер Хасанов, Олександр Старостін",
  "Aleksandr Kapitonov, Ivan Berman, Sergey Lonshakov, Aleksandr Krupenkin": "Олександр Капітонов, Іван Берман, Сергій Лоншаков, Олександр Крупенкін",
  "Aleksandr Kapitonov, Ivan Berman, Vitaly Bulatov, Sergey Lonshakov, Aleksandr Krupenkin": "Олександр Капітонов, Іван Берман, Віталій Булатов, Сергій Лоншаков, Олександр Крупенкін",
  "Anton Galenovich, Sergey Lonshakov, Alexey Shadrin": "Антон Галенович, Сергій Лоншаков, Олексей Шадрін",
  "Aleksandr Kapitonov, Sergey Lonshakov, Aleksandr Krupenkin, Ivan Berman": "Олександр Капітонов, Сергій Лоншаков, Олександр Крупенкін, Іван Берман",
  "On the Way to Sovereign Home Automation": "У шляху до суверенної домашньої автоматизації",
  "World Economic Forum Annual Meeting 2022": "Щорічна зустріч Світового економічного форуму 2022",
  "Polkadot Decoded 2022": "Polkadot Decoded 2022",
  "Becoming a Parachain for IoT Applications": "Стати парачейном для IoT-додатків",
  "Polkadot Decoded 2021": "Polkadot Decoded 2021",
  "IROS2021 (sponsored by Robonomics)": "IROS2021 (підтримується Robonomics)",
  "Robonomics Winter School 2021 (hosted by Robonomics)": "Зимова школа Robonomics 2021 (організована Robonomics)",
  "Transition to Multinetwork — Along Came Polkadot": "Перехід до багатомережевості - Ось і прийшов Polkadot",
  "The Rise of Robonomics Network": "Підйом мережі Robonomics",
  "Crypto Valley Conference 2018": "Конференція Crypto Valley 2018",
  "European Parliament workshop ‘The Economy of Robots’": "Семінар Європейського парламенту «Економіка роботів»",
  "Consensus 2018 conference": "Конференція Consensus 2018",
  "Symposium on Blockchain for Robotic Systems at MIT Media Lab": "Симпозіум з блокчейну для робототехнічних систем в Медіа-лабораторії MIT",
  "Robonomics-2018 summer school hosted by Robonomics.": "Літня школа Robonomics-2018, організована Robonomics.",
  "Fronius Solar.web integration with Home Assistant": "Інтеграція Fronius Solar.web з Home Assistant",
  "One of our goals in developing this case is to turn Robonomics into ROS 2 Middleware.This will allow us to use Robonomics on Substrate to create an dapp that can run ROS 2 right from the browser!": "Одна з наших цілей у розробці цього випадку - перетворити Robonomics в проміжний програмний засіб ROS 2. Це дозволить нам використовувати Robonomics на Substrate для створення додатка, який може працювати з ROS 2 прямо з браузера!",
  "Eisenkoch, the robot chef": "Ейзенкоч, робот-кухар",
  "Real case fot the robot equipped with two waffle irons and baking 6 waffles at the same time in 5-7 minutes.": "Реальний випадок для робота, оснащеного двома вафельними прасками, який готує 6 вафель одночасно за 5-7 хвилин.",
  "Blockchain-powered smart coffee machine": "Смарт-кавоварка на основі блокчейну",
  "Robonomics coffee - is a smart coffee machine integrated in Robonomics Network. This project aims to show Robonomics potential in the IoT sphere by a real-world example.": "Кавоварка Robonomics - це смарт-кавоварка, інтегрована в мережу Robonomics. Цей проект має на меті показати потенціал Robonomics у сфері Інтернету речей на реальному прикладі.",
  "Water environmental inspector": "Інспектор водного середовища",
  "Air monitoring network": "Мережа моніторингу повітря",
  "Production quality control platform “Feecc”": "Платформа контролю якості виробництва «Feecc»",
  "Backup and archiving service for robotics companies": "Сервіс резервного копіювання та архівування для робототехнічних компаній",
  "Public lab with Boston Dynamics Spot": "Публічна лабораторія з роботом Boston Dynamics Spot",
  "Autonomous telescope service": "Автономний сервіс телескопа",
  "Smart home secure remote control and backup service": "Безпечне дистанційне керування та резервне копіювання розумного будинку",
  "Blockchain as quality control system for chemistry": "Блокчейн як система контролю якості для хімії",
  "Real CO2 emissions reduction with blockchain-proven certificates": "Справжнє зменшення викидів CO2 за допомогою блокчейн-підтверджених сертифікатів",
  "Robot-artist Gaka-Chu": "Робот-художник Гака-Чу",
  "Demo “Get the weather of Fuji mountain”": "Демонстрація «Отримання погоди гори Фудзі»",
  "The main idea that the authors of Robonomics tried to convey before - is the natural, logical, and seemingly inevitable evolution from the current level of the economy into fully automated services. Automated services will need to have both the ability to speak the language of human economics and also the machines' own economics to perform various operations in the world around them at a speed not available to humans.": "Основна ідея, яку автори Robonomics намагалися передати раніше, - це природна, логічна і, здається, необхідна еволюція від поточного рівня економіки до повністю автоматизованих послуг. Автоматизовані послуги повинні мати здатність говорити мовою людської економіки і також власної економіки машин для виконання різних операцій у світі навколо них зі швидкістю, недоступною для людей.",
  "The development and application of the Internet of Things has shown that solving typical problems is not enough. Completely new concepts and principles, based on earlier mistakes and identified shortcomings, have emerged by the present day. This certainly convenient approach of using cloud services turned out to have a number of critical shortcomings related to scalability, privacy, and security. In an effort to solve these problems, it was proposed to bring data processing, logic, and computation closer to the immediate place where they are used. Thus, the concepts of fog and edge computing emerged, with intermediate systems between the cloud and devices taking over some of the cloud's functions. Therefore, the creation of edge systems has become one of the new challenges of building the Internet of Things.": "Розробка та застосування Інтернету речей показали, що вирішення типових проблем недостатньо. З'явилися зовсім нові концепції і принципи, засновані на раніше допущених помилках і виявлених недоліках. Цей зручний підхід до використання хмарних сервісів виявився з низкою критичних недоліків, пов'язаних з масштабованістю, конфіденційністю та безпекою. В намаганні вирішити ці проблеми було запропоновано наблизити обробку даних, логіку та обчислення до безпосереднього місця їх використання. Таким чином, з'явилися концепції туманного та реберного обчислення, з проміжними системами між хмарою та пристроями, які беруть на себе деякі функції хмари. Тому створення реберних систем стало одним з нових викликів побудови Інтернету речей.",
  "the Robonomics Parachain portal": "портал Robonomics Parachain",
  "3. Managing blockchain-verified carbon footprint offset": "3. Управління вуглецевим слідом, підтвердженим блокчейном",
  "Collaborations with congenial projects also continued. Robonomics and DAO IPCI introduced a service for collecting and analyzing sensory data —": "Також продовжувалися співпраці з рідкісними проектами. Robonomics та DAO IPCI представили сервіс для збору та аналізу сенсорних даних -",
  "And what's so scientifically interesting, taking as a basis the idea of the restrictions imposed by the market on the size of the firm, we can say that the limit of the increase in CPS will always be determined by the market and nothing else is required for this.": "І що так науково цікаво, виходячи з ідеї обмежень, накладених ринком на розмір фірми, можна сказати, що межа зростання CPS завжди буде визначатися ринком і для цього не потрібно нічого іншого.",
  "One of the examples of our experiments: negotiating road space and right of way payments for autonomous vehicles to reduce congestion. What a person would absolutely not do in traffic, the car will do for you without difficulties: you want to switch lanes, your car and your neighbor's car exchange offers on the cost of such an operation at a rate of hundreds msgs per second, they will reveal an equilibrium price, and so you are already in the next faster moving lane. This means that now it will become available to \"charge\" your ride with uber and make it faster.": "Один з прикладів наших експериментів: переговори про дорожній простір та платежі за право проїзду для автономних транспортних засобів з метою зменшення заторів. Те, що людина абсолютно не зробила б у дорожньому русі, автомобіль зробить для вас без проблем: ви хочете перестроїтися, ваш автомобіль та автомобіль вашого сусіда обмінюються пропозиціями щодо вартості такої операції зі швидкістю сотень повідомлень на секунду, вони виявлять рівновагову ціну, і ви вже знаходитесь в наступному швидкому рухомому ряду. Це означає, що тепер ви зможете \"зарядити\" свою поїздку з uber та зробити її швидшою.",
  "Robonomics White Paper": "Robonomics Білий Папір",
  "Here, you can find and download (completely free, of course) the very first Robonomics white paper, which was introduced in May 2018. While much has evolved since then, the fundamentals of Robonomics are still outlined in this paper.": "Тут ви можете знайти та завантажити (звичайно, абсолютно безкоштовно) перший Білий Папір Robonomics, який був представлений у травні 2018 року. Хоча з того часу багато що змінилося, основи Robonomics все ще описані в цьому документі.",
  "Gaka-Chu: A Self-Employed Autonomous Robot Artist": "Gaka-Chu: Самозайнятий автономний робот-художник",
  "Cooperative Gradient-Free Localization and Tracking of Moving Environmental Boundaries by Teams of Nonholonomic Robots": "Кооперативна безградієнтна локалізація та відстеження рухомих меж навколишнього середовища командами неголономних роботів",
  "Robot-as-a-Service: From Cloud to Peering Technologies": "Робот-як-сервіс: від технологій хмари до технологій пірінгу",
  "Trustable Environmental monitoring by means of sensors networks on swarming autonomous marine vessels and distributed ledger technology": "Довірчий моніторинг навколишнього середовища за допомогою мереж датчиків на розповзаючихся автономних морських суднах та технології розподіленого реєстру",
  "Digital Passport for Unmanned Vehicles": "Цифровий паспорт для безпілотних транспортних засобів",
  "Robonomics as a Blockchain-based Platform for Unmanned Traffic Management of Mobile Vehicles": "Robonomics як блокчейн-платформа для управління рухом безпілотних транспортних засобів",
  "Towards blockchain-based multi-agent robotic systems: Analysis, classification and applications": "Шлях до блокчейн-базових багентних роботизованих систем: аналіз, класифікація та застосування",
  "Robotic Services for New Paradigm Smart Cities Based on Decentralized Technologies": "Роботизовані сервіси для нових парадигм розумних міст на основі децентралізованих технологій",
  "Protocol for Organization of a Decentralized Autonomous Agents Network in Factories Using Market Mechanisms": "Протокол для організації децентралізованої мережі автономних агентів на фабриках з використанням ринкових механізмів",
  "Towards blockchain-based Robonomics: autonomous agents behavior validation": "Шлях до блокчейн-базового Robonomics: перевірка поведінки автономних агентів",
  "Transforming Climate Finance and Green Investment with Blockchains": "Трансформація фінансування клімату та зелених інвестицій за допомогою блокчейнів",
  "Robonomics: platform for integration of cyber physical systems into human economy": "Robonomics: платформа для інтеграції кіберфізичних систем в людську економіку",
  "Blockchain based protocol for economical communication in industry 4.0": "Протокол на основі блокчейну для економічного спілкування в промисловості 4.0",
  "Robonomics based on blockchain as a principle of creating smart factories": "Robonomics на основі блокчейну як принцип створення розумних фабрик",
  "Blockchain ecosystem for carbon markets, environmental assets, rights, and liabilities: Concept design and implementation": "Екосистема блокчейну для вуглецевих ринків, екологічних активів, прав та зобов'язань: концепт-дизайн та реалізація",
  "Blockchain-based protocol of autonomous business activity for multi-agent systems consisting of UAVs": "Протокол на основі блокчейну для автономної бізнес-діяльності багентних систем, що складаються з БПЛА",
  "English": "Англійська",
  "Russian": "Російська",
  "Chinese": "Китайська",
  "Robonomics is an open-source platform that facilitates both simple IoT services and complex robotics, enabling effective communication between agents, whether they are human or robotic. To integrate robots into this system, we utilize ROS. In this article, we aim to provide an overview of our process for integrating Robonomics into ROS 2.": "Robonomics - це відкрита платформа, яка сприяє як простим IoT-сервісам, так і складній робототехніці, забезпечуючи ефективну комунікацію між агентами, будь то людиною або роботом. Для інтеграції роботів у цю систему ми використовуємо ROS. У цій статті ми маємо на меті надати огляд нашого процесу інтеграції Robonomics у ROS 2.",
  "Why ROS 2 in Robonomics?": "Чому ROS 2 в Robonomics?",
  "ROS, the Robot Operating System, is one of the oldest open-source frameworks for robotics. It's a collection of software libraries and tools for making robots work. It has everything from the basics to advanced features and comes with handy tools for programmers. It's widely used by universities worldwide for teaching and research in robotics, so it's well-established, works with many types of robots, and has a big community of developers.": "ROS, Операційна система роботів, є однією з найстаріших відкритих фреймворків для робототехніки. Це колекція програмних бібліотек і інструментів для робототехніки. Вона має все, від основ до розширених функцій і постачається зручними інструментами для програмістів. Вона широко використовується університетами по всьому світу для навчання та досліджень у галузі робототехніки, тому вона добре встановлена, працює з багатьма типами роботів і має велику спільноту розробників.",
  "Since ROS was started in 2007, significant changes have taken place in the field of robotics and within the ROS community. As a response to these developments, ROS 2 was introduced with the aim of adapting to these changes. It builds upon the strengths of ROS 1 while addressing its limitations. We've been utilizing ROS in Robonomics from the very beginning, and now it's time for us to migrate to ROS 2.": "З моменту запуску ROS у 2007 році в галузі робототехніки та в спільноті ROS відбулися значні зміни. Як відповідь на ці зміни, був представлений ROS 2 з метою адаптації до цих змін. Він ґрунтується на перевагах ROS 1, вирішуючи його обмеження. Ми використовували ROS у Robonomics з самого початку, і тепер настав час для нас мігрувати до ROS 2.",
  "You might find this interesting": "Ви можете знайти це цікавим",
  "There are numerous open-source robots and complex robotic platforms that support ROS. This means you can create an impressive multi-robot system to achieve your specific objectives. For": "Існує безліч відкритих роботів та складних робототехнічних платформ, які підтримують ROS. Це означає, що ви можете створити вражаючу мультироботну систему для досягнення ваших конкретних цілей. Для ",
  "the most current list of supported robots": " найактуальнішого списку підтримуваних роботів ",
  "please visit the ROS website.": "відвідайте веб-сайт ROS.",
  "Let's see how ROS is used within the Robonomics framework by picturing the entire system with Robonomics acting as different layers:": "Давайте подивимося, як ROS використовується в рамках фреймворку Robonomics, уявивши весь систему з Robonomics, діючим як різні шари:",
  "On the 'Machine Interface' layer, we require tools to seamlessly connect robots with software. ROS 2 provides a robust set of developer tools perfectly suited for this task.": "На рівні 'Машинний інтерфейс' нам потрібні інструменти дл безшовного з'єднання роботів з програмним забезпеченням. ROS 2 надає надійний набір інструментів розробника, які ідеально підходять для цієї задачі.",
  "Robonomics packages for ROS and ROS 2": "Пакети Robonomics для ROS і ROS 2",
  "Building a multi-robotic system often involves the challenge of connecting devices from various vendors, or even devices within a single vendor, each using different protocols. Whether it's for a smart home setup or automated manufacturing, effective communication among your machines is crucial. ROS (and, of course, ROS 2) offers various modes to address this. What if you could customize tasks while ROS manages communication between nodes?": "Побудова багатороботних систем часто включає в себе виклик підключення пристроїв від різних виробників або навіть пристроїв в межах одного виробника, кожен з яких використовує різні протоколи. Незалежно від того, чи це розумний домашній комплект або автоматизоване виробництво, ефективна комунікація між вашими машинами є вирішальною. ROS (і, звичайно, ROS 2) пропонує різні режими для вирішення цієї проблеми. Що, якщо ви могли б налаштувати завдання, а ROS керував комунікацією між вузлами?",
  "The Robonomics team has created various packages for ROS to make robots smarter and handle specific tasks as needed. To see the tasks we've accomplished with ROS, check out our R&D cases page. Almost every interaction with a robot relies on ROS. You can find our open-source Robonomics packages for ROS on GitHub, and here are some of them:": "Команда Robonomics створила різні пакети для ROS, щоб зробити роботів розумнішими а виконувати конкретні завдання за потребою. Щоб побачити завдання, які ми виконали з ROS, перегляньте нашу сторінку з випадками дослідження та розробки. Майже кожна взаємодія з роботом базується на ROS. Ви можете знайти наші відкриті пакети Robonomics для ROS на GitHub, а ось деякі з них:",
  "Robonomics communication stack contains a set of ROS packages for economical communication purposes.": "Стек комунікації Robonomics містить набір пакетів ROS для економічної комунікації.",
  "Robonomics' contribution in the ROS 2 community": "Внесок Robonomics у спільноту ROS 2",
  "Robonomics combines Robotics with Web3 technologies, and we aim to grow in these areas. Since the introduction of ROS 2, we've identified three main challenges that involve supporting the ROS 2 community and improving the capabilities of Robonomics:": "Robonomics поєднує робототехніку з технологіями Web3, і ми прагнемо розвиватися в цих галузях. Після введення ROS 2 ми визначили три основні виклики, які пов'язані з підтримкою спільноти ROS 2 та покращенням можливостей Robonomics:",
  "Creating ROS 2 tools for Rust:": "Створення інструментів ROS 2 для Rust:",
  "These tools empower developers to write ROS 2 applications using Rust. To discover more about why we chose Rust and the significance of this project for us, you can find": "Ці інструменти дозволяють розробникам писати додатки ROS 2 з використанням Rust. Щоб дізнатися більше про те, чому ми обрали Rust і значення цього проекту для нас, ви можете знайти",
  "additional details": "додаткові деталі",
  "Developing Robonomics Middleware for ROS 2:": "Розробка проміжного програмного забезпечення Robonomics для ROS 2:",
  "This plays an important role in ensuring seamless integration of Robonomics into various multi-agent robotics systems using ROS 2. It can facilitate the integration of robots into Web 3 blockchain technologies while also reducing errors during the integration process, thereby saving both time and costs.": "Це відіграє важливу роль у забезпеченні безшовної інтеграції Robonomics у різноманітні багатороботні системи з використанням ROS 2. Воно може сприяти інтеграції роботів у технології блокчейн Web 3, а також зменшувати помилки під час процесу інтеграції, що дозволяє зекономити час і кошти.",
  "Creating a robotics lab with ROS 2:": "Створення лабораторії робототехніки з ROS 2:",
  "As ROS 2 gains popularity in the robotics community, we're eager to see more robots and hardware working with ROS 2. Our goal is to connect them to the Web3 ecosystem using Robonomics.": "Оскільки ROS 2 набуває популярності в робототехнічній спільноті, ми бажаємо бачити більше роботів та обладнання, що працюють з ROS 2. Нашою метою є підключення їх до екосистеми Web3 за допомогою Robonomics.",
  "Research papers": "Наукові статті",
  "Without academic research, the advancement of complex systems that can be integrated into our daily lives may lose its purpose or even pose risks. We must carefully contemplate our direction, objectives, and potential consequences. The spheres where Robonomics operates, specifically Robotics, Economic relations, and Web3 technologies, are worth studying individually, exploring how they can be integrated with each other, and assessing their potential impact on our lives.": "Без наукових досліджень розвиток складних систем, які можуть бути інтегровані в наше повсякденне життя, може втратити свою мету або навіть створити ризики. Ми повинні ретельно обдумувати наш напрямок, цілі та потенційні наслідки. Сфери, в яких працює Robonomics, зокрема робототехніка, економічні відносини та технології Web3, варто вивчати окремо, досліджуючи, як їх можна інтегрувати один з одним та оцінюючи їх потенційний вплив на наше життя.",
  "This case is currently in motion; don't miss out news — subscribe for updates in the box below": "Цей випадок наразі знаходиться в русі; не пропустіть новини - підпишіться на оновлення у полі нижче",
  "The 'Robonomics Coffee' is a smart coffee machine integrated into the Robonomics Network. This project aims to illustrate Robonomics' potential in the IoT sphere through a real-world example.": "Кавоварка 'Robonomics Coffee' - це розумна кавоварка, інтегрована в мережу Robonomics. Цей проект має на меті продемонструвати потенціал Robonomics у сфері Інтернету речей на прикладі реального світу.",
  "Digital twins are the heart of the internet of things": "Цифрові двійники є серцем Інтернету речей",
  "\"Main tasks of robonomics architecture": "\"Основні завдання архітектури робономіки",
  "No posts yet": "Ще немає записів",
  "If you want to help us with translation": "Якщо ви хочете допомогти нам з перекладом",
  "contact us at": "зв'яжіться з нами за адресою",
  "send": "надіслати",
  "Robonomics is 100% open-source, secure, сost-effective, and futuristic IoT platform for connecting robotics under Polkadot and Ethereum control. Anyone can build services with Robonomics.": "Robonomics - це 100% відкрита, безпечна, ефективна за вартістю та майбутнєорієнтована платформа Інтернету речей для з'єднання робототехніки під контролем Polkadot та Ethereum. Будь-хто може створювати сервіси з Robonomics.",
  "Below a list of our  proven applications of modern robotics technologies.": "Нижче наведений список наших перевірених застосувань сучасних технологій робототехніки.",
  "By interest:": "За інтересами:",
  "Sort by progress:": "Сортувати за прогресом:",
  "Any progress": "Будь-який прогрес",
  "Complete": "Завершено",
  "Proceeding": "В процесі",
  "Sort by time:": "Сортувати за часом:",
  "Recent": "Останні",
  "Earliest": "Найраніше",
  "Show more": "Показати більше",
  "logos and assets": "логотипи та активи",
  "Download the Robonomics logos here. We've got two options for your": "Завантажте логотипи Robonomics тут. У нас є два варіанти для вашої",
  "basic needs": "основних потреб",
  "and one designed for": "і один розроблений для",
  "XRT": "XRT",
  "token. Additionally, discover the optimal": "токену. Крім того, відкрийте оптимальну",
  "color palette": "палітру кольорів",
  "for the distinguished Robonomics brand": "для видатного бренду Robonomics",
  "Robonomics logos": "логотипи Robonomics",
  "Download all": "Завантажте всі",
  "XRT logos": "логотипи XRT",
  "Recommended color palette": "Рекомендована палітра кольорів",
  "RWS logos": "Логотипи RWS",
  "You are currently opted out. Click here to opt in.": "Ви в даний момент відмовилися. Натисніть тут, щоб погодитися.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Відмова виконана; ваші відвідування цього веб-сайту не будуть записуватися інструментом веб-аналітики. Зверніть увагу, що якщо ви очистите файли cookie, видалите файли cookie відмови або зміните комп'ютери або веб-браузери, вам доведеться знову виконати процедуру відмови.",
  "Please click below to opt in:": "Натисніть нижче, щоб погодитися:",
  "You are currently opted in. Click here to opt out.": "Ви в даний момент погодилися. Натисніть тут, щоб відмовитися.",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Ви можете відмовитися від призначення унікального номера ідентифікації файлу cookie веб-аналітики для вашого комп'ютера, щоб уникнути агрегації та аналізу даних, зібраних на цьому веб-сайті.",
  "To make that choice, please click below to receive an opt-out cookie": "Щоб зробити цей вибір, натисніть нижче, щоб отримати файл cookie відмови",
  "Privacy Policy": "Політика конфіденційності",
  "Robonomics Middleware Framework for ROS 2": "Робономічс Middleware Framework для ROS 2",
  "Bringing Together Web3 Techs and Robotic Frameworks": "Об'єднання технологій Web3 та роботичних фреймворків",
  "Playing with Human-Machine Interaction through Ethereum": "Гра з взаємодією людини та машини через Ethereum",
  "This study information has been expired. For up-to-date lessons and workshops visit our": "Ця інформація про дослідження застаріла. Для актуальних уроків та майстер-класів відвідайте нашу",
  "academy": "академію",
  "Home assistant themes": "Теми для домашнього помічника",
  "Customize your Home Assistant with our free to use themes. Follow the instructions for installation on": "Налаштуйте свій домашній помічник за допомогою наших безкоштовних тем. Дотримуйтесь інструкцій для встановлення на",
  "Do you want": "Чи хочете",
  "to dive even deeper?": "ще глибше зануритися?",
  "Our": "Наш",
  "White Paper": "Білий Папір",
  "Science": "Наука",
  "We think reading books can really open up your mind. Whether it's simple but smart ideas or more complex ones, books are the best way for your brain to soak it all in. You can grab our books for free and check out our list of recommended reads to dive into the exciting world of robotics!": "Ми вважаємо, що читання книг дійсно може відкрити ваш розум. Чи то прості, але розумні ідеї, чи складніші, книги - це найкращий спосіб для вашого мозку всмоктувати все це. Ви можете завантажити наші книги безкоштовно та переглянути наш список рекомендованих книг, щоб зануритися в захопливий світ робототехніки!",
  "Download books about Robonomics": "Завантажте книги про Робономіку",
  "Open your mind [list of recommendations]": "Відкрийте свій розум [список рекомендацій]",
  "Robonomics R&D": "Робономіка R&D",
  "R&D 18-28": "R&D 18-28",
  "R&D 1-17": "R&D 1-17",
  "Robot economics": "Робот-економіка",
  "Grab your merch with unique Robonomics art painted by our gorgeous girls. We created shops on the biggest online markets for artists, check it out and find t-shirts, long sleeves, hoodies, shower curtains, pillows, blankets and other useful stuff.": "Заберіть свій товар з унікальним мерчем Robonomics, намальованим нашими чудовими дівчатами. Ми створили магазини на найбільших онлайн-ринках для художників, перевірте це і знайдіть футболки, довгі рукави, куртки з капюшоном, душові занавіски, подушки, ковдри та інші корисні речі.",
  "We have chosen the most well-known robotics framework called Robot Operating System (ROS) as the standard interface for integrating any compatible cyber-physical system. Robonomics supports several uses for ROS. The implementation of Robonomics for the Ethereum network is in the form of the ROS package robonomics_comm. For the ROS 2 architecture, we implement support for Robonomics as a middleware layer (see «Robonomics as ROS 2 Middleware» for details). When the use of ROS is redundant (e.g., when working with IoT devices), a Python robonomics-interface module has been developed. It helps to access the functions of Robonomics natively and works with both local and private and remote and public nodes.": "Ми обрали найбільш відому рамку робототехніки під назвою Robot Operating System (ROS) як стандартний інтерфейс для інтеграції будь-якої сумісної кібер-фізичної системи. Robonomics підтримує кілька використань для ROS. Реалізація Robonomics для мережі Ethereum відбувається у вигляді пакету ROS robonomics_comm. Для архітектури ROS 2 ми реалізуємо підтримку Robonomics як проміжного рівня (див. «Robonomics як проміжний рівень ROS 2» для деталей). Коли використання ROS є зайвим (наприклад, при роботі з пристроями Інтернету речей), був розроблений модуль інтерфейсу Python robonomics, який допомагає отримати доступ до функцій Robonomics нативно і працює як з локальними, так і з приватними та віддаленими та публічними вузлами.",
  "read our almanac": "прочитайте наш альманах",
  "Begin your adventure in the world of cyberpunks": "Почніть свою пригоду у світі кібер-панків",
  "Pure open source": "Чистий відкритий код",
  "Local and Global Availability": "Місцева та глобальна доступність",
  "By utilizing open source, P2P, and Web3, there’s no room for corporate tricks, ensuring your personal data is protected. All information is stored either locally or encrypted with your personal key in the Web3 cloud.": "Використовуючи відкритий код, P2P та Web3, немає місця для корпоративних хитрощів, що гарантує захист ваших особистих даних. Усі дані зберігаються або локально, або зашифровані за допомогою вашого особистого ключа в хмарі Web3.",
  "Interested in how the team reached this stage?": "Цікаво, як команда дійшла до цього етапу?",
  "The Robonomics Timeline": "Хронологія Robonomics",
  "can guide you through our journey": "може провести вас через наш шлях",
  "Device Design and Development": "Проектування та розробка пристроїв",
  "Smart devices": "Розумні пристрої",
  "Wearable merch": "Носима продукція",
  "Academy": "Академія",
  "Wiki": "Вікі",
  "Science & White paper": "Наука та біла книга",
  "Tokenomics": "Токеноміка",
  "Cases": "Випадки",
  "Brand assets": "Брендові активи",
  "Wallpapers": "Шпалери",
  "NFT": "NFT",
  "Blog": "Блог",
  "Contacts": "Контакти",
  "Become a provider of environmental data to your friends and neighbors in the area. Access truly decentralized measurements of air quality, noise, temperature, and other environmental conditions on the sensor map.": "Станьте постачальником середовищних даних для своїх друзів та сусідів у вашому районі. Отримуйте дійсно децентралізовані виміри якості повітря, шуму, температури та інших середовищних умов на карті датчиків.",
  "The most open-source smart home server, powered by RISC-V, with a Web3 cloud replacing Google servers under the hood.": "Найбільш відкритий домашній сервер з використанням RISC-V, з хмарою Web3, що замінює сервери Google під капотом.",
  "Smart WI-FI MQTT devices with open-source firmware Tasmota on the board fully compatible with Home Assistant.": "Розумні пристрої WI-FI MQTT з відкритим програмним забезпеченням Tasmota на борту, повністю сумісні з Home Assistant.",
  "Connect your smart home and smart clothing to the Hikikomori to monitor sensor data—right at your fingertips. Literally.": "Підключіть свій розумний дім та розумний одяг до Hikikomori, щоб моніторити дані датчиків - прямо під ваших пальцях. Буквально.",
  "Meet smart devices & futuristic hardware from an autonomous team with extensive expertise in robotics, blockchain, and IoT": "Зустрічайте розумні пристрої та майбутнє обладнання від автономної команди з великим досвідом у робототехніці, блокчейні та Інтернеті речей",
  "Data processing is always a sensitive issue. That's why we offer a fully open-source": "Обробка даних завжди є чутливим питанням. Тому ми пропонуємо повністю відкритий код",
  "connectivity module": "модуль підключення",
  "Robonomics established three Connectivity hubs to ensure a stable connection. This option switched on by default on the station.": "Robonomics створив три центри підключення для забезпечення стабільного з'єднання. Ця опція ввімкнена за замовчуванням на станції.",
  "You may launch your own hub for receiving data from Altruist Civil Station and further processing.": "Ви можете запустити свій власний хаб для отримання даних від Альтруїстської Цивільної Станції та подальшої обробки.",
  "Steps to set up your Connectivity": "Кроки для налаштування вашого підключення",
  "Deploy Connectivity": "Розгорнути підключення",
  "Technical requirements:": "Технічні вимоги:",
  "2 CPU cores;": "2 ядра CPU;",
  "4 GB RAM;": "4 ГБ ОЗУ;",
  "40 GB storage;": "40 ГБ зберігання;",
  "Static IP": "Статична IP-адреса",
  "Than set up": "Потім налаштуйте",
  "and follow": "і слідуйте",
  "the instructions": "інструкціям",
  "Connect a station to your connectivity": "Підключіть станцію до вашого підключення",
  "Open your sensor settings by its IP.": "Відкрийте налаштування датчика за його IP-адресою.",
  "Go to APIs settings": "Перейдіть до налаштувань API",
  "Check the checkbox for sending data to custom API and fill corresponding fields (server IP, ports, etc.).": "Позначте прапорець для відправки даних на користувацький API та заповніть відповідні поля (IP-адреса сервера, порти і т. д.).",
  "Join with your setup to global map (optional)": "Приєднуйтеся з вашим налаштуванням до глобальної карти (необов'язково)",
  "If you want to publish data to": "Якщо ви хочете опублікувати дані на",
  "the global map": "глобальну карту",
  "you need to make two pull requests:": "вам потрібно зробити два запити на витягування:",
  "Add IPFS ID of your Connectivity to agents list of sensor map:": "Додайте IPFS ID вашого підключення до списку агентів карти датчиків:",
  "Add parachain address of your Connectivity to template agents list of long-term storage server:": "Додайте адресу парачейну вашого підключення до списку агентів шаблону довгострокового сховища:",
  "Steps for launching your own map": "Кроки для запуску вашої власної карти",
  "Deploy web interface": "Розгорнути веб-інтерфейс",
  "Fork the map repository:": "Розгалужуйте репозиторій карти:",
  "Edit the settings to customize your map, including the domain, provider, starting viewpoint, and your connectivity IPFS ID for the list of agents.": "Редагуйте налаштування для налаштування вашої карти, включаючи домен, постачальника, початкову точку зору та ваш IPFS ID підключення для списку агентів.",
  "Deploy your own version of the web interface and begin receiving real-time data from your sensor.": "Розгорніть свою власну версію веб-інтерфейсу та почніть отримувати дані в реальному часі від вашого датчика.",
  "Full guide here:": "Повний посібник тут:",
  "Launch long-term storage": "Запустіть довгострокове зберігання",
  "Simply collecting data from sensors is not enough; it needs to be processed. Tweak a server for collecting sensor’s data based on with open-source node.js software": "Просте збирання даних від датчиків недостатнє; їх потрібно обробляти. Налаштуйте сервер для збору даних від датчиків на основі відкритого програмного забезпечення node.js",
  "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)": "Robonomics Sensors Measure Analytics and Archive Node (RoSeMAN)",
  "and get your own working server for long-term map data storage.": "і отримайте свій власний робочий сервер для зберігання даних на довгостроковий термін на мапі.",
  "Static IP.": "Статичний IP.",
  "Steps for launching a storage:": "Кроки для запуску зберігання:",
  "Fork the RoSeMAN repository:": "Розгалужуйте репозиторій RoSeMAN:",
  "Choose Docker or Node.js (required MongoDB database) version.": "Виберіть версію Docker або Node.js (потрібна база даних MongoDB).",
  "Add a parachain address of your Connectivity to agents list.": "Додайте адресу парачейну вашого підключення до списку агентів.",
  "Run the project.": "Запустіть проект.",
  "The first server for a smart home built entirely on open-source — from CPU to decentralized cloud.": "Перший сервер для розумного будинку, побудований виключно на відкритому вихідному коді — від ЦП до децентралізованого хмарного сховища.",
  "Processor:": "Процесор:",
  "StarFive JH-7110 with RISC-V 4-core CPU, 2 MB L2 cache, up to 1.5 GHz, RV64GC ISA support": "StarFive JH-7110 з RISC-V 4-ядерним ЦП, 2 МБ кешу L2, до 1,5 ГГц, підтримка ISA RV64GC",
  "GPU:": "Графічний процесор:",
  "IMG BXE-4-32 MC1, up to 600 MHz": "IMG BXE-4-32 MC1, до 600 МГц",
  "Memory:": "Пам'ять:",
  "8 GB LPDDR4 SDRAM, up to 2800 Mbps": "8 ГБ LPDDR4 SDRAM, до 2800 Мбіт/с",
  "Storage:": "Сховище:",
  "32 GB TF card (minimum)": "32 ГБ картка TF (мінімум)",
  "Interfaces:": "Інтерфейси:",
  "2x Gigabit Ethernet ports, 4x USB 3.0 Type-A ports, 40-pin GPIO header, M.2 connector,  eMMC socket, 2-pin fan header": "2 порти Gigabit Ethernet, 4 порти USB 3.0 Type-A, роз'єм GPIO на 40 контактів, роз'єм M.2, роз'єм eMMC, роз'єм для вентилятора на 2 контакти",
  "Power:": "Живлення:",
  "5V DC via USB-C, up to 30 W (minimum 3 A) or 5V input via 40-pin GPIO": "5В постійного струму через USB-C, до 30 Вт (мінімум 3 А) або 5В вхід через 40-контактний роз'єм GPIO",
  "OS:": "ОС:",
  "Ubuntu 24.04 LTS": "Ubuntu 24.04 LTS",
  "Home Assistant Core Installation": "Встановлення основного компонента Home Assistant",
  "Robonomics Integration Installation": "Встановлення Інтеграції Robonomics",
  "Zigbee Devices in Zigbee2MQTT": "Пристрої Zigbee в Zigbee2MQTT",
  "Add RoSeMAN domain to remote provider of map.": "Додайте домен RoSeMAN до віддаленого постачальника карти.",
  "All hardware": "Все обладнання",
  "Use it": "Використовуйте його",
  "Learn": "Вивчайте",
  "Explore website": "Досліджуйте веб-сайт",
  "Timeline since 2015": "Хронологія з 2015 року",
  "The team is acquiring new skills in designing and programming smart devices from the ground up. The": "Команда набуває нові навички у проектуванні та програмуванні розумних пристроїв з нуля.",
  "sensors.social": "сенсори.соціальні",
  "network, where testbed devices developed by Robonomics engineers operate, has been created. A line of smart home devices based on Tasmota Wi-Fi has also been developed, and since summer 2024, this line has been undergoing certification for the EU market. In fall 2024, the project team will introduce a line of open-source devices powered by Web3 technologies, under the name \"Hardware for Cryptopunks.\"": "Створено мережу, де працюють пристрої тестового стенду, розроблені інженерами Robonomics. Також була розроблена лінійка розумних пристроїв для дому на основі Wi-Fi Tasmota, і з літа 2024 року ця лінійка проходить сертифікацію для ринку ЄС. Уосени 2024 року команда проекту представить лінійку пристроїв з відкритим вихідним кодом на основі технологій Web3 під назвою \"Hardware for Cryptopunks\".",
  "Robonomics continues to grow within the Polkadot ecosystem. The Kusama network parachain has been running for over two years, and starting in fall 2024, a parachain will also launch on the Polkadot network. More than 5 million transactions from user devices have been recorded on the network. The team is continuing to explore possibilities for integrating their implementations across both Ethereum and Polkadot.": "Robonomics продовжує розвиватися в екосистемі Polkadot. Паралельна мережа Kusama працює вже понад два роки, і починаючи з осені 2024 року, також буде запущена паралельна мережа на мережі Polkadot. Більше 5 мільйонів транзакцій від пристроїв користувачів було зафіксовано в мережі. Команда продовжує досліджувати можливості інтеграції своїх реалізацій як в Ethereum, так і в Polkadot.",
  "Robo Smart Devices:": "Робо Розумні Пристрої:",
  "Read books": "Читати книги",
  "Robonomics merch": "Мерч Robonomics",
  "Desktop": "Робочий стіл",
  "Smartphone": "Смартфон",
  "our robo art wallpapers": "наші робо-арт-шпалери",
  "Space monkey devcon 2024 special": "Космічний мавпа девкон 2024 спеціальний",
  "Download this picture to your device and join our special Devcon 2024 quest at thrilling locations around Bangkok!": "Завантажте це зображення на свій пристрій та приєднуйтесь до нашого спеціального квесту Devcon 2024 на захоплюючих місцях по всьому Бангкоку!",
  "Free Wallpapers for you from our artists": "Безкоштовні шпалери для вас від наших художників",
  "Hide your folder with secret wallpaper": "Сховайте свою папку за секретною шпалерою",
  "We've created secret wallpapers just for you! Download the background and folder icons, and your folders will blend seamlessly into your Home Screen—leaving only beautiful artwork visible.": "Ми створили секретні шпалери саме для вас! Завантажте фон та значки папок, і ваші папки будуть гармонійно вписуватися в ваш екран домашнього меню, залишаючи видимими лише красиві художні роботи.",
  "Desktop background": "Фон робочого столу",
  "Mac OS icons": "Іконки Mac OS",
  "Windows icons": "Іконки Windows",
  "Iphone": "Iphone",
  "Samsung": "Samsung",
  "Pixel": "Pixel",
  "A non-invasive device for installation in electrical panels with DIN rail mounting. Built on the Espressif ESP32C6 chip with open RISC-V architecture.": "Неінвазивний пристрій для встановлення в електричних щитах з монтажем на DIN-рейку. Побудований на мікросхемі Espressif ESP32C6 з відкритою архітектурою RISC-V.",
  "Sign up for updates": "Підписатися на оновлення",
  "Hardware for cyberpunks": "Обладнання для кібер-панків",
  "Tech Blog & Updates": "Технічний блог та оновлення",
  "Share and access noise, dust, and temperature data from other independent sensors nearby. Forget corporate servers—this data is securely distributed worldwide through innovative Web3 technology.": "Діліться та отримуйте дані про шум, пил та температуру від інших незалежних датчиків поруч. Забудьте про корпоративні сервери - ці дані безпечно розподіляються по всьому світу за допомогою інноваційної технології Web3.",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving for years on our": "Відчуйте силу справжньої DePIN (Децентралізованої Фізичної Інфраструктурної Мережі) - революційного технологічного руху, який ожив і процвітає вже кілька років на нашій",
  "decentralized sensor map": "децентралізованій карті датчиків",
  "3 ways to use it": "3 способи використання",
  "Check open-source sensor firmware on GitHub": "Перевірте відкрите програмне забезпечення атчика на GitHub",
  "Operate your own Data Server": "Управляйте своїм власним сервером даних",
  "giving you the freedom to choose which servers to use for processing. No proprietary clouds, no hidden code.": "що дає вам свободу вибору серверів для обробки. Немає пропрієтарних хмар, немає схованого коду.",
  "Keep in mind, you can join the": "Пам'ятайте, що ви можете приєднатися до",
  "global decentralized sensor map": "глобальної децентралізованої карти датчиків",
  "even with a sensor connected through your own server!": "навіть з датчиком, підключеним через свій власний сервер!",
  "Run your own Interactive Map": "Запустіть свою власну інтерактивну карту",
  "Love the idea of a decentralized map but want to customize it with extra layouts and become an administrator of new sovereign sensor infrastructure? You can deploy": "Любите ідею децентралізованої карти, але хочете налаштувати її з додатковими макетами та стати адміністратором нової суверенної інфраструктури датчиків? Ви можете розгорнути",
  "your own version by forking": "свою власну версію, розділивши",
  "our open-source code on GitHub (be sure to check the license type). Remember to use open-source resources responsibly.": "наш відкритий код на GitHub (не забудьте перевірити тип ліцензії). Пам'ятайте відповідально використовувати відкриті ресурси.",
  "Device Specifications": "Характеристики пристрою",
  "Input Voltage:": "Вхідна напруга:",
  "AC 100-240V 50/60Hz": "AC 100-240V 50/60Гц",
  "Wireless protocol:": "Бездротовий протокол:",
  "Supports 2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), Zigbee with onboard antenna": "Підтримує 2,4 ГГц Wi-Fi 6 (802.11 b/g/n) та Bluetooth 5 (LE), Zigbee з вбудованою антеною",
  "Equipped with a high-performance": "Оснащений високопродуктивним",
  "32-bit RISC-V processor": "32-бітним процесором RISC-V",
  "with clock speed up to 160 MHz, and a low-power 32-bit RISC-V processor with clock speed up to 20MHz": "з тактовою частотою до 160 МГц та енергоефективним 32-бітним процесором RISC-V з тактовою частотою до 20 МГц",
  "320KB ROM, 512KB of HP SRAM, 16KB LP SRAM and 4MB Flash memory": "320КБ ROM, 512КБ HP SRAM, 16КБ LP SRAM та 4МБ флеш-пам'яті",
  "USB-C": "USB-C",
  "for firmware development and updates": "для розробки та оновлень вбудованого програмного забезпечення",
  "PM sensor:": "Датчик PM:",
  "SDS011 laser PM2.5/PM10 sensor": "Лазерний датчик PM2.5/PM10 SDS011",
  "Supported sensors:": "Підтримувані датчики:",
  "T&H: SHT3X,BME280,HTU21D; Noise Level Sensor:  I2S INMP441; Geiger counter : Radsens.": "T&H: SHT3X, BME280, HTU21D; Датчик рівня шуму: I2S INMP441; Гейгерів лічильник: Radsens.",
  "Help & support": "Допомога та підтримка",
  "With Robonomics decentralized map you can use Robonomics Connectivity or create your own Connectivity Service.": "З децентралізованою картою Robonomics ви можете використовувати підключення Robonomics або створити свій власний сервіс підключення.",
  "Your own Connectivity": "Власне підключення",
  "A smart home assistant you’ll enjoy caring for, even when you’re away. Only devs.": "Розумний домашній асистент, про якого вам буде приємно дбати, навть коли ви відсутні. Тільки розробники.",
  "Robonomics open-source hardware": "Відкрите апаратне забезпечення Robonomics",
  "Open-source hardware": "Відкрите апаратне забезпечення",
  "Experience the power of true DePIN (Decentralized Physical Infrastructure Network) — a revolutionary technological movement brought to life and thriving with Robonomics": "Відчуйте силу справжньої DePIN (Децентралізованої Фізичної Інфраструктурної Мережі) - революційного технологічного руху, який ожив і процвітає з Robonomics",
  "Home server with Web3 cloud": "Домашній сервер з хмарою Web3",
  "Home server on RISC V": "Домашній сервер на RISC V",
  "Supports": "Підтримує",
  "2.4GHz Wi-Fi 6 (802.11 b/g/n) and Bluetooth 5 (LE), with onboard antenna": "2,4 ГГц Wi-Fi 6 (802.11 b/g/n) та Bluetooth 5 (LE), з вбудованою антеною",
  "Built in": "Вбудовано",
  "Onboard": "На борту",
  "1.47inch LCD display, 172x320 resolution, 262K color": "1,47-дюймовий LCD-дисплей, роздільна здатність 172x320, 262 тисячі кольорів",
  "Adapting": "Адаптується",
  "integrates": "інтегрує",
  "full-speed USB-С port": "порт USB-С повної швидкості",
  "Onboard TF card slot": "Слот для TF-карти на борту",
  "for external TF card storage of pictures or files": "для зовнішнього зберігання зображень або файлів",
  "Supports accurate control": "Підримує точний контроль",
  "such as flexible clock and multiple power modes to realize low power consumption in different scenarios": "такий як гнучкий годинник та кілька режимів живлення для реалізації низького споживання енергії в різних сценаріях",
  "Built-in RGB LED": "Вбудований RGB LED",
  "with clear acrylic sandwich panel for cool lighting effect": "з прозорою акриловою панеллю-сендвічем для крутого ефекту підсвічування",
  "Battery Level Gauge": "Індикатор рівня заряду батареї",
  "Low-Power I2C Temperature sensor": "Низькопотужний датчик температури I2C",
  "RV-3032-C7 Real-Time Clock Module": "Модуль реального часу RV-3032-C7",
  "Battery 180mA": "Батарея 180 мА",
  "Measuring Range:": "Діапазон вимірювання:",
  "0.1-80A": "0,1-80A",
  "Wireless Protocol:": "Бездротовий протокол:",
  "IEEE 802.11b/g/n (2.4 GHz Wi-Fi)": "IEEE 802.11b/g/n (2,4 ГГц Wi-Fi)",
  "CPU:": "ЦП:",
  "ESP32-S3 MCU-based system on a chip (SoC) dual-core microprocessor (Xtensa 32-bit LX7), up to 240 MHz": "Мікроконтролер ESP32-S3 на основі системи на кристалі (SoC) з двоядерним мікропроцесором (Xtensa 32-бітний LX7), до 240 МГц",
  "448 KB ROM, 520 KB SRAM, 8 MB FLASH": "448 КБ ROM, 520 КБ SRAM, 8 МБ FLASH",
  "for development and updates": "для розробки та оновлень",
  "To configure the device, please visit:": "Для налаштування пристрою відвідайте:",
  "multiple IO interfaces,": "кілька інтерфейсів введення-виведення,",
  "Get updates about smart devices": "Отримуйте оновлення про розумні пристрої",
  "Receive regular emails from Robonomics": "Отримуйте регулярні електронні листи від Robonomics",
  "Thanks for your submission!": "Дякуємо за вашу заявку!",
  "Not submitted": "Не надіслано",
  "Notify me when available": "Повідомте мене, коли буде доступно",
  "Captcha is not verified. Please, check your internet connection": "Капча не перевірена. Будь ласка, перевірте підключення до Інтернету",
  "Thanks for the submition!": "Дякую за подання!",
  "Submitting": "Подання",
  "Submit": "Подати",
  "Follow for latest news and important updates": "Слідкуйте за останніми новинами та важливими оновленнями",
  "The best way to check open-source project": "Найкращий спосіб перевірити відкритий проект з відкритим кодом",
  "Useful, serious, cute videos, teasers etc.": "Корисні, серйозні, милі відео, трейлери тощо",
  "Chat for engineers and developers": "Чат для інженерів та розробників",
  "X": "X",
  "Youtube": "Youtube",
  "Discord": "Discord",
  "Unofficial chat for crypto fellows": "Неофіційний чат для криптовалютних колег",
  "Rent in California, USA": "Оренда в Каліфорнії, США",
  "Available by the Hour, Day, or Week": "Доступно за годину, день або тиждень",
  "Your name": "Ваше ім'я",
  "Your comment": "Ваш коментар",
  "By clicking this button, you agree to receive an email regarding the rental of the Unitree G1 Humanoid Robot.": "Натискаючи цю кнопку, ви погоджуєтеся отримувати електронний лист щодо оренди робота-людини Unitree G1.",
  "We'll get in touch shortly!": "Ми з вами зв'яжемося найближчим часом!",
  "Contact me": "Зв'яжіться зі мною",
  "A smart sensor that collects environmental data and integrates it into a decentralized sensor map.": "Розумний датчик, який збирає середовищні дані та інтегрує їх у децентралізовану карту датчиків.",
  "Smart Tamagotchi “Hikikomori“": "Розумний Тамагочі “Hikikomori“",
  "A microcontroller development board designed to integrate with Web3 systems. It can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Плата розробки мікроконтролера, призначена для інтеграції з системами Web3. Це може бути ваш розумний домашній тамагочі, ігровий контролер, навчальний інструмент - все, що ви розробляєте!",
  "Energy monitor with USB-C": "Монітор енергії з USB-C",
  "A non-invasive device designed for DIN rail mounting in electrical panels, tracks electricity consumption and generation.": "Неінвазивний пристрій, призначений для монтажу на DIN-рейку в електричних щитах, відстежує споживання та генерацію електроенергії.",
  "Smart devices from Robonomics": "Розумні пристрої від Robonomics",
  "Our values": "Наші цінності",
  "Our devices are designed for total transparency. Every product comes with open RISC-V processor, open-source code and circuit schematics, and local update instructions—no need for cloud connections. You’re empowered to understand, customize, and trust your technology from the ground up": "Наші пристрої розроблені для повної прозорості. Кожен продукт постачається з відкритим процесором RISC-V, відкритим вихідним кодом та схемами схем, інструкціями щодо локального оновлення - немає потреби в хмарних підключеннях. Ви маєте можливість розуміти, налаштовувати та довіряти вашій технології з нуля",
  "The combination of P2P communication and Web3 cloud guarantees that your devices will always be connected. No internet access? You can still connect directly to the device. Moving to a new region or going on vacation? Your devices will stay online and accessible wherever you are": "Поєднання P2P-зв'язку та хмари Web3 гарантує, що ваші пристрої завжди будуть підключені. Немає доступу до Інтернету? Ви все ще можете підключитися безпосередньо до пристрою. Переїзд у новий регіон або відпустка? Ваші пристрої залишатьс онлайн та доступними, де б ви не були",
  "Privacy by design": "Приватність за дизайном",
  "Trust the Code": "Довіряйте коду",
  "Fully open-source, no hidden algorithms, no corporate surveillance. It’s transparency for the true decentralist.": "Повністю відкритий вихідний код, без прихованих алгоритмів, без корпоративного спостереження. Це прозорість для справжнього децентралізатора.",
  "Your data, your keys": "Ваші дані, ваші ключі",
  "Take full control of your data with our fully open-source connectivity module. Choose between Robonomics or secure Web3 cloud storage with your personal key—no closed clouds, no opaque code.": "Повністю керуйте своїми даними за допомогою нашого повністю відкритого модуля підключення. Виберіть між Robonomics або безпечним сховищем у хмарі Web3 з вашим особистим ключем - немає закритих хмар, немає непрозорого коду.",
  "Always Connected, Always Secure": "Завжди підключений, завжди захищений",
  "Local P2P communication and Web3 cloud ensures that your your sensor is always accessible, no matter where you are. No centralized points of failure—just pure, peer-to-peer connection.": "Місцевий P2P-зв'язок т хмара Web3 забезпечують доступність вашого датчика завжди, незалежно від вашого місцезнаходження. Немає централізованих точок відмови - лише чисте, взаємне підключення.",
  "Join the Altruist Collective": "Приєднуйтесь до Альтруїстичного Колективу",
  "Plug the device into the global,": "Підключіть пристрій до глобального, ",
  "Share your environmental intel with your neighbors, your community, or your decentralized network.": "Поділіться своїми середовищними даними з вашими сусідами, вашою спільнотою або вашою децентралізованою мережею.",
  "Equipped with USB-C supports WiFi and Zigbee. Records electricity consumption and generation data in the Polkadot network at 10-minute intervals.": "Оснащений USB-C підтримує WiFi та Zigbee. Записує дані про споживання та генерацію електроенергії в мережі Polkadot кожні 10 хвилин.",
  "Hikikomori runs on a ESP32-C6 microcontroller development board, has an LCD display, Wi-Fi 6 and BLE 5 support.": "Hikikomori працює на платі розробки мікроконтролера ESP32-C6, має дисплей LCD, підтримку Wi-Fi 6 та BLE 5.",
  "Hikikomori is suitable for the quick development of Web3 powered IoT applications. This can be your smart home tamagotchi, a gaming controller, an educational tool - anything you design!": "Hikikomori підходить для швидкого розроблення застосунків IoT на основі Web3. Це може бути ваш розумний домашній тамагочі, ігровий контролер, навчальний інструмент - все, що ви розробляєте!",
  "Unitree G1 Humanoid Robot": "Робот-людина Unitree G1",
  "Rent the cutting-edge humanoid robot for your research, programming, and entertainment projects.": "Орендуйте передового робота-людину для ваших досліджень, програмування та розважальних проектів.",
  "Hour": "Година",
  "$200": "$200",
  "Rent on site (Oakland, CA)": "Оренда на місці (Окленд, Каліфорнія)",
  "Suitable for short tasks": "Підходить для коротких завдань",
  "No engineering support included": "Не включено інженерної підтримки",
  "Day": "День",
  "$900": "$900",
  "Suitable for bigger tasks": "Підходить для більших завдань",
  "Basic engineering support included": "Базова інженерна підтримка включена",
  "Week+": "Тиждень+",
  "On demand": "На вимогу",
  "Delivery to your location": "Доставка до вашого місцезнаходження",
  "Customized approach": "Індивідуальний підхід",
  "Engineering support can be included": "Інженерна підтримка може бути включена",
  "Enter the new era": "Увійдіть в нову еру",
  "The G1 humanoid robot with its innovative features offers versatility for research, programming, and entertainment needs. The Unitree G1 includes a Power Control Dexterous Hand, enabling it to perform delicate tasks such as handling objects, pressing buttons, and carrying out other precise operations with various items.": "Робот-людина G1 з інноваційними функціями пропонує гнучкість для досліджень, програмування та розважальних потреб. Unitree G1 включає в себе руку з потужним керуванням, що дозволяє виконувати дрібні завдання, такі як обробка об'єктів, нтискання кнопок та виконання інших точних операцій з різними предметами.",
  "Tech specification": "Технічні характеристики",
  "Height, Width and Thickness（Stand）": "Висота, ширина та товщина (Стійка)",
  "1320x450x200mm": "1320x450x200 мм",
  "Height, Width and Thickness（Fold）": "Висота, ширина та товщина (Згорнута)",
  "690x450x300mm": "690x450x300 мм",
  "Weight (With Battery)": "Вага (з батареєю)",
  "About 35kg": "Близько 35 кг",
  "Arm Maximum Load": "Максимальне навантаження на руку",
  "About 2Kg": "Близько 2 кг",
  "Cooling System": "Система охолодження",
  "Local air cooling": "Місцеве повітряне охолодження",
  "Smart Battery (Quick Release)": "Розумна батарея (Швидке від'єднання)",
  "9000mAh": "9000 мАг",
  "Charger": "Зарядний пристрій",
  "54V 5A": "54 В 5 А",
  "Battery Life": "Час роботи батареї",
  "About 2h": "Близько 2 годин",
  "Sensing Sensor": "Датчик відчуття",
  "Depth Camera+3D LiDAR": "Камера глибини + 3D LiDAR",
  "5W Speaker": "Динамік 5 Вт",
  "WiFi 6 , Bluetooth 5.2": "WiFi 6, Bluetooth 5.2",
  "Manual Controller": "Ручний контролер",
  "Take control of your smart home data with open-source home server on RISC-V processor and Web3 connectivity.": "Беріть під контроль ваші дані про розумний дім за допомогою домашнього сервера з відкритим вихідним кодом на процесорі RISC-V та підключенням Web3.",
  "Surveillance-free": "Без спостереження",
  "No hidden data logs on corporate servers while still allowing secure remote access.": "Немає прихованих жуналів даних на корпоративних серверах, але при цьому забезпечується безпечний віддалений доступ.",
  "No vendor lock-in": "Немає блокування від виробника",
  "Supports over 3000 integrations with devices from various manufacturers.": "Підтримує понад 3000 інтеграцій з пристроями від різних виробників.",
  "Open hardware": "Відкрите обладнання",
  "Open processor architecture and open-source code ensure a trustless system.": "Відкрита архітектура процесора та відкритий вихідний код забезпечують довірливу систему.",
  "Open and efficient hardware": "Відкрите та ефективне обладнання",
  "Our Home Server is powered by a RISC-V processor and features fully transparent circuit board schematics. RISC-V is an open and modular processor architecture that comes with a BSD license. Unlike proprietary ARM, it offers flexibility for customization without licensing restrictions, making it ideal for trustless IoT devices and servers.": "Наш домашній сервер працює на процесорі RISC-V і має повністю прозорі схеми плати. RISC-V - це відкрита та модульна архітектура процесора, яка постачається з ліцензією BSD. На відміну від пропрієтарного ARM, вона пропонує гнучкість для налаштування без ліцензійних обмежень, що робить її ідеальною для довірливих пристроїв Інтернету речей та серверів.",
  "Vendor agnostic smart home heart": "Вендор-агностичне серце розумного будинку",
  "The server comes pre-installed with Home Assistant, an open-source home automation platform, giving you full control of your smart home without relying on third-party cloud services.": "Сервер поставляється з попередньо встановленою системою Home Assistant, відкритою платформою для автоматизації дому, яка дозволяє вам повністю контролювати свій розумний будинок без залежності від хмарних послуг сторонніх компаній.",
  "Its modular design allows you to easily add components, automations, and integrations, supporting over 3,000 devices from various manufacturers without vendor lock-in. With support for Zigbee and Wi-Fi protocols, you can connect a wide range of devices, from temperature sensors to energy consumption monitors, all to a local server.": "Його модульний дизайн дозволяє легко додавати компоненти, автоматизації та інтеграції, підтримуючи понад 3 000 пристроїв від різних виробників без блокування від вендора. З підтримкою протоколів Zigbee та Wi-Fi ви можете підключити широкий спектр пристроїв, від датчиків температури до моніторів споживання енергії, все до локального сервера.",
  "Designed for privacy": "Розроблено для конфіденційності",
  "Our smart home server eliminates corporate interference, keeping your data local or encrypted with your personal key in decentralized Web3 storage. Enjoy complete privacy with no tracking, no surveillance—just secure, trustless control over your smart home.": "Наш домашній сервер розумного будинку усуває корпоративне втручання, зберігаючи ваші дані локально або зашифровані за допомогою вашого особистого ключа в децентралізованому сховищі Web3. Насолоджуйтеся повною конфіденційністю без відстеження, без спостереження - просто безпечний, довірливий контроль над вашим розумним будинком.",
  "With Robonomics Web3 cloud and P2P remote control, you get cryptographic access to all the functions of smart home:": "З Robonomics Web3 хмарним та P2P віддаленим керуванням ви отримуєте криптографічний доступ до всіх функцій розумного будинку:",
  "hour": "година",
  "hours": "години",
  "day": "день",
  "days": "днів",
  "week": "тиждень",
  "weeks": "тижні",
  "on demand": "за запитом",
  "Special offer": "Спеціальна пропозиція",
  "Get exclusive access to one of the first commercially available humanoid robots. Flexible rental options for research, programming and entertainment needs.": "Отримайте ексклюзивний доступ до одного з перших комерційно доступних гуманоїдних роботів. Гнучкі варіанти оренди для наукових, програмних та розважальних потреб.",
  "Access current device states remotely": "Доступ до поточних станів пристроїв віддалено",
  "Control devices remotely via parachain or LibP2P": "Віддалене керування пристроями через парачейн або LibP2P",
  "Manage Home Assistant users": "Керування користувачами Home Assistant",
  "Back up and restore Home Assistant configurations": "Резервне копіювання та відновлення конфігурацій Home Assistant",
  "Store your home's digital twin in a secure, decentralized cloud": "Зберігайте цифровий двійник вашого будинку в безпечному, децентралізованому хмарі",
  "Books": "Книги",
  "In 2022, the Robonomics team began collaborating with other parachain teams within the Polkadot ecosystem to leverage the unique strengths of this decentralized network. This collaboration resulted in the launch of a Backup and Data Archiving Service designed specifically for robotics companies.": "У 2022 році команда Robonomics почала співпрацювати з іншими командами парачейну в екосистемі Polkadot, щоб використовувати унікальні переваги цієї децентралізованої мережі. Ця співпраця призвела до запуску Служби резервного копіювання та архівування даних, спеціально розробленої для компаній з робототехнікою.",
  "Digital markets for robots": "Цифрові ринки для роботів",
  "The development of robotics and automated systems during the Fourth Industrial Revolution will require robots to have the capability to order services for their own maintenance.": "Розвиток робототехніки та автоматизованих систем під час Четвертої промислової революції потребуватиме, щоб роботи мали можливість замовляти послуги для свого власного обслуговування.",
  "Tokenization of Data of IOT devices": "Токенізація даних пристроїв Інтернету речей",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy.": "Токенізація даних з пристроїв Інтернету речей (IoT) представляє собою проривний розвиток у цифровій економіці.",
  "Industrial zone management with capital": "Управління промисловою зоною з капіталом",
  "This case explores the role of smart factories in responding to capital shifts in modern markets. As part of the Industry 4.0 transformation, it introduces a decentralized communication protocol using cyber-physical systems to improve economic coordination among industrial agents.": "У цьому випадку досліджується роль розумних фабрик у відповіді на капітальні зміни на сучасних ринках. Як частина трансформації Індустрії 4.0, він вводить децентралізований протокол комунікації з використанням кібер-фізичних систем для покращення економічної координації між промисловими агентами.",
  "Mars colonization, impossible without kusama": "Колонізація Марсу, неможлива без kusama",
  "This R&D case explores the role of Kusama network's decentralized infrastructure in supporting interplanetary missions, particularly Mars colonization.": "Цей випадок досліджує роль децентралізованої інфраструктури мережі Kusama в підтримці міжпланетних місій, зокрема колонізації Марсу.",
  "A decentralized system for negotiating road space": "Децентралізована система для переговорів про дорожні простори",
  "Our goal was to develop a decentralized system for negotiating road space where autonomous vehicles can pay for routes and permissions.": "Нашою метою було розробити децентралізовану систему для переговрів про дорожні простори, де автономні транспортні засоби можуть платити за маршрути та дозволи.",
  "Almanac": "Альманах",
  "Last updated: February 03, 2025": "Останнє оновлення: 3 лютого 2025 року",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Ця Угода початково написана англійською мовою. Це машинний переклад надається лише для вашої інформації.",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Ця Політика конфіденційності описує наші політики та процедури збору, використання та розкриття вашої інформації, коли ви використовуєте Службу, та повідомляє вас про ваші права на конфіденційність та про те, як закон захищає вас.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Ми використовуємо ваші особисті дані для надання та покращення Служби. Використовуючи Службу, ви погоджуєтеся зі збором та використанням інформації відповідно до цієї Політики конфіденційності.",
  "Interpretation and Definitions": "Тлумачення та Визначення",
  "Interpretation": "Тлумачення",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Слова, перша літера яких написана великою буквою, мають значення, визначені в наступних умовах. Наведені визначення матимуть одне й те ж значення незалежно від того, чи вони зустрічаються в однині чи множині.",
  "Definitions": "Визначення",
  "For the purposes of this Privacy Policy:": "З метою цієї Політики конфіденційності:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(називається як \"DAO\", \"Ми\", \"Нас\" або \"Наші\" в цій Угоді) відноситься до децентралізованої автономної організації Robonomics Network, оператора веб-сайту",
  "(referred to as": "(називається",
  "Website": "Веб-сайт",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "в цій Угоді). З метою Загального регламенту про захист даних (GDPR) DAO є контролером даних.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "це невеликі файли, які розміщуються на вашому комп'ютері, мобільному пристрої або будь-якому іншому пристрої веб-сайтом, що містять деталі вашої історії перегляду на тому веб-сайті серед інших їх багатьох використань. Докладнішу інформацію про файли cookie та їх роботу можна знайти за адресою:",
  "Country": "Країна",
  "refers to: Cyprus.": "відноситься до: Кіпр.",
  "Data Controller": "Контрлер даних",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "з метою Загального регламенту про захист даних (GDPR) відноситься до DAO як юридичної особи, яка самостійно або спільно з іншими визначає цілі та засоби обробки особистих даних.",
  "Device": "Пристрій",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "означає будь-який пристрій, який може отримати доступ до Служби, такий як комп'ютер, мобільний телефон або цифровий планшет.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "відноситься до Загального регламенту про захист даних ЄС.",
  "Personal Data": "Особисті дані",
  "is any information that relates to an identified or identifiable individual.": "це будь-яка інформація, яка стосується ідентифікованої або ідентифікованої фізичної особи.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "З метою GDPR Особисті дані означають будь-яку інформацію, що стосується вас, таку як ім'я, ідентифікаційний номер, дані про місцезнаходження, онлайн-ідентифікатор або один або кілька факторів, що є специфічними для фізичної, фізіологічної, гнетичної, розумової, економічної, культурної або соціальної ідентичності.",
  "Service": "Служба",
  "refers to the Website": "відноситься до Веб-сайту",
  "Service Provider": "Постачальник послуг",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "означає будь-яку фізичну або юридичну особу, яка обробляє дані від імені DAO. Це стосується сторонніх компаній або осіб, які працюють на користь DAO для полегшення надання Служби, для надання Служби від імені DAO, для виконання послуг, пов'язаних з Службою, або для допомоги DAO в аналізі того, як використовується Служба. З метою GDPR Постачальники послуг вважаються обробниками даних.",
  "Usage Data": "Дані використання",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "це дані, які збираються автоматично, які генеруються використанням Служби або з самої інфраструктури Служби (наприклад, тривалість візиту на сторінку).",
  "You": "Ви",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(називається як \"Ваші\" в цій Угоді) означає фізчну особу, яка отримує доступ або використовує Службу, або DAO, або іншу юридичну особу від імені якої така особа отримує доступ або використовує Службу, застосовно.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Згідно з GDPR, ви можете бути визначені як Суб'єкт даних або як Користувач, оскільки ви є особою, яка використовує Службу.",
  "Collecting and Using Your Personal Data": "Збір та використання Ваших особистих даних",
  "Types of Data Collected": "Типи зібраних даних",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Під час використання нашого сервісу ми можемо попросити вас надати нам певну особисту ідентифікаційну інформацію, яка може бути використана для зв'язку або ідентифікації вас. Особиста ідентифікаційна інформація може включати, але не обмежується:",
  "Email address": "Адреса електронної пошти",
  "First name and last name": "Ім'я та прізвище",
  "Usage Data is collected automatically when using the Service.": "Дані використання збираються автоматично при використанні сервісу.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Дані використання можуть включати інформацію, таку як Інтернет-протокол вашого пристрою (наприклад, IP-адреса), тип браузера, версія браузера, сторінки нашого сервісу, яі ви відвідуєте, час та дата вашого візиту, час, проведений на цих сторінках, унікальні ідентифікатори пристрою та інші діагностичні дані.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Коли ви отримуєте доступ до сервісу за допомогою мобільного пристрою, ми можемо автоматично збирати певну інформацію, включаючи, але не обмежуючись, тип мобільного пристрою, який ви використовуєте, унікальний ідентифікатор вашого мобільного пристрою, IP-адреса вашого мобільного пристрою, операційна система вашого мобільного пристрою, тип мобільного Інтернет-браузера, який ви використовуєте, унікальні ідентифікатори пристрою та інші діагностичні дані.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Ми також можемо збирати інформацію, яку ваш браузер надсилає кожного разу, коли ви відвідуєте наш сервіс або коли ви отримуєте доступ до сервісу за допомогою мобільного пристрою.",
  "Cookies & Browser Storage": "Cookies & Browser Storage",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Сайти можуть використовувати файли cookie. Ми використовуємо файли cookie та сховище браузера лише для важливих налаштувань з метою поліпшення вашого досвіду, а не для відстеження. Вони допомагають запам'ятовувати ваші уподобання, такі як мовні налаштування або вибори згоди, щоб вам не доводилося скидати їх кожного разу, коли ви відвідуєте.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Ми не використовуємо файли cookie для відстеження або персоналізованої реклами. Ви можете керувати або вимкнути файли cookie в налаштуваннях браузера, але деякі функції можуть не працювати належним чином без них.",
  "Matomo Analytics": "Аналітика Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Наш веб-сайт може викоритовувати Matomo, платформу аналітики з відкритим вихідним кодом, для збору відомостей про використання веб-сайту. Це включає анонімнізовані дані, такі як:",
  "Pages visited and navigation paths": "Відвідані сторінки та шляхи навігації",
  "Time spent on our website": "Час, проведений на нашому веб-сайті",
  "Whether you’re a returning or new visitor": "Чи ви повертаєтесь як відвідувач чи новий",
  "Your device type (desktop, mobile, etc.)": "Тип вашого пристрою (настільний комп'ютер, мобільний телефон і т. д.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Для захисту вашої конфіденційності ваш IP-адреса анонімізується перед зберіганням. Зібрані нами дані використовуються лише для поліпшення веб-сайту і не використовуються для особистої ідентифікації.",
  "Under Art. 6(1)(f) GDPR": "Згідно зі ст. 6(1)(f) Загального регламенту про захист даних",
  "we process this data based on our legitimate interest in enhancing our services.": "ми обробляємо ці дані на підставі нашого законного інтересу в покращенні наших послуг.",
  "Opt-Out Option": "Опція відмови",
  "You can disable Matomo tracking at any time:": "Ви можете в будь-який момент викнути відстеження Matomo:",
  "Use of Your Personal Data": "Використання ваших особистих даних",
  "The DAO may use Personal Data for the following purposes:": "DAO може використовувати особисті дані для наступних цілей:",
  "To provide and maintain our Service": "Надання та підтримка наших послуг",
  "including to monitor the usage of our Service.": "включаючи моніторинг використання наших послуг.",
  "For the performance of a contract": "Для виконання контракту",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "розробка, виконання та виконання договору купівлі продуктів, товарів або послуг, які ви придбали або будь-якого іншого контракту з нами через Службу.",
  "To contact You": "Зв'язок з вами",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Зв'язок з вами по електронній пошті, телефонних дзвінках, SMS або іншими еквівалентними формами електронного зв'язку, такими як сповіщення про оновлення мобільного додатка щодо оновлень або інформаційних комунікацій, пов'язаних з функціональністю, продуктами або укладеними послугами, включаючи оновлення безпеки, коли це необхідно або розумно для їх впровадження.",
  "To provide You": "Надання вам",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "новини, спеціальні пропозиції та загальну інформацію про інші товари, послуги та події, які ми пропонуємо, схожі на ті, які ви вже придбали або запитували, якщо ви не відмовилися отримувати таку інформацію.",
  "To manage Your requests": "Управління вашими запитами",
  "To attend and manage Your requests to Us.": "Для відвідування та управління вашими запитами до нас.",
  "For other purposes": "Для інших цілей",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Ми можемо використовувати вашу інформацію для інших цілей, таких як аналіз даних, визначення тенденцій використання, визначення ефективності наших рекламних кампаній та оцінка та покращення наших послуг, продуктів, сервісів, маркетингу та вашого досвіду.",
  "We may share Your personal information in the following situations:": "Ми можемо передавати ваші особисті дані в наступних ситуаціях:",
  "With Service Providers": "З Постачальниками послуг",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Ми можемо ділитися Вашою особистою інформацією з Постачальниками послуг для моніторингу та аналізу використання нашого Сервісу, для зв'язку з Вами.",
  "With Your consent": "З Вашою згодою",
  "We may disclose Your personal information for any other purpose with Your consent.": "Ми можемо розкривати Вашу особисту інформацію для будь-яких інших цілей за Вашою згодою.",
  "Retention of Your Personal Data": "Зберігання Ваших особистих даних",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "DAO буде зберігати Ваші особисті дані лише стільки часу, скільки це необхідно для цілей, визначених у цій Політиці конфіденційності. Ми будемо зберігати та використовувати Ваші особисті дані в міру необхідності для виконання наших правових зобов'язань (наприклад, якщо нам потрібно зберігати ваші дані для виконання вимог чинного законодавства), вирішення суперечок та забезпечення виконання наших правових угод та політик.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "DAO також буде зберігати Дані використання для внутрішнього аналізу. Дані використання, як правило, зберігаються протягом короткого періоду часу, за винятком випадків, коли ці дані використовуються для зміцнення безпеки або покращення функціональності нашого Сервісу, або коли нам законно обов'язково зберігати ці дані протягом довшого часу.",
  "Security of Your Personal Data": "Безпека Ваших особистих даних",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "Безпека Ваших особистих даних є важливою для нас, але пам'ятайте, що жоден метод передачі через Інтернет або метод електронного зберігання не є 100% безпечним. Хоча ми намагаємося використовувати комерційно прийнятні засоби для захисту Ваших особистих даних, ми не можемо гарантувати їх абсолютну безпеку.",
  "Detailed Information on the Processing of Your Personal Data": "Детальна інформація про обробку Ваших особистих даних",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Ваша інформація, включаючи особисті дані, обробляється на веб-сайті постачальника послуг DAO та в будь-яких інших місцях, де знаходяться сторони, що беруть участь у обробці. Це означає, що ця інформація може бути передана — та зберігатися на — комп'ютерах, що знаходяться за межами Вашої держави, провінції, країни або іншої урядової юрисдикції, де закони про захист даних можуть відрізнятися від тих, що діють у Вашій юрисдикції.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Ваша згода з цією Політикою конфіденційності, яка слідує за Вашим наданням такої інформації, означає Вашу згоду на такий перенос.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "DAO зробить все можливе, щоб забезпечити безпечну обробку Ваших даних відповідно до цієї Політики конфіденційності, і ніякий перенос Ваших особистих даних не відбудеться до організації або країни, якщо не будуть встановлені відповідні контрольні заходи, включаючи безпеку Ваших даних та іншої особистої інформації.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Зверніть увагу, що будь-яка передача даних через Інтернет (наприклад, комунікація по електронній пошті) загалом не є безпечною, і ми не несемо відповідальності за дані, які нам передаються через Інтернет. На жаль, абсолютний захист технічно неможливий. Ця інформація не стосується веб-сайтів третіх сторін та відповідних посилань, наведених на нашому веб-сайті. DAO не несе відповідальності за це.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Постачальники послуг, якими ми користуємося, можуть мати доступ до Ваших особистих даних. Ці сторонні постачальники збирають, зберігають, використовують, обробляють та передають інформацію про Вашу діяльність на нашому Сервісі відповідно до їхніх Політик конфіденційності.",
  "Email Marketing": "Електронний маркетинг",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Ми можемо використовувати Ваші особисті дані для зв'язку з Вами за допомогою розсилок, маркетингових або промоційних матеріалів та іншої інформації, яка може бути цікавою для Вас. Ви можете відмовитися від отримання будь-яких або всіх цих комунікацій від нас, слідуючи посиланню для відписки або інструкціям, наданим в будь-якому електронному листі, який ми відправляємо, або зв'язавшись з нами.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Ми можемо використовувати постачальників послуг електронного маркетингу для управління та відправлення електронних листі до Вас;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Їхню Політику конфіденційності можна переглянути за посиланням",
  "Usage, Performance and Miscellaneous": "Використання, продуктивність та різноманітні",
  "We may use third-party Service Providers to maintain and improve our Service.": "Ми можемо використовувати сторонніх постачальників послуг для підтримки та покращення нашого Сервісу.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR Конфіденційність",
  "Legal Basis for Processing Personal Data under GDPR": "Правова підстава для обробки особистих даних відповідно до GDPR",
  "We may process Personal Data under the following conditions:": "Ми можемо обробляти особисті дані за наступними умовами:",
  "Consent:": "Згода:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Ви надали свою згоду на обробку особистих даних для однієї або декількох конкретних цілей.",
  "Performance of a contract:": "Виконання угоди:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Надання особистих даних є необхідним для виконання угоди з Вами та/або для будь-яких попередніх зобов'язань перед укладенням угоди.",
  "Legal obligations:": "Правові обов'язки:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Обробка особистих даних є необхідною для виконання правового обов'язку, якоу підпорядковується DAO.",
  "Vital interests:": "Життєво важливі інтереси:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Обробка особистих даних є необхідною для захисту Ваших життєво важливих інтересів або інтересів іншої фізичної особи.",
  "Public interests:": "Громадські інтереси:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Обробка особистих даних пов'язана з завданням, яке виконується в громадському інтересі або в рамках виконання офіційних повноважень, наданих DAO.",
  "Legitimate interests:": "Легітимні інтереси:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Обробка особистих даних є необхідною для цілей легітимних інтересів, які переслідуються DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "У будь-якому випадку DAO буде радо допоможе уточнити конкретну правову підставу, яка застосовується до обробки, і зокрема, чи є надання особистих даних законним або контрактним вимоги, або вимогою, необхідною для укладення угоди.",
  "Your Rights under the GDPR": "Ваші права відповідно до GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "DAO зобов'язується поважати конфіденційність Ваших особистих даних та гарантувати, що Ви можете скористатися своїми правами.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "Ви маєте право відповідно до цієї Політики конфіденційності та закону, якщо ви знаходитесь в ЄС, на:",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Право на доступ, оновлення або видалення інформації, яку ми маємо про вас. Якщо це можливо, ви можете отримати доступ, оновити або запросити видалення ваших особистих даних безпосередньо в розділі налаштувань вашого облікового запису. Якщо ви не можете виконати ці дії самостійно, будь ласка, зв'яжіться з нами, щоб ми вам допомогли. Це також дозволяє вам отримати копію особистих даних, які ми маємо про вас.",
  "Request correction of the Personal Data that We hold about You.": "Запит на виправлення особистих даних, які ми маємо про вас.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "У вас є право вимагати виправлення будь-якої неповної або неточної інформації, яку ми маємо про вас.",
  "Object to processing of Your Personal Data.": "Висловити протест проти обробки ваших особистих даних.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Це право існує, коли ми покладаємося на законний інтерес як правову підставу для нашої обробки, і є щось в вашій конкретній ситуації, що змушує вас протестувати проти нашої обробки ваших особистих даних на цій підставі. Ви також маєте право висловити протест, коли ми обробляємо ваші особисті дані для цілей прямого маркетингу.",
  "Request erasure of Your Personal Data.": "Запит на видалення ваших особистих даних.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "У вас є право попросити нас видалити або видалити особисті дані, коли немає вагомої причини для нас продовжувати їх обробку.",
  "Request the transfer of Your Personal Data.": "Запит на передачу ваших особистих даних.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Ми надамо вам, або третій стороні, яку ви обрали, ваші особисті дані у структурованому, загальноприйнятому, машинночитаемому форматі. Зверніть увагу, що це право застосовується тільки до автоматизованої інформації, яку ви спочатку надали згоду на використання нами або де ми викорстовували інформацію для виконання контракту з вами.",
  "Withdraw Your consent.": "Відкликати вашу згоду.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "У вас є право відкликати вашу згоду на використання ваших особистих даних. Якщо ви відкликаєте свою згоду, ми можемо не мати можливості надати вам доступ до певних конкретних функцій Сервісу.",
  "Exercising of Your GDPR Data Protection Rights": "Використання ваших прав на захист даних GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Ви можете скористатися своїми правами на доступ, виправлення, скасування та опозицію, звернувшись до нас. Зверніть увагу, що ми можемо попросити вас підтвердити вашу особу перед відповіддю на такі запити. Якщо ви зробите запит, ми намагатимемося якнайшвидше відповісти вам.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "У вас є право скаржитися на орган з питань захисту даних про нашу збір та використання ваших особистих даних. Для отримання додаткової інформації, якщ ви знаходитесь в Європейському економічному просторі (ЄЕП), будь ласка, зверніться до вашого місцевого органу з питань захисту даних в ЄЕП.",
  "Children's Privacy": "Конфіденційність дітей",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Наш сервіс не адресований нікому молодше 13 років. Ми не намагаємося свідомо збирати особисту ідентифікаційну інформацію від кого-небудь молодше 13 років. Якщо ви є батьком або опікуном і ви знаєте, що ваша дитина надала нам особисті дані, будь ласка, зв'яжіться з нами. Якщо ми дізнаємося, що ми зібрали особисті дані від кого-небудь молодше 13 років без перевірки згоди батьків, ми вживаємо заходів для видалення цієї інформації з наших серверів.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Якщо нам потрібно покладатися на згоду як правову підставу для обробки вашої інформації, і ваша країна вимагає згоду від батьків, ми можемо вимагати згоду вашого батька перед тим, як ми зберемо та використаємо цю інформацію.",
  "Links to Other Websites": "Посилання на інші веб-сайти",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Наш сервіс може містити посилання на інші веб-сайти, які не є нашими. Якщо ви натиснете на посилання на сторонній сайт, вас буде перенаправлено на сайт цієї сторони. Ми настійно радимо вам переглянути Політику конфіденційності кожного сайту, який ви відвідуєте.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Ми не маємо контролю і не несемо відповідальності за вміст, політику конфіденційності або практики будь-яких сторонніх сайтів або послуг.",
  "Changes to this Privacy Policy": "Зміни в цій Політиці конфіденційності",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Ми можемо оновлювати нашу Політику конфіденційності з часу в час. Ми повідомимо вас про будь-які зміни, розмістивши нову Політику конфіденційності на цій сторінці.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Ми повідомим вас по електронній пошті і / або помітному повідомленні на нашому сервісі перед тим, як зміни набудуть чинності і оновимо дату \"Останнє оновлення\" у верхній частині цієї Політики конфіденційності.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Вам рекомендується періодично переглядати цю Політику конфіденційності для отримання будь-яких змін. Зміни в цій Політиці конфіденційності набирають чинності з моменту їх публікації на цій сторінці.",
  "Contact Us": "Зв'яжіться з нами",
  "If you have any questions about this Privacy Policy, You can contact us:": "Якщо у вас є питання щодо цієї Політики конфіденційності, ви можете зв'язатися з нами:",
  "By visiting this page on our website:": "Відвідавши цю сторінку на нашому веб-сайті:",
  "Robonomics' Approach": "Підхід Robonomics",
  "Robonomics provides an alternative to centralized corporate-controlled cloud services. Instead of relying on such systems, it leverages public blockchain networks, such as Ethereum and Polkadot, to facilitate secure and autonomous transactions between robots and service providers.": "Robonomics надає альтернативу централізованим корпоративно-контрольованим хмаровим сервісам. Замість того, щоб покладатися на такі системи, він використовує громадські блокчейн мережі, такі як Ethereum та Polkadot, для забезпечення безпечних та автономних транзакцій між роботами та постачальниками послуг.",
  "How Digital Markets for Robots Work": "Як працюють цифрові ринки для роботів",
  "Key Benefits": "Ключові переваги",
  "Digital markets for robots represent a critical step toward supporting the next wave of automation and smart city infrastructure. Robonomics' decentralized approach ensures secure, scalable, and autonomous service management for robots.": "Цифрові ринки для роботів є важливим кроком у підтримці наступної хвилі автоматизації та інфраструктури розумного міста. Децентралізований підхід Robonomics забезпечує безпечне, масштабоване та автономне управління послугами для роботів.",
  "Conclusion": "Висновок",
  "Why Smart Factories Should Respond to Capital Changes": "Чому розумні фабрики повинні реагувати на зміни капіталу",
  "A Decentralized Protocol for Economic Coordination": "Децентралізований ротокол для економічної координації",
  "Balancing Production and Capital": "Балансування виробництва та капіталу",
  "Technical Foundation": "Технічна основа",
  "This R&D case presents how capital flows can act as economic signals for smart factories. By adopting Robonomics' decentralized protocol, industries can better manage production efficiency and stay aligned with the evolving standards of Industry 4.0.": "Цей випадок дослідження показує, як потоки капіталу можуть діяти як економічні сигнали для розумних фабрик. Шляхом прийняття децентралізованого протоколу Robonomics, галузі можуть краще управляти ефективністю виробництва та залишатися відповідними до розвиваючихся стандартів Індустрії 4.0.",
  "Exploring Kusama's Role in Space Exploration": "Дослідження ролі Kusama в космічних дослідженнях",
  "The Mars Rover Experiment": "Експеримент з марсіанським ровером",
  "Technical Implementation": "Технічна реалізація",
  "Use Cases and Potential Impact": "Сценарії використання та потенційний вплив",
  "A fun video about the use of KUSAMA on Mars:": "Цікаве відео про використання KUSAMA на Марсі:",
  "This R&D case demonstrates how the Kusama network can support scientific exploration, resource management, and data transparency for space missions. The decentralized architecture offers a promising foundation for the future of Mars colonization and beyond.": "Цей випадок дослідження демонструє, як мережа Kusama може підтримувати наукове дослідження, управління ресурсами та прозорість даних для космічних місій. Децентралізована архітектура пропонує перспективну основу для майбутньої колонізації Марса та далі.",
  "The Challenge": "Виклик",
  "The Solution": "Рішення",
  "Here is the project presentation during the MOBI GRAND CHALLENGE": "Ось презентація проекту під час MOBI GRAND CHALLENGE",
  "We want to give special thanks to the Jetbrains Team’s Mobile Robot Algorithms Laboratory for giving us access to Duckietown.": "Ми хочемо висловити особливу подяку Лабораторії алгоритмів мобільних роботів команди Jetbrains за надання нам доступу до Duckietown.",
  "Special Thanks": "Особлива подяка",
  "With robots generating enormous amounts of data—including videos, raw technical data, and logs—storage can become a significant challenge, especially at scale. This new service offers an affordable and secure solution to meet these needs.": "Оскільки роботи генерують величезні обсяги даних, включаючи відео, сирі технічні дані та журнали, зберігання може стати значним викликом, особливо на великій шкалі. Цей новий сервіс пропонує доступне та безпечне рішення для вирішення цих потреб.",
  "Addressing the Challenge of Data Storage": "Вирішення виклику зберігання даних",
  "Our Solution: A Decentralized Approach": "Наше рішення: Децентралізований підхід",
  "Key Technology Behind the Service": "Ключові технології за сервісом",
  "Why This Service Is Essential": "Чому цей сервіс є важливим",
  "Looking Ahead": "Передбачення майбутнього",
  "For additional details about the collaboration between Robonomics and Crust Network and how decentralized storage is reshaping data management for robotics companies, visit the official": "Для додаткоих деталей про співпрацю між Robonomics та Crust Network та про те, як децентралізоване зберігання перетворює управління даними для компаній-робототехніки, відвідайте офіційний",
  "blog": "блог",
  "Learn More About the Collaboration": "Дізнайтеся більше про співпрацю",
  "Send a request message and get the result from the autonomous agent. The resulting file is saved to IPFS and the resultant message requires a signature with a private key.": "Надішліть запит та отримайте результат від автономного агента. Результатний файл зберігається в IPFS, а для результатного повідомлення потрібен підпис з приватним ключем.",
  "Overview": "Огляд",
  "This case study explores how Robonomics Network facilitates decentralized data access using IoT devices and blockchain technology. By leveraging the Robonomics dApp connected to a weather sensor on Fuji Mountain, users can obtain real-time weather data securely and transparently.": "Цей випадок дослідження досліджує, як мережа Robonomics сприяє децентралізованому доступу до даних за допомогою пристроїв Інтернету речей та технології блокчейн. Шляхом використання додатку Robonomics, підключеного до датчика погоди на горі Фудзі, користувачі можуть отримувати реальні дані про погоду безпечно та прозоро.",
  "How does it work?": "Як це працює?",
  "Technical Insights": "Технічні відомості",
  "Here's a walkthrough video:": "Ось відео-огляд:",
  "This R&D case highlights the capabilities of decentralized technologies in real-world data collection and access. Robonomics Network empowers secure, verifiable data retrieval from IoT sensors, advancing the reliability of environmental monitoring solutions.": "Цей випадок дослідження підкреслює можливості децентралізованих технологій у зборі та доступі до даних у реальному світі. Мережа Robonomics дозволяє безпечне, перевірене отримання даних від датчиків Інтернету речей, підвищуючи надійність рішень з моніторингу навколишнього середовища.",
  "The tokenization of data from IoT (Internet of Things) devices represents a groundbreaking development in the digital economy. By leveraging blockchain technology, IoT devices can generate, verify, and tokenize data as units of value, creating a secure and transparent mechanism for digital asset creation.": "Токенізація даних від пристроїв Інтернету речей (Інтернет речей) представляє собою революційний розвиток у цифровій економіці. Шляхом використання технології блокчейн, пристрої Інтернету речей можуть генерувати, підтверджувати та токенізувати дані як одиниці вартості, створюючи безпечний та прозорий механізм для створення цифрових активів.",
  "Background": "Фон",
  "The Role of IoT Devices in Tokenization": "Роль пристроїв Інтернету речей в токенізації",
  "Key Benefits of Tokenized IoT Data": "Ключові переваги токенізованих даних Інтернету речей",
  "Tokenizing IoT data through blockchain not only enhances data security and transparency but also paves the way for autonomous, machine-driven economies. This transformative approach creates a new generation of tokenized assets, unlocking immense potential for global innovation and economic growth.": "Токенізація даних Інтернету речей через блокчейн не тільки підвищує безпеку та прозорість даних, але також відкриває шлях для автономних, машинних економік. Цей трансформаційний підхід створює нове покоління токенізованих активів, розблоковуючи величезний потенціал для глобальної інновації та економічного зростання.",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Натиснувши кнопку «Надіслати», ви погоджуєтеся отримувати регулярні електронні листи від Robonomics (не більше 1 на місяць) і ви погоджуєтеся з",
  "Request access to Your Personal Data.": "Запит доступу до ваших особистих даних.",
  "Aira is back": "Айра повернулася",
  "Transform your screen with our brand new wallpaper—download now!": "Трансформуйте свій екран за допомогою нашого зовсім нового шпалери - завантажте зараз!",
  "Open-Source Hardware & Software": "Відкрите апаратне та програмне забезпечення",
  "Independent Decentralized Network Technologies": "Незалежні децентралізовані технології мережі",
  "Colorful 3D-Printed Cases of Your Choice": "Кольорові 3D-надруковані корпуси на ваш вибір",
  "Order Now": "Замовити зараз",
  "Altruist": "Альтруїст",
  "3 highlights for you": "3 основні моменти для вас",
  "Our special wallpapers to commemorate the launch of the Outdoor sensor “Altruist“": "Наші спеціальні шпалери для вшанування запуску зовнішнього датчика «Альтруїст»",
  "Order from the EU": "Замовлення з ЄС",
  "In its natural habitat": "У своєму природному середовищі",
  "Tag": "Тег",
  "(Robonomics Hardware) in your post with a photo.": "(Апаратне забезпечення Robonomics) у вашому пості з фото.",
  "Share Your “Altruist” in Action": "Поділіться своїм «Альтруїстом» у дії",
  "Air Quality Sensor “ALTRUIST“": "Датчик якості повітря «ALTRUIST»",
  "Europe": "Європа",
  "Japan": "Японія",
  "Order from the Japan": "Замовлення з Японії",
  "Russia": "Росія",
  "Order from the Russia": "Замовлення з Росії",
  "With the Altruist Air Quality Sensor, you become a force in decentralized environmental monitoring. Capture noise, dust, and temperature data — signed, mapped, and shared across a distributed network.": "З датчиком якості повітря Altruist ви стаєте силою в децентралізованому екологічному моніторингу. Зафіксуйте дані про шум, пил та температуру — підписані, змаповані та розповсюджені по розподіленій мережі.",
  "Early bird price": "Ціна для ранніх пташок",
  "Coming in early 2025": "З'явиться в початковому 2025 році",
  "Now Available!": "Тепер доступно!",
  "Worldwide Shipping": "Всесвітня доставка",
  "Multi-tool Device for developers": "Багатофункціональний пристрій для розробників",
  "Design your own software": "Створюйте власне програмне забезпечення",
  "OPEN-SOURCE HARDWARE": "ВІДКРИТЕ АПАРАТНЕ ЗАБЕЗПЕЧЕННЯ",
  "Extend it in whatever way you like": "Розширюйте його так, як вам подобається",
  "Real-time monitor of electricity consumption": "Монітор реального часу споживання електроенергії",
  "INDEPENDENT DECENTRALIZED data backup": "НЕЗАЛЕЖНЕ ДЕЦЕНТРАЛІЗОВАНЕ резервне копіювання даних",
  "OPEN-SOURCE HARDWARE & SOFTWARE": "ВІДКРИТЕ АПАРАТНЕ ТА ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ"
}